{"title":"Image Resizer v4.2.0.0 Portable (registered)","uid":7887651,"size":11915334,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00a8556da9987fe15497b1de726206b12f133c49&amp;dn=Image+Resizer+v4.2.0.0+Portable+%28registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1354653736,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnassasary regestry changes,\nThis makes a portable version a better version.\n\nVSO Image Resizer helps users deal with the massive amount of space photographs can take up on a hard drive. With a simple, yet directionless, interface, pictures can be reorganized and resized to meet needs, but comes with a risk.\n\nThis free program initially impresses with a colorful screen that looks professional and simple to navigate. However, a little playing around soon shows that users are in a canoe without any paddles. The simple-looking screen morphs into something far more complicated as option boxes expand with more confusing command choices. Not only are the options for adjusting picture size and save location less than intuitive, we found no Help file to hold our hand through the learning process. Adjusting pictures was eventually figured out through trial and error, but could come at a serious cost to some users. VSO Image Resizer doesn't offer any way to preview the changes you are making, but makes sure you are informed that these are permanent changes. Our fear is that users will alter a picture in ways they don't intend without a preview option.\n\nAfter our image was converted we stumbled upon VSO's lone positive surprise, a screen detailing your conversion. Here the program shows how many kilobytes you saved or gained by converting your picture and how fast it changed (ours converted instantly). At the end of the day, we cannot recommend this program because there are other photo resizing options that don't run the risk of permanently ruining a shot.","torrent":{"xt":"urn:btih:00a8556da9987fe15497b1de726206b12f133c49","amp;dn":"Image+Resizer+v4.2.0.0+Portable+%28registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a8556da9987fe15497b1de726206b12f133c49","infoHashBuffer":{"type":"Buffer","data":[0,168,85,109,169,152,127,225,84,151,177,222,114,98,6,177,47,19,60,73]},"announce":[],"urlList":[]}}