{"title":"Confederate Ordeal - The Southern home front (Time-Life The Civi","uid":11589814,"size":37674180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01627d578f84706b3b3d1c2c214a51ae07a85bfc&amp;dn=Confederate+Ordeal+-+The+Southern+home+front+%28Time-Life+The+Civi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"STBGD","files":-1,"time":1417218477,"description":"Pdf / English / 1984 Time-Life / 176 pages / 35.9 MB\n\n&quot;Confederate Ordeal: The Southern Home Front&quot; and its counterpart &quot;Twenty Million Yanks: The Northern Home Front&quot; provide the civilian perspective on the war in the Time-Life Civil War series: (1) The Pulse of Independence looks at how the Southern made up with gallantry what it lacked in industry and agriculture; with so much acreage devoted to Cotton the South had relied on what were now Union states for essential food stuffs; (2) A Culture Transformed looks at how life in the South changed during the war (e.g., wallpaper being used to print newspapers), and how Confederates expressed their pride; (3) The Fires of Dissent looks at not only those Southerners who did not support the war, including pro-Union guerillas, but those who dissented on state's rights grounds to the Confederate government dictating policy; (4) Long Cruel Roads focuses on Southerners who had to endure occupation by Union troops and the first steps of slaves towards freedom; and (5) End to the Dream talks about the end of the War as it became clear to even the most die-hard Confederate loyalists that the Cause was doomed. This chapter looks at the last attempts by Confederate Commissioners to negotiate a peace, a rather interesting footnote to the last days of the war. Steven A. Channing does a nice job of providing a representative look at the Confederate home front, especially when you take into account that unlike most volumes in the Time-Life Civil War series, which have a limited time frame, &quot;Confederate Ordeal&quot; starts before the war and ends well afterwards. The volume is illustrated with historic photographs, illustrations, etchings, and such, the vast majority of which you have probably never seen before even if you are a die-hard Civil War buff","torrent":{"xt":"urn:btih:01627d578f84706b3b3d1c2c214a51ae07a85bfc","amp;dn":"Confederate+Ordeal+-+The+Southern+home+front+%28Time-Life+The+Civi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01627d578f84706b3b3d1c2c214a51ae07a85bfc","infoHashBuffer":{"type":"Buffer","data":[1,98,125,87,143,132,112,107,59,61,28,44,33,74,81,174,7,168,91,252]},"announce":[],"urlList":[]}}