{"title":"Inside the klavern the secret history of a Ku Klux Klan","uid":11805408,"size":510278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:017201431cf70f4054ff137bcc4502a43d4d509f&amp;dn=Inside+the+klavern+the+secret+history+of+a+Ku+Klux+Klan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"zombie_rox","files":1,"time":1428558679,"description":"This is an annotated collection of the minutes of a thriving Ku Klux Klan in La Grande, Oregon, between 1922 and 1924. The most complete set of Klan minutes ever uncovered, these documents illustrate the inner workings of a Klan chapter of more than 300 members at the time when the national membership reached into the millions and the Invisible Empire was at the peak of its power. Through an extensive introduction and conclusion as well as brief notes previewing each installment of the minutes, the author seeks to place these documents in historical perspective. The La Grande minutes demonstrate Klan hostility to Roman Catholics, Jews, blacks and &quot;hyphenated&quot; Americans. But they also explain how the chapter exercised requirements for admission, how officers were selected, and how Klansmen encountered difficulties enforcing the moral standards of their order. Because the Klan kligrapp (recording secretary) Harold R. Fosner recorded not only the official proceedings but also volunteered extemporaneous comments and gossip, readers should get a feeling for what it was like to attend the meetings. Horowitz concludes that &quot;although it is tempting to judge Jazz Age Klansmen by the standards of later generations, the story provided by the minutes is a complex one - a chronicle of both compassion and complicity in cruelty, of positive social accomplishment and arbitrary and dysfunctional divisiveness&quot;.\n\nProduct Description\nReview\n&quot;This book is a unique contribution to the scholarship on the massive Ku Klux Klan movement of the 1920s. These minutes of one klavern in a state where the Klan flourished do a great deal to demystify the Klan and explain its extraordinary, often complex appeal. Inside the Klavern is destined to become a standard reference for anyone seeking to understand one of the most popular and powerful social movements in twentieth-century American history.&quot;--Leonard J. Moore, author of &quot;Citizen Klansmen: The Ku Klux Klan in Indiana, 1921-1928&quot;\nAbout the Author\nDavid A. Horowitz is a professor of history at Portland State University. His books include &quot;Beyond Left and Right: Insurgency and the Establishment&quot; and the coauthored volume (with Peter Carroll), &quot;On the Edge: The U.S. in the 20th Century.&quot;\n\nPublisher: Southern Illinois University Press; annotated edition edition (31 May 1999)\nLanguage: English\nISBN-10: 080932248X\nISBN-13: 978-0809322480","torrent":{"xt":"urn:btih:017201431cf70f4054ff137bcc4502a43d4d509f","amp;dn":"Inside+the+klavern+the+secret+history+of+a+Ku+Klux+Klan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017201431cf70f4054ff137bcc4502a43d4d509f","infoHashBuffer":{"type":"Buffer","data":[1,114,1,67,28,247,15,64,84,255,19,123,204,69,2,164,61,77,80,159]},"announce":[],"urlList":[]}}