{"title":"Thich Nhat Hanh - Various texts","uid":6487796,"size":6926403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:019022beb106bc6c8fe03e6a2b8c154bce51f161&amp;dn=Thich+Nhat+Hanh+-+Various+texts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"timnehguy","files":57,"time":1308768474,"description":"Here is an assortment of 56 items by or about the Vietnamese Buddhist teacher Thich Nhat Hanh in a variety of formats. There are four pictures of him, as well as texts in Adobe PDF, HTML, text, and Kindle / MOBI.\n\nI think this upload covers most of the texts by Thich Nhat Hanh available online, at least, that I have been able to find. \n\nThere are many audio and video materials for Thich Nhat Hanh online. You will find quite a few audio recordings of Thich Nhat Hanh teaching. Also, on http://video.google.com, you will find many videos of his teachings. A search on http://video.google.com today returns 5,440 items, 334 over 20 minutes (many of which seem to run over an hour, some over two hours).\n\nNone of the texts in this upload are of Thich Nhat Hanh's published books, just short essays and transcriptions. I have been trying to upload Buddhist teachings in Kindle / MOBI format, but I got a request for Thich Nhat Hanh teachings. These are what I came up with. I converted just one text, the longest, to Kindle format, so if someone else would convert some more of them for the Kindle, that would be a good thing.\n\nTake what you want, and enjoy (and benefit from) what you take. Please seed, and check my torrents for other Buddhist teachings.\n\nCONVERSIONS (Not religious) - if you want to convert these texts from one format to the other, including .EPUB for Nook or .MOBI for Kindle, you need the free software Calibre, which you can download at http://calibre-ebook.com/download. You can convert from one format to the other, and do many other things with your ebook library with Calibre.\n","torrent":{"xt":"urn:btih:019022beb106bc6c8fe03e6a2b8c154bce51f161","amp;dn":"Thich+Nhat+Hanh+-+Various+texts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"019022beb106bc6c8fe03e6a2b8c154bce51f161","infoHashBuffer":{"type":"Buffer","data":[1,144,34,190,177,6,188,108,143,224,62,106,43,140,21,75,206,81,241,97]},"announce":[],"urlList":[]}}