{"title":"William M. Fowler-Empires at War.epub","uid":9442536,"size":6309912,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01a8287bee75311dcda27cefcc7259fef5e8a7bc&amp;dn=William+M.+Fowler-Empires+at+War.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":1,"time":1389039041,"description":"On May 28, 1754, a group of militia and Indians led by twenty-two-year-old major George Washington surprised a camp of sleeping French soldiers near present-day Pittsburgh. Washington could not have known it, but the brief and deadly exchange of fire that ensued lit the match that, in Horace Walpole's memorable phrase, would &quot;set the world on fire.&quot; The resultung French and Indian War in North America became part of the global conflict known as the Seven Years War, fought across Europe, India, and the East and West Indies. Before it ended, nearly one million men had died. \n&quot;Empires at War captures the sweeping panorama of this first world war, especially in its descriptions of the strategy and intensity of the engagements in North America, many of them epic struggles between armies in the wilderness. William M. Fowler Jr. views the conflict both from British prime minister William Pitt's perspective-- as a vast chessboard, on which William Shirley's campaign in North America and the fortunes of Frederick the Great of Prussia were connected-- and from that of field commanders on the ground in America and Canada, who contended with disease, brutal weather, and scant supplies, frequently having to build the very roads they marched on. As in any conflict, individuals and events stand out: Sir William Johnson, a baronet and a major general of the British forces, who sometimes painted his face and dressed like a warrior when he fought beside his Indian allies; Edward Braddock's doomed march across Pennsylvania; the valiant French defense of Fort Ticonderoga; and the legendary battle for Quebec between armies led by the arisocratic French tactical genius, the marquis de Montcalm, and thegallant, if erratic, young Englishman James Wolfe-- both of whom died on the Plains of Abraham on September 13, 1759. \nFor many, the French and Indian War has been merely the backdrop for James Fenimore Cooper's famous novel, &quot;The Last of the Mohicans. William M. Fowler Jr.'s engrossing narrative reveals it to have been a turning point of modern history, without which the American Revolution as we know it might well not have occurred.","torrent":{"xt":"urn:btih:01a8287bee75311dcda27cefcc7259fef5e8a7bc","amp;dn":"William+M.+Fowler-Empires+at+War.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a8287bee75311dcda27cefcc7259fef5e8a7bc","infoHashBuffer":{"type":"Buffer","data":[1,168,40,123,238,117,49,29,205,162,124,239,204,114,89,254,245,232,167,188]},"announce":[],"urlList":[]}}