{"title":"Ch4 Grand Designs Collection 5 10of10 The Loch House DVDRip x264","uid":8950586,"size":695571227,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:01dcad32205a77d546de458227d14714922da0d7&amp;dn=Ch4+Grand+Designs+Collection+5+10of10+The+Loch+House+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":-1,"time":1379874883,"description":"Grand Designs: Collection 5\n\nArts Documentary hosted by Kevin McCloud, published by Channel 4 broadcasted as part of CH4 Grand Designs series in 2006 - English narration\n\n\nInformation\n------------------------------\n\nGrand Designs: Collection 5\nThis series chronicles the development of eight very different projects: a family home in Kent built out of Finnish logs, a 21st-century version of a Roman villa in Belfast, the renovation of a 16th-century farmhouse in Gloucester, a home in Peckham, South London complete with sliding glass roof, a round house by the sea in Devon, an eco-house in Carmarthen and a Miami-style beach house in Devon. Would you risk everything to design and build your unique dream home? Presenter Kevin McCloud joins some truly extraordinary, brave and visionary people as they take the ultimate gamble to create the home of their dreams. Many are risking their life savings. Others are attempting the near-impossible, spurred on by sheer determination against the odds. There are moments of deep self-doubt, of terrible fatigue and utter despair. Unforeseen problems cause cash crises, violent arguments and desperate improvisation. But somehow these people keep going, determined to complete their architectural masterpieces.\n\n\n1)  The Sliding Glass Roof House \nHere we see an extraordinary and inventive project in South London. This house proves that even in the most crowded areas of our cities, there is potential for Grand Designs. When Monty Ravenscroft and Clare Loewe began looking for a house to buy in London they soon realised that the only affordable option was to build one themselves. They snapped up a dirt cheap slither of land in Peckham at an auction only to be told it was too small to put a house on. Undeterred, three years ago, engineering whiz Monty began building an extraordinary experimental bungalow that filled the site to bursting point.\n\n2)  The Sliding Glass Roof House Revisit \nAfter 2 years Kevin goes back to see if Monty Ravenscroft and Clare Loewe have settled in the new home\n\n3)  The 16th Century Farmhouse \nWhen lawyers Jeremy and Louise Brown walked into Upthorpe Farm in Gloucester, they couldn't believe their eyes. It was like stepping back in time. Apart from a few minor alterations, the Grade II listed 16th-century farmhouse had barely been touched for over 400 years and was completely unmodernised with lots of original features. Now that they've purchased the property their ambitious design plan is to bring the farmhouse into the 21st century, blending the original historic features with modern simplicity and luxury. Kevin watches on intrigued as they tackle the challenge of reconciling the very old and the very contemporary.\n\n4)  Finnish Log Cabin \nJohn Cadney and Marnie Moon have never had a permanent home. So John, a carpenter, has rolled up his sleeves and decided to build a house for his family with his bare hands. For 16 years, John, Marnie and their children have camped on land owned by Marnie's parents, because they could never afford to buy a house in the area where they live. So now they're building their own place. After much searching for the right kind of house they settled on an environmentally friendly four-bedroom log cabin. The whole thing was imported from Finland as hundreds of pre-cut bits of wood. All John had to do is figure out how this kit house fits together!\n\n5)  Curvy Seashell House \nFor the last 20 years, Pat Becker has been living in a large Georgian family house overlooking the sea in Devon. Now that her family have flown the nest and the house has grown too big for her, she's decided to build a new home at the bottom of the garden. Shaped like a curvy seashell, the new house has concrete and polystyrene walls, which spiral down from the central staircase. Her architect has promised it will take only six months to build but constructing a round house is never straightforward!\n\n6)  21st Century Roman Villa \nThis is Belfast, one of the great cities of the industrial revolution, and home to Thomas and Dervla O'Hare. They've lived here for 18 years, and although they still love their tiny cottage for its compactness, they're about to build something much, much bigger. They're building a 21st century answer to the Roman villa, with a copper roof, glass and concrete walls and vast amounts of living space all arranged around a central courtyard. In order to cope with the incredibly steep slope the house was divided across three levels. At the base of the building there is a garage and all the utilities. Through the front door a double-width processional staircase leads up to the living and dining areas.\n\n7)  The Miami Style Beach House \nKevin McCloud meets Julie and Mark Veysey, whose Grand Design is a stunning Miami-style beach house on a beachfront plot overlooking the south Devon coast. Julie and Mark have had several holidays in Miami, and Julie wanted to recreate the outdoor beachfront lifestyle back in England, living in a house full of light and sun, within easy reach of the waves. The house is very much Julie's vision and she is passionate about the design. It is a series of dazzling white interlocking boxes topped with a flat zinc roof.\n\n8)  The Eco House \nAndrew and Lowri Davies embark on a project to build an environmentally friendly farmhouse in rural Wales. Encouraged by their architect, they opt for some state-of-the-art experimental building materials; but do their builders know how to use them? As the budget spirals out of control, they find it increasingly difficult to balance the budget with their desire for a sustainable home.\n\n9)  The Eco House Revisit \nKevin goes back after 18 month to see if the house is now finished\n\n10)  The Loch House \nJim Fairfull considers himself a very lucky guy. He was out fishing with a friend when he came across a beautiful, secluded loch. It's a magical place with stunning views over the nearby hills. He got chatting to the farmer who owned it and discovered the site was for sale. Within a week, he'd done a deal and bought the land. Jim runs a successful wholesale fruit and vegetable company in Glasgow and his wife, Simone, looks after their two girls, aged 11 and eight. Jim and Simone were not intending to self build. But they fell in love with this dramatic location and decided they wanted to live here.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img94.imageshack.us/img94/2066/5co8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img94.imageshack.us/img94/2066/5co8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img571.imageshack.us/img571/9073/qlm4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img571.imageshack.us/img571/9073/qlm4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img600.imageshack.us/img600/6926/3jd1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img600.imageshack.us/img600/6926/3jd1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/img855/6613/lgrk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/img855/6613/lgrk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img6.imageshack.us/img6/4279/nblb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img6.imageshack.us/img6/4279/nblb.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img18.imageshack.us/img18/7412/h7pv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img18.imageshack.us/img18/7412/h7pv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img15.imageshack.us/img15/3401/6prq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img15.imageshack.us/img15/3401/6prq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img24.imageshack.us/img24/5802/2rck.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img24.imageshack.us/img24/5802/2rck.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img819.imageshack.us/img819/7715/f4a7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img819.imageshack.us/img819/7715/f4a7.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9ed6f7f9f6ded2adb0ae&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1803 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 48mins\n * Framerate: 25fps\n * Number of Parts: 10\n * Part Size: average 676 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n * Release Notes\n * Merged Subtitles\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.dailymail.co.uk/femail/article-2219697/As-celebrates-100th-episode-Grand-Designs-Kevin-McCloud-explains-s-taken-toll--turned-grumpy-old-Victor-Meldrew.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dailymail.co.uk/femail/article-2219697/As-celebrates-100th-episode-Grand-Designs-Kevin-McCloud-explains-s-taken-toll--turned-grumpy-old-Victor-Meldrew.html&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:01dcad32205a77d546de458227d14714922da0d7","amp;dn":"Ch4+Grand+Designs+Collection+5+10of10+The+Loch+House+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01dcad32205a77d546de458227d14714922da0d7","infoHashBuffer":{"type":"Buffer","data":[1,220,173,50,32,90,119,213,70,222,69,130,39,209,71,20,146,45,160,215]},"announce":[],"urlList":[]}}