{"title":"The Child of Lov (2013) [FLAC]","uid":8616199,"size":268718787,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:027157a9cb4c5bc809d121e5b66ed4e042aa9ebc&amp;dn=The+Child+of+Lov+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1372258351,"description":"\n  The Child of Lov (2013) [FLAC]\n\n  * Released: 2013\n  * Duration: 38:35\n  * Genres: Hip-hop, Pop/Rock\n  * Styles: Alternative Rap, Indie, Experimental, Funk\n  * Source: WEB\n  * Codec: FLAC\n  * Bit Rate: ~ 1,000 kbps\n  * Bit Depth: 16\n  * Sampling Rate: 44,100 Hz\n\n  Tracks\n\n  * 01 Call Me Up \n  * 02 Heal \n  * 03 One Day (feat Damon Albarn) \n  * 04 Living the Circle \n  * 05 Give Me \n  * 06 Go With the Wind \n  * 07 Owl (feat DOOM) \n  * 08 Fly \n  * 09 Warrior\n  * 10 Give It to the People\n\n  Album Review\n\n  * Anticipation built around the Child of Lov project when it was announced that the mysterious artist would be teaming with some of the hip-hop underground's finest, including iconic rapper MF DOOM, Flying Lotus bassist Thundercat, and Damon Albarn of the Gorillaz. In fact, by the time The Child of Lov was released, more was known about the guests' involvement than the artist pulling the strings. Fronted by previously unknown 25-year-old graphic design student Cole Williams, the songwriter's debut record proved to be more psychedelic than expected, even weirder than one would expect from the backing clientele. Stony, beat-heavy neo-soul is the main ingredient, with Williams' Andre 3000 falsetto twisting around fractured soundscapes built on stony studio experimentation. \n\n  * Gnarls Barkley's The Odd Couple and Gonjasufi's A Sufi and a Killer share a similar aesthetic, with oddly structured, detached compositions wrapped in slick production. Albarn's lush style and expansive arrangements bring to mind his work with Danger Mouse, and Williams' narcotic, bittersweet vibe -- paired with his fragmented way of piecing a song together -- makes for an outing that feels fashionable, but somewhat unsettling. The majority of the record is jam-packed with a trippy juxtaposition of horns, strings, guitars, and computerized hip-hop beats and basslines. So many competing sounds and ideas become a bit of a creative mess, and the dark mood of the slower songs &quot;Call Me Up,&quot; &quot;One Day,&quot; &quot;Owl,&quot; and &quot;Warrior&quot; can feel oppressive at times. Luckily the final track, &quot;Give It to the People&quot; is a good-natured, &quot;Crazy&quot;-esque single that is upbeat enough to make the wade through the muck worth the effort.\n\n  Artist Bio\n\n  * Not much background is known about the purposely enigmatic underground hip-hop project Child of Lov, but the soloist behind it appears to be a man with connections to prolific artists. Blur's Damon Albarn, MF Doom, and Thundercat all appear on his debut album. His identity remains a secret for the moment (as difficult as that can be in the Internet age); however, it has been revealed that he started making music at age 15 and was age 20 at the time of his self-titled debut in 2012. Following a video for the single &quot;Heal,&quot; The Child of Lov was released on Domino affiliate Double Six.\n","torrent":{"xt":"urn:btih:027157a9cb4c5bc809d121e5b66ed4e042aa9ebc","amp;dn":"The+Child+of+Lov+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027157a9cb4c5bc809d121e5b66ed4e042aa9ebc","infoHashBuffer":{"type":"Buffer","data":[2,113,87,169,203,76,91,200,9,209,33,229,182,110,212,224,66,170,158,188]},"announce":[],"urlList":[]}}