{"title":"Ketama-Discografia.","uid":4424716,"size":442348033,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:02a9be087e4bfe8ed009f843ff6349b7c377bfe2&amp;dn=Ketama-Discografia.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"cholo24","files":78,"time":1222969585,"description":"Ketama\n\nKetama se formÃƒÂ³ a principios de los 80, tomando el nombre de un pueblo marroquÃƒÂ­ famoso al parecer porque allÃƒÂ­ se cultiva una de las mejores yerbas. Sus primeras influencias vienen de la mÃƒÂºsica latino americana. El grupo en su origen estaba formado por JosÃƒÂ© Soto, con Juan Carmona y Ray Heredia de Madrid.\n\nPoco despuÃƒÂ©s se les unirÃƒÂ­an Antonio y JosÃƒÂ© Miguel Carmona. Ray Heredia abandonarÃƒÂ­a el grupo para iniciar su carrera en solitario, aunque las drogas malograron dicha carrera. Posteriormente, JosÃƒÂ© Soto, Sorderita, fue que se separÃƒÂ³ del grupo. Los tres Carmona siguieron con el grupo y publican ahora Dame la mano.\n\nDesde el principio Ketama liderÃƒÂ³ lo que se ha dado en llamr el nuevo flamenco. En sus discos han mezclado salsa, mÃƒÂºsica brasileÃƒÂ±a, reggae, funk y hasta jazz y han compartido escenario con gente como Paco de Lucia, Enrique Morente y Camaron De La Isla.\n\nDespuÃƒÂ©s de construirse una sÃƒÂ³lida reputaciÃƒÂ³n gracias a sus guitarras y a sus voces, Ketama tocÃƒÂ³ con Celia Cruz, Paquito De Rivera, Arturo Sandaval, y Michel Camilo. Han llegado incluso a ser teloneros de Prince, The Rolling Stones y varias veces de Frank Sinatra. Su primer trabajo se publicÃƒÂ³ en 1985 y se llamÃƒÂ³ como ellos mismos. &quot;Ketama&quot;. Sin embargo el disco se habÃƒÂ­a grabado dos aÃƒÂ±os antes. En ese primer trabajo ya colaboraba gente de la talla de Carlos Benavent, Pepe Habichuela y Teo Cardalda. En 1987 se marchÃƒÂ³ Ray Heredia entrando en el grupo Joemi Carmona cuando sÃƒÂ³lo tenÃƒÂ­a 16 aÃƒÂ±os de edad. Ya con ÃƒÂ©l grabaron &quot;La pipa de Kif&quot; en 1987. Un aÃƒÂ±o mÃƒÂ¡s tarde apareciÃƒÂ³ &quot;Songhai&quot; con el mÃƒÂºsico africano Toumani Diabate. En dicho disco colaborÃƒÂ³ Ketama, asÃƒÂ­ como en el siguiente, &quot;Songhaui 2&quot;. &quot;Songhai&quot; fue elegido por la revista New Musical Express como el mejor disco extranjero del aÃƒÂ±o.\n\nEn 1990 Ketama publican &quot;Y es ke me han kambiao los tiempos&quot;, el primer ÃƒÂ¡lbum producido por los mismos Ketama y el primer disco con un cierto ÃƒÂ©xito, lo que les hace merecedores de ser los teloneros de Prince en su gira por EspaÃƒÂ±a. Posteriormente, el grupo publica &quot;Pa gente con alma&quot;.\n\nNuevos Medios, su antigua compaÃƒÂ±ÃƒÂ­a publica &quot;Canciones hondas&quot;, un recopilatorio de sus aÃƒÂ±os en esa discogrÃƒÂ¡fica. En 1993 Ketama, ya convertido definitivamente el trÃƒÂ­o, tras la marcha de Sorderita, publica &quot;El arte de lo invisible&quot;.\n\nGrabado en los Estudios Cinearte de Madrid los dÃƒÂ­as 28 y 29 de marzo en directo, &quot;De aki a Ketama&quot; marca la transformaciÃƒÂ³n del trÃƒÂ­o en fenÃƒÂ±ÃƒÂ³meno de masas. Se trata de un disco grabado en Madrid, y que contÃƒÂ³ con la colaboraciÃƒÂ³n de artistas de la talla de Potito, Chonchi, Antonio Canales, JuaÃƒÂ±ares, Antonio Vega, Antonio Carbonell, Aurora, Amara Carmona y Antonio Flores, quien fallecerÃƒÂ­a poco despuÃƒÂ©s. El disco estuvo mÃƒÂ¡s de 1 aÃƒÂ±o en las listas espaÃƒÂ±olas y vendiÃƒÂ³ mÃƒÂ¡s de medio millÃƒÂ³n de copias, confirmÃƒÂ¡ndoles como las grandes estrellas del nuevo flamenco. Por este disco consiguieron el premio al mejor ÃƒÂ¡lbum en los Premios Ondas.\n\nEn 1997 consiguieron el Premio de la MÃƒÂºsica en la categorÃƒÂ­a de Mejor CanciÃƒÂ³n del aÃƒÂ±o 1996 por &quot;No estamos lokos&quot;.\n\nDespuÃƒÂ©s de un merecido descanso, Ketama retorna a los estudiso de grabaciÃƒÂ³n. Para ello cuenta con la colaboraciÃƒÂ³n de Jorge Drexler y Khaled. El resultado de este trabajo es un disco titulado &quot;KonfusiÃƒÂ³n&quot;, con el que vendieron mÃƒÂ¡s de 300.000 copias.\n\nEn 1998 publicaron &quot;Sabor Ketama&quot;, un recopilatorio con 17 temas del periodo comprendido entre 1990 y 1997. Su siguiente trabajo fue &quot;Toma Ketama!&quot;, que contÃƒÂ³ nuevamente con la colaboraciÃƒÂ³n de Jorge Drexler.\n\n&quot;Dame la mano&quot; es el siguiente ÃƒÂ¡lbum de Ketama. En el disco ademÃƒÂ¡s de los toques, de pop, flamenco y blues hacen incursiones en el hip hop y el house.\n\n\n","torrent":{"xt":"urn:btih:02a9be087e4bfe8ed009f843ff6349b7c377bfe2","amp;dn":"Ketama-Discografia.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02a9be087e4bfe8ed009f843ff6349b7c377bfe2","infoHashBuffer":{"type":"Buffer","data":[2,169,190,8,126,75,254,142,208,9,248,67,255,99,73,183,195,119,191,226]},"announce":[],"urlList":[]}}