{"title":"HandsOnHardcore - Rose Valerie (Doctors United) NEW 15 February","uid":13547023,"size":328659121,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:02bc0c87a4f9bf40f0097fad946f58a19f944992&amp;dn=HandsOnHardcore+-+Rose+Valerie+%28Doctors+United%29+NEW+15+February+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1455527922,"description":"David Perry works at the DDF Network hospital. Heâ™s got a new face in his core team and her name is Rose Valerie. The redhead is a stunning glamour babe from France. Her enhanced tits almost jump out of her scrub when she enters his medical room and her dirty mind already knows, how to seduce this hot stud. She looks so sexy, he simply canâ™t resist and grabs her small curvy ass. She immediately is all in and grabs his hard-on to give him a deep throat blowjob. Suddenly a patient shows up while her face is filled with cock. They interrupt their horny intermezzo. While the doc is checkin on some records, the eager nurse seduces the patient and inserts his hard dick into her amazing pussy. While the two are fucking on the examination table, doc Perry returns and joins the two for a sizzling threesome. The patient Ricky Mancini turns out to be pretty good in examining the young milfâ™s tasty pussy. A couple of moments later, the two studs cram her two fuckholes for some double penetration. One boners fills her anus, the other one bangs her snatch! They shift to doggy style position and while Ricky fucks her from behind, she takes a mouthful of Perry cock until she receives a load of cum in her ass and the docâ™s jizz all over her face.\r\nTags: Anal, Hardcore, High Heels, Lingerie, MMF, Nurse, Glasses, Milf, Clinic, DP, Multidick sucking, Blowjob\r\n \nhttp://imgdone.com/viewer.php?file=87715463672100280780.jpg\r\n \nhttp://imgdone.com/viewer.php?file=10223898610389907222.jpg","torrent":{"xt":"urn:btih:02bc0c87a4f9bf40f0097fad946f58a19f944992","amp;dn":"HandsOnHardcore+-+Rose+Valerie+%28Doctors+United%29+NEW+15+February+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02bc0c87a4f9bf40f0097fad946f58a19f944992","infoHashBuffer":{"type":"Buffer","data":[2,188,12,135,164,249,191,64,240,9,127,173,148,111,88,161,159,148,73,146]},"announce":[],"urlList":[]}}