{"title":"George Thorogood - Greatest Hits [FLAC] - Kitlope","uid":5698040,"size":583630474,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02d536918bdd1593e78338e15e5bb713dc3a73fe&amp;dn=George+Thorogood+-+Greatest+Hits+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Kitlope","files":19,"time":1279383146,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: 02D536918BDD1593E78338E15E5BB713DC3A73FE\nFile Size: 556.59 MB\nYear: 2004\nLabel: EMI\nCatalog #: 72438-7 4889-0-8\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\nFrom Wiki:\n\nGeorge Thorogood (born February 24, 1950) is a blues rock performer from Wilmington, Delaware, known for his hit song &quot;Bad to the Bone&quot; as well as for covers of blues standards such as Hank Williams' &quot;Move It On Over&quot; and John Lee Hooker's &quot;House Rent Boogie/One Bourbon, One Scotch, One Beer&quot;. Another favorite is a cover of Bo Diddley's &quot;Who Do You Love?&quot; George Thorogood and the [Delaware] Destroyers have released 16 studio albums, including five that have been certified Gold. The band is credited with the early success of Rounder Records.\n\n\nThorogood was born on February 24, 1950 and was raised in Naamans Manor, a neighborhood in suburban Wilmington, Delaware, where his father worked for DuPont. He graduated from Brandywine High School in 1968. The singer was born the middle of five children; including two older brothers, John and Pete consecutively. And two younger sisters, identical twins, Liza and Anne. Anne died suddenly on February 21, 2008.[2] Thorogood played semi-professional baseball, but turned toward music after seeing John P. Hammond perform in 1970.[3]\n\nThorogood's demo, Better Than the Rest, was recorded in 1974 and released in 1979. In 1976 he recorded his debut album: the eponymous George Thorogood &amp; The Destroyers with his band, The Destroyers (sometimes known as The Delaware Destroyers or simply GT and D) and issued the album in 1977. Thorogood released his next album titled Move It On Over in 1978 with The Destroyers, which included the Hank Williams remake &quot;Move It On Over&quot;. &quot;Please Set a Date&quot; and their remake of the Bo Diddley song &quot;Who Do You Love?&quot; both followed in 1979. In the late 1970s, Thorogood played on a team in Delaware in the Roberto Clemente League which was created in 1976. He was the second baseman and was chosen rookie of the year in the league.[citation needed] Soon after this achievement, The Destroyers forced him to quit playing the sport. In the 1970s, he and his band were based in Boston (see also Hound Dog Taylor).\n\nGeorge and the Delaware Destroyers were friends with Jimmy Thackery and the Nighthawks. While touring in the 1970s, the Destroyers and the Nighthawks happened to be playing shows in Georgetown (DC) at venues across the street from each other. The Destroyers were engaged at The Cellar Door and the Nighthawks at Desperados. At midnight, by prior arrangement, while both bands played Elmore James' &quot;Madison Blues&quot; in the key of E, Thorogood and Thackery left their clubs, met in the middle of M Street, exchanged guitar cables and went on to play with the opposite band.[4]\n\nThorogood gained his first mainstream exposure as a support act for the Rolling Stones during their 1981 U.S. tour. He also was the featured musical guest on Saturday Night Live (Season 8, Episode 2) on the October 2, 1982 broadcast. During this time, George and the Destroyers also became known for their rigorous schedule, including the &quot;50/50&quot; tour of 1980, on which the band toured 50 US states in the space of 50 days.[5]. After two shows in Boulder, Colorado, Thorogood and his band flew to Hawaii for one show and then performed a show in Alaska on the following night. The next day the band flew to Washington State, met their roadies who had their Checker car and a truck, and continued a one show per state tour for all fifty states in exactly fifty nights. In addition, they played Washington, DC on the same day that they performed a show in Maryland.\n\nThis increased visibility occurred as Thorogood's contract with Rounder Records expired. He signed with EMI America Records and in 1982 released his best-known song, &quot;Bad to the Bone&quot;, and an album of the same name. The song has been used frequently in television and the big screen, including Terminator 2: Judgment Day, the comedy Problem Child, Stephen King's Christine, and many episodes of the television sitcom Married with Children. This track also was used during the intro to the movie Major Payne. The same song is also featured in the game Rock 'n Roll Racing. It is also played during football pregame festivities at Mississippi State University. It is also played at USHRA Monster Jam events to introduce Grave Digger (regardless of driver). Quincy Jones once said to Thorogood, &quot;The three things important in a record is the tune, tune, and the tune&quot;. \n\n\n\n\n\n\nGreatest Hits: 30 Years of Rock\n\n\n\n\n\nTracks:\n\n\nMadison Blues\nOne Bourbon, One Scotch, One Beer\nMove it On Over\nWho Do You Love?\nBad to the Bone\nI Drink Alone\nGear Jammer\nWillie and the Hand Jive\nThe Sky is Crying (live)\nReelin' &amp; Rockin' (live)\nYou Talk too Much\nIf You Don't Start Drinkin'\nGet a Haircut\nRockin' My Life Away (alternate Take) \nAmerican Made\nWho Do You Love? (Rothrock Remix)\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:02d536918bdd1593e78338e15e5bb713dc3a73fe","amp;dn":"George+Thorogood+-+Greatest+Hits+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02d536918bdd1593e78338e15e5bb713dc3a73fe","infoHashBuffer":{"type":"Buffer","data":[2,213,54,145,139,221,21,147,231,131,56,225,94,91,183,19,220,58,115,254]},"announce":[],"urlList":[]}}