{"title":"Simpsons Skateboarding PS2 NTSC","uid":4898553,"size":1716301608,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:02fe742fd2cd7caba657be4f8e765f5f607d1935&amp;dn=Simpsons+Skateboarding+PS2+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"thenoobish","files":4,"time":1242488233,"description":"Springfield\nhas been converted into one giant skate park, and none of its famous landmarks will ever be the same?here?s your opportunity to thrash on top of, under, over, and through tons of skate-able locales. How about shredding the halls of Springfield Elementary, going through the stages at Krusty-Lu Studios and sidewalk surfing Downtown to the Kwik-E-Mart. Better yet skate the Springfield Gorge, Itchy and Scratchy land, Sir Putt-A-Lot?s and trigger a meltdown at the highly radioactive Power Plant.\n\nEveryone in town is jumping into the action, vying for the colossal $99 prize (fictional grand prize) for winning the tour contest. All characters have more than 40 moves and include tricks unique to each character such as Bart?s ?In Your Dreams? to Homer?s ?Stinkyfish.? In addition to the Simpsons family, players can select other favorites such as Otto, Professor Fink, Nelson and Krusty the Clown. Each character brings to the event his or her own tricks, personality and dialogue ? recorded by the actual voice talent from the TV show. Players can go for broke in five, fast and furious modes, including: Freeskate, Skate Fest, Trick Contest, Skillz School and a good game of skateboard H-O-R-S-E. The more you skate, the more hidden boards, characters and levels you unlock. Also, players and their friends can throw elbows to grab the grand prize* in single or dual-player, head-to-head mode. \n\ndownloaded from demonoid,com","torrent":{"xt":"urn:btih:02fe742fd2cd7caba657be4f8e765f5f607d1935","amp;dn":"Simpsons+Skateboarding+PS2+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fe742fd2cd7caba657be4f8e765f5f607d1935","infoHashBuffer":{"type":"Buffer","data":[2,254,116,47,210,205,124,171,166,87,190,79,142,118,95,95,96,125,25,53]},"announce":[],"urlList":[]}}