{"title":"Sting - Ten Summoner's Tales 320cbr (Big Papi) 1995 Fields of Go","uid":9744862,"size":117264244,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:03595fda491365499ef0fa10b3289e28c2630869&amp;dn=Sting+-+Ten+Summoner%27s+Tales+320cbr+%28Big+Papi%29+1995+Fields+of+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1394570449,"description":"Source: 1995 CD\n\n\n\nBy &quot;cyberwares&quot;\n\nThose who didn't understand Sting's departure from the Police may finally get it when they listen to this album. Ten Summoner's Tales is an amazing compilation of 11 songs that really push boundaries with his musicianship while staying true to his excellent songwriting. The songs included on this album are both immerse and expansive, serious and funny and packed with melodies. While its message isn't as deep as his past albums, it shines in its authenticity, surely the best material he's ever played.\nTo draw you in the first song is the well-known pop song, &quot;If I Ever Lose My Faith in You.&quot; It has an addictive groove and multiple layers of sounds and melodies. In that same vein is the other guaranteed hit, &quot;Fields of Gold.&quot; Surely this song, in its somber mood and loving lyrics is more than just a pop song but a recalled memory of love. Something even the music video hit dead-on.\n\nIf you were scared of Sting's poly-rhythms in his other albums, you'll be terrified of this album. And too bad, some of Sting's best work is with the following three songs. He uses 7/4 scale before going into cowboy bebop in &quot;Love is Stronger than Justice (The Munificent Seven).&quot; The storytelling here is a simple but amusing story of seven desperados as they rescue a town and fight each other for the girl. 5/2 scale is heard in &quot;Seven Days.&quot; The musicianship is worth high praise as mandolin and violins texture this song in its weird rhythm, making the 5 beats sound normal after the first chorus. Saint Augustine in Hell is the last of poly-beats, taking a 7/4 beat again. This song is a bit awkward, but a humorous romp with its tale of one guy's descent to Hell.\n\nSting's sense of storytelling is exercised in songs like &quot;Love is Stronger...\nTo give credit to the other writers on this album, Dominic Miller's &quot;Shape of My Heart&quot; and Clapton's and Michael Kamen's &quot;It's Probably Me&quot; are excellent compositions in their own right. &quot;Shape of My Heart&quot; is a strumming tune and rivals that of &quot;Fragile&quot; (from Sting's previous album, Nothing Like the Sun). It's lyrics, again, are of a story of a gambler while its music is serious and fits excellently with Sting's vocal. &quot;It's Probably Me&quot; is totally panoramic, capturing its listener in a sea of music, of sorts, as it takes you through its love-song context.\n\nTo end the album, &quot;Epilogue (Nothing `Bout Me)&quot; is another silly romp, probably talking back to the media that surrounds him. He continually denies ever spilling his guts, no matter how much you search. Again, it's silly but it's also nice epilogue and come on... that ending rips directly from &quot;A Day in the Life&quot; from the Beatles with its instruments winding up scales in the end.\n\nThis album feels like a whole composition while the songs themselves are a greatest hits collection. Sting's mastery of musicianship and ironic, direct lyrics can not be denied as he safely takes tastes of all sorts and blends them into his romantic and freshly synthesized songs. This album is the pinnacle of Sting's work, not going too deep or too somber in message and being as high in his own standard as he'll ever get.\n\n\n---------------------------------------------------------------------\nSting - Ten Summoner's Tales\n---------------------------------------------------------------------\n\nArtist...............: Sting\nAlbum................: Ten Summoner's Tales\nGenre................: \nSource...............: CD\nYear.................: \nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Sting - If I Ever Lose My Faith in You [04:29]\n2. Sting - Love Is Stronger Than Justice (The Munificent Seven)[05:10]\n3. Sting - Fields of Gold [03:41]\n4. Sting - Heavy Cloud No Rain [03:47]\n5. Sting - She's Too Good for Me [02:29]\n6. Sting - Seven Days [04:38]\n7. Sting - Saint Augustine in Hell [05:16]\n8. Sting - It's Probably Me [05:08]\n9. Sting - Shape of My Heart [04:38]\n10. Sting - Something the Boy Said [05:28]\n11. Sting - Epilogue (Nothing 'Bout Me) [03:41]\n\nPlaying Time.........: 48:29","torrent":{"xt":"urn:btih:03595fda491365499ef0fa10b3289e28c2630869","amp;dn":"Sting+-+Ten+Summoner%27s+Tales+320cbr+%28Big+Papi%29+1995+Fields+of+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03595fda491365499ef0fa10b3289e28c2630869","infoHashBuffer":{"type":"Buffer","data":[3,89,95,218,73,19,101,73,158,240,250,16,179,40,158,40,194,99,8,105]},"announce":[],"urlList":[]}}