{"title":"Let's Learn Arabic","uid":6561752,"size":476190720,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0389feca8842847f21ab06da8d31c30e2e199a40&amp;dn=Let%5C%27s+Learn+Arabic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"iSky","files":1,"time":1311469056,"description":"                                                   \n                      ||   .                 || /| | ||\n      o_____|_____\\ __|| |   |_____o_____\\ __||  |_|_||  o______w_|\n     /   &quot;         /     |___|            /             /        .\n\n\nALL praise is due to Allah, the Lord of the Worlds, the Most\nMerciful, the Beneficent, and the Master of the Day of\nJudgment. O Allah! Have Your Salat and Salam (peace) and\nblessing upon Your slave and Messenger Muhammad and\nupon all of his companions.\n\n\n\nAssalamu Alaikum Wa Rahmatullahi Wa Barakatuh\n(&quot;Peace be unto you and so may the mercy of Allah and His blessings&quot;)\n\nEnglish Description: There are alot of people asking for an Arabic learning software, masha-allah. Well, i have searched long and hard and i hope you like it. Its a step by step guide to Arabic with sound, images and words. Not only can you see the Arabic alphabet you can also learn how to pronounce it perfectly with the sounds. So, non-arabic muslims, having trouble with the quranic pronunciation, then Insha-allah you will be pros when your finished with this software. The software also teaches you dialogue, reading and writing. This software makes learning arabic fun. So enjoy.\n\nLanguage: Englsh/Arabic\n\nFormat: Iso\n\nOther Comments: The format is iso, to save space, so you will need to download Power iso. go on this link - http://www.newfreedownloads.com/download-PowerISO.html, and then download link 1 - This sofware is free to try and all you need to do is install the software and then open 'Lets learn Arabic' it , after this just extract the files to where you want and then install the software.\n\nI HOPE YOU FIND THE SOFTWARE USEFUL. INSHA-ALLAH.\n\np.s. After downloadng can you please carry on seeding so other people can benifite from the software, and then I dua that allah gives you reward, Insha-allah, Ameen.","torrent":{"xt":"urn:btih:0389feca8842847f21ab06da8d31c30e2e199a40","amp;dn":"Let%5C%27s+Learn+Arabic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0389feca8842847f21ab06da8d31c30e2e199a40","infoHashBuffer":{"type":"Buffer","data":[3,137,254,202,136,66,132,127,33,171,6,218,141,49,195,14,46,25,154,64]},"announce":[],"urlList":[]}}