{"title":"Sprinkle Islands v1.1.0 [PD]","uid":8859418,"size":29923321,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0463577ab4ce9bd87885268e3f96dd6f7f95d799&amp;dn=Sprinkle+Islands+v1.1.0+%5BPD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Androider","files":-1,"time":1377737480,"description":"\nTitan burns again - Award winning, fire fighting, water-physics puzzler Sprinkle is back with an all new adventure!\n\nIn a not so distant future, a garbage hauling space ship from Earth has gone off course and burning trash is falling all over the beautiful islands of Titan. The innocent Titans' villages have been set on fire by burning trash and they need your help!\n\nUsing intuitive touch controls you control a tiny firetruck to put out fires. But some of the fires are hard to reach - solve each puzzle with the flow of water by using obstacles, buttons, elevators, and more to save Titan. Your water supply is limited so conserve water to earn the most drops on each level!\n\n* Four distinct islands with a total of 48 levels provide hours of challenging entertainment.\n* Amazing water physics - The original Sprinkle set a new standard for water in mobile games. Sprinkle Islands improves on that with endless oceans, pools and floating objects.\n* Aquatic boss battles - New to Sprinkle Islands, players will find dramatic boss battles at the end of each island.\n* Revamped touch controls - Refined controls let players focus on the task at hand, solving brain-tingling puzzles with their water cannon's stream.\n\nThe original Sprinkle has been enjoyed by more than eight million people. Join in on the fun in this new and improved version by using your smarts and your water cannon to solve puzzles and save Titan!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.mediocre.sprinkle2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.mediocre.sprinkle2&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0463577ab4ce9bd87885268e3f96dd6f7f95d799","amp;dn":"Sprinkle+Islands+v1.1.0+%5BPD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0463577ab4ce9bd87885268e3f96dd6f7f95d799","infoHashBuffer":{"type":"Buffer","data":[4,99,87,122,180,206,155,216,120,133,38,142,63,150,221,111,127,149,215,153]},"announce":[],"urlList":[]}}