{"title":"Finding Your Own North Star: Claiming the Life You Were Meant to","uid":8501979,"size":4609113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04e54b553feabbcbc41000787da779b701000500&amp;dn=Finding+Your+Own+North+Star%3A+Claiming+the+Life+You+Were+Meant+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1369327354,"description":"\nMartha Beck, &quot;Finding Your Own North Star: Claiming the Life You Were Meant to Live&quot;\nISBN: 081293217X, 0812932188 | 2001 | EPUB\n\n&quot;The North Star -- Stella Polaris -- is a fixed point that can always be used to figure out which way you're headed. Explorers and mariners can depend on Polaris when there are no other landmarks in sight. The same relationship exists between you and your right life, the ultimate realization of your potential for happiness. I believe that a knowledge of that perfect life sits inside you just as the North Star sits in its unaltering spot. You may think you're utterly lost, but brush away the leaves, wait for the clouds to clear, and you'll see your destiny shining as brightly as ever; the fixed point in the constantly changing constellations of your life.&quot; -- Martha Beck\n\nAs the creator of Life Designs, Inc., Martha Beck has helped hundreds of clients find their own North Star and figure out how to fulfill their potential and create joyful lives through her lectures, seminars, and one-on-one counseling. In her new book, she shares her step-by-step program that will guide you to fulfill your own potential. You'll start by learning how to read the internal compasses already built into your brain and body -- and why you may have spent your life ignoring their signals. As you become reacquainted with your own deepest desires, you'll identify and repair any unconscious beliefs or unhealed emotional wounds that may be blocking your progress. This will change your life, but don't worry -- although every life is unique, major transformations have common elements, and Beck provides a map that will guide you through your own life changes. You'll learn how to navigate every stage, from the first flickering appearance of a new dream to the planning and implementation of your own ideal life.","torrent":{"xt":"urn:btih:04e54b553feabbcbc41000787da779b701000500","amp;dn":"Finding+Your+Own+North+Star%3A+Claiming+the+Life+You+Were+Meant+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e54b553feabbcbc41000787da779b701000500","infoHashBuffer":{"type":"Buffer","data":[4,229,75,85,63,234,187,203,196,16,0,120,125,167,121,183,1,0,5,0]},"announce":[],"urlList":[]}}