{"title":"Frank Sinatra Reprise - The Very Good Years [FLAC+MP3]","uid":9513244,"size":578709327,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0503d666902ad5f728c0eb1c67507426d8e2bad6&amp;dn=Frank+Sinatra+Reprise+-+The+Very+Good+Years+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1390458237,"description":"\n\nSource: Di-lithium Crystals\n\n\n\nThis is all you need - Big Papi\n\n\n\nBy Joel L. Gandelman VINE VOICE\n\nWhy was Frank Sinatra considered one of the 20th century's greatest singers (some say THE). Sinatra Reprise The Very Good Years is one of the key Sinatra CDs that'll show you precisely why.\n\nSinatra fans will love this collection. And young people who are interested in singing-non rock (in his final years Sinatra's biggest fans included some of the rock's biggest names, who publically attested to his influence and their admiration for him) can find in this recording not only a good role musical model but proof (as rock's Bruce Springsteen now also clearly shows with The Rising) that a teen idol CAN age, create, innovate and wear well musically. Talent doesn't evaporate at age 30 or 40.\n\nThe 20 tracks on this CD are somewhat unusual since they're incredibly diverse, include some re-makes of his earlier Capitol hits and even a &quot;live&quot; performance in front of an audience. Usually you can't find a collection that gives you the studio and live recordings in one. This CD's songs reflect the 60s/70s/and-yes-80s Sinatra, the show-stopping singer who had survived being a washed-up teen idol and had been born again in the early 50s as a &quot;swinger&quot; using only the best arrangers and orchestras at Capitol Records. By the 60s/70s and 80s Sinatra had managed to pierce the rock charts and get extensive radio play as many of his easy listening/jazz contemporaries vanished from the airwaves, not due to lack of talent but due to musical/demographic changes. But Sinatra's work, talent and song selection were so overpowering that his songs not only were played but SOLD while still getting critical rave reviews.\n\nMy favorites here include the often-imitated theme from New York New York, ending in his final sock-em chorus where with gleeful pizazz he elongates the word &quot;annnnnnnnnnnd&quot;; My Kind of Town (Sinatra's zestful ode to Chicago, from one of his films); I've Got You Under My Skin (a slightly inferior remake of the1950s Capitol records version with the same lengendarily explosive Nelson Riddle arrangement); Strangers in the Night (a song he didn't really like and barely sung in concert); My Way (matched only by Elvis' unique but equally rousing version); That's Life (an almost harsh 70s-style rock-blues influenced number that he almost shouts); the Lady is a Tramp (Sinatra gave Cole Porter standards new life).\n\nThere are many others. Fans of Tv's &quot;Married With Children&quot; will find his remake of Love and Marriage, the theme song on that show. But there is one song on this CD that I think is WORTH THE WHOLE COST of the collection: The Summer Wind. Here he returned to his 1950s innovative roots, producing an original version of this song artistically satisfying as it builds to its emotional show-stopping conclusion....with Sinatra then punctuating it with a final, unusually low, soft phrase. It's a homerun.\n\nSinatra perfected this kind of singing. The Reprise label was his own and, as usual, he used state-of-the-art and only-the-best musicians and arrangers. STRONGLY recommended for Sinatra fans, young people who want to learn why Sinatra was considered great, and for young people interested in learning this kind of singing or using some of its techniques in their own music. You cannot learn from a better master than Sinatra -- and he has left a ton of great CD &quot;instruction books&quot; behind.","torrent":{"xt":"urn:btih:0503d666902ad5f728c0eb1c67507426d8e2bad6","amp;dn":"Frank+Sinatra+Reprise+-+The+Very+Good+Years+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0503d666902ad5f728c0eb1c67507426d8e2bad6","infoHashBuffer":{"type":"Buffer","data":[5,3,214,102,144,42,213,247,40,192,235,28,103,80,116,38,216,226,186,214]},"announce":[],"urlList":[]}}