{"title":"Aerosmith - Honkin' On Bobo (2004) 320 vtwin88cube","uid":6185703,"size":109312157,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05081baaf8b4c78d16da2f3612cd81bae9f160d8&amp;dn=Aerosmith+-+Honkin%5C%27+On+Bobo+%282004%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1298103507,"description":"\n\nAerosmith\nHonkin' On Bobo (2004)\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\nSource:\t\t\tFlac Conversion\n\n\nAerosmith prove that a band can be inspired by the blues and play the blues without ever feeling like a blues band. Then again, the nature of the blues is that every musician who plays it stamps his or her own identity on a set of familiar chord changes and songs. While it might not feel like the blues, Aerosmith do indeed stamp their identity on each track on their long-promised blues album, the atrociously named Honkin' on Bobo. Other rockers who have cut full-length blues albums have always played the music with a kind of scholarly reverence, taking care to pay tribute to their influences. Not Aerosmith. They turn up the amps and cut loose, playing slick and sleazy blooze-rock that feels indebted to second-generation blues-rock instead of blues forefathers. But that's the nature of the band. Surely, they loved Chess and country blues as much as they loved the Stones, but they are so thoroughly the children of Mick and Keith, they can't help but sound like a rock &amp; roll band no matter what they do, no matter what they play. That might mean that Honkin' on Bobo is something that could be close to anathema to blues purists, since it's a rock album pure and simple, but chances are the bandmembers don't care, since they're just here to have a good time playing songs they love. \n\n\n01.Road Runner\n02.Shame, Shame, Shame\n03.Eyesight To The Blind\n04.Baby, Please Don't Go\n05.Never Loved A Girl\n06.Back Back Train\n07.You Gotta Move\n08.The Grind\n09.I'm Ready\n10.Temperature\n11.Stop Messin' Around\n12.Jesus Is On The Main Line\n\n\nCheers!","torrent":{"xt":"urn:btih:05081baaf8b4c78d16da2f3612cd81bae9f160d8","amp;dn":"Aerosmith+-+Honkin%5C%27+On+Bobo+%282004%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05081baaf8b4c78d16da2f3612cd81bae9f160d8","infoHashBuffer":{"type":"Buffer","data":[5,8,27,170,248,180,199,141,22,218,47,54,18,205,129,186,233,241,96,216]},"announce":[],"urlList":[]}}