{"title":"Good Boss, Bad Boss: How to Be the Best","uid":8311246,"size":3832973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:051b8e436012964c072800c0f2c18280634e706f&amp;dn=Good+Boss%2C+Bad+Boss%3A+How+to+Be+the+Best&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364485942,"description":"\nRobert I. Sutton, &quot;Good Boss, Bad Boss: How to Be the Best... and Learn from the Worst&quot;\n2010 | ISBN-10: 0446556084 | 320 pages | MOBI, PDF | 3,7 MB\n\nI loved this book - immediately my favorite business book. There are so many great principles and ideas to live up to, backed up by real data - it should be every boss' responsibility to read and understand it. (John Lilly, CEO of Mozilla Corporation, producer of the Firefox web browser )\n\nGood Boss, Bad Boss does a wonderful job of challenging conventional wisdom while outlining a clear and compelling rationale for thinking differently. From Sutton's useful steps for getting &quot;in tune&quot; with what it feels like to work for you, to evidence that eliminating the negative is more powerful than accentuating the positive, to the importance of demonstrating confidence with the admission that you're not always right. Good Boss, Bad Boss teaches the art and the science of practical leadership for the 21st century. I would consider it a must-read for anyone looking to improve their impact and accelerate their desired outcomes. (Brad Smith, CEO of Intuit )\n\nThis book is the personal coach that every boss deserves: warm, smart, and freakishly good at translating scientific research into practical tips that will help keep you at the top of your game. (Chip &amp; Dan Heath, authors of Switch: How to Change Things When Change is Hard )\n\nWe are damned lucky to have Bob Sutton. While his every word is backed up by significant research, he writes in simple sentences that make enormous sense. Typical in this book, Sutton's little chart in Chapter 3, 'Smart Versus Wise Bosses,' is worth, all by itself, 100 times the price of admission. Good Boss, Bad Boss is as good as it gets. (Tom Peters, author of The Little Big Things and co-author of In Search of Excellence )","torrent":{"xt":"urn:btih:051b8e436012964c072800c0f2c18280634e706f","amp;dn":"Good+Boss%2C+Bad+Boss%3A+How+to+Be+the+Best","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"051b8e436012964c072800c0f2c18280634e706f","infoHashBuffer":{"type":"Buffer","data":[5,27,142,67,96,18,150,76,7,40,0,192,242,193,130,128,99,78,112,111]},"announce":[],"urlList":[]}}