{"title":"Dungeons &amp; Dragons: Ravenloft Series (GOG)","uid":12656924,"size":360821017,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:05d275340e615799152abf5963a4f469c735ee1c&amp;dn=Dungeons+%26amp%3B+Dragons%3A+Ravenloft+Series+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mercs215","files":7,"time":1446234701,"description":"Install instructions:\r\n- Run &quot;setup_ravenloft_stone_prophet_2.0.0.3.exe&quot;\r\n- Run &quot;setup_ravenloft_strahds_possession_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: DUNGEONS &amp; DRAGONS: RAVENLOFT SERIES\r\nGenre: Role-playing - Action - Fantasy\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.7) and Linux (Ubuntu 14.04, Mint 17)\r\nLanguages: Audio and text: English\r\nModes: Single-player\r\nReleased: January 1, 1994\r\nCompany: DreamForge Intertainment / GOG Ltd.\r\nStore page: http://www.gog.com/game/dungeons_dragons_ravenloft_series\r\n\r\nAbout:\r\nStep into a world of gothic and Egyptian horror and adventure, set in the campaign setting of Ravenloft. This pack of entrancing horrors includes Ravenloft: Strahd's Possession and its sequel, Ravenloft: Stone Prophet\r\nRavenloft: Strahd's Possession\r\nCordial Greetings from Count Strahd Von Zarovich, Lord of Barovia\r\nFor many travellers, I have naught but contempt and slight regard, entering Barovia as they do in timid apprehension of her wonders. They are neither prepared for life high in the Balinoks, nor ready to accept its dangers. Here, the peaks of Baratak and Ghakis stand in cloaks of granite, their cowls of snow pulled securely about them as if they alone might endure the ancient night.\r\nHowever, your party intrigues me. Perhaps the harsh cut of the wind or a storm in the forest does not alarm you. If that is so, I am certain our woods, streams and caverns will attract your interest, offering many a delightful diversion. Even the otherwise abysmal village of Barovia boasts a charming cemetery. You must visit it. Perhaps, if your party survives... that is, stays long enough in this harsh and unyielding home of mine, I may require its presence. I shall ask you to join me in Ravenloft, my castle upon the precipice overlooking Barovia. It is not an invitation to be refused.\r\nI give my leave for your party to enjoy our misty, twilight dangers. Let you challenge your wits and fighting skills; may the perilous magics of my land enchant them. But heed this warning and do not play at cross-purposes with me. To stand against Strahd is to be at odds with life itself, for he who sends these greetings is the Lord and the Law of this brutal paradise.\r\nWith Gentle Regards, \r\nCount Strahd Von Zarovich\r\nLord of Barovia\r\n\r\nRavenloft: Stone Prophet\r\nThe desert of Har'Akir is ancient beyond belief. Not all of its past is marked by noble deeds and great kings. In ancient days, the evil pharaoh Anhktepot ruled a great and powerful nation. His downfall stemmed from his desire for immortality. Cursed by Ra, the sun god, Anhktepot's soul still remains in his mummified form and brings death to those it touches at night.\r\nStone Prophet, begins when your characters become trapped in a wasteland haunted by unnatural creatures, fierce sand storms, and cursed villagers afflicted by a horrible rotting disease. Your party's only hope of escape is to follow the advice of a blind seer and seek out the Stone Prophet, a huge, hieroglyphic wall hidden deep within a mysterious obelisk. Some say the writings on the wall, when deciphered, may lead the party to freedom... or to death. One thing is certain, a great conflict has been foreseen, and the mummy lord is gathering his forces.\r\nEnjoy the lore and depth of a Dungeons &amp; Dragons adventure in a gothic and Egyptian setting\r\nAssemble your party and make your way across terrain and through dungeons, using weaponry, magic, brains and brawn\r\nFight a wide array of horrific creatures and rid Barovia and Har'Akir of the evil manifestations\r\n\r\nMinimum system requirements - Windows: XP / Vista / 7 / 8 / 10 \r\nProcessor: 1.8 GHz Processor \r\nMemory: 512MB RAM (1 GB recommended) \r\nGraphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended) \r\nHard Drive: 2GB HDD \r\nMouse, Keyboard","torrent":{"xt":"urn:btih:05d275340e615799152abf5963a4f469c735ee1c","amp;dn":"Dungeons+%26amp%3B+Dragons%3A+Ravenloft+Series+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d275340e615799152abf5963a4f469c735ee1c","infoHashBuffer":{"type":"Buffer","data":[5,210,117,52,14,97,87,153,21,42,191,89,99,164,244,105,199,53,238,28]},"announce":[],"urlList":[]}}