{"title":"Stealing from God - Frank Turek","uid":11773405,"size":640910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0621459f7ad8c08b66948a41bc4d9df0d6a0181a&amp;dn=Stealing+from+God+-+Frank+Turek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1427166771,"description":"\nWhat if your best reasons to doubt God prove that He exists?\n\nIf you think atheists have reason, evidence, and science on their side, think again! Award-winning author Dr. Frank Turek (I Don?t Have Enough Faith to be an Atheist) will show you how atheists steal reason, evidence, science, and other arguments from God in trying to make their case for atheism. If that sounds contradictory, it?s because it is! Atheists can?t make their case without appealing to realities only theism can explain.\n\nIn an engaging and memorable way, Stealing from God exposes the intellectual CRIMES atheists are committing. Join Turek as he explores how many atheistic arguments, instead of disproving God, show that God actually exists. Turek also provides a powerful four-point defense for the truth of Christianity. Whether you are exploring answers for yourself or want to understand how God transcends the reasoning of those who would deny His existence, this book is for you.\n\n\nAbout the author:\nFrank Turek is the president of CrossExamined, a dynamic speaker, and a Gold Medallion award-winning author who has written/cowritten several books, including I Don't Have Enough Faith to Be an Atheist (over 200,000 sold). He hosts an hour-long apologetics TV program (broadcast on the NRB Network into 32 million homes) and an hour-long apologetics radio program (broadcast on 144 stations). Frank speaks over 100 times a year at colleges, high schools, and churches. He has debated several prominent atheists, including Christopher Hitchens and David Silverman. Frank is also an adjunct professor of apologetics at Southern Evangelical Seminary","torrent":{"xt":"urn:btih:0621459f7ad8c08b66948a41bc4d9df0d6a0181a","amp;dn":"Stealing+from+God+-+Frank+Turek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0621459f7ad8c08b66948a41bc4d9df0d6a0181a","infoHashBuffer":{"type":"Buffer","data":[6,33,69,159,122,216,192,139,102,148,138,65,188,77,157,240,214,160,24,26]},"announce":[],"urlList":[]}}