{"title":"Daddy Touched Me There XXX NEW 2016 DVDRip","uid":13296663,"size":1315897489,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:065b5070ab6635780311cf33c872920ddb4cf7e4&amp;dn=Daddy+Touched+Me+There+XXX+NEW+2016+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SudoSu","files":1,"time":1453643115,"description":"\nhttp://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――   \nhttp://imgpremium.com/image/gId \nhttp://imgpremium.com/image/gIt \nhttp://imgpremium.com/image/gI7\r\n\r\nCountry: USA\r\nStudio: Desperate Pleasures\r\nGenre: 18+ Teens, All Sex, Family Roleplay, Older Men\r\nDuration: 1:40:57\r\n\r\nCast: Ava Steele, Kallie Jo, Charlene Liana, JW Ties\r\n\r\nKallie Jo - Daddy and I have always been close but not like this. Mom was away for the weekend when it all happened I was checking out my cheer-leading outfit in the mirror when he slipped up behind me and started caressing my breasts and complimenting me. I started to protest when Daddy touched me there. Since I was not wearing panties his touch sent shivers up my spine and all my reservations went out the window. Daddy threw me on the bed and ate my wet pussy making me cum really hard. Before I knew it his cock was in my mouth and I was begging to be fucked.\r\n\r\nAva Steel - Since I turned 18, my tits have not stopped growing and I can not help but play with them. Every time I do it turns me on and I start to masturbate just like I did today except Daddy walked in. He started talking to me then he touched my sensitive tittles. In my aroused state it was hard for me to resist Daddys advances and soon his cock was in my mouth. Before I knew it I was getting fucked by my Daddy and cumming like crazy. It got so intense I rode him like a cowgirl and he lost control, filling me with his seed. OMG what will happen if I'm fertile? _Ai\r\n\r\nCharlene Liana The other day after school I was laying in my room trying to relax a muscle when Dad came home. I asked him if you would massage it for me and he grudgingly agreed. When Daddy started rubbing me he touched a few spots they were not really appropriate and the feelings that came over me were overwhelming. When daddy left I actually had to touch myself and its rare that I do that Throughout the night I imagine what is sex would feel like and I could not get it off my mind. The next day I went to his office to talk to him and my wildest fantasy came true!\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:065b5070ab6635780311cf33c872920ddb4cf7e4","amp;dn":"Daddy+Touched+Me+There+XXX+NEW+2016+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065b5070ab6635780311cf33c872920ddb4cf7e4","infoHashBuffer":{"type":"Buffer","data":[6,91,80,112,171,102,53,120,3,17,207,51,200,114,146,13,219,76,247,228]},"announce":[],"urlList":[]}}