{"title":"Cream - Fresh Cream (1966) [SACD] (2013 SHM-SACD ISO).","uid":9817086,"size":4699573600,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:068f3c4b033ba4fb92b89a90165d368217032101&amp;dn=Cream+-+Fresh+Cream+%281966%29+%5BSACD%5D+%282013+SHM-SACD+ISO%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"sidmal","files":-1,"time":1395632865,"description":"\nCream - Fresh Cream (1966) [Japanese Limited SHM-SACD 2013 # UIGY-9539]\n PS3 Rip | SACD ISO | DSD64 2.0 &gt; 1-bit/2.8224 MHz | 108:50 minutes | Scans included | 4,37 GB\n\nFeatures Original Stereo and Mono Album with several Bonus Tracks\n\n\n Fresh Cream represents so many different firsts, it's difficult to keep count. Cream, of course, was the first supergroup, but their first album not only gave birth to the power trio, it also was instrumental in the birth of heavy metal and the birth of jam rock. That's a lot of weight for one record and, like a lot of pioneering records, Fresh Cream doesn't seem quite as mighty as what would come later, both from the group and its acolytes. In retrospect, the moments on the LP that are a bit unformed -- in particular, the halting waltz of &quot;Dreaming&quot; never achieves the sweet ethereal atmosphere it aspires to -- stand out more than the innovations, which have been so thoroughly assimilated into the vocabulary of rock &amp; roll, but Fresh Cream was a remarkable shift forward in rock upon its 1966 release and it remains quite potent. Certainly at this early stage the trio was still grounded heavily in blues, only fitting given guitarist Eric Clapton's stint in John Mayall's Bluesbreakers, which is where he first played with bassist Jack Bruce, but Cream never had the purist bent of Mayall, and not just because they dabbled heavily in psychedelia. The rhythm section of Bruce and Ginger Baker had a distinct jazzy bent to their beat; this isn't hard and pure, it's spongy and elastic, giving the musicians plenty of room to roam. This fluidity is most apparent on the blues covers that take up nearly half the record, especially on &quot;Spoonful,&quot; where the swirling instrumental interplay, echo, fuzz tones, and overwhelming volume constitute true psychedelic music, and also points strongly toward the guitar worship of heavy metal. Almost all the second side of Fresh Cream is devoted to this, closing with Baker's showcase &quot;Toad,&quot; but for as hard and restless as this half of the album is, there is some lightness on the first portion of the record where Bruce reveals himself as an inventive psychedelic pop songwriter with the tense, colorful &quot;N.S.U.&quot; and the hook- and harmony-laden &quot;I Feel Free.&quot; Cream shows as much force and mastery on these tighter, poppier tunes as they do on the free-flowing jams, yet they show a clear bias toward the long-form blues numbers, which makes sense: they formed to be able to pursue this freedom, which they do so without restraint. If at times that does make the album indulgent or lopsided, this is nevertheless where Cream was feeling their way forward, creating their heavy psychedelic jazz-blues and, in the process, opening the door to all kinds of serious rock music that may have happened without Fresh Cream, but it just would not have happened in the same fashion as it did with this record as precedent.  \n\n\nTracklist:\n\n 01. N.S.U. (Stereo#\n 02. Sleepy Time Time #Stereo#\n 03. Dreaming #Stereo#\n 04. Sweet Wine #Stereo#\n 05. Spoonful #Stereo#\n 06. Cat's Squirrel #Stereo#\n 07. Four Until Late #Stereo#\n 08. Rollin' And Tumblin' #Stereo#\n 09. I'm So Glad #Mono#\n 10. Toad #Stereo#\n 11. Wrapping Paper #Stereo#\n 12. I Feel Free #Stereo#\n 13. The Coffee Song #Stereo#\n 14. N.S.U. #Mono#\n 15. Sleepy Time Time #Mono#\n 16. Dreaming #Mono# \n 17. Sweet Wine #Mono#\n 18. Spoonful #Mono#\n 19. Cat's Squirrel #Mono#\n 20. Four Until Late #Mono#\n 21. Rollin' And Tumblin' #Mono#\n 22. I'm So Glad #Mono#\n 23. Toad #Mono#\n 24. Wrapping Paper #Mono#\n 25. I Feel Free #Mono# \n 26. The Coffee Song #Mono#\n 27. Wrapping Paper #French EP version#\n 28. Sweet Wine #French EP version#\n 29. I'm So Glad #French EP version#\n 30. Cat's Squirrel #French EP version#\n 31. Rollin' And Tumblin' #French EP version#\n 32. Four Until Late #French EP version#\n\n DSD flat transferred from analogue master tapes by Seth Foster at Sterling Sound, New York, in 2013.\n Tracks &quot;14-18&quot; DSD flat transferred from analogue master tapes by Richard Whittaker at FX Copyroom, London, in 2013.\n Edited in DSD by Manabu Matsumura at Universal Music Studios, Tokyo, in 2013.\n","torrent":{"xt":"urn:btih:068f3c4b033ba4fb92b89a90165d368217032101","amp;dn":"Cream+-+Fresh+Cream+%281966%29+%5BSACD%5D+%282013+SHM-SACD+ISO%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"068f3c4b033ba4fb92b89a90165d368217032101","infoHashBuffer":{"type":"Buffer","data":[6,143,60,75,3,59,164,251,146,184,154,144,22,93,54,130,23,3,33,1]},"announce":[],"urlList":[]}}