{"title":"Reign.S01E14.HDTV.x264-2HD","uid":9758760,"size":287781645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:06ad8e9ede5702145155339b6cb6b8002677972a&amp;dn=Reign.S01E14.HDTV.x264-2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":1,"time":1394780034,"description":"[b]Reign\n\n[IMG]http://i.imgur.com/Pzd506q.jpg[/IMG]\n\nVisit: thhaque.blogspot .com\n\nGenre: Drama, Fantasy\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Brad Silberling\nCast: Toby Regbo, Torrance Coombs, Jenessa Grant\n\n.: Plot :.\nHidden between the lines of the history books is the story of Mary Stuart, the young woman the world would come to know as Mary, Queen of Scots. Queen of Scotland since she was six days old, the teenage Mary is already a headstrong monarch - beautiful, passionate, and poised at the very beginning of her tumultuous rise to power. Arriving in France with four close friends as her ladies-in-waiting, Mary has been sent to secure Scotland's strategic alliance by formalizing her arranged engagement to the French king's dashing son, Prince Francis. But the match isn't signed and sealed, it depends more on politics, religion and secret agendas than affairs of the heart. Prince Francis is intrigued by the fiery Scot, but like most young men, he resists the idea of settling down into marriage, especially when he has a history with a lady of the court and his own point of view on the wisdom of an alliance with Scotland. Still, an attraction between Mary and Francis is ignited. Further complicating things is Bash, Francis' roguish half-brother, who has a history of his own - despite his illegitimate birth, Bash is his father's favorite. And now that Bash has caught Mary's eye, a royal triangle may be forming. While at French Court, fierce foes and dark forces conspire to sabotage Mary's marriage to Francis and even threaten her life, until a mysterious shrouded guide becomes her ally. With danger and sexual intrigue around every dark castle corner, Mary rallies her ladies-in-waiting and steels herself, ready to rule the new land and balance the demands of her country and her heart.\t[/b]\t","torrent":{"xt":"urn:btih:06ad8e9ede5702145155339b6cb6b8002677972a","amp;dn":"Reign.S01E14.HDTV.x264-2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ad8e9ede5702145155339b6cb6b8002677972a","infoHashBuffer":{"type":"Buffer","data":[6,173,142,158,222,87,2,20,81,85,51,155,108,182,184,0,38,119,151,42]},"announce":[],"urlList":[]}}