{"title":"Injustices: The Supreme Court's History of Comforting the ","uid":11813591,"size":1793162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06edc49df6d17f807b6a8bd4a0eb15e5d199200f&amp;dn=Injustices%3A+The+Supreme+Court%27s+History+of+Comforting+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":1,"time":1428990295,"description":"Injustices: The Supreme Court's History of Comforting the Comfortable and Afflicting the Afflicted by Ian Millhiser\n\nFew American institutions have inflicted greater suffering on ordinary people than the Supreme Court of the United States. In this powerful indictment of a venerated institution, constitutional law expert Ian Millhiser tells the history of the Supreme Court through the eyes of everyday people who have suffered the most as a result of its judgements. The justices built a nation where children toiled in coal mines and cotton mills, where Americans could be forced into camps because of their race, and where women were sterilized at the command of states. The Court was the midwife of Jim Crow, the right hand of union busters, and the dead hand of the Confederacy. Nor is the modern Court a vast improvement, with its incursions on voting rights, its willingness to place elections for sale, and its growing skepticism towards the democratic process generally","torrent":{"xt":"urn:btih:06edc49df6d17f807b6a8bd4a0eb15e5d199200f","amp;dn":"Injustices%3A+The+Supreme+Court%27s+History+of+Comforting+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06edc49df6d17f807b6a8bd4a0eb15e5d199200f","infoHashBuffer":{"type":"Buffer","data":[6,237,196,157,246,209,127,128,123,106,139,212,160,235,21,229,209,153,32,15]},"announce":[],"urlList":[]}}