{"title":"Three Burke Novels - Andrew Vachss","uid":10720001,"size":3883600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:073373394d257451c693490d0e3dcf1ef2e57fb4&amp;dn=Three+Burke+Novels+-+Andrew+Vachss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1407468169,"description":"Andrew Vachss's Burke is one of the most cold-blooded yet strangely honorable protagonists in the history of crime fiction, an outlaw who makes his living by preying on the most vicious of New York City's bottom-feeders, those who thrive on the suffering of the defenseless. In these three thrillers, Vachss gives us a series of stories that might have been imagined by Dante. For this is a tour of hell with no stops left out, conducted by a novelist who writes with the authority of the damned.\n\nThis bundle includes the following titles:\n\n1. Flood, \n\n2. Strega, \n\n3. Blue Belle\n\nFLOOD: The renegade &quot;investigator&quot; Burke teams up with a lethally gifted avenger to follow a baby's murderer through the foul catacombs of New York, where every alley is blind and the penthouses are as dangerous as the basements. Fearfully knowing, crackling with narrative tension, and written in prose as forceful as a hollow-point slug, Flood is Burke at his deadliest--and Vachss at the peak of his form.\n\nSTREGA: The urban mercenary has a new client, a deadly and sultry woman who calls herself &quot;Strega.&quot; She wants Burke to find a kiddie porn Polaroid, and she's prepared to pay whatever that might cost. The search will take Burke back into the fetid river that flows just beneath the city: its currents are flesh and money, the anguish of children, and the pleasure of twisted adults. It is a river Burke can navigate only at the risk of unleashing the rage that is never far beneath his icy surface. But considering who actually hired him, refusing the job isn't an option. \n\nBLUE BELLE: Burke is given a purse full of dirty money to find the infamous Ghost Van that is cutting a lethal swath among teenage prostitutes who work the night streets. During the track-down job, he finds a stripper named Belle, whose moves on the runway are outclassed only by her skills as a getaway driver. But not even Burke is prepared for the evil that powers the Ghost Van, or for the sheer menace of its guardian, a skeletal martial artist who wants to add Max the Silent to his long lost of underground fight kills. ","torrent":{"xt":"urn:btih:073373394d257451c693490d0e3dcf1ef2e57fb4","amp;dn":"Three+Burke+Novels+-+Andrew+Vachss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"073373394d257451c693490d0e3dcf1ef2e57fb4","infoHashBuffer":{"type":"Buffer","data":[7,51,115,57,77,37,116,81,198,147,73,13,14,61,207,30,242,229,127,180]},"announce":[],"urlList":[]}}