{"title":"Igor Ledochowski - Professional Stage Hypnotist Bootcamp","uid":11798975,"size":7820191145,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:075660d23bfa30af6727bc108fd23901463050b6&amp;dn=Igor+Ledochowski+-+Professional+Stage+Hypnotist+Bootcamp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"acer47x","files":368,"time":1428296628,"description":"Product Descriptions\n\nProfessional Stage Hypnotist Bootcamp\n\nThe Professional Stage Hypnotist Bootcamp consists of the following:\n\nHow to Be a Professional Stage Hypnotist Bootcamp - A 15 DVD Set\n\nDVD 01 - How to Be a Powerful Stage Hypnotist\n\nDVD 02 - The Secrets to Becoming a Master of Instant Inductions\n\nDVD 03 - How to Do Dramatic Hypnotic Demonstrations &amp; Overcome Any Shyness\n\nDVD 04 - Discover the Power of Waking Inductions &amp; How to Train an Audience\n\nDVD 05 - Group Induction Secrets, Corporate Inductions, &amp; How to Deal with Problems\n\nDVD 06 - Instant Street Hypnosis Training &amp; Group Dynamics You Need to Know\n\nDVD 07 - How to Start a Stage Hypnosis Show the RIGHT Way!\n\nDVD 08 - How to Practice the Start of Your Stage Hypnosis Show So It Runs Perfectly Every Time!\n\nDVD 09 - Discover the Exact Steps a Professional Stage Hypnotist Uses to Warm Up His Volunteers on Stage\n\nDVD 10 - The 7 Critical Phases Every Stage Hypnosis Show Must Go Through to Be a Sensational Success\n\nDVD 11 - Advanced Stage Hypnosis Routines &amp; How to Invent New Routines\n\nDVD 12 - The Complete Guide to Setting Up Your Own Show\n\nDVD 13 - Secrets to a Successful Stage Hypnosis Business &amp; How to Promote Your Show Anytime, Anywhere &amp; to Anyone\n\nDVD 14 - Your Stage Hypnosis Business Questions Answered\n\nDVD 15 - How to Put All the Parts of Your Show Together So Everything Runs Like Clockwork &amp; Conclusion of the Training\n\n1 Complete Transcript in PDF\n\n15 Individual DVD Transcripts in PDF\n\n4 Bonus DVDs\n\nBonus DVD 01 - Example Stage Hypnosis Shows (Various)\n\nBonus DVD 02 - Example Stage Hypnosis Shows (Various)\n\nBonus DVD 03 - Example Stage Hypnosis Shows (Various)\n\nBonus DVD 04 - Example Stage Hypnosis Shows (Various)\n\n1 Bonus DVD - Sample PROMO Pieces &amp; DIY (Do It Yourself) Promo Items\n\n1 Bonus CD on Advanced Safety Training for Stage Hypnosis\n\n5 Bonus CDs with Royalty Free Music to Use In Your Stage Hypnosis Shows\n\nSpecial Bonus:  Stage Confidence Self-Hypnosis Digital MP3\n\nOne of the biggest objections we've heard is from people who have stage fright. They're afraid of getting on stage and talking.\n\nIf you're one of these people, it's okay. Lots of people have a fear of public speaking.\n\nBut get this... Igor has just created a brand new 40-minute self-hypnosis audio to automatically program you for confidence on the stage.\n\nAfter listening to this self-hypnosis audio, you'll be able to waltz on-stage without any butterflies in your stomach... without ever feeling even a twinge of nervousness or self-doubt.\n\nCrash Course Seminar on Stage Hypnosis\n\nIgor recently interviewed Spencer about how he got started as a professional stage hypnotist -- and all the steps he follows to make his shows run like a well-oiled machine.\n\nAfter this interview, Igor &amp; Spencer recorded what I'm calling the &quot;Crash Course Seminar on Stage Hypnosis&quot; - It runs for over three and a half hours. (Plus if you haven't yet heard the Interview that will be also available)\n\nListen to these in your car or while you're walking or doing errands around your house to reinforce everything you've learned in the DVDs.\n\nSample Stage Contract\n\nHere is a sample stage contract that you can modify and begin using immediately to book your own paid stage hypnosis shows.\n\nWe've personally seen contracts like this sold for $149. And it would cost a small fortune to have an attorney draft one up from scratch. But you get this sample contract free.\n\nStage Hypnosis Business Card Templates\n\nHere are 9 custom-made business card templates so you can promote your stage hypnosis business to people you meet in your everyday life.\n\nWe've commissioned these business cards to be professionally designed JUST for stage hypnotists! Which means your business card is going to look unique... and it's going to make you look like a professional.\n\nSample Press Release\n\nA great way to make sure you're only performing for sold out shows is to publish a press release announcing the time and date of your performance.\n\nWith that in mind, here is a sample press release -- written specifically for stage hypnotists -- that you can adapt and release anytime you put on a new show.\n\n6 Stage Hypnosis Promotional Posters\n\nWe had these 6 posters commissioned just for you. They have been designed specifically to promote stage hypnosis shows -- and they look amazing!\n\nAll you have to do is plug in the venue where you're performing, the time and date of your show, your name... and that's basically it.\n\nAdvanced Safety Training for Stage Hypnosis - Digital\n\nAs much fun as stage hypnosis is, you always need to put the safety of your volunteers first.\n\nThat's why Igor has created a list of modified instructions for regressions so every show you do runs SMOOTHLY and SAFELY.\n\nIgor says this audio recording is so critical to your long-term success that you should listen to it FIRST before you go through any of the other materials","torrent":{"xt":"urn:btih:075660d23bfa30af6727bc108fd23901463050b6","amp;dn":"Igor+Ledochowski+-+Professional+Stage+Hypnotist+Bootcamp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075660d23bfa30af6727bc108fd23901463050b6","infoHashBuffer":{"type":"Buffer","data":[7,86,96,210,59,250,48,175,103,39,188,16,143,210,57,1,70,48,80,182]},"announce":[],"urlList":[]}}