{"title":"1,001 Facts that Will Scare the Shit Out of You","uid":6936329,"size":19691582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07ce8d620423b82964d903daa8086c94ef015880&amp;dn=1%2C001+Facts+that+Will+Scare+the+Shit+Out+of+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":-1,"time":1325839529,"description":"1,001 Facts that Will Scare the Shit Out of You: The Ultimate Bathroom Reader\nBy Cary Macneal\nAdams Media | April 2010 | ISBN-10: 1605506249 | PDF | 304 pages | 18.7 mb\nConverted from EPUB \n\nFact: Chocolate contains the alkaloid theobromine, which in high doses can be toxic to humans, and in even small amounts can kill dogs, parrots, horses, and cats.\nThis means that despite its name, the Kit-Kat candy bar is not a recommended snack for your kitty-cat. I wonder how many cats have died because of this confusion.\n\nFact: The most germ-laden place on your toilet isn't the seat or even the bowl:It's the handle.\nThe solution: Don't flush. Let the next guy worry about it.\n\nThere are &quot;just the facts&quot;--and then there are just the facts that will frighten the bejeezus out of you. And thanks to this little gem of a bathroom book, you'll never look at the world the same way again, without, er, dry heaving a little bit. From the sneaky fish that can swim up our genitals to the e coli bacteria lurking in the very water we drink, disturbing phenomena are everywhere we turn. Educational, entertaining, and undeniably horrifying, this book isn't guaranteed to help you, um, go to the bathroom, but it's certain to make your time there more . . . informed.\n\nAbout the Author\nCary McNeal is an Emmy-winning TV writer and producer who has written comedy for Mike Myers, Chris Tucker, Fred Willard, and more, and once TP'ed the home of a famous actor who pissed him off. McNeal writes for several websites, including Asylum and Not for Tourists , and blogs at List of the Day. He lives in Athens, GA.","torrent":{"xt":"urn:btih:07ce8d620423b82964d903daa8086c94ef015880","amp;dn":"1%2C001+Facts+that+Will+Scare+the+Shit+Out+of+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07ce8d620423b82964d903daa8086c94ef015880","infoHashBuffer":{"type":"Buffer","data":[7,206,141,98,4,35,184,41,100,217,3,218,168,8,108,148,239,1,88,128]},"announce":[],"urlList":[]}}