{"title":"Gay Meets Girl (2013)","uid":15519747,"size":576795746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:093f2e2c8a4602315692d12cdb99ef50bae5d25c&amp;dn=Gay+Meets+Girl+%282013%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"haydent","files":1,"time":1470735677,"description":"In the documentary ‘Gay meets Girl’ friends and creators Tim (26) and Nicolaas (29) go in search of the boundaries of their own sexuality. They’re both gay, at least, they think so. But how sure are they? What would it be like to experiment with the other sex? Is their sexual identity really as fixed as they think?\r\n\r\n‘Gay,’ ‘straight’ or ‘bi’: aren’t these really just labels we use to pigeonhole ourselves, because society expects us to make a choice? Tim decides to step outside his box and tries, for the first time in his life, to have sex with a woman. Through this experiment Tim wants to find out what the boundaries of his sexuality are. Is he as gay as he thinks or are things slightly more complicated?\r\n\r\nIn the documentary Tim is followed by Nicolaas as he prepares to lose his straight virginity. Tim takes part in a workshop with a sex coach, who introduces him to female sexuality. According to her it’s all about making real contact with the other person, and an emotional connection trumps sexual preference. Science writer Asha ten Broeke also has an unconventional view of sexuality: Referring to the animal world, she states that everyone is bi.\r\n\r\nNicolaas and Tim ponder their own sexuality in the documentary, and how it is defined. When they find a girl who’s willing to participate in Tim’s experiment, the guys travel to Paris, where she lives. Are the boundaries of Tim’s sexuality really as fixed as he always assumed?","torrent":{"xt":"urn:btih:093f2e2c8a4602315692d12cdb99ef50bae5d25c","amp;dn":"Gay+Meets+Girl+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093f2e2c8a4602315692d12cdb99ef50bae5d25c","infoHashBuffer":{"type":"Buffer","data":[9,63,46,44,138,70,2,49,86,146,209,44,219,153,239,80,186,229,210,92]},"announce":[],"urlList":[]}}