{"title":"The Patriot(2000)DVDRip.AC3(ENG)-DROCK","uid":6628354,"size":734976705,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:098dea5c5de9dce5ac836223b2f2c8d7c5becedb&amp;dn=The+Patriot%282000%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"drock232","files":-1,"time":1314242737,"description":"Roland Emmerich and Dean Devlin, the director/producer team responsible for such sci-fi blockbusters as Independence Day, Stargate, and Godzilla, take a step back in time with this drama set during the American Revolution. Farmer Benjamin Martin (Mel Gibson) was born and raised in South Carolina, and fought bravely during the French-Indian wars. But since the death of his wife, Benjamin has renounced violence and quietly tends his crops, raising his seven children alone. In 1776, over Benjamin's objections, his oldest son Gabriel (Heath Ledger) joins the fight against the British. Gabriel returns from battle seriously wounded, with Lord General Cornwallis (Tom Wilkinson) calling for his arrest. A skirmish breaks out on Benjamin's plantation, and one of his children is killed as Gabriel is captured by Col. Tavington (Jason Isaacs) and sentenced to hang. Benjamin sets aside his vow of pacifism and rescues Gabriel; with the help of his former comrade-in-arms Harry Burwell (Chris Cooper), the father and son form a regiment of Carolina patriots whose cunning and ruthlessness make them heroes among the colonists -- and wanted men by British troops. Loosely adapted from the true story of Francis Marion and filmed on location in South Carolina, The Patriot was the first feature film made with the cooperation of the Smithsonian Institute, who advised the producers on historical accuracy. Joely Richardson also stars as Charlotte, Benjamin's sister-in-law who helps him care for the children. \n\nRipped with Handbrake.\n\nLength: 2 Hours 45 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 160kbps","torrent":{"xt":"urn:btih:098dea5c5de9dce5ac836223b2f2c8d7c5becedb","amp;dn":"The+Patriot%282000%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098dea5c5de9dce5ac836223b2f2c8d7c5becedb","infoHashBuffer":{"type":"Buffer","data":[9,141,234,92,93,233,220,229,172,131,98,35,178,242,200,215,197,190,206,219]},"announce":[],"urlList":[]}}