{"title":"Katy Perry - Prism [2013] [DELUXE] [FLAC]","uid":9080316,"size":455025728,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0994551d3910bb0bd481233ea4757dda1772b18f&amp;dn=Katy+Perry+-+Prism+%5B2013%5D+%5BDELUXE%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"SmashAndGrab","files":-1,"time":1382375456,"description":"Katy Perry - Prism [2013] [DELUXE] [FLAC]\n\nReleased ................ 2013\nSource .................. CD\nGenre ................... Pop/Rock\nStyle ................... Pop\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\n\n01 - Roar\n02 - Legendary Lovers\n03 - Birthday\n04 - Walking On Air\n05 - Unconditionally\n06 - Dark Horse (Feat. Juicy J)\n07 - This Is How We Do\n08 - International Smile\n09 - Ghost\n10 - Love Me\n11 - This Moment\n12 - Double Rainbow\n13 - By The Grace of God\n14 - Spiritual\n15 - It Takes Two\n16 - Choose Your Battles\n\nTeenage Dream did its job. With its five number one singles, the 2010 album turned Katy Perry into a genuine superstar, the kind of musician whose image rivaled her music in popularity, the kind who could topline her own 3-D theatrical documentary, the kind whose name became shorthand for a sugar-pop sensibility. This meant there was only one thing left for her to do on its 2013 sequel, Prism: to make a graceful pivot from teen dream to serious, mature artist. Prism hits these marks precisely yet isn't stuffy, not with its feints at trap-rap, but even with the preponderance of nightclub glitz, there isn't a shadow of a doubt that Katy Perry has toned down her cheesecake burlesque, opting for a hazy, dreamy, sun-kissed hippie Californian ideal that quietly replaces the happily vulgar pinup of her earliest years. All the lingering nastiness of One of the Boys -- the smiling Mean Girl backstabbing of &quot;Ur So Gay,&quot; for instance -- and the pneumatic Playboy fantasy of Teenage Dream are unceremoniously abandoned in favor of Perry's candy construct of a chipper, cheerful grown-up prom princess, the popular girl who has left all her sneering dismissals in the past. Perry remains a terminal flirt but she channels her energies into long-term relationships -- the sexiest song, &quot;Birthday,&quot; is a glorious retro-disco explosion delivered to a steady boyfriend, while elsewhere she testifies toward unconditional love -- and the overall effect transforms Prism into a relatively measured, savvy adult contemporary album, one that's aware of the latest fashions but is designed to fit into Katy's retirement plan. Ultimately, this makes Prism a tighter, cleaner record than its predecessors -- there are no extremes here, nothing that pushes the boundaries of either good taste or tackiness; even when she cheers on excess on &quot;This Is How We Do&quot; she's not a participant but rather a ringmaster, encouraging her fans to spend money they don't have just so they can have a good time. Ultimately, this sense of reserve reveals just how canny Katy Perry really is: she's determined to give her career a dramatic narrative arc, eager to leave behind the bawdy recklessness of her early years in favor of something that's age appropriate. That's why the lead single from Prism was &quot;Roar,&quot; an homage to Sara Bareilles so transparent that the singer/songwriter may deserve co-credit: the inspirational adult contemporary single signaled how Perry no longer views herself as a fluffy confection but rather a showbiz staple who'll be here for years and years, and Prism fully lives up to that carefully constructed ideal.\n &lt;a href=&quot;\nhttp://i.imgur.com/5S5CZPS.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/5S5CZPS.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0994551d3910bb0bd481233ea4757dda1772b18f","amp;dn":"Katy+Perry+-+Prism+%5B2013%5D+%5BDELUXE%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0994551d3910bb0bd481233ea4757dda1772b18f","infoHashBuffer":{"type":"Buffer","data":[9,148,85,29,57,16,187,11,212,129,35,62,164,117,125,218,23,114,177,143]},"announce":[],"urlList":[]}}