{"title":"The Germ Files: The Surprising Ways Microbes Can Improve Your","uid":13859877,"size":2391923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09fb38cddf8d925ff66af4b1f201177e08e2ae09&amp;dn=The+Germ+Files%3A+The+Surprising+Ways+Microbes+Can+Improve+Your&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1458025128,"description":"The Germ Files: The Surprising Ways Microbes Can Improve Your Health and Life by Jason Tetro\r\nEnglish | 2016 | ISBN: 0385685777 | 288 pages | EPUB | 2 MB\r\n\r\nThe microbes living on and inside us outnumber the cells in our bodies three to one. Many provide services on which our well-being, our moods, our very lives depend. They help to digest our food and operate the immune system. They trade information about potential mates when we kiss. They alert the brain to problems in different locations around the body. The balance of their populations in our gut is a crucial factor in our physical and mental health. \r\n\r\nThe effect of germs on our lives is not, however, a one-way street. We can help their efforts by the way we lead our lives. \r\n\r\nThe Germ Files is a one-stop source of the most up-to-date, life-changing information on our relationship with microbes, presented in concise and highly readable items grouped by theme. Areas covered include health, hygiene, sex, childcare, nutrition and dieting.\r\n\r\nThe Germ Files will answer your questions about everything from preventing flu to selecting probiotics, while constantly surprising you with revelations about the miraculous workings of the microscopic world","torrent":{"xt":"urn:btih:09fb38cddf8d925ff66af4b1f201177e08e2ae09","amp;dn":"The+Germ+Files%3A+The+Surprising+Ways+Microbes+Can+Improve+Your","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09fb38cddf8d925ff66af4b1f201177e08e2ae09","infoHashBuffer":{"type":"Buffer","data":[9,251,56,205,223,141,146,95,246,106,244,177,242,1,23,126,8,226,174,9]},"announce":[],"urlList":[]}}