{"title":"Swords of the Viking Age (Weapon History).pdf","uid":8357659,"size":31853684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a1c41bd7eb3c9f9d1e15c9b0e3b85295236ae6e&amp;dn=Swords+of+the+Viking+Age+%28Weapon+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1365534675,"description":"Ian Peirce - Swords of the Viking Age\nBoydell Press | 2002 | ISBN: 0851159141 | English | 168 pages | PDF | 30.38 MB\n\nThis new work fills a vacuum in English language studies of the swords made and used in northern Europe during the Viking Age, from the mid-eighth through to the mid-eleventh century. Given the mission of seeking out the best representative examples of the broad diversity of sword types surviving from this time, Ian Peirce, lecturer and museum consultant, travelled to museums of northern Europe and, from the hundreds of swords he handled, selected some sixty examples. While a few of these swords will be well known from inclusion in previous publications but are too important to omit, the majority are rarely seen or newly shown here. Where possible, a full-length photograph and photographs of details have been included for each example, with the illustrations and descriptions of most of the swords covering two facing pages. Eight pages of colour illustrations are included, three of which are reproductions from Lorange's unsurpassed lithographs of 1889. A brief illustrated overview of blade types and construction, pattern-welding, inscriptions and handle forms and their classification under Jan Petersen's classification is included as an introduction to the catalogue of examples which forms the bulk of this work. IAN PEIRCE, engineer, armourer and weaponsmith, has staged major exhibitions of armour and weapons in England, France and Ireland, and written and lectured extensively on arms and armour, on the Norman Conquest and on the Vikings. EWART OAKESHOTT was a world-renowned expert in sword studies, and the deviser of a comprehensive typology of medieval swords which has been instrumental in the development of sword scholarship. His books include Records of the Medieval Sword, The Sword in the Age of Chivalry and European Weapons and Armour.","torrent":{"xt":"urn:btih:0a1c41bd7eb3c9f9d1e15c9b0e3b85295236ae6e","amp;dn":"Swords+of+the+Viking+Age+%28Weapon+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a1c41bd7eb3c9f9d1e15c9b0e3b85295236ae6e","infoHashBuffer":{"type":"Buffer","data":[10,28,65,189,126,179,201,249,209,225,92,155,14,59,133,41,82,54,174,110]},"announce":[],"urlList":[]}}