{"title":"Cabezon - Instrumentals - Wimmer, Ens Accentus (1997) [Philidor]","uid":15751433,"size":281990181,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0a22073264d26d9fd5025d1a68e6be606cfe49dd&amp;dn=Cabezon+-+Instrumentals+-+Wimmer%2C+Ens+Accentus+%281997%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Philidor","files":22,"time":1473034381,"description":"Antonio de Cabezon was part of a family with a long tradition of musical performance and composition. (Two of the items on this recording are by relatives of his.) He quickly rose to great esteem in his native Spain. As Wikipedia puts it:\r\n\r\n&quot;In 1538 Cabezón was made músico de la cámara (chamber musician) to Charles (who as a child was educated in music by the noted organist Henry Bredemers). After Isabella's death in 1539 Cabezón was appointed music teacher to her children: Prince Felipe and his sisters Maria and Joan (Maria would later become the most important patron of composer Tomás Luis de Victoria). In 1543 Felipe became Regent of Spain, and he made Cabezón his court organist. Cabezón's duties included playing a portative organ for Felipe on his journeys. On 19 July 1546 Cabezón's brother Juan, also an organist and composer, was appointed musician in the royal chapel of Prince Felipe. Since the late 1540s Antonio and Juan both accompanied Felipe on his various trips, and visited Italy, the Netherlands, Germany (in 1548–49), and England (in 1554–56), where Antonio's variations may have influenced William Byrd and Thomas Tallis, who later took up the form.&quot;\r\n\r\nThis is a collection of instrumentals such as would have been popular at the time, arrangements of sacred and secular music for a typical &quot;broken&quot; ensemble of instruments from various instrumental groups. \r\n\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio is enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:0a22073264d26d9fd5025d1a68e6be606cfe49dd","amp;dn":"Cabezon+-+Instrumentals+-+Wimmer%2C+Ens+Accentus+%281997%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a22073264d26d9fd5025d1a68e6be606cfe49dd","infoHashBuffer":{"type":"Buffer","data":[10,34,7,50,100,210,109,159,213,2,93,26,104,230,190,96,108,254,73,221]},"announce":[],"urlList":[]}}