{"title":"Hinterland-Y.Gwyll-2015.Special.and.Series.2--BBC-2015-360p","uid":14687435,"size":2677340477,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ad8c72af23798a154712f580a2b0e5ea1f5612a&amp;dn=Hinterland-Y.Gwyll-2015.Special.and.Series.2--BBC-2015-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"uggauga","files":10,"time":1464152245,"description":"Hinterland - 2015 Special and Series 2\r\n\r\nDetective drama series set in Aberystwyth against the backdrop of mountainous terrain, isolated farms and close-knit villages. Starring Richard Harrington as DCI Tom Mathias.\r\n\r\nBBC (2015) - 1 + 4 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b0791wyd\r\n \nhttps://en.wikipedia.org/wiki/Y_Gwyll\r\n_______________________________________\r\n\r\n640x360 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nThis is the English language version.\r\nWith hard coded subtitles for the few occasions where they speak Welsh.\r\nEnglish subtitles (srt-files) are included as well.\r\n_______________________________________\r\n\r\nWinter Special - Episode 1 of 5\r\nThe climax of the first series saw DCI Tom Mathias pushed to the edge. With a local woman's death on his conscience and blood on his hands, Mathias's future is hanging in the balance until Chief Superintendent Prosser persuades him to return and work on a case of an arson attack on a farm that leaves a mother and child fighting for thier lives.\r\n\r\nEpisode 2 - Episode 2 of 5\r\nMathias is under pressure. Meg Mathias, his wife, has turned up in Aberystwyth, and he's under investigation by the IPCC following the death of Mari Davies. When a bus driver's body is found shot on an isolated mountainside, the investigation provides a welcome escape for DCI Mathias. The team have a suspect to question, but Mathias believes he is an unlikely killer. In his current state of mind, Mathias is fascinated by the lifestyle choices taken by ex-soldier John Bell. He also knows that he cannot avoid Meg for much longer.\r\n\r\nEpisode 3 - Episode 3 of 5\r\nThe murder of a local dignitary leads to the uncovering of a tragic story of love and loss fuelled by distrust and suspicion in the depths of the Hinterland.\r\n\r\nEpisode 4 - Episode 4 of 5\r\nThe team investigate the personal life of missing Greta Pritchard after discovering a body in her car. In a world full of dark secrets will Mathias and the team unravel them before another person is killed?\r\n\r\nEpisode 5 - Episode 5 of 5\r\nA burnt body on the dunes embroils the team in a long-standing family feud with a connection to the murder of a young mother 13 years earlier. Mathias is convinced the young woman's murder holds the answers, but Prosser isn't keen on Mathias delving into the past.\r\n\r\n***************************************************\r\n\r\n*Y Gwyll*\r\n\r\nY Gwyll (English translation: The Dusk[1]), titled in the English-language version Hinterland, is a Celtic noir[2] police detective drama series broadcast on S4C in Welsh. The main character, DCI Tom Mathias, is played by Richard Harrington.[3] On 27 November 2013, a second series was announced by S4C.[4] An English language version, with brief passages of Welsh dialogue, aired on BBC One Wales. When it was aired on the BBC in 2014, it was the first BBC television drama with dialogue in both English and Welsh.[5] A third series of the show began filming in January 2016.[6]\r\n\r\nProduction\r\n\r\nThe series reflects the commitment made in April 2013 by the Director of BBC Cymru Wales, Rhodri Talfan Davies, to show more Welsh language life and culture on the mainstream BBC channels.[5]\r\n\r\nOn a tight budget—which funds that took two and a half years to raise —the total production cost was £4.2 million.[7] The programme makers received £215,000 in repayable business funding from the Welsh Government and was mainly filmed in Aberystwyth and the surrounding Ceredigion region on the west coast of Wales, over a 124 day period in 2013. The show was filmed in both Welsh and English, with the location-based production offices contained within the former Ceredigion Council offices Swyddfa'r Sir, which also acts as the external scene of the show's police station.\r\n\r\nThe Welsh version was broadcast (in eight parts) on S4C in October 2013, with the bilingual version (in four parts) broadcast on BBC One Wales in January 2014 and on BBC Four later that year.[8] The broadcaster which produced The Killing, Danmarks Radio (DR), acquired the rights in 2012 to broadcast the show in Denmark,[9] before filming had commenced.[5]","torrent":{"xt":"urn:btih:0ad8c72af23798a154712f580a2b0e5ea1f5612a","amp;dn":"Hinterland-Y.Gwyll-2015.Special.and.Series.2--BBC-2015-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad8c72af23798a154712f580a2b0e5ea1f5612a","infoHashBuffer":{"type":"Buffer","data":[10,216,199,42,242,55,152,161,84,113,47,88,10,43,14,94,161,245,97,42]},"announce":[],"urlList":[]}}