{"title":"Simon And Garfunkel - Parsley Sage Rosemary and Thyme [FLAC] TNT","uid":9112333,"size":194131370,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0b01c72eb01ea98f9ef14941919965fb2a095895&amp;dn=Simon+And+Garfunkel+-+Parsley+Sage+Rosemary+and+Thyme+%5BFLAC%5D+TNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"l.diliberto","files":14,"time":1382969443,"description":"Simon And Garfunkel - Parsley Sage Rosemary and Thyme [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=366567&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=366567&lt;/a&gt;\n\nAnno: 10 ottobre 1966\nGenere: Folk rock\n\nSimon &amp; Garfunkel's first masterpiece, Parsley, Sage, Rosemary and Thyme was also the first album on which the duo, in tandem with engineer Roy Halee, exerted total control from beginning to end, right down to the mixing, and it is an achievement akin to the Beatles' Revolver or the Beach Boys' Pet Sounds album, and just as personal and pointed as either of those records at their respective bests. After the frantic rush to put together an LP in just three weeks that characterized the Sounds of Silence album early in 1966, Parsley, Sage, Rosemary and Thyme came together over a longer gestation period of about three months, an uncommonly extended period of recording in those days, but it gave the duo a chance to develop and shape the songs the way they wanted them. The album opens with one of the last vestiges of Paul Simon's stay in England, &quot;Scarborough Fair/Canticle&quot; -- the latter was the duo's adaptation of a centuries-old English folk song in an arrangement that Simon had learned from Martin Carthy. The two transformed the song into a daunting achievement in the studio, however, incorporating myriad vocal overdubs and utilizing a harpsichord, among other instruments, to embellish it, and also wove into its structure Simon's &quot;The Side of a Hill,&quot; a gentle antiwar song that he had previously recorded on The Paul Simon Songbook in England. The sonic results were startling on their face, a record that was every bit as challenging in its way as &quot;Good Vibrations,&quot; but the subliminal effect was even more profound, mixing a hauntingly beautiful antique melody, and a song about love in a peaceful, domestic setting, with a message about war and death; Simon &amp; Garfunkel were never as political as, say, Peter, Paul &amp; Mary or Joan Baez, but on this record they did bring the Vietnam war home.\n\nThe rest of the album was less imposing but just as beguiling -- audiences could revel in the play of Simon's mind (and Simon &amp; Garfunkel's arranging skills) and his sense of wonder (and frustration) on &quot;Patterns,&quot; and appreciate the sneering rock &amp; roll-based social commentary &quot;The Big Bright Green Pleasure Machine.&quot; Two of the most beautiful songs ever written about the simple joys of living, the languid &quot;Cloudy&quot; and bouncy &quot;The 59th Street Bridge Song (Feelin' Groovy),&quot; were no less seductive, and the album also included &quot;Homeward Bound,&quot; their Top Five hit follow-up to &quot;The Sound of Silence,&quot; which had actually been recorded at the sessions for that LP. No Simon &amp; Garfunkel song elicits more difference of opinion than &quot;The Dangling Conversation,&quot; making its LP debut here -- one camp regards it as hopelessly pretentious and precious in its literary name-dropping and rich string orchestra accompaniment, while another holds it as a finely articulate account of a couple grown distant and disconnected through their intellectual pretensions; emotionally, it is definitely the precursor to the more highly regarded &quot;Overs&quot; off the next album, and it resonated well on college campuses at the time, evoking images of graduate school couples drifting apart, but for all the beauty of the singing and the arrangement, it also seemed far removed from the experience of teenagers or any listeners not living a life surrounded by literature (&quot;couplets out of rhyme&quot; indeed!), and understandably only made the Top 30 on AM radio. &quot;For Emily, Whenever I May Find Her&quot; was a romantic idyll that presented Art Garfunkel at his most vulnerable sounding, anticipating such solo releases of his as &quot;All I Know,&quot; while &quot;Flowers Never Bend With the Rainfall&quot; was Simon at his most reflectively philosophical, dealing with age and its changes much as &quot;Patterns&quot; dealt with the struggle to change, with a dissonant note (literally) at the end that anticipated the style of the duo's next album.\n\n&quot;A Simple Desultory Philippic,&quot; which also started life in England more than a year earlier, was the team's Dylanesque fuzz tone-laden jape at folk-rock, and a statement of who they weren't, and remains, alongside Peter, Paul &amp; Mary's &quot;I Dig Rock &amp; Roll Music,&quot; one of the best satires of its kind. And the last of Simon's English-period songs, &quot;A Poem on the Underground Wall,&quot; seemed to sum up the tightrope walk that the duo did at almost every turn on this record at this point in their career -- built around a beautiful melody and gorgeous hooks, it was, nonetheless, a study in personal privation and desperation, the &quot;sound of silence&quot; heard from the inside out, a voice crying out. Brilliantly arranged in a sound that was as much rock as film music, but with the requisite acoustic guitars, and displaying a dazzling command and range of language, it could have ended the album. Instead, the duo offered &quot;7 O'Clock News/Silent Night,&quot; a conceptual work that was a grim and ironic (and prophetic) comment on the state of the United States in 1966. In retrospect, it dated the album somewhat, but that final track, among the darkest album-closers of the 1960s, also proved that Simon &amp; Garfunkel weren't afraid to get downbeat as well as serious for a purpose. Overall, Parsley, Sage, Rosemary and Thyme was the duo's album about youthful exuberance and alienation, and it proved perennially popular among older, more thoughtful high-school students and legions of college audiences across generations. [The August 2001 reissue offers not only the best sound ever heard on this album in any incarnation, but also a few bonuses -- a slightly extended mastering of &quot;Cloudy&quot; that gives the listener a high-harmony surprise in its fade; and, as actual bonus tracks, Simon's solo demos of &quot;Patterns&quot; and &quot;A Poem on the Underground Wall.&quot; Raw and personal, they're startling in their intimacy and their directness, and offer a more intimate view of Paul Simon, the artist, than ever seen.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://25.media.tumblr.com/tumblr_lsvttnQSxs1qi3h0zo1_1318493332_cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://25.media.tumblr.com/tumblr_lsvttnQSxs1qi3h0zo1_1318493332_cover.jpg&lt;/a&gt;\n\n.: Tracklist :.\n\n1. Scarborough Fair/Canticle\n2. Patterns\n3. Cloudy Simon, Woodley\n4. Homeward Bound\n5. The Big Bright Green Pleasure Machine\n6. The 59th Street Bridge Song\n7. The Dangling Conversation\n8. Flowers Never Bend With The Rainfall\n9. A Simple Desultory Philippic\n10. For Emily, Whenever I May Find Her\n11. A Poem on the Underground Wall\n12. 7 O'Clock News/Silent Night\nEXTRA\n13. Patterns (Demo)\n14. A Poem on the Underground Wall (Demo)","torrent":{"xt":"urn:btih:0b01c72eb01ea98f9ef14941919965fb2a095895","amp;dn":"Simon+And+Garfunkel+-+Parsley+Sage+Rosemary+and+Thyme+%5BFLAC%5D+TNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b01c72eb01ea98f9ef14941919965fb2a095895","infoHashBuffer":{"type":"Buffer","data":[11,1,199,46,176,30,169,143,158,241,73,65,145,153,101,251,42,9,88,149]},"announce":[],"urlList":[]}}