{"title":"For The Masses; A Tribute To Depeche Mode - VA [V0](Big Papi) 19","uid":9847584,"size":146970739,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b8a4adc96322f6648347fc6e7204022bf2402b1&amp;dn=For+The+Masses%3B+A+Tribute+To+Depeche+Mode+-+VA+%5BV0%5D%28Big+Papi%29+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1396104012,"description":"Source: CD\n\nBy Lara Bailey\n\nDepeche Mode aren't usually a band you see or hear much glorification about. But a career that has lasted almost 20 years speaks for itself, as the contributers to this tribute album certainly know. Having survived critical indifference (until Violator shut the critics up, then made them talk in 1990), numerous band member desertions and clinical death in the case of the magnificently gaunt frontman Dave Gahan, it's a small wonder Depeche Mode are still here. So it's pleasing to see that this tribute album doesn't just go for the well known tracks (thank God nobody's tried to improve upon Personal Jesus), but includes some choice cuts from their extensive back catalogue. Highlights of which are Gus Gus's &quot;Monument&quot;, a darker version than DM's and in my opinion the better for it; Rabbit In The Moon's version of &quot;Waiting for the Night&quot; is pure delight, updating the trancey 1990 dark synth-pop to late 90's breakbeat, with heartbreaking vocals easily rivaling Martin Gore. The best track for me is God Lives Underwater's reworking of &quot;Fly on the Windscreen&quot;, giving the track a harder, more rock edge compared to it's former keyboard-led incarnation. Surprisingly the tracks that let this album down are the ones covered by the more well known bands. Smashing Pumpkins version of &quot;Never Let Me Down&quot; is, frankly, at best a soothing mediocre pastiche, and at worst a lifeless stroll through the motions. Apollo Four-forty's rehash of &quot;I Feel You&quot; lacks the relentless pounding rhythm and intense vocal performance of the original, and surprisingly none of the tongue-in-cheek humour of Apollo Four-forty's other work shines through in this either. I can't decide whether Rammstein's version of &quot;Stripped&quot; is merely naively hysterical or plain trash- I just know it's stripped the original version of all it's sinister subtlety and replaced it with harsh grinding metal. Many of the tracks however have managed to encapsulate, if not emulate the sense of humour and spirit of experimentation in all of Depeche Modes work; Hooverphonic's &quot;Shake The Disease&quot; and Locust's &quot;Master and Servant&quot; are good examples. I'm not sure whether this is an album for hardcore Depeche Mode fans: you may not appreciate the different takes on your favourite songs. But for alternative music fans it is a must, if only for the sheer breadth of style represented here by artists such as The Cure, Monster Magnet and Meat Beat Manifesto.\n\n\nimage\n\n---------------------------------------------------------------------\nVA - For The Masses: A Tribute To Depeche Mode\n---------------------------------------------------------------------\n\nArtist...............: Various Artists\nAlbum................: For The Masses: A Tribute To Depeche Mode\nGenre................: Rock\nSource...............: CD\nYear.................: 1998\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 263kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Smashing Pumpkins - Never Let Me Down Again [04:01]\n2. God Lives Underwater - Fly On The Windscreen [05:23]\n3. Failure - Enjoy The Silence [04:20]\n4. The Cure - World In My Eyes [04:51]\n5. Dishwalla - Policy Of Truth [03:45]\n6. Veruca Salt - Somebody [04:05]\n7. Meat Beat Manifesto - Everything Counts [05:24]\n8. Hooverphonic - Shake The Disease [03:59]\n9. Locust - Master And Servant [03:40]\n10. Self - Shame [04:12]\n11. Monster Magnet - Black Celebration [04:16]\n12. Rabbit In The Moon - Waiting For The Night [07:34]\n13. Apollo 440 - I Feel You [05:21]\n14. Gus Gus - Monument [05:21]\n15. Deftones - To Have And To Hold [02:53]\n16. Rammstein - Stripped [04:44]\n\nPlaying Time.........: 01:13:56\nTotal Size...........: 140.12 MB","torrent":{"xt":"urn:btih:0b8a4adc96322f6648347fc6e7204022bf2402b1","amp;dn":"For+The+Masses%3B+A+Tribute+To+Depeche+Mode+-+VA+%5BV0%5D%28Big+Papi%29+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8a4adc96322f6648347fc6e7204022bf2402b1","infoHashBuffer":{"type":"Buffer","data":[11,138,74,220,150,50,47,102,72,52,127,198,231,32,64,34,191,36,2,177]},"announce":[],"urlList":[]}}