{"title":"Elementary.S02E17.HDTV.x264-LOL","uid":9717049,"size":216390037,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c14005ebfce43c125f5b3090bb2e7387f762794&amp;dn=Elementary.S02E17.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":2,"time":1394169621,"description":"[b]Elementary\n\n[IMG]http://i.imgur.com/reD5AIp.jpg[/IMG]\n\nVisit: thhaque.blogspot .com\n\nGenre: Crime, Drama, Mystery\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Robert Doherty\nCast: Jonny Lee Miller, Lucy Liu, Aidan Quinn, Bill Heck\n\n.: Plot :.\nELEMENTARY stars Jonny Lee Miller as detective Sherlock Holmes and Lucy Liu as Dr. Joan Watson in a modern-day drama about a crime-solving duo that cracks the NYPD's most impossible cases. Following his fall from grace in London and a stint in rehab, eccentric Sherlock escapes to Manhattan where his wealthy father forces him to live with his worst nightmare - a sober companion, Dr. Watson. A successful surgeon until she lost a patient and her license three years ago, Watson views her current job as another opportunity to help people, as well as paying a penance. However, the restless Sherlock is nothing like her previous clients. He informs her that none of her expertise as an addiction specialist applies to him and he's devised his own post-rehab regimen - resuming his work as a police consultant in New York City. Watson has no choice but to accompany her irascible new charge on his jobs. But Sherlock finds her medical background helpful, and Watson realizes she has a knack for playing investigator. Sherlock's police contact, Capt. Tobias &quot;Toby&quot; Gregson (Aidan Quinn), knows from previous experience working with Scotland Yard that Sherlock is brilliant at closing cases, and welcomes him as part of the team. With the mischievous Sherlock Holmes now running free in New York solving crimes, it's simple deduction that he's going to need someone to keep him grounded, and it's elementary that it's a job for Watson.[/b]","torrent":{"xt":"urn:btih:0c14005ebfce43c125f5b3090bb2e7387f762794","amp;dn":"Elementary.S02E17.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c14005ebfce43c125f5b3090bb2e7387f762794","infoHashBuffer":{"type":"Buffer","data":[12,20,0,94,191,206,67,193,37,245,179,9,11,178,231,56,127,118,39,148]},"announce":[],"urlList":[]}}