{"title":"The Profit - The movie Scientology doesnt want you to see.","uid":4092650,"size":4675633152,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0c94df875cd9e92d58707e45748c164b4bf7cf5f&amp;dn=The+Profit+-+The+movie+Scientology+doesnt+want+you+to+see.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nomnomnom","files":1,"time":1206138038,"description":"Anonymous Delivers.\n\nWe have all wanted to see this movie that scientology kept hidden away from us.\n\nWe have all wondered just how damning could this story be that we were banned from watching it.\n\n\nWonder no more.  This is not the 8 minute clip you've all seen.  This is the complete movie.  \n\n\nNow onto the description:  (from wikipedia)\n\nThe Profit is a feature film written and directed by Peter N. Alexander. The film premiered at the Cannes Film Festival in France in 2001. Distribution of the film was prohibited by an American court order which was a result of a lawsuit brought by the Church of Scientology, although the filmmaker says that the film is not about Scientology. The Disinformation Book Of Lists and The Times have characterized The Profit as a banned film in the United States.\n\nThe film was described by its producers as a work of fiction, meant to educate the public about cults and con men. It was widely seen, however, as a parody of the Church of Scientology and its founder, L. Ron Hubbard. The main character L. Conrad Powers leads an organization called the &quot;Church of Scientific Spiritualism&quot;, and many elements about both the Church portrayed in the film, and Powers' life have been compared to Scientology and Hubbard. The film was mainly produced and shot in Tampa Bay, Florida, and the cast included actors from the area and cameos from a few Scientology critics.\n\n\nVideo:\n\nThis copy is a vhs converted to dvd.  It is not the best quality we could hope for.  But it is watchable.  For a movie that has never made it out to the public, dont complain about the quality.\n\n\nKnowledge is free.\n\nWe are Anonymous.\n\nWe are Legion.\n\nWe do not forgive.\n\nWe do not forget.\n\nExpect us. \n","torrent":{"xt":"urn:btih:0c94df875cd9e92d58707e45748c164b4bf7cf5f","amp;dn":"The+Profit+-+The+movie+Scientology+doesnt+want+you+to+see.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c94df875cd9e92d58707e45748c164b4bf7cf5f","infoHashBuffer":{"type":"Buffer","data":[12,148,223,135,92,217,233,45,88,112,126,69,116,140,22,75,75,247,207,95]},"announce":[],"urlList":[]}}