{"title":"Aphrodite &amp; Micky Finn - The Takeover Bid  -  mp3 - 320kbs","uid":4158487,"size":285858972,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0dd65fbfb543dc9ef1514409dad5bb0ff67e0d3f&amp;dn=Aphrodite+%26+Micky+Finn+-+The+Takeover+Bid++-++mp3+-+320kbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"d1111s","files":-1,"time":1209258173,"description":"Aphrodite &amp; Micky Finn - The Takeover Bid\n\t\n\nLabel:\tDMC Publishing\nFormat:\t2 x CD, Compilation, Mixed\nCountry:\tUK\nReleased:\t1998\nGenre:\tElectronic\nStyle:\tDrum n Bass\nCredits:\tDJ Mix - Aphrodite (tracks: 1.01 to 1.13) , Micky Finn (tracks: 2.01 to 2.12)\nBitrate:\t320kbs\n\nTracklisting:\n\nDJ Aphrodite Mix\n\n1.01 \tAphrodite \tThe Underworld (6:51)\n1.02 \tAphrodite \tWikki Wikki Plate (3:36)\n1.03 \tClick 'n Cycle \tThe Bee (5:02)\n1.04 \tTeebee \tTurnteebeelized (4:39)\n1.05 \tMajistrate \tProhibited (3:13)\n1.06 \tRockerfella \tAs We Always Do (3:56)\n1.07 \tAphrodite \tRinsing Quince (5:22)\n1.08 \tAphrodite \tThe Bomber Style (3:10)\n1.09 \tCommissioner, The \tGroove On (DJ Phantasy Re-Edit) (2:54)\n  \t  Remix - DJ Phantasy\n1.10 \tMulder \tThe Hard Way (3:45)\n1.11 \tProdigy, The \tFunky Shit (Mulder Exclusive Mix) (4:07)\n  \t  Remix - Mulder\n1.12 \tYum Yum \tFallen Angel (Aphrodite Mix) (4:39)\n  \t  Featuring - Martin Greene\n\tRemix - Aphrodite\n1.13 \tEskovah \tCome To Me (4:20)\n  \t  Featuring - Karry\n\n\nDJ Mickey Finn Mix\n\n2.01 \tJonny L \tPiper (Grooverider Mix) (7:26)\n  \t  Remix - Grooverider\n2.02 \tFurry Phreaks \tSoothe (Prisoners Of Technology Dub) (7:03)\n  \t  Featuring - Terra Deva\n\tRemix - Prisoners Of Technology\n2.03 \tEd Rush &amp; Optical \tFunktion (5:13)\n2.04 \tPrisoners Of Technology \tOne-Two (3:56)\n2.05 \tDJ Krust* \tWarhead (6:37)\n2.06 \tA-Sides \tOn The Streets (Kenny Ken Exclusive Mix) (6:05)\n  \t  Remix - Kenny Ken\n2.07 \tJonny L \tWish U Had Something (Jonny L Remix) (4:39)\n2.08 \tBrockie &amp; Ed Solo \tRepresent (4:45)\n2.09 \tMampi Swift \tThe 1 (5:01)\n2.10 \tGang Related \tWho Are You? (4:17)\n2.11 \tMask \tSplurt (3:37)\n2.12 \tMoby \tHoney (Micky Finn &amp; Aphrodite Remix) (4:46)\n  \t  Remix - Micky Finn &amp; Aphrodite*\n\n\t\t\t\t\n\n\t\t\t\tDJ Aphrodite \n\n\n\taka Gavin King, is the man behind Aphrodite Recordings. It all started way back in the summer of love '88' running an Acid House club called Aphrodite, the namesake has been with him since.\n\n\tThrough various chance meetings with DJs Micky Finn and Claudio Giussani, Urban Shakedown was born. Over the years Aphro's own Aphrodite Recordings and Urban Takeover, a joint lable with Micky Finn followed. The musical progession to Drum n Bass was a natural step over the years through hardcore and jungle.\n\n\tDJ Aphrodite is known for playing out a good vibe that ranges from classics to upfront and exclusive dubplates. Aphro is invited to DJ in countries all over the world. \n\n\n\n\n\t\t\t\tDJ Mickey Finn\n\n\n\tMickey Finn, real name Michael Hearn,  was born in East London on the 3rd December 1966.    Mickey Finn went to Woolwich Polytechnic before getting into trouble for various offences and spending spells at his majesty's pleasure in prison.    It was during the last of these that Mickey Finn decided to make something more constructive of himself and was inspired to learn to DJ.\n\n\tMickey Finn started to release his own material in collaboration with Gavin King (known as Aphrodite), under the name Urban Shakedown and released the hit &quot;Some Justice&quot; with samples from Ce Ce Rogers &quot;Some Day&quot;.     He has also had a prolific career as a remixer.    He is now involved with a label call Urban Takeover which he owns with DJ Aphro.  \n\n\tNow in the late nineties Mickey travels the world and throws down his vibe in countries like Japan, USA, Australia, Holland, Ibiza, Germany, Finland, Israel and France to name just a few.\n\n\n\nDJ Mickey Finn Interview\n\n\n&quot;I've always liked music and always used to tape music off of the radio, but I got pissed off with the DJ talkin'  in between records.    So when I was twenty-one, I went and saw Eric B and that just topped it.  I really like wot Eric B was doin'  when I saw him, 'cause he just intrigues me.\n\n&quot;It was that year -1987- that I first discovered 'Ouse.  A friend of mine took me out to a club in the West End called Future, where Paul Oakenfold and Nancy Noice was playin', which was one of the first clubs, next door to Spectrum and I've never looked back since.   I fought it was really good, a different dimension.&quot;\n\n&quot;House hit big here,  in early 1987.  I mean Colin Faver was playin' 'Ouse since 1986, but it was put straight down as gay music, so people weren't really into it.  But I fink once the scene started comin' over with Shoom and Future, a lot more people started acceptin' it,  although it weren't just the 'Ouse-you 'ad a different variety of music then, but still underground.&quot;\n\n&quot;What type of music do I play?  I'd Just label it Dance music really.  I've never like the words Jungle of 'Ardcore,  I don't really use 'em.  I just try and play good dance music, and my set can go right across the board, from breaks with pianos in or reggae sample in it with deep bass lines, or I could go for stuff with straight 909 stompin' Kicks, which some people would say is Techno, but I wouldn't say it's Techno.&quot;\n\nWhat do you think of the hype of being a DJ?\n&quot;I've never really looked at it on that side of it - I'm not really that way inclined.  I ain't into grabbing no limelight.  I just see it as being up there playin' music for people, and I enjoy seein'' 'em enjoying it.  I don't really take it no further'n that. Just because you're a DJ, you ain't a step above anyone else, but some people seem to fink they are.  Some people fink,  'Oh I'm a DJ and I've got time for who the fuck, I fink I've got time for'.  But that's bullshit-you're no different from a bricklayer.  Just because you stand in front of a crowd of people and entertain 'em, wot's the big fing?   The only buzz I get is seein' that wot I'm doin' is making people enjoy 'emselves.&quot;\n\nDo you have any other plans outside of DJing?\n&quot;Well I'm trying to build a studio now, but I've never ever come the the decision that I don't wanna be a DJ.  But you get older and you change.  Wot I would like to do is get into writin'  film sound tracks and music for adverts and 'fings like that.   But so long as the demand is 'ere, I'm 'ere.&quot;\n\nWhich parties have you most enjoyed DJing at?\n&quot;It'd have to go between a couple.  I'd say Techno Drome in Scotland for atmosphere and seein' people doin' wot they wanted to do-like dancin' in the mud with no shoes on, and seein' trainers wounded at the end of the gig where people couldn't be bothered to fish 'em out of the mud.\n\n&quot;Sunrise festival I fought was one of the best fings I've been to as well, and Livin' Dream at Hackney I fought was a good gig.  The way I look at a good gig is not just for me, I look at it all round for the people as well: the sound system, the lighting , the line up, the way the music went all night and all that.  I look at it for their value for money - whether the people are gettin' ripped off or not.  For a gig to be one of the best gigs I've been to,  I take into consideration the whole fing.&quot;\n\nWhere did you get your DJ name?\n&quot;When I started off doin' this,  I done it 'cause I liked it - I didn't fink about preparing myself with a name and all that 'cause I didn't know how far I was gonna go.  Well how it all started off was I got the residency at  the Tunnel Club which was on the south side of the Blackwall Tunnel, and me sister used to run a night down there.  She said 'I'm gonna give you a name, 'cause you ain't gonna get noticed if you don't give yourself some fing that's gonna catch peoples minds'.   And since she used to take the piss out of me because I was skinny anyway she called my Micky Thin, but with an F.  I later found out it meant others fings to do with a drug from years ago.   You hear it in old films, people saying 'I slipped him a Micky Finn', but I never knew that it had any fing to do with drugs,  and if I did I would have never been involved,  but I'm stuck with it now.&quot;\n\nMickey Finn started to release his own material in collaboration with Gavin King (known as Aphrodite), under the name Urban Shakedown and released the hit &quot;Some Justice&quot; with samples from Ce Ce Rogers &quot;Some Day&quot;.     He has also had a prolific career as a remixer.    He is now involved with a label call Urban Takeover which he owns with DJ Aphro.  \n\nNow in the late nineties Mickey travels the world and throws down his vibe in countries like Japan, USA, Australia, Holland, Ibiza, Germany, Finland, Israel and France to name just a few.\n &lt;a href=&quot;\nhttp://workittothebone.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://workittothebone.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:0dd65fbfb543dc9ef1514409dad5bb0ff67e0d3f","amp;dn":"Aphrodite+%26+Micky+Finn+-+The+Takeover+Bid++-++mp3+-+320kbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dd65fbfb543dc9ef1514409dad5bb0ff67e0d3f","infoHashBuffer":{"type":"Buffer","data":[13,214,95,191,181,67,220,158,241,81,68,9,218,213,187,15,246,126,13,63]},"announce":[],"urlList":[]}}