{"title":"The Muggs Discography","uid":9493511,"size":622215664,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e0aba4d2a6c19b0f653bf485fc209d7e1f6ae85&amp;dn=The+Muggs+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"yousef86","files":-1,"time":1390005526,"description":"Genre: Blues Rock, Hard Rock, Classic Rock | 4 albums | mp3 CBR 320kbps | Size: 593MB\n\n\n The Muggs formed in February of 2000. Guitar player Danny Methric and Bass player Tony DeNardo were playing in two bands at that time: The Detroit Underground Blues Band and Fat Belly Brown. Danny was hanging out at The Music Menu in downtown Detroit when he ran into Matt Rost, a local drummer that had actually been in Fat Belly Brown for about two weeks before leaving, as he decided his band workload at the time was too heavy. They got to talking and Danny found out that Matt had just quit his main project, The Immortal Winos of Soul. Danny mentioned that he was looking to do something different than Fat Belly Brown, something more &quot;bluesy&quot;, and Matt said he'd be interested. The Ugliest Band on a Carousel - photo by Maggie Bouchard\n\nIt didn't take long for the band to start gelling as all three players had been musicians for at least seven years. DeNardo and Methric have always played together in every band they were in and Rost was a consummate drummer in his own right. In October 2000, the Muggs recorded their first EP demo so that they had something to play bar owners to get gigs. &quot;They were good enough for the money that we spent, but keep in mind, those songs are only demos,&quot; says Tony.\n\nIn March 2001, the Muggs were invited to play the Hamtramck Blowout, a music festival that involves hundreds of Detroit bands at about twenty different bars in the city of Hamtramck, a city contained entirely within Detroit. This show, played at Paychecks to a packed house, seemed to solidify the group as an established act in Detroit. From March to September 2001, the Muggs continued playing more and more shows, gaining a solid fan base in the process. In August of 2001, they were asked to play the very last show ever in the famed Gold Dollar before it went out of business. Neil Yee, the owner of the Gold Dollar, asked the Muggs to play to &quot;sell me out of my remaining imports.&quot; The Muggs accepted and played by themselves to about sixty guests. On September 2nd, 2001 the Muggs played a high energy show to a packed tent outdoors at the Cadieux Cafe's &quot;Mussel Beach Music Festival.&quot; They did not know that this would be their last show for quite some time.\n\nOn Tuesday, September 4th, 2001 bass player Tony DeNardo suffered a hemorrhagic stroke that nearly ended his life. He was completely paralyzed on his right side and unable to speak. DeNardo survived his stroke but was in bad shape. The Ugliest Band in the World: The Muggs\n\nNot wanting to replace DeNardo on bass guitar, Danny and Matt decided to get involved in different bands and other projects while Tony was recovering. Methric spearheaded a project called Over Under Sideways Down (named after a Yardbirds' song), playing with Muggs' drummer Rost and three other prominent musicians from around the Detroit scene: Brett Lucas, consummate lead guitarist and young bluesman, Ross Westerbur from 500 Ft. Of Pipe fame on piano, and Chuck Bartels, a local bass legend. Danny also played with The Kingsnakes for about six months until The Go asked him to join their band and record an album with them. The Go was a short lived experience for Danny as The Paybacks were looking for a lead guitarist and Methric seemed a perfect fit. Matt Rost also participated in other bands as well, including Colic and several jazz ensembles.\n\nOn December 8th, 2002, DeNardo had a fund-raiser at the Cadieux Cafe (in eastside Detroit) to raise money to send him to to California for some medical treatment that he hoped would speed his recovery. That night turned out to be magical; everybody who's anybody showed up for the fund-raiser as DeNardo had his favorite bands in Detroit play. The bands included Mod Orange, Stunning Amazon featuring Audra Kubat, Blue Song, Climax Divine, Over Under Sideways Down, and many others. The place was packed with tons of generous people, and included an auction of dozens of local artists' CDs, donated for the event. The Ugliest Band in the World: The Muggs\n\nDeNardo had two more fundraisers shortly thereafter, at Jacoby's in downtown Detroit and Nancy Whiskey's in the Corktown neighborhood of Detroit. He now had enough money to go to Southern California, where he stayed with his father, Frank, and attended daily physical therapy. From January until June of 2003, Tony worked hard and kept in close contact with Methric. In February 2003, a friend of the Muggs, Matt Smith from the band Outrageous Cherry, mentioned that Tony could, if he wanted to, play his bass lines on a piano. After a discussion between old friends Tony and Danny, Tony decided to give it a shot.\n\nTony bought a Fender Rhodes Mark I to perform the bass lines that he used to play on his bass guitar. After months of practicing two to three hours daily, DeNardo returned to Detroit, still unable to use his right arm but ready to start rehearsals again, using his new instrument. After about a month of rehearsals together, the Muggs returned to the Cadieux Cafe, almost two years to the day after their last show together, to play their comeback show at the Cadieux Cafe's Mussel Beach Party 2003.\n\nSince then it has been nothing but good times and good music as the Muggs picked up right where they left off. They were signed by indie label Times Beach Records in August 2004, and on July 19th, 2005 the Muggs released their eponymously titled first album in stores nationwide and distributed it overseas. Soon after, three of the Muggs' songs from that first album (&quot;Need Ya Baby&quot;, &quot;Gonna Need My Help&quot;, and &quot;Rollin' B-Side Blues&quot;) became the soundtrack for the 2006 and 2007 Dodge Charger website. Then soon after that, the Muggs were contacted by www.canyouhearme.tv - a website dedicated to finding the best underground bands in America, and the Muggs were 1 of only 3 bands selected in Detroit to perform and film a &quot;rockumentary.&quot; Footage of their August 24th, 2005 performance at the Magic Stick in Downtown Detroit was used, as well as numerous interviews of the band and others. In January of 2007, this Muggs' rock doc and live show were aired on PBS (in Michigan and all of Canada) as part of Can You Hear ME TV's &quot;Rock n' Roll Safari&quot;! At about the same time, The Muggs started a tour of Spain, playing 8 shows in 8 different cities. Soon after arriving back in the states, fans voted the Muggs Best Blues Artist/Group for 2007 in the Feb 28th, 2007 issue of Real Detroit Weekly.\n\nIn June of 2007, after a tip from a longtime fan, the Muggs sent in an application to appear on a new FOX TV series (named &quot;The Next Great American Band&quot;) set to air in October 2007. The Muggs were flown out to audition in the Nevada desert in August of '07 and were accepted into the top 12 (out of 10,000+ applicants) by the judges, which meant they would be appearing on the show. The Muggs got to display their talent on national TV for four shows, until they were voted off. They got to play two of their original songs ? &quot;Slow Curve&quot; and &quot;Should've Learned My Lesson&quot; ? along with two cover songs, and had a great experience staying out on the west coast and appearing on the show.\n\nAfter their national television exposure, The Muggs won Riff2's (local WRIF online radio) &quot;Best Rock Band of the Year 2007&quot; award in February 2008, and have again teamed up with Dodge for a promotional compilation CD entitled, &quot;Out of Detroit &amp; Into Dodge&quot;. &quot;Need Ya Baby&quot; from the Muggs first LP is the song Dodge selected to be on the compilation. Dodge is pressing 100,000 CD's to go over to Europe and into Dodge Dealerships. Luckily, European buyers of new Dodge automobiles get the comp CD as a bonus! Then more good news for the Muggs: at the 2008 Detroit Music Awards, the band won the &quot;Outstanding Rock Artist/Group&quot; award and Danny Methric won the &quot;Outstanding Rock/Pop Instrumentalist&quot; award for his electric guitar playing.\n\nOn May 9th, 2008, the Muggs released their second LP entitled &quot;On With The Show.&quot; The album has received great reviews in several publications and on several rock websites, including an 8/10 review in the August 2008 issue of Classic Rock Magazine.\n\nIn October 2009, Matt Rost stepped down as drummer of The Muggs. Todd Glass, one of the most respected and sought-after drummers in Detroit, replaced Rost. Soon after, in the spring of 2010, the Muggs embarked on another successful tour of Spain and the Canary Islands - this time playing 12 shows in a 15 day period. And in late 2010, the Muggs entered the studio to begin recording their third full-length album &quot;Born Ugly&quot;, which is being released April 29th, 2011.\n\nThe band has enjoyed opening for countless classic rock and various national acts including Mountain, Robin Trower, Cactus, Savoy Brown, Ten Years After, Glenn Hughes of Deep Purple/Black Sabbath, Johnny Lang, Candlebox, North Mississippi Allstars, the Verve Pipe, Electric Six, &amp; the Detroit Cobras. Their popularity continues to grow, as exhibited by their making the &quot;100 HOT Unsigned Bands&quot; list in Music Connection in December 2008, and by their over 86,000 fans onand fast-growing facebook following. ","torrent":{"xt":"urn:btih:0e0aba4d2a6c19b0f653bf485fc209d7e1f6ae85","amp;dn":"The+Muggs+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0aba4d2a6c19b0f653bf485fc209d7e1f6ae85","infoHashBuffer":{"type":"Buffer","data":[14,10,186,77,42,108,25,176,246,83,191,72,95,194,9,215,225,246,174,133]},"announce":[],"urlList":[]}}