{"title":"TTC A modern look at Ancient Greek Civilization","uid":7970856,"size":307405739,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0e1118fa601c6f775c18bf9f0b8a52ab42932a2b&amp;dn=TTC+A+modern+look+at+Ancient+Greek+Civilization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"kukamonga","files":19,"time":1356836287,"description":"RARE OUT OF PRINT. THIS COURSE IS NO LONGER OFFERED BY THE TEACHING COMPANY\n\nTHE TEACHING COMPANY\nTHE GREAT COURSES SERIES\nTHE SUPERSTAR TEACHERS\nCOMPLETE AND UNABRIDGED\n\n16 lectures of 45 minutes on 4 VIDEOTAPES (VHS)\n\nTaught by: Professor ANDREW SZEGEDY-MASZAK, WESLEYAN UNIVERSITY\n\nDrawing on art, literature, recent archeological discovers and the record of history, Professor Szegedy-Maszak of Wesleyan University explores the culture of 2,500 years of Greek civilization.  \nBeginning with Greece's own pre-history in Cycladic and Minoan civilizations through the warrior kings of Mycenae, the lectures share in the invention and developing consciousness that led to the poetry of Homer, the philosophical achievements of Socrates, Plato and Aristotle, the rise and disappointments of early democracy, the beginnings of historical understanding the harsh tensions imposed by the colonial and military ambitions of the Greeks, as well as the rich artistic legacy left ot us by the rich first flower of western civilization.\n\nCourse Lecture Titles \n01-INTRODUCTION AND PREHISTORY: THE CYCLADIC AND MINOAN CIVILIZATION \n02-HOMER AND THE ORIGINS OF THE EPIC TRADITION \n03-THE ARCHAIC AGE \n04-SPARTA AND LYCURGUS: THE CREATION OF A MARTIAL UTOPIA \n05-ATHENS AND SOLON: ECONOMICS AND POLITICAL REFORM \n06-FROM TYRANNY TO DEMOCRACY \n07-THE IONIAN PHILOSOPHERS, HERODOTUS, AND THE BIRTH OF HISTORY: THE PERSIAN WARS \n08-THE WAR GENERATION \n09-SOCIETY AND SOCIAL LIFE IN ATHENS \n10-TRAGEDY, MYTH, RITUAL AND THE POLIS \n11-DEMOCRACY AND EMPIRE: THE RULE OF PERICLES \n12-THUCYDIDES AND SCIENTIFIC HISTORY: THE PELOPONNESIAN WAR \n13-OLD COMEDY AND NEW POLITICIANS: SATIRISTS AND DEMAGOGUES \n14-SOCRATES \n15-THE FOURTH CENTURY AND THE RISE OF MACEDON \n16-ALEXANDER THE GREAT AND THE ONSET OF THE HELLENISTIC AGE","torrent":{"xt":"urn:btih:0e1118fa601c6f775c18bf9f0b8a52ab42932a2b","amp;dn":"TTC+A+modern+look+at+Ancient+Greek+Civilization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e1118fa601c6f775c18bf9f0b8a52ab42932a2b","infoHashBuffer":{"type":"Buffer","data":[14,17,24,250,96,28,111,119,92,24,191,159,11,138,82,171,66,147,42,43]},"announce":[],"urlList":[]}}