{"title":"Newuniversal (001 - 006) (2007) (Digital) (AnPymGold-Empire)","uid":11024362,"size":107219698,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0e21b717f5466c1674ad9022474839d885a77021&amp;dn=Newuniversal+%28001+-+006%29+%282007%29+%28Digital%29+%28AnPymGold-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nemesis43","files":6,"time":1410650551,"description":"Newuniversal (001 - 006) (2007) (Digital) (AnPymGold-Empire)\n\n\n\nPlanet Earth. Inhabited by six billion people. People leading ordinary lives, coping with everyday struggles. But on a night like any other, the Earth is rocked by the most startling celestial event ever witnessed by the human race. The White Event. And from its wake, a handful of humans emerge as something more.\n\nWe meet many of the characters from the original New Universe, but re-imagined. Ken Connell and Madeline Felix (now smarter and blonde) live in Oklahoma. They are young and hanging out in a meadow after a night of partying.\n\nIzanami Randall leaves a bar in San Francisco.\n\nDetective John Tensen lies in the hospital after being shot in the head.\n\nThe White Event happens, and they are all affected. Izanami gets the powers of Nightmask and sees the reality of dreams.\n\nTensen wakes up, kills the nurse who had come into the room as a mercy killer, and becomes a new Justice.\n\nSome archaeologists find a previously-unknown ruin in Latvia, including a skeleton showing the diagram of the Star Brand on its head.\n\nKen wakes up and finds himself in a giant Star Brand mark burned into the meadow, with Maddie's burned body beside him. He calls the police (her dad is the chief). They arrest him and her dad threatens to kill him, but at that moment, the Star Brand on his hand lights up.","torrent":{"xt":"urn:btih:0e21b717f5466c1674ad9022474839d885a77021","amp;dn":"Newuniversal+%28001+-+006%29+%282007%29+%28Digital%29+%28AnPymGold-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e21b717f5466c1674ad9022474839d885a77021","infoHashBuffer":{"type":"Buffer","data":[14,33,183,23,245,70,108,22,116,173,144,34,71,72,57,216,133,167,112,33]},"announce":[],"urlList":[]}}