{"title":"Stanley Hauerwas - Theology, Ethics &amp; Philosophy (4 books)","uid":9112767,"size":36465107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e6533e186d74873cb5af214a715306df1c420aa&amp;dn=Stanley+Hauerwas+-+Theology%2C+Ethics+%26amp%3B+Philosophy+%284+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1382980272,"description":"\nSTANLEY M. HAUERWAS (b. 1940) is an American theologian, ethicist, and public intellectual.\n\nHe is considered by many to be one of the world's most influential living theologians and was named &quot;America's Best Theologian&quot; by Time Magazine in 2001.  He was also the first American to deliver the prestigious Gifford Lectures in over forty years.  His work is frequently read and debated by scholars in fields outside of religion, theology, or ethics, such as political philosophy, sociology, history, and literary theory.\n\nThough Hauerwas is most well known for his work related to Christian ethics, the relationship between Christianity and politics, and ecclesiology, he has written widely on a diverse range of subjects, such as systematic theology, philosophical theology, political philosophy, the philosophy of social science, law, education, bioethics, and medical ethics.  Hauerwas is known for his outspoken advocacy of pacifism, as well of his fierce criticism of liberal democracy, capitalism, militarism, American civil religion and both Christian fundamentalism and liberal Christianity.  Among his most important contributions to modern theology are his advocacy of and work related to virtue ethics and postliberal theology.\n\nHauerwas's work draws from a number of theological perspectives, including Methodism, Anabaptism, Anglicanism, and Catholicism. He is commonly cited as a member of the evangelical left.\n\n\nThe following books are in PDF format:\n\n* THE HAUERWAS READER (Duke University Press, 2001).  Edited by John Berkman and Michael Cartwright.\n\n* NAMING THE SILENCES: God, Medicine, and the Problem of Suffering (T. &amp; T. Clark, 2004).\n\n* THE STATE OF THE UNIVERSITY: Academic Knowledges and the Knowledge of God (Blackwell, 2007).\n\n* WILDERNESS WANDERINGS: Probing Twentieth-Century Theology and Philosophy (Westview, 1997).\n\n___________________________________\n\nHauerwas's WAR AND THE AMERICAN DIFFERENCE (2011) can be found here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8866359/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8866359/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0e6533e186d74873cb5af214a715306df1c420aa","amp;dn":"Stanley+Hauerwas+-+Theology%2C+Ethics+%26amp%3B+Philosophy+%284+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e6533e186d74873cb5af214a715306df1c420aa","infoHashBuffer":{"type":"Buffer","data":[14,101,51,225,134,215,72,115,203,90,242,20,167,21,48,109,241,196,32,170]},"announce":[],"urlList":[]}}