{"title":"Police Interceptors S5 2013","uid":9691839,"size":3922100553,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0e660da0a726c04b014d23ca3f7865926d2fc8b6&amp;dn=Police+Interceptors+S5+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"kollekk","files":-1,"time":1393880517,"description":"Police Interceptors is a British TV documentary series that profiles the work of a police ANPR Intercept Team (now known as the Territorial Support Team) in Essex, United Kingdom and in series 4 profiles the work of South Yorkshire Police's Road Crime Unit and Derbyshire Police's Road Policing Unit. In the fifth series the program profiles the work of Cumbria Constabulary following their Roads Policing Unit. The documentary has been broadcast by Channel 5 since the first episode on 9 May 2008.\n\nThe series features the following police officers from Essex Police, South Yorkshire Police, Derbyshire Constabulary and Cumbria Constabulary involved in high-speed car chases following car thieves in stolen vehicles, speeding and drunken drivers. They use the latest high-speed police cars to follow and hunt down boy racers presenting a danger to the public. The Interceptors also use the latest number-plate reading technology (ANPR) to detect drivers without car insurance, often resulting in an argument with the driver and the disclosure of other crimes. The chases are often interspersed with light-hearted incidents involving the team's food breaks, harmless drunks and practical jokes in the incident room. The show often identifies officers by humorous nicknames and on-screen graphics feature data on their years in service, likes and dislikes. Most incidents are tracked down by uniform officers from the Interceptor team but plain clothes and undercover police have also featured in the five series.\n\nTitle..............: Police Interceptors\n Source.............: PDTV\n Framerate..........: 25 FPS\n Video Codec........: X264\n Audio..............: AAC @ 128kbps VBR 48KHz\n Link...............: http://www.tvrage.com/Police_Interceptors\n\nEpisodes 1-10\t\t","torrent":{"xt":"urn:btih:0e660da0a726c04b014d23ca3f7865926d2fc8b6","amp;dn":"Police+Interceptors+S5+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e660da0a726c04b014d23ca3f7865926d2fc8b6","infoHashBuffer":{"type":"Buffer","data":[14,102,13,160,167,38,192,75,1,77,35,202,63,120,101,146,109,47,200,182]},"announce":[],"urlList":[]}}