{"title":"Handbook of Small Electric Motors - (Malestrom)","uid":6381627,"size":13466417,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e8c7546c74724abf7b44385ed303ceecefa37f8&amp;dn=Handbook+of+Small+Electric+Motors+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1305048964,"description":"Handbook of Small Electric Motors\nby William Yeadon, Alan Yeadon\n\nMcGraw-H?ll Profess?on?l | English | 2001 | ISBN: 007072332X | 1040 pages | PDF \n\nA complete, definitive source for the design, manufacture, application, and testing of small electric motors less than ten horsepower *Gives motor design engineers, test technicians, and engineers top-to-bottom coverage of materials used in motor manufacturing, as well as how-to advice on selecting the right design and assembly method *Includes a full section on motor applications\n\nFrom the Back Cover\n- A compenium of expert information on today's designs, methods and materials -\n\nGet up to speed on the latest design and manufacturing tools and techniques with this expert guide from leaders of the motor industry. A superb source of innovative, productivity, and profit-increasing solutions, HANDBOOK OF SMALL ELECTRIC MOTORS gives you more help with selection, calculation, assembly methods, and on-the-spot data than you can find anywhere else.\nThere's no other source that approaches this unique reference for comprehensive, clear coverage of small motor design, production, and use. For cost-cutting, efficiency-boosting solutions, and the answers you need now, this is a resource that will prove its value every day on the job.\n\nInformation you can use:\n*A complete source for the design, manufacture, and application of electric motors of 10 hp or less\n*Comprehensive introduction to electric motor basics\n*Detailed coverage of more than 17 types of motors and drives\n*Step-by-step calculation methods for design and application of all featured motors, with examples\n*Best source for applications information\n*Reference data on materials and manufacturing methods\n*Key information on small electric motors for appliances, automobiles, computers, business machines, HVAC, power tools, industrial drives, and many other applications ","torrent":{"xt":"urn:btih:0e8c7546c74724abf7b44385ed303ceecefa37f8","amp;dn":"Handbook+of+Small+Electric+Motors+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8c7546c74724abf7b44385ed303ceecefa37f8","infoHashBuffer":{"type":"Buffer","data":[14,140,117,70,199,71,36,171,247,180,67,133,237,48,60,238,206,250,55,248]},"announce":[],"urlList":[]}}