{"title":"Jack L. Chalker Mobi Collection","uid":6255415,"size":24082252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ec1856584702f50917dc8648928a6cd2204f7c3&amp;dn=Jack+L.+Chalker+Mobi+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Eddiehjjjfcfjfc","files":-1,"time":1300555911,"description":"All are in Mobi format.\n\nIncludes:\n\n90 Trillion Fausts - Jack L. Chalker\nAnd The Devil Will Drag You Under - Jack L. Chalker\nBalshazzar's Serpent - Jack L. Chalker\nCerberus - A Wolf in the Fold - Jack L. Chalker\nCharon - A Dragon at the Gate - Jack L. Chalker\nChildren of Flux &amp; Anchor - Jack L. Chalker\nDancers in the Afterglow - Jack L. Chalker\nDemons of the Dancing Gods - Jack L. Chalker\nDowntiming the Night Side - Jack L. Chalker\nEchoes of the Well of Souls - Jack L. Chalker\nEmpires of Flux &amp; Anchor - Jack L. Chalker\nExiles at the Well of Souls - Jack L. Chalker\nGhost of the Well of Souls - Jack L. Chalker\nGods of the Well of Souls - Jack L. Chalker\nKaspar's Box - Jack L. Chalker\nLilith - A Snake in the Grass - Jack L. Chalker\nLords of the Middle Dark - Jack L. Chalker\nMasks of the Martyrs - Jack L. Chalker\nMasters of Flux &amp; Anchor - Jack L. Chalker\nMedusa - A Tiger by the Tail - Jack L. Chalker\nMelchior's Fire - Jack L. Chalker\nMidnight at the Well of Souls - Jack L. Chalker\nPirates of the Thunder - Jack L. Chalker\nQuest for the Well of Souls - Jack L. Chalker\nRiders of the Winds - Jack L. Chalker\nShadow of the Well of Souls - Jack L. Chalker\nSongs of the Dancing Gods - Jack L. Chalker\nSpirits of Flux &amp; Anchor - Jack L. Chalker\nThe Birth of Flux &amp; Anchor - Jack L. Chalker\nThe Cybernetic Walrus - Jack L. Chalker\nThe Demons at Rainbow Bridge - Jack L. Chalker\nThe Hot-Wired Dodo - Jack L. Chalker\nThe Identity Matrix - Jack L. Chalker\nThe Labyrinth of Dreams - Jack L. Chalker\nThe March Hare Network - Jack L. Chalker\nThe Maze in the Mirror - Jack L. Chalker\nThe Messiah Choice - Jack L. Chalker\nThe Moreau Factor - Jack L. Chalker\nThe Return of Nathan Brazil - Jack L. Chalker\nThe River of Dancing Gods - Jack L. Chalker\nThe Run to Chaos Keep - Jack L. Chalker\nThe Sea is Full of Stars - Jack L. Chalker\nThe Shadow Dancers - Jack L. Chalker\nTwilight at the Well of Souls - The Legacy of Nathan Brazil - Jack L. Chalker\nVengeance of the Dancing Gods - Jack L. Chalker\nWar of the Maelstrom - Jack L. Chalker\nWarriors of the Storm - Jack L. Chalker\nWhen the Changewinds Blow - Jack L. Chalker\n\nJack Laurence Chalker was an American science fiction author. Chalker was also a Baltimore City Schools history teacher in Maryland for a time. He also was a member of the Washington Science Fiction Association and was involved in the founding of the Baltimore Science Fiction Society.","torrent":{"xt":"urn:btih:0ec1856584702f50917dc8648928a6cd2204f7c3","amp;dn":"Jack+L.+Chalker+Mobi+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec1856584702f50917dc8648928a6cd2204f7c3","infoHashBuffer":{"type":"Buffer","data":[14,193,133,101,132,112,47,80,145,125,200,100,137,40,166,205,34,4,247,195]},"announce":[],"urlList":[]}}