{"title":"Marx Brothers - At The Circus(1939)Marx Brothers - At The Circu","uid":3255007,"size":553174528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f3cdb47fefde5d10f313ec3b52167496e08cbf6&amp;dn=Marx+Brothers+-+At+The+Circus%281939%29Marx+Brothers+-+At+The+Circu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Sanity","files":2,"time":1100225562,"description":"Summary: Possibly their best; up there with Duck Soup, anyway\n\nFrankly, critical consensus on this film is downright wrong. No joke flops in this Marx Brothers masterpiece. All three of the remaining brothers, Groucho, Harpo, and Chico, have a plethora of great scenes. Groucho has possibly his best line of his entire career. I won't ruin it for you. Chico's best moments are as Chiccolini in Duck Soup, but he is nearly as funny here. The scene in the midget's room is as funny a set piece as ever existed. Chico also has a great piano scene. Harpo is hilarious as well, playing a card game with a seal, and he delivers his best harp number. Usually they're awful, but the one here is great. He plays ambassador to the races again in this film, as he did in A Day at the Races. He dances around with a group of black people who show up out of nowhere. These scenes might be dated, but they're excellent in their context. I'd call them both scenes of great beauty, showing harmony between the races. Margaret Dumont, the fifth Marx Brother - well, maybe we ought to call her the fourth; she's in more of them than Zeppo is! - is as funny as usual. The only let down is the romantic subplot, but you probably come to expect that from Marx Brothers' films. Perhaps the one here will be funny to you. The guy is one of the biggest dorks in history. His girl isn't too bad though. She has a great musical number with a horse. But even the two together have a decent scene where they sing to each other while they are desperately trying to lose a waiter who's intently watching their courtship. At the Circus contains maybe the best climactic sequence of their career, with the three brothers, Dumont, the villain, and a gorilla swing around on the trapeze swings. The final shot is a doozy, as well. 10/10. \n","torrent":{"xt":"urn:btih:0f3cdb47fefde5d10f313ec3b52167496e08cbf6","amp;dn":"Marx+Brothers+-+At+The+Circus%281939%29Marx+Brothers+-+At+The+Circu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f3cdb47fefde5d10f313ec3b52167496e08cbf6","infoHashBuffer":{"type":"Buffer","data":[15,60,219,71,254,253,229,209,15,49,62,195,181,33,103,73,110,8,203,246]},"announce":[],"urlList":[]}}