{"title":"Stephen Hayes Ninjutsu Ninja Kuji-in and Kuji-Kiri","uid":10993354,"size":1563520687,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0fd1a31ef010a6d9162f21797b9d5a24bcfcf67e&amp;dn=Stephen+Hayes+Ninjutsu+Ninja+Kuji-in+and+Kuji-Kiri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"survy9","files":4,"time":1410032494,"description":"This is a collection of all three of Stephen K. Hayes' videos on Kuji-in and Kuji Kiri:\n\nKuji In - Sprit Projection Power\n\nNinja Kuji-In Spirit Protection Projection presents a master's understanding of warrior presence. We train for physical mastery in a dangerous world, and then we translate that fighter prowess into warrior will - pure intention at work subduing negative forces in the world. Welcome to your initiation into Kuji-In &quot;9 Syllable Mudra Postures&quot;. An-shu Stephen K. Hayes gives a from-the-heart explanation/interpretation of training in spiritual protection power projection for martial artists - the ninja's legendary Kuji-In. An-shu takes you through a step-by-step process for learning the mechanics of the ninja's Kuji In 9 syllable mudra finger grip symbols, setting you on the path of progress towards personally building protector power presence.\n\nKuji Kiri - Spirit Protection Projection\n\nBlack Belt Hall of Fame member An-shu Stephen K. Hayes takes you through a step-by-step process for learning the mechanics of the ninja's Kuji Kiri grid of 9 syllable slashes, setting you on the path of progress towards personally building protector power presence.\n\nKuji 6 - Thought Projection and Receiving\n\nNinja Kuji-no-Ho 6 presents To-Shin Do An-shu Stephen K. Hayes' master coaching in a very special aspect of warrior thought projection and receiving - how to begin training to know what others are thinking and how to plant your thoughts in another's mind - that allows the highest of warriors to find the keys to victory when the conventionally minded see only a future of defeat. &quot;Did you see An-shu Stephen K. Hayes win on the Discovery Channel ultimate ninja challenge where he had to get past two LAPD SWAT bodyguard specialists for access to a squirming target, in competition with 5 US Navy SEALS? This is how he accomplished the impossible - ninja kuji 6!&quot;\n","torrent":{"xt":"urn:btih:0fd1a31ef010a6d9162f21797b9d5a24bcfcf67e","amp;dn":"Stephen+Hayes+Ninjutsu+Ninja+Kuji-in+and+Kuji-Kiri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd1a31ef010a6d9162f21797b9d5a24bcfcf67e","infoHashBuffer":{"type":"Buffer","data":[15,209,163,30,240,16,166,217,22,47,33,121,123,157,90,36,188,252,246,126]},"announce":[],"urlList":[]}}