{"title":"Moms Teach Sex - Alex Grey, Brandi Love - Multiple Masturbation","uid":13535805,"size":1234109421,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0fd70622114bc6d34e6a1893f76943f4e62d6328&amp;dn=Moms+Teach+Sex+-+Alex+Grey%2C+Brandi+Love+-+Multiple+Masturbation+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"codho","files":1,"time":1455442723,"description":"Screens :\r\n \nhttp://imgaah.com/viewer.php?file=67017048804739998591.jpg\r\n \nhttp://imgaah.com/viewer.php?file=91026406480020990237.jpeg\r\n \nhttp://imgaah.com/viewer.php?file=02658935507142408356.jpeg\r\n\r\n\r\n\r\nAlex Grey is the type of always-horny girl that can never keep her hands from her juicy bald pussy. Whether she's spying on Xander Corvus in the shower, pressing a vibrator to her needy snatch while doing her homework, or even making do with the buzz from the vacuum cleaner while she's helping out around the house, this tight blonde can't seem to stop masturbating.\r\n\r\nThe problem is that Alex keeps getting caught. Finally, Brandi Love is forced to sit Alex down along with Xander so that they can have a heart to heart about Alex's urges. Fortunately, Brandi and Xander decide to take pity on her and help her out!\r\n\r\nTo get started, Brandi instructs Alex to give Xander some head. Since she's a hands-on tutor, Brandi gets in on the action right away even while she's instructing Alex how to do better. Soon the girls are working in tandem to deliver a double blowjob as they each alternate between sucking Xander's cock and gargling his balls. Xander and Brandi even demonstrate how a titty fuck works.\r\n\r\nWhen Alex is ready to move on to full-fledged sex, Xander doesn't waste a single movement. After a brief pussy licking to get Alex all wet and ready, Xander pushes his cock deep into the petite blonde's bare pussy. Brandi is there every step of the way to make sure that Alex is loving what she feels.\r\n\r\nA quick study, Alex is eager to eat out Brandi's pussy when the busty mom crawls above her stepdaughter to suck Xander's dick clean. When Xander pushes back into Alex's twat and then lifts her up so that he can take her while standing, Alex comes unglued with orgasmic pleasure.\r\n\r\nNow that Alex has been fully brought into the world of sex, Brandi finally gets to enjoy having her pussy pounded, too. She takes it doggy style to start while simultaneously fondling Alex's cooch. After taking a break to show Alex how to ride a hard cock, Brandi takes another turn for a reverse cowgirl stiffie ride that pushes all her buttons.\r\n\r\nThe girls are soon ready to reward Xander for his patience as he played stud to them. Brandi once again shows Alex how it's done, positioning her stepdaughter in front of Alex's member while she works him with her hands. The result is a blast of cum all over Alex's face when Xander explodes, leaving the petite blonde smiling through her facial","torrent":{"xt":"urn:btih:0fd70622114bc6d34e6a1893f76943f4e62d6328","amp;dn":"Moms+Teach+Sex+-+Alex+Grey%2C+Brandi+Love+-+Multiple+Masturbation+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd70622114bc6d34e6a1893f76943f4e62d6328","infoHashBuffer":{"type":"Buffer","data":[15,215,6,34,17,75,198,211,78,106,24,147,247,105,67,244,230,45,99,40]},"announce":[],"urlList":[]}}