{"title":"The Oblongs Complete Twisted Series","uid":4396317,"size":1263788079,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0fdd499be52ce3e19a4dd84162958d7857486097&amp;dn=The+Oblongs+Complete+Twisted+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"nomad13666","files":14,"time":1221440734,"description":"The Oblongs is an American animated television program aimed at teenagers and adults. It was created by Angus Oblong and produced by Jobsite Productions and Mohawk Productions, Inc. in association with Warner Bros. Television and is very loosely based on a series of characters that Oblong introduced in a picture-book entitled Creepy Susie and 13 Other Tragic Tales for Troubled Children. The theme song for the show was done by They Might Be Giants.\n\nThe show focuses on the antics of a family who live in a poor valley community who, as a result of extreme pollution and radiation, all are severely disabled and deformed, either physically or mentally. The pollution is the direct result of the lavish lifestyle of a rich community known as &quot;The Hills,&quot; the residents of which continue to exploit and harm the valley residents with little regard for their safety or well being.\n\nIt premiered on April 1, 2001 on The WB, but it failed to find an audience. On May 20, 2001, The WB aired &quot;Disfigured Debbie,&quot; the second episode produced, as the season finale, leaving five of the episodes unaired. A fan of the series who was writing an episode guide at TV Tome informed creator Angus Oblong of the show&amp;#039;s cancellation and rallied fans of the series to petition and encourage the network to renew the show. Ultimately, the petition was unsuccessful[citation needed]. Later that same year, Canada&amp;#039;s Teletoon network began airing the series. Quickly, a large fanbase began to bloom. In August 2002, the series found a home on Cartoon Network&amp;#039;s Adult Swim evening program schedule, where it received high ratings due to many American fans discovering the series for the first time. When shown in Australia on free to air television in 2003, the show was pulled in the middle of the first episode (but was later shown in a late night/early morning time slot).\n\nThe show is rated TV-14 for suggestive situations, mild to moderate language, dialogue and suggestive/sexual themes (though one episode is rated TV-PG for mild to moderate language).\n\n&quot;The Oblong family&quot;\n\n* Bob Oblong (voice: Will Ferrell), the father, was born without any arms or legs and works at a poison factory. He can drive vehicles like any other person and is an accomplished pianist. Very chipper and his disposition being very sunny, he is seen as being modeled after various fathers from 1950s shows, complete with pipe.\n\n* Pickles Oblong (voice: Jean Smart) is the chain smoking, alcoholic mother who was originally a Hill resident but moved to the valley after meeting Bob. All her hair has since fallen out, and she is now regarded as an outcast by her former Hill friends. While not bitter about losing her former privileged life (in her words: &quot;I found a bar next to a wig shop&quot;), she often expresses disdain towards her self-centered neighbors in the Hills. Pickles also is turned on by Bob&amp;#039;s simple, albeit at times awkward, wisdom.\n\n* Chip and Biff Oblong (voices: Randy and Jason Sklar) are 17 year old conjoined twin who are attached at the waist and share a middle leg. Biff is a hard worker obsessed with sports, while Chip is more laid back. It is sometimes implied that Biff is gay, though other times the two are seen lusting after girls together. Biff and Chip each occasionally go into trances to give the other brother privacy (as seen in the episode &quot;Get Off My Back&quot;). Biff and Chip have different hair colors, suggesting that they are not genetically identical, though this is impossible for conjoined twins; this inconsistency can be seen as either another one of the quirks of the Hill Valley populace, or that one of the twins colors and styles his hair differently from the other.\n\n* Milo Francis Oblong (voice: Pamela Segall Adlon), the middle child and youngest son, is afflicted with numerous mental and social conditions, including everything from attention deficit disorder to diabetes. He&amp;#039;s also on every medication &quot;from ritalin to Rogaine,&quot; having only one hair in the center of his head. He is based on a character that appears in Creepy Susie. He wears a shirt that says &quot;NO.&quot; At most times, he is the main protagonist of the series.\n\n* Beth Oblong (voice: Jeannie Elias) is the youngest child and only daughter, who has a warty, elongated tumor growing out of her head. Despite her tumor, she appears to be more well adjusted than the rest of her family. She has a doll (which is actually a bondage whip with a doll&amp;#039;s head, dress, and arms attached so the whip looks like a ponytail) named Slowie.\n\n* Grammy Oblong, Bob&amp;#039;s vegetative mother, resides in a motorized wheelchair and never speaks, although she frequently passes gas.\n\n* Lucky Oblong, the family cat who constantly smokes cigarettes.\n\n* Scottie Oblong is Milo&amp;#039;s narcoleptic dog, a result of perfume used on him during his tenure as a test animal at Globocide. Scottie was based on the short story &quot;Narcoleptic Scottie&quot; in Creepy Susie.\n\n&quot;List of The Oblongs episodes&quot;\n\n1. &quot;Misfit of Love (Pilot)&quot; - Milo attends his first day at &quot;normal school&quot; and falls in love with a girl who is actually an alien. Meanwhile, Bob Oblong tries to look for a new job after his health insurance at work gets cancelled.\n2. &quot;Narcoleptic Scottie&quot; - In an attempt to calm Milo&amp;#039;s A.D.D., his parents let him adopt a dog named Scottie, but decide to give it away to Bob&amp;#039;s boss after the dog becomes a bad influence on Milo.\n3. &quot;Milo Interrupted&quot; - Milo finds that Helga&amp;#039;s parents are missing and tries to help her, which makes his dad, Bob, suspect that Milo&amp;#039;s abusing drugs.\n4. &quot;Bucketheads&quot; - Milo becomes cool after his mother sends him to school with a bucket on his head.\n5. &quot;Heroine Addict&quot; - Pickles quits smoking and drinking after failing to get Beth a Velva doll...and becomes a thrill seeker after accidentally punching a girl in a Tae-Bo class.\n6. &quot;The Golden Child&quot; - Milo creates an energy drink called &quot;Manic&quot; and becomes a &quot;marketing genius&quot;.\n7. &quot;Flush, Flush, Sweet Helga&quot; - Milo and his friends crash a Debbie&amp;#039;s party and Helga gets stuck in a sewer pipe.\n8. &quot;Disfigured Debbie&quot; - Debbie becomes deformed in a freak accident and finds acceptance with Milo and his friends.\n9. &quot;Pickles&amp;#039; Little Amazons&quot; - Pickles becomes the den mother of a Girl Scout troop after getting busted for neglecting Beth.\n10. &quot;Get Off My Back&quot; - Bob accidentally super-glues Milo to Biff and Chip&amp;#039;s back.\n11. &quot;Please Be Genital&quot; - Bob gets his genitals crushed by a stripper wearing clogs during his best friend&amp;#039;s bachelor party. When he confesses to Pickles that they can&amp;#039;t have sex for two weeks, Pickles begins wondering whether or not her marriage to Bob is real. Meanwhile, Milo becomes an insomniac when Pickles and Bob stop having sex.\n12. &quot;My Name is Robbie&quot; - Bob gets his jaw injured at his company&amp;#039;s theme park and (at the advice of company attorneys) is given a robotic body with the arms and legs he never had.\n13. &quot;Father of the Bribe&quot; - Biff and Chip get their driver&amp;#039;s licenses and come across the mayor&amp;#039;s bribe money after winning his car at an auction.\n\nEnjoy!\n\nNOMAD13666","torrent":{"xt":"urn:btih:0fdd499be52ce3e19a4dd84162958d7857486097","amp;dn":"The+Oblongs+Complete+Twisted+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fdd499be52ce3e19a4dd84162958d7857486097","infoHashBuffer":{"type":"Buffer","data":[15,221,73,155,229,44,227,225,154,77,216,65,98,149,141,120,87,72,96,151]},"announce":[],"urlList":[]}}