{"title":"The Rolling Stones - Exile On Main Street (1972) WMA320","uid":6308054,"size":307311178,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:100b82e2d78be1e488fb1afea2a907373ea5c806&amp;dn=The+Rolling+Stones+-+Exile+On+Main+Street+%281972%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302426902,"description":"Deluxe Edition, Extra Tracks, Original Recording Remastered. \n\nFollowing an album like 1971's magnificent &quot;Sticky Fingers&quot; was always going to be a tall order, but The Stones did it with swagger and panache. &quot;Exile On Main St&quot; was released 12 May 1972 as a 2LP set on Rolling Stones Records COC 69100 in the UK and on COC 2-2900 in the USA. It reached the coveted number 1 spot on both sides of the pond - and like The Beatles &quot;White Album&quot; before it - is a flawed and sprawling thing, but considered by most to be a masterpiece nonetheless. \n\nThis 17 May 2010 reissue (18 May in the USA) is the 2CD expanded version of that double on Rolling Stones/Polydor 273 429-5. Disc 1 has the full compliment of 18 tracks at 67:18 minutes, while Disc 2 is a new 10-track mixture of previously unreleased outtakes and alternate versions at 41:12 minutes. All songs are by Mick Jagger and Keith Richards except &quot;Ventilator Blues&quot; which is co-written with Mick Taylor, while &quot;Shake Your Hips&quot; and &quot;Stop Breaking Down&quot; are Slim Harpo and Robert Johnson cover versions. As with &quot;Sticky Fingers&quot;, the additional musicians and producer (Jimmy Miller) added hugely to the power of almost every song and should be noted for it - Bobby Keys on Saxophone, Jim Price on Trumpet, Nicky Hopkins, Ian Stewart and Billy Preston on Piano and Organ with lady-soul veterans Clydie King and Vanetta Fields on Backing Vocals. Dr. John also sang backup on &quot;Let It Loose&quot;. \n\nSOUND: \nAs with the 2009 reissues STEPHEN MARCUSSEN (over 1000 mastering credits to his name including the &quot;Alfie&quot; soundtrack with Mick Jagger) and STEWART WHITMORE of Marcussen Mastering have remastered the original tapes and the sound is glorious throughout. &quot;Loving Cup&quot; followed by &quot;Happy&quot; are beautifully clear and &quot;Tumbling Dice&quot; is at last full and in your face. Most every track is improved - the instrumentation in your speakers with a fabulous live and shambolic feel. The acoustic and harmonica opening of &quot;Sweet Virginia&quot; and the drums of &quot;All Down The Line&quot; are superb. To me it's a huge improvement, a balls-to-the-wall triumph. Downsides - the hiss level on &quot;Shine A Light&quot; that was there in the first place is now more accented as it is on the frantic &quot;Rip This Joint&quot;. Some despised the 2009 remasters, so this will be more of the same for them, but most I suspect will absolutely love it. Wish I could say the same about the presentation... \n\nPACKAGING: \nVery poor I'm afraid. The front flap and rear of the original 2LP cover are produced on the outside of the digipak (as they should be) with the inner LP photo spread reproduced on the inside of the digipak, BUT the original vinyl double also had two fantastic inner sleeves and a set of fold-out postcards (only came with 1st pressings and they're now very rare). Only 1 of the 4 sides of the two inner sleeves is reproduced! That the idiots would not bother picturing the 'postcards' seems to be par for the course for Stones reissues these days, but that great shot of Mick &amp; Keith at the mike with whiskey bottle in hand is missing - as is the &quot;I Don't Want To Talk About Jesus I Just Want To See His face&quot; quote on the other side - unbelievable! The supposedly exclusive 12-page booklet is different to all other issues, but turns out to be just black and white photos of the session and no liner notes whatsoever - none! The track-by-track details are now only bland black and white printed listings, which lose all of the inner sleeves magical artwork. It's an insult that this supposedly 'deluxe' reissue cavalierly misses out on crucial visual elements of the original release - it's hugely unimaginative and workmanlike at best. \n\nBONUS DISC: \nAlthough the 10 bonus tracks have the same original backing band - and despite what the track-by-track credits 'don't' tell you - it's obvious that the first 5 have had 'treatment' of some kind - vocal tracks added on/redone recently. \n\n&quot;Pass The Wine (Sophia Loren)&quot; is an ok opener, but the track that sounds most like a genuine outtake peach is &quot;Plundered My Soul&quot; which is fantastic (it was issued in April 2010 as a limited edition Record Shop Day 7&quot; single in the USA and UK). Best approximation is that it sounds like the B-side &quot;Tumbling Dice&quot; should always have had (lyrics above). &quot;I'm Not Signifying&quot; is ok, but hardly great, but there then follows a genuinely lovely ballad &quot;Following The River&quot; complete with the new girls giving it some soulful backing vocals (Lisa Fischer and Cindy Mizelle). It's far better than you think. &quot;Dancing In The Light&quot; is a jaunty mid-tempo song similar to &quot;Hide Your Love&quot; off &quot;Goat's Head Soup&quot;. The opening of &quot;So Divine (Aladdin Story) is closer to Brian Jones Rolling Stones circa &quot;Dandelion&quot; and its really interesting - Jim Price on vibes and Bobby Keys on some kind-of treated saxophone sound. There follows two &quot;Alternate Takes&quot; of &quot;Loving Cup&quot; and &quot;Soul Survivor&quot;. Now these are far closer to what we want - &quot;Loving Cup&quot; opens with a lovely Nicky Hopkins piano refrain and suddenly it's &quot;there&quot; - that shambolic feel to everything - especially the guitars of Richards and Taylor duelling to the end yet complimenting each other so perfectly. Now this I will love. And then another gem - Keith carrying the vocals and sloppy stuff on &quot;Soul Survivor&quot; instead of Mick - and it works - and when that riffing guitar kicks in, I'm balling my eyes out and there's chills on my arms. &quot;Good Time Women&quot; is a forerunner for &quot;Tumbling Dice&quot; and is fab - rough and tumble as well. &quot;Title 5&quot; opens with studio chatter of &quot;Take 1&quot; and is a strange little rocking instrumental which kind of peters out, interesting but that's all... \n\nOk - so there's no live stuff and there should be (legendarily good), the &quot;All Down The Line&quot; Alternate Take that's on the B-side of the &quot;Plundering My Soul&quot; 7&quot; single isn't on here either, which is just stupid - and the 4-track Excerpts 7&quot; Flexi single from the April 1972 NME in the UK with song edits and an exclusive &quot;Exile On Main Street Blues&quot; track is nowhere to be seen let alone pictured either. But overall - I'm kind of shocked at how good Disc 2 is. I'll ignore some of these newer makeovers for sure, but those Alternate Takes are thrilling. \n\nIn May 2012, &quot;Exile&quot; will be 40 years old and Mick and Keef will be more Zimmer Frames than Glimmer Twins. But that won't stop this coolest of double-albums from being the absolute business. I suspect the real truth about this 2CD reissue is far simpler - men around the world will see this digital temptress pouting on the shelf of their local megastore, feel a quickening of the pulse and a movement in their trouser area - and be unable to resist. \n\nAnd you know, you can't help but feel that these two canny English lads already know this. \n\nGod bless The Rolling Stones and roll on &quot;Some Girls... \n(due later this year apparently) \n\nPS: \nHMV in the UK have issued &quot;Exile&quot; with the digipak inside an exclusive card slipcase (Polydor 274 102-3). I've pictured both sides of it for fans. \n\nThe Japanese, however, have not surprisingly got the most desirable version of them all; it's inside a 14-disc box set called &quot;From The 70's To 00's&quot; which contains all their albums from &quot;Sticky Fingers&quot; through to &quot;A Bigger Bang&quot;. They are all on the SHM-CD format (Super High Materials) and each has the original album artwork repro'd on one of those 5&quot; Mini LP sleeves we so love (UICY-91558). &quot;Exile&quot; is included - being the 2010 Remaster version - and is in a gatefold card sleeve complete with its original fold-out postcards and two inner sleeves.\n\nby Mark Barry\n\nTRACKLIST:\nDisc 1:\n01 - Rocks Off.wma                                                    \n02 - Rip This Joint.wma                                               \n03 - Shake Your Hips.wma                                              \n04 - Casino Boogie.wma                                                \n05 - Tumbling Dice.wma                                                \n06 - Sweet Virginia.wma                                               \n07 - Torn And Frayed.wma                                              \n08 - Sweet Black Angel.wma                                            \n09 - Loving Cup.wma                                                   \n10 - Happy.wma                                                        \n11 - Turd On The Run.wma                                              \n12 - Ventilator Blues.wma                                             \n13 - I Just Want To See His Face.wma                                  \n14 - Let It Loose.wma                                                 \n15 - All Down The Line.wma                                            \n16 - Stop Breaking Down.wma                                           \n17 - Shine A Light.wma                                                \n18 - Soul Survivor.wma        \n\nDisc 2:\n01 - Rocks Off.wma                                                    \n02 - Rip This Joint.wma                                               \n03 - Shake Your Hips.wma                                              \n04 - Casino Boogie.wma                                                \n05 - Tumbling Dice.wma                                                \n06 - Sweet Virginia.wma                                               \n07 - Torn And Frayed.wma                                              \n08 - Sweet Black Angel.wma                                            \n09 - Loving Cup.wma                                                   \n10 - Happy.wma                                                        \n11 - Turd On The Run.wma                                              \n12 - Ventilator Blues.wma                                             \n13 - I Just Want To See His Face.wma                                  \n14 - Let It Loose.wma                                                 \n15 - All Down The Line.wma                                            \n16 - Stop Breaking Down.wma                                           \n17 - Shine A Light.wma                                                \n18 - Soul Survivor.wma        \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:100b82e2d78be1e488fb1afea2a907373ea5c806","amp;dn":"The+Rolling+Stones+-+Exile+On+Main+Street+%281972%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100b82e2d78be1e488fb1afea2a907373ea5c806","infoHashBuffer":{"type":"Buffer","data":[16,11,130,226,215,139,225,228,136,251,26,254,162,169,7,55,62,165,200,6]},"announce":[],"urlList":[]}}