{"title":"Encyclopedia of Spirits - Judika Illes","uid":9490980,"size":3373388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:104131d08ee572101c7160f506d31fbb87dc76cd&amp;dn=Encyclopedia+of+Spirits+-+Judika+Illes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ZamKhan","files":3,"time":1389993018,"description":"Enter the World of Spirits!\n\nThe Encyclopedia of Spirits is a comprehensive and entertaining A to Z of spirits from around this world and the next. Within these pages meet love goddesses and disease demons, guardians of children and guardians of cadavers. Discover Celtic goddesses and goddesses of the Kabbalah, female Buddhas, African Powers, Dragon Ladies, White Ladies, Black Madonnas, the Green Man, the Green Fairy, lots and lots of ghosts, djinn, mermaids, fairies, and more. From the beneficent to the mischievous, working with these spirits can bring good fortune, lasting love, health, fertility, revenge, and relief. Discover:\n\nThe true identities of over one thousand spirits (as well as their likes and dislikes)\n\nHow to communicate with specific spirits for your own benefit\n\nHow to recognize these spirits when they manifest themselves\n\nThe mythological and historical events associated with specific spirits\n\nThe colors, days, numbers, and astrological signs associated with specific spirits\n\nThe Encyclopedia of Spirits also provides an overview of the role of spirit communication throughout history and a general guide to working with spirits. No matter what your life's problems or desires, this book can guide you to the right spirits who can help fulfill your dreams. For the spiritual adept, the amateur, or the simply curious, the Encyclopedia of Spirits will inform, inspire, and delight.\n\nAbout the Author\n\nJudika Illes is an independent scholar, educator, and author of several books of folklore, folkways, and mythology. Judika is a graduate of Rutgers University and has a certification in therapeutic aromatherapy from the Australasian College of Herbal Studies. Her books include Encyclopedia of 5,000 Spells, Encyclopedia of Spirits, The Element Encyclopedia of Witchcraft, The Weiser Field Guide to Witches, and The Weiser Field Guide to the Paranormal (published under the name Judith Joyce).","torrent":{"xt":"urn:btih:104131d08ee572101c7160f506d31fbb87dc76cd","amp;dn":"Encyclopedia+of+Spirits+-+Judika+Illes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"104131d08ee572101c7160f506d31fbb87dc76cd","infoHashBuffer":{"type":"Buffer","data":[16,65,49,208,142,229,114,16,28,113,96,245,6,211,31,187,135,220,118,205]},"announce":[],"urlList":[]}}