{"title":"International Political Economy (5th Ed)","uid":8876536,"size":33203510,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:105323fb65e2022bf45a83459f8167aaf2a6b0d7&amp;dn=International+Political+Economy+%285th+Ed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":1,"time":1378220345,"description":"International Political Economy (5th Edition)\nby Thomas Oatley\nPearson | March 2011 | ISBN-10: 0205060633 | PDF | 432 pages | 31.6 mb &lt;a href=&quot;\nhttp://www.amazon.com/International-Political-Economy-5th-Edition/dp/0205060633&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/International-Political-Economy-5th-Edition/dp/0205060633&lt;/a&gt;\n\nBroadly viewing the global economy as a political competition that produces winners and losers, International Political Economy holistically and accessibly introduces the field of IPE to readers with limited background in political theory, history, and economics. This book surveys major interests and institutions and examines how state and non-state actors pursue wealth and power. Emphasizing fundamental economic concepts as well as the interplay between domestic and international politics, International Political Economy not only explains how the global economy works; it also encourages readers to think critically about how economic policy is made in the context of globalization.\n\nTable of Contents\nChapter 1. International Political Economy\nChapter 2. The WTO and the World Trade System\nChapter 3. The Political Economy of International Trade Cooperation\nChapter 4. A Society-Centered Approach to the Politics of Trade\nChapter 5. A State-Centered Approach to Trade Politics\nChapter 6. Trade and Development I: Import Substitution Industrialization\nChapter 7. Trade and Development II: Economic Reform\nChapter 8. Multinational Corporations in the Global Economy\nChapter 9. The Politics of Multinational Corporations\nChapter 10. The International Monetary System\nChapter 11. Contemporary International Monetary Arrangements\nChapter 12. A Society-Centered Approach to Monetary and Exchange-Rate Policies\nChapter 13. A State-Centered Approach to Monetary and Exchange-Rate Policies\nChapter 14. Developing Countries and International Finance I: The Latin American Debt Crisis\nChapter 15. Developing Countries and International Finance II: A Decade of Crises\nChapter 16. Globalization: Consequences and Controversies\n\nAbout the Author\n\nThomas Oatley, Associate Professor of Political Science, did his graduate work at the Graduate Institute of International Studies of the University of Geneva and at Emory University in Atlanta. He specializes in international political economy, teaching courses on the politics of global trade and finance, the European Union, and related topics. His research interests focus on international cooperation, international institutions, and international finance. He is the author ofMonetary Politics (1997, University of Michigan Press), which investigates the political economy of exchange rate cooperation in the European Union, and International Political Economy: Interests and Institutions in the Global Economy (2003, Longman). He has also published articles in International Organization, The American Journal of Political Science, Public Choice, and International Politics. His current research focuses on developing countries and the international financial system.","torrent":{"xt":"urn:btih:105323fb65e2022bf45a83459f8167aaf2a6b0d7","amp;dn":"International+Political+Economy+%285th+Ed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"105323fb65e2022bf45a83459f8167aaf2a6b0d7","infoHashBuffer":{"type":"Buffer","data":[16,83,35,251,101,226,2,43,244,90,131,69,159,129,103,170,242,166,176,215]},"announce":[],"urlList":[]}}