{"title":"Alan Moore: Comics as Performance, Fiction as Scalpel [EPUB]","uid":9952970,"size":15610938,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:107c1b482c111f4d4e3fcb6aae14f3505aeb4dd4&amp;dn=Alan+Moore%3A+Comics+as+Performance%2C+Fiction+as+Scalpel+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"VikTSlick","files":4,"time":1397430056,"description":"Title: Alan Moore - Comics as Performance, Fiction as Scalpel\nAuthor: Annalisa Di Liddio\nSeries: Great Comics Artists Series\nPaperback: 192 pages\nPublisher: University Press of Mississippi (March 13, 2009)\nLanguage: English\nISBN-10: 160473213X\nISBN-13: 978-1604732139\n\nPromotional summary from the publisher - &quot;Eclectic British author Alan Moore (b. 1953) is one of the most acclaimed and controversial comics writers to emerge since the late 1970s. He has produced a large number of well-regarded comic books and graphic novels while also making occasional forays into music, poetry, performance, and prose.In Alan Moore: Comics as Performance, Fiction as Scalpel, Annalisa Di Liddo argues that Moore employs the comics form to dissect the literary canon, the tradition of comics, contemporary society, and our understanding of history. The book considers Moore's narrative strategies and pinpoints the main thematic threads in his works: the subversion of genre and pulp fiction, the interrogation of superhero tropes, the manipulation of space and time, the uses of magic and mythology, the instability of gender and ethnic identity, and the accumulation of imagery to create satire that comments on politics and art history. Examining Moore's use of comics to scrutinize contemporary culture, Di Liddo analyzes his best-known works--Swamp Thing, V for Vendetta, Watchmen, From Hell, Promethea, and Lost Girls. The study also highlights Moore's lesser-known output, such as Halo Jones, Skizz, and Big Numbers, and his prose novel Voice of the Fire. Alan Moore: Comics as Performance, Fiction as Scalpel reveals Moore to be one of the most significant and distinctly postmodern comics creators of the last quarter-century.&quot;\n\nThe torrent folder contains the cover image, the generated metadata, the original PDF, a slightly strange EPUB conversion that I made with Calibre but which is still highly readable (seems to only be affecting some titles with random capitalization, and it looks cool and appropriate like Rorschach's journal from Watchmen). Please seed and enjoy! :-)","torrent":{"xt":"urn:btih:107c1b482c111f4d4e3fcb6aae14f3505aeb4dd4","amp;dn":"Alan+Moore%3A+Comics+as+Performance%2C+Fiction+as+Scalpel+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"107c1b482c111f4d4e3fcb6aae14f3505aeb4dd4","infoHashBuffer":{"type":"Buffer","data":[16,124,27,72,44,17,31,77,78,63,203,106,174,20,243,80,90,235,77,212]},"announce":[],"urlList":[]}}