{"title":"Technology in Action Complete (12th Global Ed)(gnv64)","uid":12513994,"size":71823867,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10ba879de9ab2c800046d1fd77d29d9e99eae3f6&amp;dn=Technology+in+Action+Complete+%2812th+Global+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":3,"time":1443620548,"description":"Technology in Action Complete (12th Ed)(Global Edition)\r\nby Alan Evans and Kendall Martin\r\nPearson | September 2015 | ISBN 10: 1-292-09967-4 | True PDF | 632 pages | 69.4 mb\r\n\r\nFor introductory courses in computer concepts, digital literacy, or computer literacy, often including instruction in Microsoft Office.\r\nExplore, discover, and experience technology with the immersive and adaptive Technology in Action–the book that uses technology to teach technology! Technology in Action is a learning system that pushes the envelope of what is possible in technology, and what is helpful in teaching. It is a system that fits the way students are learning today.\r\n\r\nAbout the Authors\r\nAlan Evans is currently a faculty member at Moore College of Art and Design and Montgomery County Community College teaching a variety of computer science and business courses.\r\nKendall Martin has been teaching since 1988 at a number of institutions, including Villanova University, DeSales University, Arcadia University, Ursinus College, County College of Morris, and Montgomery County Community College, at both the undergraduate and master’s degree level.\r\nMary Anne is an adjunct faculty member at Montgomery County Community College, teaching various computer application and concepts courses in face-to-face and online environments.\r\n\r\nCONTENTS\r\nChapter 1 Using Technology to Change the World ... 32\r\nChapter 2 Looking at Computers: Understanding the Parts ... 58\r\nChapter 3 Using the Internet: Making the Most of the Web’s Resources ... 104\r\nChapter 4 Application Software: Programs That Let You Work and Play ... 152\r\nChapter 5 System Software: The Operating System, Utility Programs, and File Management ... 188\r\nChapter 6 Understanding and Assessing Hardware: Evaluating Your System ... 252\r\nChapter 7 Networking: Connecting Computing Devices ... 288\r\nChapter 8 Digital Devices and Media: Managing a Digital Lifestyle ... 340\r\nChapter 9 Securing Your System: Protecting Your Digital Data and Devices ... 376\r\nChapter 10 Behind the Scenes: Software Programming ... 436\r\nChapter 11 Behind the Scenes: Databases and Information Systems ... 478\r\nChapter 12 Behind the Scenes: Networking and Security in the Business World ... 520\r\nChapter 13 Behind the Scenes: How the Internet Works ... 560\r\nGlossary ... 594\r\nIndex ... 613\r\n\r\nNOTE; If Adobe reader gives problems in reading this book, please use Sumatra or Foxit or Calibre.\r\n \nhttp://s7.postimg.org/6plx5i9ej/Technology_in_Action_Complete_12th_Ed.jpg","torrent":{"xt":"urn:btih:10ba879de9ab2c800046d1fd77d29d9e99eae3f6","amp;dn":"Technology+in+Action+Complete+%2812th+Global+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ba879de9ab2c800046d1fd77d29d9e99eae3f6","infoHashBuffer":{"type":"Buffer","data":[16,186,135,157,233,171,44,128,0,70,209,253,119,210,157,158,153,234,227,246]},"announce":[],"urlList":[]}}