{"title":"Elvis Costello - This Years Model [MP3 192] TNT Village","uid":9874948,"size":51941536,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:115823a05a3be19f9e4f7862771ede31abb9edbc&amp;dn=Elvis+Costello+-+This+Years+Model+%5BMP3+192%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"l.diliberto","files":12,"time":1396465279,"description":"Elvis Costello - This Years Model [MP3 192] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=392143&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=392143&lt;/a&gt;\n\nAnno: 17 marzo 1978\nGenere: British punk, Pop rock, New wave\n\nWhere My Aim Is True implied punk rock with its lyrics and stripped-down production, This Year's Model sounds like punk. Not that Elvis Costello's songwriting has changed -- This Year's Model is comprised largely of leftovers from My Aim Is True and songs written on the road. It's the music that changed. After releasing My Aim Is True, Costello assembled a backing band called the Attractions, which were considerably tougher and wilder than Clover, who played on his debut. the Attractions were a rock &amp; roll band, which gives This Year's Model a reckless, careening feel. It's nervous, amphetamine-fueled, nearly paranoid music -- the group sounds like they're spinning out of control as soon as they crash in on the brief opener, &quot;No Action,&quot; and they never get completely back on track, even on the slower numbers. Costello and the Attractions speed through This Year's Model at a blinding pace, which gives his songs -- which were already meaner than the set on My Aim Is True -- a nastier edge. &quot;Lipstick Vogue,&quot; &quot;Pump It Up,&quot; and &quot;(I Don't Want to Go To) Chelsea&quot; are all underscored with sexual menace, while &quot;Night Rally&quot; touches on a bizarre fascination with fascism that would blossom on his next album, Armed Forces. Even the songs that sound relatively lighthearted -- &quot;Hand in Hand,&quot; &quot;Little Triggers,&quot; &quot;Lip Service,&quot; &quot;Living in Paradise&quot; -- are all edgy, thanks to Costello's breathless vocals, Steve Nieve's carnival-esque organ riffs, and Nick Lowe's bare-bones production. Of course, the songs on This Year's Model are typically catchy and help the vicious sentiments sink into your skin, but the most remarkable thing about the album is the sound -- Costello and the Attractions never rocked this hard, or this vengefully, ever again. [The 1993 CD reissue standardized the sequencing of This Year's Model on both sides of the Atlantic, restoring the album to its original British running order and adding six bonus tracks. The first three tracks are singles and B-sides, including the classic rant &quot;Radio, Radio,&quot; the organ-driven '60s pop of &quot;Big Tears,&quot; and the frenetic &quot;Crawling to the USA.&quot; The remaining three tracks -- &quot;Running Out of Angels,&quot; &quot;Greenshirt,&quot; and &quot;Big Boys&quot; -- are all demos.] \n\n.: Locandina :.\n &lt;a href=&quot;\nhttp://cdn.head-fi.org/3/32/500x1000px-LL-32c2e727_tumblr_ltphvfhIEd1qbnpilo1_500.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cdn.head-fi.org/3/32/500x1000px-LL-32c2e727_tumblr_ltphvfhIEd1qbnpilo1_500.jpeg&lt;/a&gt;\n\n.: Tracklist :.\n\nNo Action\nThis Year's Girl\nThe Beat\nPump It Up\nLittle Triggers\nYou Belong to Me\nHand in Hand\n(I Don't Want to Go to) Chelsea\nLip Service\nLiving in Paradise\nLipstick Vogue\nNight Rally\n","torrent":{"xt":"urn:btih:115823a05a3be19f9e4f7862771ede31abb9edbc","amp;dn":"Elvis+Costello+-+This+Years+Model+%5BMP3+192%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115823a05a3be19f9e4f7862771ede31abb9edbc","infoHashBuffer":{"type":"Buffer","data":[17,88,35,160,90,59,225,159,158,79,120,98,119,30,222,49,171,185,237,188]},"announce":[],"urlList":[]}}