{"title":"Darkon.2005.DVDrip-Xenfreak","uid":4585277,"size":2059033165,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11810314ae3c25c446d31fdf5f2a9f1e25a28da3&amp;dn=Darkon.2005.DVDrip-Xenfreak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xenfreak","files":-1,"time":1229596312,"description":"i had to buy this movie for my documetary class, and since i have some encoding skills, i encoded it. \n\ni recommend viewing it with VLC so you can switch between the audio tracks(when the file is opened in VLC, right click, audio, select audio track, and pick whichever one you want)\n\nand if you want to watch this in something like Windows Media Player, download CCCP(google)\n\nthis movie is NOT SCENE! what does this mean? it doesn't conform to scene standards such as 700mb Avi file, or encoded with xvid video, mp3 audio. for the tech details, read below. i encoded this file myself and debated with myself to see what i would or would not include. in the end, the filesize ended up being around 2gb\n\ngenre: Documentary/Fantasy/Live Action Roleplaying(check IMDB title for more info)\n\nvideo: encoded using MeGUI with x264 and the codec is h.264/AVC\n\nAudio: 3 audio streams ripped directly from the DVD with no quality loss, all in AC3 format, and all at 192kbps. \n\n1.first audio track is the main movie audio\n\n2.second audio track is the director commentary\n\n3.third audio track is the commentary from the protagonist and antagonist in the movie.\n\nsubs: none! i'm like 95% sure this came with no subs, because there was no link to enable subtitles in the main menu and i didn't find anything with vobsub.\n\nit's important to note, as far as i know, this is the first DVD rip uploaded on the internet(and if not, at least the first on a public tracker), the release by loder was a DVDR and had some messed up rars(lol scene) and there's a version on Karagarga which is a TVrip. but i've yet to see any DVDrips for this.\n\n","torrent":{"xt":"urn:btih:11810314ae3c25c446d31fdf5f2a9f1e25a28da3","amp;dn":"Darkon.2005.DVDrip-Xenfreak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11810314ae3c25c446d31fdf5f2a9f1e25a28da3","infoHashBuffer":{"type":"Buffer","data":[17,129,3,20,174,60,37,196,70,211,31,223,95,42,159,30,37,162,141,163]},"announce":[],"urlList":[]}}