{"title":"Cinderella - The Last Mile  (2nafish)","uid":5549358,"size":135077892,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:11ff082a70739fe76fa3afc086abfe5d13a9ff52&amp;dn=Cinderella+-+The+Last+Mile++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1273492717,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Last Mile&quot; is the second single released from hard rock and glam metal band Cinderella's second album, Long Cold Winter. It peaked at number 36 on the U.S. Billboard  Hot 100 single chart in early 1989.\n\nLong Cold Winter is Cinderella's second studio album, released in 1988 through Mercury Records. It reached #10 in the US and became double-platinum for selling 2 million copies in the US by the end of the year, just as their debut album Night Songs had done earlier. Currently both albums are certified triple platinum.\n\nThe album features four singles, which all charted in the US. &quot;Don't Know What You Got (Till It's Gone)&quot;, which was to be Cinderella's highest-charting single, reached #12, &quot;The Last Mile&quot;, reached #36, &quot;Coming Home&quot; reached #20, and &quot;Gypsy Road&quot; hit #51, a year after the release of the album itself.\n\nWith Long Cold Winter, Cinderella started to move away from the glam metal-territory of their previous album and into a more blues-rock direction, akin to early 70's Rolling Stones, Aerosmith, Humble Pie, Bad Company, and Deep Purple.\n\nCinderella is an American  heavy metal band from Philadelphia, Pennsylvania. They emerged in the mid-1980s with a series of multi-platinum albums and hit singles whose music videos received heavy MTV rotation. They were famous for being a glam metal band, but then shifted over towards a more hard rock/blues-rock sound. By the mid-1990s, the band's popularity declined severely due to personal setbacks and public changes in musical tastes. Nonetheless, after a period of hiatus the band reunited and is still active at present.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:11ff082a70739fe76fa3afc086abfe5d13a9ff52","amp;dn":"Cinderella+-+The+Last+Mile++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11ff082a70739fe76fa3afc086abfe5d13a9ff52","infoHashBuffer":{"type":"Buffer","data":[17,255,8,42,112,115,159,231,111,163,175,192,134,171,254,93,19,169,255,82]},"announce":[],"urlList":[]}}