{"title":"Transient Analysis of Power Systems: Solution Techniques, Tools ","uid":12088356,"size":33262972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12216e2674157dcca929c104c351d922b100404c&amp;dn=Transient+Analysis+of+Power+Systems%3A+Solution+Techniques%2C+Tools+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NoctDeath","files":3,"time":1435961068,"description":"Title: Transient Analysis of Power Systems: Solution Techniques, Tools and Applications \nSeries: Wiley - IEEE \nAuthor: Juan A. Martinez-Velasco \nFormat: PDF \nHardcover: 648 pages \nPublisher: Wiley-IEEE Press; 1 edition (January 27, 2015) \nLanguage: English \nISBN: 978-1118352342 \n\n\nThe simulation of electromagnetic transients is a mature field that plays an important role in the design of modern power systems. Since the first steps in this field to date, a significant effort has been dedicated to the development of new techniques and more powerful software tools. Sophisticated models, complex solution techniques and powerful simulation tools have been developed to perform studies that are of supreme importance in the design of modern power systems. The first developments of transients tools were mostly aimed at calculating over-voltages. Presently, these tools are applied to a myriad of studies (e.g. FACTS and Custom Power applications, protective relay performance, simulation of smart grids) for which detailed models and fast solution methods can be of paramount importance.\n\nThis book provides a basic understanding of the main aspects to be considered when performing electromagnetic transients studies, detailing the main applications of present electromagnetic transients (EMT) tools, and discusses new developments for enhanced simulation capability.\n\nKey features:\n\nProvides up-to-date information on solution techniques and software capabilities for simulation of electromagnetic transients.\n\nCovers key aspects that can expand the capabilities of a transient software tool (e.g. interfacing techniques) or speed up transients simulation (e.g. dynamic model averaging).\n\nApplies EMT-type tools to a wide spectrum of studies that range from fast electromagnetic transients to slow electromechanical transients, including power electronic applications, distributed energy resources and protection systems. Illustrates the application of EMT tools to the analysis and simulation of smart grids","torrent":{"xt":"urn:btih:12216e2674157dcca929c104c351d922b100404c","amp;dn":"Transient+Analysis+of+Power+Systems%3A+Solution+Techniques%2C+Tools+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12216e2674157dcca929c104c351d922b100404c","infoHashBuffer":{"type":"Buffer","data":[18,33,110,38,116,21,125,204,169,41,193,4,195,81,217,34,177,0,64,76]},"announce":[],"urlList":[]}}