{"title":"Computing Fundamentals, IC3 Edition [PDF] [StormRG]","uid":11477187,"size":25908363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:123b9666c30e688dee48c934f88f511b60dfd9a9&amp;dn=Computing+Fundamentals%2C+IC3+Edition+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"steelballz","files":-1,"time":1416168929,"description":"Description\nComputing Fundamentals, IC3 Edition - [SRG]\nAuthor: Wempen, Faithe\nPublished:Oct. 6 2014\nPublisher:Wiley; IC3 ed edition\nISBN: 1118910133\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\n\nKick start your journey into computing and prepare for your IC3 certification\n\nWith this essential course book you'll be sending e-mails, surfing the web and understanding the basics of computing in no time. Written by Faithe Wempen, a Microsoft Office Master Instructor and author of more than 120 books, this complete guide to the basics has been tailored to provide comprehensive instruction on the full range of entry-level computing skills. It is a must for students looking to move into almost any profession, as entry-level computing courses have become a compulsory requirement in the modern world.\n\nThis great resource brings readers up to speed on computing basics, and helps them achieve competency on a computer quickly and easily. The book covers everything from computer hardware and software to the underlying functionality of a computer, and helps readers gain the skills and knowledge they need to move forward in their careers, or to successfully prepare for the IC3 Exam.\n\nLearn about computer hardware, software and other basic functions\nGet a full introduction to Windows and Microsoft Office\nCreate polished documents and presentations in Microsoft Excel, PowerPoint and Word 2010\nGain an understanding of web basics, connectivity, security and privacy\n\nWritten especially for students and those interested in learning more about computing, the book includes bonus questions, PowerPoint slides and bonus tasks to help put new skills into practice immediately.\n\nFrom the Back Cover\n\nMaster Basic Computing Skills and Prepare for the IC3 Exams\n\nComputing Fundamentals provides students with the basic computing knowledge and skills needed to get the most from their educational endeavors, regardless of field of study. Written by Microsoft Office Master Instructor Faithe Wempen, this detailed resource helps you develop a strong understanding of how computers work and how they affect our society. In addition to helping you master essential computing tasks such as working with operating systems, productivity applications, and the Internet, this book also provides you with all the knowledge you need for success on the IC3 exams.\n\nLearn the types of computer hardware and how they work together\nUnderstand operating systems and application software\nGet a complete introduction to WindowsÂ® 7, including customizing and troubleshooting\nMaster basic skills in MicrosoftÂ® Office applications, including Word, PowerPointÂ®, ExcelÂ®, and AccessÂ®\nUnderstand the essential technologies behind networking, the Internet, and the web\nLearn how to protect your online privacy and security\nExplore legal, ethical, and health issues of computing\n\nEach chapter includes a summary, list of key terms, and sample questions to help you master the content and prepare for the IC3 exams.\nAbout the Author\n\nFaithe Wempen, M.A., is a Microsoft Office Master Instructor and A+ certified computer technician, and the author of more than 120 books on computer hardware and software. An adjunct instructor of Computer Information Technology at Purdue University, she has also written and taught online technology courses that have educated over a quarter of a million students for corporate clients including Hewlett-Packard, CNET, and Sony","torrent":{"xt":"urn:btih:123b9666c30e688dee48c934f88f511b60dfd9a9","amp;dn":"Computing+Fundamentals%2C+IC3+Edition+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"123b9666c30e688dee48c934f88f511b60dfd9a9","infoHashBuffer":{"type":"Buffer","data":[18,59,150,102,195,14,104,141,238,72,201,52,248,143,81,27,96,223,217,169]},"announce":[],"urlList":[]}}