{"title":"Jesus in China (Christian Documentary)","uid":8825607,"size":1105050061,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:125831813b00482ca118679893c4b03b1729a871&amp;dn=Jesus+in+China+%28Christian+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"IndianChristian","files":7,"time":1376840454,"description":"Jesus in China (Christian Documentary)\n\n\nChristianity is blazing in China today. World Christian database already lists it as the third biggest christian country in the world today after USA and Brazil. This dvd shows the amazing things that God has been doing in China in the last few decades.\n\nFor the first time in history, Christianity in China, especially the House-Church, is given an honest and comprehensive account. The film answers the question raised by many people outside China: how did the number of Chinese Christians increase from 700,000 in 1949 to approximately 70 million today, despite communist control?\n\nUsing live footage and interviews, the film captures the true stories of many people and seeks to answer the most common questions: how does the Chinese government deal with Chinese Christians and vice-versa? How did Chinese Christians develop, survive and grow? What kind of people are they and what influence have they had and will have on Chinese society?\n\nThe documentary film The Cross-Jesus in China consists of four episodes:\n\nEpisode 1 - Seeds of Blood follows the bloody footprints of the Chinese missionaries of the older generation after the Boxer Rebellion, particularly, in the past fifty years. The stories of Mingdao Wang, John Sung, Watchman Nee, Allen Yuan, Samuel Lamb, Moses Xie, Yan Xinfei, and Epaphras are covered.\n\nEpisode 2 - The Bitter Cup abounds with compelling testimonies by missionaries of the younger generation. Their dedication, suffering, faithfulness, and thanksgiving have led to an unprecedented revival of the Chinese Christian church.\n\nEpisode 3 - The Spring of Life recounts the rebirth that the Gospel has brought to a broad spectrum of people in modern China. Included are testimonies from farmers, students, officials, criminals, orphans, actors, writers, scientists, and entrepreneurs.\n\nEpisode 4 - The Canaan Hymns tells the amazing story of a farm girl Xiao Min. She is a high school dropout with no musical training., Nevertheless, she created nearly a thousand hymns by the power of the Holy Spirit.\n\nAlso includes a rare bible distribution clip from Rural china.\n\nUnder the oppressive reign of an anti-God, anti-Christian regime, the church of Jesus Christ not only survives, but positively THRIVES! These testimonies of Chinese Christians are wonderfully weaved together in the first 3 documentaries to:\n\na) Demonstrate the power of the Christian gospel to feed the spiritual hunger of a nation hungry for God;\nb) Testify to the power of God in the Chinese church sprouting from the blood of martyrdom and persecution, and emerging as a force for social good in China; and\nc) Show the passion of Chinese Christian evangelists who doggedly and courageously fan out across this great nation to share the gospel of Christ.\n\nA &quot;must-have&quot; in every Christian home!\n\nRuntime: 4 parts of approx 50 mins each\nLanguage: English\nYear: 2003\nQuality: 8/10 \nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon(dot)com/The-Cross-Jesus-China-DVD/dp/B000HYZ0C2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon(dot)com/The-Cross-Jesus-China-DVD/dp/B000HYZ0C2&lt;/a&gt;\n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t","torrent":{"xt":"urn:btih:125831813b00482ca118679893c4b03b1729a871","amp;dn":"Jesus+in+China+%28Christian+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"125831813b00482ca118679893c4b03b1729a871","infoHashBuffer":{"type":"Buffer","data":[18,88,49,129,59,0,72,44,161,24,103,152,147,196,176,59,23,41,168,113]},"announce":[],"urlList":[]}}