{"title":"The Beatles - Public Domain tracks from 1963","uid":9628432,"size":120607478,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:12e3c7ac423992370e412bf7b9c0884de94880f8&amp;dn=The+Beatles+-+Public+Domain+tracks+from+1963&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1392635979,"description":"Some unreleased recordings by The Beatles weren't published by the EMI before 1 January 2014, and now they fell into the Public Domain in European Union. This is only a portion of them - feel free to redistribute it. You can find complete list of the PD-recordings by The Beatles on various blogs and forums.\n\n\n01. I Saw Her Standing There - Saturday Club, recorded: 21 May, aired: 25 May 1963,\n02. Boys - Saturday Club, recorded: 21 May, aired: 25 May 1963,\n03. Long Tall Sally - Saturday Club, recorded: 21 May, aired: 25 May 1963,\n04. Do You Want To Know A Secret - Pop Go The Beatles, rec. 24 May, air. 4 June\n05. Everybody's Trying To Be My Baby - Pop Go The Beatles, rec. 24 May, air. 4 June\n06. From Me To You - Eazy Beat, rec. 19 June, air. 23 June\n07. Too Much Monkey Business - Side By Side, rec. 4 April, air. 24 June\n08. Twist And Shout - Pop Go The Beatles, r. 17 June, a. 25 June\n09. A Shot Of Rhythm And Blues (Eazy Beat, r. 17 July, a. 21 July\n10. I'll Get You - Pop Go The Beatles, r. 16 July, a. 13 August\n11. She Loves You - Pop Go The Beatles, r. 16 July, a. 13 August\n12. You Really Got A Hold On Me - Pop Go The Beatles, r. 16 July, a. 13 August\n13. Misery - Pop Go The Beatles, r. 3 September, a. 17 September\n14. Christmas Lennon-McCartney Medley - Saturday Club, rec. 17 December, aired 21 December\n\n\nSound quality is good for the most of the tracks on this compilation, with the exception for a four rare recordings (04, 05, 09, 14), that are Lo-Fi.","torrent":{"xt":"urn:btih:12e3c7ac423992370e412bf7b9c0884de94880f8","amp;dn":"The+Beatles+-+Public+Domain+tracks+from+1963","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12e3c7ac423992370e412bf7b9c0884de94880f8","infoHashBuffer":{"type":"Buffer","data":[18,227,199,172,66,57,146,55,14,65,43,247,185,192,136,77,233,72,128,248]},"announce":[],"urlList":[]}}