{"title":"The Innocence Mission - Umbrella [1991] [EAC/FLAC]","uid":10570270,"size":286065741,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:12e522797c666fc6fbfc39c43729d3fb2f18a2a5&amp;dn=The+Innocence+Mission+-+Umbrella+%5B1991%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":-1,"time":1405566557,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: A&amp;M #AA7502153622\nCountry: USA\nYear: July 23, 1991\nGenre: pop,rock\nFormat: CD,Album\n\n\n\n\n\n1. And Hiding Away [3:34]\n2. Sorry And Glad Together [3:28]\n3. Umbrella [2:41]\n4. Every Hour Here [3:27]\n5. Evensong [3:42]\n6. Now In This Hush [4:25]\n7. Beginning The World [4:50]\n8. Flags [3:00]\n9. Someday Coming [4:03]\n10. Joan [3:23]\n11. Revolving Man [4:33]\n12. My Waltzing Days Are Over / Minta's Waltz [3:25]\n\n\n\nThe Innocence Mission's second album, like their debut, is soaked in the influence of 10,000 Maniacs. This time, however, it's fused with the newly popular sound of the Sundays, who exploded onto the music scene inbetween the two Innocence Mission records.\nIt might be easy to dismiss the band as a pack of shameless imitators, except that the band clearly has a vision which is truly original and startlingly mature. Karen Paris writes beautifully simple lyrics somehow packed with depth, like unmetered, spottily rhymed Emily Dickinson poems. The lyric sheet reads amazingly well sans music (better, even, than that of the band's 1995 album, Glow, which is otherwise superior). Her introspective word-watercolors are evocative minimalist paintings of unassuming subjects which aren't often tackled in pop music-suburban childhoods, housewives with unnecessary inferiority complexes, shy adults recalling autumn schooldays. Her voice is an excellent medium for those themes. Folk-rocker Peter Himmelman once aptly described her vocals as that of a &quot;pale ethereal child, sort of a voice of spirits, totally white.&quot; The chief problem with Umbrella, however, is the slightly overblown production by Larry Klein, who is a real pro with a terrific ear but also a softness for melodrama (a fault which also plagues his work on albums by his then-wife, Joni Mitchell). Klein's soaring keyboard chords and guitar reverb create an engaging environment, and he is only partially overreliant on the Sundays and Maniacs (those bands are, after all, two of the most influential in 1990s pop, even if they aren't often credited as such). But the sound is much too big for the little bits of little lives which Peris sings out.","torrent":{"xt":"urn:btih:12e522797c666fc6fbfc39c43729d3fb2f18a2a5","amp;dn":"The+Innocence+Mission+-+Umbrella+%5B1991%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12e522797c666fc6fbfc39c43729d3fb2f18a2a5","infoHashBuffer":{"type":"Buffer","data":[18,229,34,121,124,102,111,198,251,252,57,196,55,41,211,251,47,24,162,165]},"announce":[],"urlList":[]}}