{"title":"The Original Shannara Trilogy - Terry Brooks (epub mobi pdf)","uid":7684617,"size":12031931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12f9062990cf947fbf7883c4fb794434fdfe8f76&amp;dn=The+Original+Shannara+Trilogy+-+Terry+Brooks+%28epub+mobi+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Effloresce","files":-1,"time":1348913743,"description":"=== The Original Shannara Trilogy, by Terry Brooks ===\n\n1. The Sword of Shannara\n2. The Elfstones of Shannara\n3. The Wishsong of Shannara\n\nAll in pdf, mobi &amp; epub formats\n\n======================================================\nThe Sword of Shannara:\n\n\nLong ago, wars of ancient Evil ruined the world and forced \n\nmankind to compete with many other races - gnomes, trolls, \n\ndwarfs, and elves. In peaceful Shady Vale, half-elfin Shea \n\nOhmsford knows little of such troubles until giant, forbidding \n\nAllanon, with strange Druidic powers, reveals a supposedly-dead \n\nWarlock Lord plots to destroy the world. \n\nThe sole weapon against this Power of Darkness is the Sword of \n\nShannara, only usable by a true heir of Shannara. On Shea, last \n\nof the bloodline, rests the hope of all the races. Soon a Skull \n\nBearer, dread minion of Evil, flies into the Vale to kill Shea. \n\nTo save the Vale, Shea flees, drawing the Skull Bearer after him.\n\n======================================================\n\nThe Elfstones of Shannara:\n\n\nTerry Brooks' Shannara series has become a modern classic, and \n\nnow, 25 years after it was written, it is a must-have addition \n\nto your eBook library. For a limited time only, take advantage \n\nof this exciting opportunity -- buy Elfstones of Shannara and \n\nget The Sword of Shannara for free Sword of ShannaraLiving in \n\npeaceful Shady Vale, Shea Ohmsford knew little of the troubles \n\nthat plagued the rest of the world. Then the giant, forbidding \n\nAllanon revaled that the supposedly dead Warlock Lord was plotting \n\nto destory the world. The sole weapon against this Power of \n\nDarkness was the Sword of Shannara, which could only be used by \n\na true heir of Shannara--Shea being the last of the bloodline, \n\nupon whom all hope rested. Soon a Skull Bearer, dread minion of \n\nEvil, flew into the Vale, seeking to destroy Shea. To save the \n\nVale, Shea fled, drawing the Skull Bearer after him.... Elfstones \n\nof ShannaraAncient Evil threatens the Elves: The ancient tree \n\ncreated by long-lost Elven magic, is dying. When Wil Ohmsford is \n\nsummoned to guard the Amberle on a perilous quest to gather a new \n\nseed for a new tree, he is faced with the Reaper, the most fearsome \n\nof all Demons. And Wil is without power to control them...\n\n======================================================\n\nThe Wishsong of Shannara:\n\n\nThe Druid Allanon needs Brin Ohmsford to help win through the vile \n\ngrowth that protects the Ildatch, ancient source of evil--for only \n\nBrin holds the magic power of the wishsong, which can make plants \n\nbloom instantly, or turn trees to autumn gold.\n\n======================================================\n\nEffloresce~TPB.\n\n======================================================","torrent":{"xt":"urn:btih:12f9062990cf947fbf7883c4fb794434fdfe8f76","amp;dn":"The+Original+Shannara+Trilogy+-+Terry+Brooks+%28epub+mobi+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f9062990cf947fbf7883c4fb794434fdfe8f76","infoHashBuffer":{"type":"Buffer","data":[18,249,6,41,144,207,148,127,191,120,131,196,251,121,68,52,253,254,143,118]},"announce":[],"urlList":[]}}