{"title":"The Sacred Desert - Religion, Literature, Art and Culture (Philo","uid":10079965,"size":1203126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1323f2d350e15ab5db3b7a05db8837e6c73460f4&amp;dn=The+Sacred+Desert+-+Religion%2C+Literature%2C+Art+and+Culture+%28Philo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1398987143,"description":"You are alone now in spite of these stars,\nThe center is near you and far from you,\nYou have walked, you can walk, nothing changes anymore,\nAlways the same night that never ends,\nAnd behold you are already separated from yourself\nEven that same cry, but you do not hear it;\nAre you he who is dying, you who have no more anguish,\nAre you even lost, you who do not seek?\n... Yves Bonnefoy\n\n\nDavid Jasper, &quot;The Sacred Desert: Religion, Literature, Art and Culture&quot;\nBlackwell Publishing (2004) | English | ISBN: 1405119756 | 231 pages | PDF | 1.14 MB\n\nThe Sacred Desert is a fascinating and original work, which reflects on the role of the desert in theology, history, literature, art and film. Engaging with figures as diverse as Jesus, the early Christian Desert Fathers, William Blake, T.E. Lawrence, T.S. Eliot, Georgia O'Keeffe, Wim Wenders, Bill Viola, and Jim Crace, author David Jasper explores deserts as real places, as interior spaces and as they feature in numerous texts. He makes connections across millennia of desert texts, meditating on the mystical, religious and theological meanings that emerge. Underlying these interdisciplinary wanderings in the wasteland is the author's quest for a new form of religious thought and language. Lively and lucid, this outstanding work stretches from the Bible - perhaps still the greatest of our desert texts - through to contemporary experiences of the desert. It is truly an original work of theology, and a captivating journey through the history of religion.","torrent":{"xt":"urn:btih:1323f2d350e15ab5db3b7a05db8837e6c73460f4","amp;dn":"The+Sacred+Desert+-+Religion%2C+Literature%2C+Art+and+Culture+%28Philo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1323f2d350e15ab5db3b7a05db8837e6c73460f4","infoHashBuffer":{"type":"Buffer","data":[19,35,242,211,80,225,90,181,219,59,122,5,219,136,55,230,199,52,96,244]},"announce":[],"urlList":[]}}