{"title":"Don't Hurt People and Don't Take Their Stuff - Audiobook MP3","uid":10363107,"size":177250624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:133e81dd7445ec9ee6e1396f45d1d5041999287f&amp;dn=Don%27t+Hurt+People+and+Don%27t+Take+Their+Stuff+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1402838954,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nDon't Hurt People and Don't Take Their Stuff: A Libertarian Manifesto\n\nWritten by: Matt Kibbe\nNarrated by: John Pruden\nLength: 6 hrs and 7 mins\nFormat: Unabridged\nRelease Date:05-21-14\nProgram Type: Audiobook\n\nDon't Hurt People and Don't Take Their Stuff is a rational yet passionate argument that defends the principles upon which America was founded - principles shared by citizens across the political spectrum. The Constitution grants each American the right to self-determination, to be protected from others whose actions are destructive to their lives and property. Yet as Matt Kibbe shows, the political and corporate establishment consolidates its power by infringing upon our independence - from taxes to regulations to spying - ultimately eroding the ideals, codified in law, that have made the United States unique in history. Kibbe offers a surefire plan for reclaiming our inalienable rights and regaining control of our lives, grounded in six simple rules: don't hurt people, don't take people's stuff, take responsibility, work for it, mind your own business, and fight the power.","torrent":{"xt":"urn:btih:133e81dd7445ec9ee6e1396f45d1d5041999287f","amp;dn":"Don%27t+Hurt+People+and+Don%27t+Take+Their+Stuff+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"133e81dd7445ec9ee6e1396f45d1d5041999287f","infoHashBuffer":{"type":"Buffer","data":[19,62,129,221,116,69,236,158,230,225,57,111,69,209,213,4,25,153,40,127]},"announce":[],"urlList":[]}}