{"title":"Wyatt Woodsmall - Emotional Intelligence DVDRip","uid":12651450,"size":4388837204,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1343dbbe5ea736e8a61586880a94278d91258acd&amp;dn=Wyatt+Woodsmall+-+Emotional+Intelligence+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"acer47x","files":3,"time":1446142497,"description":"Emotional intelligence is the ability to sense, understand, and effectively apply the power and acumen of emotions \r\nas a source of human energy, information, connection and influence.  \r\n\r\nSeminar on Emotional Intelligence from an NLP and Spiral Dynamics perspective, and looking at the context of Leadership.\r\n\r\nAbout the Author:\r\nMarilyne Woodsmall, Ph.M., and Wyatt Woodsmall, Ph.D., are renowned behavioral modelers, international trainers, and experts in human typological research. \r\n\r\nFor 20 plus years they have synthesized their expertise and research in the areas of performance enhancement, learning, creativity, leadership, management science, Neuro-Linguistic Programming (NLP), and cultural change. \r\n\r\nKnown as the experts on experts(tm), they are the principals of Advanced Behavioral Modeling(tm), Inc., a consulting and training firm committed to increasing the performance and productivity of organizations and individuals using advanced behavioral science and learning technologies. \r\n\r\nThey co-created Advanced Behavioral Modeling(tm) Technology, a behavioral science change technology for capturing, explicating, replicating and transferring expertise. \r\n\r\nThey have pioneered its development and application in numerous fields and have designed model-based trainings to increase and maintain high performance levels in high stress situations in private and corporate sectors and in athletic competition. \r\n\r\nThe result: dramatically increased performance, reduced training time and slashed costs.\r\n\r\nThe Woodsmalls are experts in human typologies and created the International Research Institute for Human Typological Studies, specializing in research on human difference. \r\n\r\nThey emphasize the connection between human differences and performance and on the shaping of cultures to create high performance organizations and global cooperation. \r\n\r\nThey design and implement organizational and culture-shaping projects to strengthen the productivity of people and technology, integrating socio-technical values models. \r\n\r\nThese highly respected business consultants and international trainers have worked with Fortune 100 companies, governments, pioneering educators, top executives and managers, and world class athletes, including Olympic Medalists and Olympic Coaches. \r\n\r\nThey conduct trainings on five continents, including entrepreneurship, creativity, learning, leadership, values, culture-shaping, negotiations, coaching, People Patterns(tm), performance enhancement, and 37 nineteen day NLP Trainer's Trainings. \r\n\r\nIn the 80's the Woodsmalls created Learning How to Learn Technology(tm). \r\n\r\nTheir trainings are part of The CLWF Institute for Global Leadership (www.theclwf.org) whose mission is to develop enlightened global leaders capable of critical thinking, using new educational models and innovative technologies","torrent":{"xt":"urn:btih:1343dbbe5ea736e8a61586880a94278d91258acd","amp;dn":"Wyatt+Woodsmall+-+Emotional+Intelligence+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1343dbbe5ea736e8a61586880a94278d91258acd","infoHashBuffer":{"type":"Buffer","data":[19,67,219,190,94,167,54,232,166,21,134,136,10,148,39,141,145,37,138,205]},"announce":[],"urlList":[]}}