{"title":"Blender 3D - Architecture, Buildings, and Scenery{BBS}","uid":6642687,"size":12560534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:134b738d76b5f118f14ce2f95957e5fc485301b5&amp;dn=Blender+3D+-+Architecture%2C+Buildings%2C+and+Scenery%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1314809925,"description":"This book is about creating realistic models of building exteriors and interiors, and surrounding environment and scenery. This book is for architects, game designers, artists, or movie makers who want to create realistic buildings, interiors, and scenery using Blender 3D, a free, open-source graphics tool. This book is not a general introduction to Blender, but focuses on developing expertise on the architectural aspects of the tool. Readers need not have prior knowledge of Blender.\n\n\nThis book will show you how to create realistic architectural models in Blender. Blender is an open-source 3D animation program released as free software. It can be used for modeling, texturing, skinning, animating, and so on. It runs on all the important operating systems (including Windows, Mac, and Linux).\n\nYou can create natural scenery, landscapes, plants, various weather conditions, environmental factors, building materials such as wood, metal, brick, and more. You will also learn how to add people to different scenes as well as other objects to an already existing photograph or a video making it easier to increase its realism.\n\nYou will see how to use the final models to create simpler scenes for use in 3D games, where real-time rendering is necessary. You will also see how to use them to create the sets for animated movies.\nApproach\n\nThe book consists of a lot of exciting examples, which are shaped using the various features of Blender. It consists of step-by-step instructions leading you to realistic models of buildings, landscapes, and more. A collection of amazing screenshots will add up excitement to your learning experience. You can build realistic 3D models that can be used while creating different animation projects.\nProduct Details\n\n    * Paperback: 332 pages\n    * Publisher: Packt Publishing; First Edition edition (May 30, 2008)\n    * Language: English\n    * ISBN-10: 1847193676\n    * ISBN-13: 978-1847193674","torrent":{"xt":"urn:btih:134b738d76b5f118f14ce2f95957e5fc485301b5","amp;dn":"Blender+3D+-+Architecture%2C+Buildings%2C+and+Scenery%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"134b738d76b5f118f14ce2f95957e5fc485301b5","infoHashBuffer":{"type":"Buffer","data":[19,75,115,141,118,181,241,24,241,76,226,249,89,87,229,252,72,83,1,181]},"announce":[],"urlList":[]}}