{"title":"JavaScript JSON Cookbook (2015) (Pdf, Epub and Mobi) Gooner","uid":12521463,"size":6650652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13657009ee1f6c42f9e10bb9686092343f9e3bdb&amp;dn=JavaScript+JSON+Cookbook+%282015%29+%28Pdf%2C+Epub+and+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1443885895,"description":"Over 80 recipes to make the most of JSON in your desktop, server, web, and mobile applications\r\n\r\nAbout This Book\r\nCreate fast and dynamic JavaScript applications that implement JSON\r\nPractical examples to show you how to leverage JSON from a variety of application domains\r\nBecome the go-to person for building JSON-enabled web applications in your organization\r\nWho This Book Is For\r\nIf you're writing applications that move structured data from one place to another, this book is for you. This is especially true if you've been using XML to do the job because it's entirely possible that you could do much of the same work with less code and less data overhead in JSON.\r\n\r\nWhile the book's chapters make some distinction between the client and server sides of an application, it doesn't matter if you're a frontend, backend, or full-stack developer. The principles behind using JSON apply to both the client and the server, and in fact, developers who understand both sides of the equation generally craft the best applications.\r\n\r\nWhat You Will Learn\r\nLearn to use JSON in a type-safe way to avoid common data typing errors\r\nExchange data with NoSQL databases such as MongoDB and CouchDB with JSON\r\nMake the most of JSON in AJAX web applications, with or without a framework\r\nExchange data between servers and mobile applications running on Android and iOS with JSON\r\nPractical examples to show you how to leverage JSON from a variety of application domains\r\nIn Detail\r\nJSON (JavaScript Object Notation) is a lightweight text-based data interchange format used to create objects to transfer data over the Internet. It's widely used today by common web applications, as well as mobile applications.\r\n\r\nThis book gives you clear ways that you can exchange objects using JSON, regardless of whether you're developing a web or traditional networked application. You'll start with a brief refresher on JSON and JavaScript syntax and read and write on the client and server. Then, you'll learn how to use JSON in simple AJAX applications using AngularJS and jQuery. Next, you will learn how to exchange objects with databases using MongoDB and CouchDB. You'll also explore how to use JSON in a type-safe manner, writing programs that have fewer bugs","torrent":{"xt":"urn:btih:13657009ee1f6c42f9e10bb9686092343f9e3bdb","amp;dn":"JavaScript+JSON+Cookbook+%282015%29+%28Pdf%2C+Epub+and+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13657009ee1f6c42f9e10bb9686092343f9e3bdb","infoHashBuffer":{"type":"Buffer","data":[19,101,112,9,238,31,108,66,249,225,11,185,104,96,146,52,63,158,59,219]},"announce":[],"urlList":[]}}