{"title":"Chucho Valdes - Live at the Village Vanguard [FLAC] TQMP","uid":6336740,"size":366149415,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13e29a1d2c215e2df70749ffa337de9132febe46&amp;dn=Chucho+Valdes+-+Live+at+the+Village+Vanguard+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pastafari","files":-1,"time":1303499001,"description":"Chucho Valdes - Live at the Village Vanguard\n1999\n\nThere's a hurricane approaching from the Caribbean!\n\n* * * * * * * * * * * * * * * * * * *\n\nSince it opened over sixty years ago, The Village Vanguard has become the spiritual center of live jazz in America if not the world. Performances recorded &quot;Live at the Vanguard&quot; are highlights of almost every jazz label in the business. Over the years, Blue Note has issued sessions from the Vanguard by Sonny Rollins, Joe Henderson, Joe Lovano, Benny Green, Junko Onishi and others. Each of those releases capture something unique and ineffable which seems to be a result of inspiration and an other-worldly elevation of already highly-honed skills. When Chucho and his band rolled into the Vanguard in April '99 all of the elements were in place for another special event. Every set was sold out, crowds of disappointed latecomers milled outside on Seventh Avenue, trying to hear the sounds emanating from the famous basement club. For those who were lucky enough to witness the event and those who couldn't get in, this disc otters the finest of the eventful dates. \n\nStarting with &quot;Anubis&quot; and concluding in &quot;Lorraine's Habanera&quot; (the second tune Valdes has named after Lorraine Gordon, proprietor of the Village Vanguard), Chucho demonstrates his modus operandi. As a sonero, he improvises by collaging eclectic structures from the wide range of music he loves. It's as if he enjoys tearing away the labels of jazz, Latin, Afro-Cuban and European concert music. &quot;Son,&quot; Chucho says, &quot;is an antecedent of today's salsa music, and, like ragtime, the son blends African and European elements.&quot; Be prepared however - &quot;Son XXI&quot; is a moon-shot away from popular salsa. \n\nRegarding his own compositions, Chucho Valdes explains how he melds Cuban and jazz idioms with such finesse: &quot;There is one thing that is bilingual,&quot; he says, &quot;the eight chords that are purely Cuban, and the harmonics that are pure jazz.&quot; \n\nAlways retaining recognizable elements from earlier forms, Chucho Valdes is enough of an artist - postmodernist at that - to come up with his own recipes. So, while his ajiaco is like no other stew, its presentation is more than virtuosic.\n\nThe kind of elegance that permeates a Wifredo Lam canvas prevails in Chucho Valdes's compositions, especially on the solos. The architecture of that elegance builds ephemeral formations that implode and drift. Known as descargas, they are launched from a scaffolding of multiple and intersecting rhythms of a force typical to those burly Caribbean hurricanes. After these improvised jams with the band pulling out all stops, the air clears for awe and the moment when Chucho embarks yet again on another illuminating passage with echoes from Nat &quot;King&quot; Cole, Oscar Peterson, Cecil Taylor or McCoy Tyner. \n\nBy now collectors of Chucho Valdes CDs may see a pattern in the array of compositions, mostly his own, that he presents. Chucho wisely dedicates an original tune to a woman; in this case, Pia Lopez, wife of producer Rene Lopez is lauded. He tends to include a danzon and jazz standard. Here he puts the melody to &quot;My Funny Valentine&quot; over a danzon rhythm. Solo at first, Chucho tips his Kangol to the ever-young Bud Powell who winds up in the middle of a joyous mambo. He also tributes composer Arsenio Rodriguez, who popularized the son montuno, or salsa as it known now. Understand that Rodriguez's metaphor in &quot;How I Get The Yuca&quot; transcends farming. The dramatic lullaby &quot;Drume Negrita,&quot; Cuban creole for &quot;sleep, my little child,&quot; as rendered by Chucho's sister, Mayra Caridad Valdes, takes no prisoners. The last cut, an enchanting habanera, has many associations, but Valdes might offer up this bit of history: After slavery was abolished in Cuba, many former slaves traveled from eastern provinces to Havana. From Santiago de Cuba came the Haitian-French contradanza with tango elements; in Havana it became danza habanera. Seeing they were among an enormous number all trying to get work, many musicians sailed for New Orleans. Successful in joining African-American bands, their habaneras became the &quot;Latin tinge&quot; of the fledgling 1880s music that was to become jazz. \n\nHere, Chucho continues his mission to add African and Cuban elements to American jazz. Fluent in traditional forms and complex rhythms, some via Mozambique (Cubans participated in the independence struggle of the 1970s), bassist Francisco Rubio Pampin, percussionist Roberto Vizcaino Guillot and drummer Raul Pineda Roque, together with el maestro, raise the temperature to its tropical saturation point throughout, Chucho's hands crisscrossing the keys at the speed of a magician's are a flock of birds refracted by the piano's ebony mirror. \n\nSet after set, The Village Vanguard was sold out during Chucho Valdes's engagement. Be pleased. This recording lets you in, no cover, no minimum. \n- Zoe Anglesey (CD liner notes)\n\n* * * * * * * * * * * * * * * * * * *\n\nMusicians: \nChucho Valdes: acoustic piano\nFrancisco Rubio Pampin: acoustic bass\nRaul Pineda Roque: trap drums \nRoberto Vizcaino Guillot: conga &amp; bata drums\nMayra Caridad Valdes: vocalization\n\n* * * * * * * * * * * * * * * * * * *\n\nTracks\n01 - Anabis\n02 - Son XXI (Para Pia)\n03 - Punto Cubano\n04 - My Funny Valentine\n05 - To Bud Powell\n06 - Drume Negrita\n07 - Como Traigo La Yuca\n08 - Ponle La Clave\n09 - Encore - Lorraine's Habanera\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:13e29a1d2c215e2df70749ffa337de9132febe46","amp;dn":"Chucho+Valdes+-+Live+at+the+Village+Vanguard+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e29a1d2c215e2df70749ffa337de9132febe46","infoHashBuffer":{"type":"Buffer","data":[19,226,154,29,44,33,94,45,247,7,73,255,163,55,222,145,50,254,190,70]},"announce":[],"urlList":[]}}