{"title":"Actium 31 BC: Downfall of Antony and Cleopatra","uid":11786764,"size":42373052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:143f6e8c6275298dc4802a6884213d1211a24545&amp;dn=Actium+31+BC%3A+Downfall+of+Antony+and+Cleopatra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427780337,"description":"Osprey's examination of the Battle of Actium, which was the decisive confrontation of the Final War of the Roman Republic (32-30 BC). In 32 BC, the Roman Republic declared war on Egypt and set in motion a chain of events that would tear the Republic apart. In Rome, the forces of the western republic were marshaled together under Octavian (the future Emperor Augustus) and Marcus Agrippa. In the east, armies were gathered under the leadership of the famous lovers, Marc Antony and Cleopatra.\n\nOn September 2, 31 BC, the forces of Octavian and Marcus Agrippa managed to trap their enemies in the Gulf of Actium. Although Anthony and Cleopatra managed to escape, their army and navy, along with their hopes for victory were crushed. A few months later, the lovers would commit suicide. Their death saw the end of the war and the end of the Roman Republic. Now wielding supreme power, Octavian declared himself Emperor.\n\nActium has remained one of the most famous battles of the Ancient World thanks to its colorful cast of characters that have been reinvented by the writings of Shakespeare and the stars of the silver screen. This new book tells the true story of the decisive and bloody battle that would once and for all seal the fate of the Roman Republic","torrent":{"xt":"urn:btih:143f6e8c6275298dc4802a6884213d1211a24545","amp;dn":"Actium+31+BC%3A+Downfall+of+Antony+and+Cleopatra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"143f6e8c6275298dc4802a6884213d1211a24545","infoHashBuffer":{"type":"Buffer","data":[20,63,110,140,98,117,41,141,196,128,42,104,132,33,61,18,17,162,69,69]},"announce":[],"urlList":[]}}