{"title":"Photovoltaics System Design and Practice (gnv64)","uid":8784064,"size":27081135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14bda25a0c91b811db79836b8a1ba89740c8c41f&amp;dn=Photovoltaics+System+Design+and+Practice+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"gnv65","files":-1,"time":1375782860,"description":"Photovoltaics System Design and Practice\nby Heinrich Haberlin\nWiley | February 2012 | ISBN-10: 1119992850 | PDF | 732 pages | 25.8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Photovoltaics-System-Design-Practice-Heinrich/dp/1119992850&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Photovoltaics-System-Design-Practice-Heinrich/dp/1119992850&lt;/a&gt;\n\nWith the explosive growth in PV (photovoltaic) installations globally, the sector continues to benefit from important improvements in manufacturing technology and the increasing efficiency of solar cells. this timely handbook brings together all the latest design, layout and construction methods for entire PV plants in a single volume. Coverage includes procedures for the design of both stand-alone and grid-connected systems as well as practical guidance on typical operational scenarios and problems encountered for optimum PV plant performance.\n\nKey features:\n-    plant energy yield results from the author's own operational experience, with tables showing the measuring results of long-term monitoring data of up to 18 years and normalized representation of energy yield/production\n-    a discussion of the solar resource worldwide\n-    detailed treatment of the design and operation of solar cells for the reader to appreciate possible technical developments and improvements in the future\n-   a description of PV plant components such as solar modules, solar generators, accumulators, charge controllers and inverters,with emphasis on their optimum co-operation in the entire PV system in order to obtain the maximum possible energy yield and reliability\n-    in-depth coverage of the principles of lightning and overvoltage protection of PV plants\n-    guidelines on how to calculate the yield of grid-connected PV plants and the data needed for the calculations used in man locations across Europe, Africa, North and South America, Asia and Australia\n\nThis comprehensive resource will benefit electrical engineer and other electrical professionals in PV systems, especially designers and installers of PV plants or the product manufacturing and testing supply chain. Advanced students on renewable energy courses will find this useful background reading and it will be an invaluable desk reference for PV plant builders and owners.\n\nAbout the Author\nAfter earning a Masters degree in electrical engineering from ETH Zurich, Heinrich Hâ‚¬aberlin became a staff researcher at the ETH Microwave Lab. He earned a doctorate in 1978, From 1979 to 1980, Dr.Hâ‚¬aberlin headed a team at the Zellweger Company that worked on the development of hardware and software for microprocessor-based control of a complex short-wave radio system. In late1980 he was appointed a professor to the engineering school in Burgdorf, Switzerland, where from 1980 to 1988 besides electrical engineering he also taught computer science. Prof. Hâ‚¬aberlin has been actively involved in photovoltaics since 1987. In 1988 he established the Bern University of Applied Sciences Photovoltaics Lab, where he and his staff mainly investigate the behaviour of grid-connected systems. Prof. Hâ‚¬aberlin has been teaching photovoltaics at Bern University of Applied Sciences since 1989.\n\nCONTENTS\nForeword xiii\nPreface xv\nAbout the Author xvii\nAcknowledgements xix\nNote on the Examples and Costs xxi\nList of Symbols xxiii\n1 Introduction 1\n2 Key Properties of Solar Radiation 27\n3 Solar Cells: Their Design Engineering and Operating Principles 79\n4 Solar Modules and Solar Generators 127\n5 PV Energy Systems 223\n6 Protecting PV Installations Against Lightning 395\n7 Normalized Representation of Energy and Power of PV Systems 487\n8 PV Installation Sizing 507\n9 The Economics of Solar Power 553\n10 Performance Characteristics of Selected PV Installations 569\n11 In Conclusion. . . 623\nAppendix A: Calculation Tables and Insolation Data 633\nAppendix B: Links; Books; Acronyms; etc. 691\nIndex 697","torrent":{"xt":"urn:btih:14bda25a0c91b811db79836b8a1ba89740c8c41f","amp;dn":"Photovoltaics+System+Design+and+Practice+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14bda25a0c91b811db79836b8a1ba89740c8c41f","infoHashBuffer":{"type":"Buffer","data":[20,189,162,90,12,145,184,17,219,121,131,107,138,27,168,151,64,200,196,31]},"announce":[],"urlList":[]}}