{"title":"It's Not How Good You Are, Its How Good You Want to Be: The Worl","uid":8769503,"size":22782234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14e7b86aebda5c226abc72bfd086cd4daefb2910&amp;dn=It%27s+Not+How+Good+You+Are%2C+Its+How+Good+You+Want+to+Be%3A+The+Worl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"leopardog","files":1,"time":1375418451,"description":"It's Not How Good You Are, Its How Good You Want to Be: The World's Best Selling Book\nby Paul Arden\nPDF FORMAT\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/0714843377/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/0714843377/4353-20&lt;/a&gt;\n\nIt's Not How Good You Are, It's How Good You Want to Be is a handbook of how to succeed in the world - a pocket 'bible' for the talented and timid to make the unthinkable thinkable and the impossible possible. The world's top advertising guru, Paul Arden, offers up his wisdom on issues as diverse as problem solving, responding to a brief, communicating, playing your cards right, making mistakes and creativity, all notions that can be applied to aspects of modern life. This book provides a unique insight into the world of advertising and is a quirky compilation of quotes, facts, pictures, wit and wisdom, packed into easy-to-digest, bite-sized spreads. If you want to succeed in life or business, this is a must!\n\nPaul Arden began his career in advertising at the age of 16. For 14 years he was Executive Creative Director at Saatchi and Saatchi, where he was responsible for some of Britain's best known campaigns including British Airways, Silk Cut, Anchor Butter, InterCity and Fuji. His famous slogans include 'The Car in front is a Toyota' and 'The Independent - It is - Are You?'. In 1993 he set up the London-based production company Arden Sutherland-Dodd where he is now a commercials director for clients such as BT, BMW, Ford, Nestle and Levis.","torrent":{"xt":"urn:btih:14e7b86aebda5c226abc72bfd086cd4daefb2910","amp;dn":"It%27s+Not+How+Good+You+Are%2C+Its+How+Good+You+Want+to+Be%3A+The+Worl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14e7b86aebda5c226abc72bfd086cd4daefb2910","infoHashBuffer":{"type":"Buffer","data":[20,231,184,106,235,218,92,34,106,188,114,191,208,134,205,77,174,251,41,16]},"announce":[],"urlList":[]}}