{"title":"Superclass - David Rothkopf","uid":11715256,"size":990577,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14fc411113d7e67c74924a22f8d99f3f73125176&amp;dn=Superclass+-+David+Rothkopf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1424540599,"description":"\n\n\nEach of them is one in a million. They number six thousand on a planet of six billion. They run our governments, our largest corporations, the powerhouses of international finance, the media, world religions, and, from the shadows, the world's most dangerous criminal and terrorist organizations. They are the global superclass, and they are shaping the history of our time.\n \nToday's superclass has achieved unprecedented levels of wealth and power. They have globalized more rapidly than any other group. But do they have more in common with one another than with their own countrymen, as nationalist critics have argued? They control globalization more than anyone else. But has their influence fed the growing economic and social inequity that divides the world? What happens behind closeddoor meetings in Davos or aboard corporate jets at 41,000 feet? Conspiracy or collaboration? Deal-making or idle self-indulgence? What does the rise of Asia and Latin America mean for the conventional wisdom that shapes our destinies? Who sets the rules for a group that operates beyond national laws?\n \nDrawn from scores of exclusive interviews and extensive original reporting, Superclass answers all of these questions and more. It draws back the curtain on a privileged society that most of us know little about, even though it profoundly affects our everyday lives. It is the first in-depth examination of the connections between the global communities of leaders who are at the helm of every major enterprise on the planet and control its greatest wealth. And it is an unprecedented examination of the trends within the superclass, which are likely to alter our politics, our institutions, and the shape of the world in which we live.\n\nAbout the author:\n DAVID ROTHKOPF is the author of Running the World: The Inside Story of the National Security Council and the Architects of American Power . He is the president and chief executive officer of Garten Rothkopf, an international advisory firm. He teaches international affairs at Columbia University","torrent":{"xt":"urn:btih:14fc411113d7e67c74924a22f8d99f3f73125176","amp;dn":"Superclass+-+David+Rothkopf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14fc411113d7e67c74924a22f8d99f3f73125176","infoHashBuffer":{"type":"Buffer","data":[20,252,65,17,19,215,230,124,116,146,74,34,248,217,159,63,115,18,81,118]},"announce":[],"urlList":[]}}