{"title":"Engineering Materials 1 - An lntroduction to their Properties an","uid":12128004,"size":11269574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15091e2fe1d78fbb7d27e76c5d5c9993d91c4568&amp;dn=Engineering+Materials+1+-+An+lntroduction+to+their+Properties+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1436973269,"description":"Engineering Materials 1 - An lntroduction to their Properties and Applications 2nd ed - D. R. H. Jones, Michael F. Ashby (Elsevier-BH, 1996).pdf\n\nISBN: 0750630817\n\nThis book gives a broad introduction to the properties of materials used in engineering applications and is intended to provide a course in engineering materials for engineering students with no previous background in the subject. Engineering disasters are frequently caused by the misuse of materials and so it is vital that every engineer should understand the properties of these materials, their limitations and how to select materials which best fit the demands of his design.\n\nThe chapters are arranged in groups, each group describing a particular class of properties: the Elastic Moduli; the Fracture Toughness; Resistance to Corrosion; and so forth. Each group of chapters starts by defining the property, describing how it is measured, and providing a table of data for solving problems involving the selection and use of materials. Then the basic science underlying each property is examined to provide the knowledge with which to design materials with better properties. Each chapter group ends with a case study of practical application and each chapter ends with a list of books for further reading. To further aid the student, there are sets of examples (with answers) at the end of the book intended to consolidate or develop a particular point covered in the text. There is also a list of useful aids and demonstrations (including how to prepare them) in order to facilitate teaching of the material","torrent":{"xt":"urn:btih:15091e2fe1d78fbb7d27e76c5d5c9993d91c4568","amp;dn":"Engineering+Materials+1+-+An+lntroduction+to+their+Properties+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15091e2fe1d78fbb7d27e76c5d5c9993d91c4568","infoHashBuffer":{"type":"Buffer","data":[21,9,30,47,225,215,143,187,125,39,231,108,93,92,153,147,217,28,69,104]},"announce":[],"urlList":[]}}