{"title":"Interest Rate Models - Theory and Practice, With Smile, Inflatio","uid":10295523,"size":7271573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1566a1b9414f7448cf799cd11ca6059602688c6e&amp;dn=Interest+Rate+Models+-+Theory+and+Practice%2C+With+Smile%2C+Inflatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1401913052,"description":"ABOUT THIS BOOK\nThe 2nd edition of this successful book has been extensively updated and expanded. The book offers a balance between the practitioner's viewpoint and the theoretical viewpoint. In contrast to other academic books on interest rate modelling which deal with HJM formulation, the text reflects the current market emphasis on LIBOR and Swap market models.\n\nThe book brings the practitioner's viewpoint together with the theoretical viewpoint. Mathematics is kept to an appropriate minimum; the book includes many numerical examples, while remaining both rigorous and understandable.\n\nConsiderable new material has been added. A discussion of historical estimation of the instantaneous correlation matrix and of rank reduction is new in this edition, and a LIBOR-model consistent swaption-volatility interpolation technique has been introduced.\n\nAdditional new material includes sections on local-volatility dynamics; a new chapter addressing the fast-growing interest in hybrid products, with a special focus on the pricing of inflation-linked derivatives; and three new chapters devoted to credit, discussing Credit Derivatives, including Credit Def","torrent":{"xt":"urn:btih:1566a1b9414f7448cf799cd11ca6059602688c6e","amp;dn":"Interest+Rate+Models+-+Theory+and+Practice%2C+With+Smile%2C+Inflatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1566a1b9414f7448cf799cd11ca6059602688c6e","infoHashBuffer":{"type":"Buffer","data":[21,102,161,185,65,79,116,72,207,121,156,209,28,166,5,150,2,104,140,110]},"announce":[],"urlList":[]}}