{"title":"Beethoven - The 9 Symphonies (Abbado)","uid":5143542,"size":1552239499,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:159b9a260977f18323e683a77e1960a641862d9a&amp;dn=Beethoven+-+The+9+Symphonies+%28Abbado%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"sheila6","files":-1,"time":1257091474,"description":"This is Claudio Abbado's first Beethoven symphony cycle, and it has come in for some astonishingly negative criticism over the years. Most of that criticism seems to judge the cycle a failure because it doesn't offer new insights into what Beethoven's symphonies are about. But I can't agree, probably because I don't subscribe to a &quot;progressive&quot; critical ideology that insists on novelty as a prerequisite for artistic performance (&amp; recording). And maybe even Abbado has come around to that kind of ideologized thinking: his second cycle (also on DGG, but with the Berlin Philharmonic) is based on the new Jonathan Del Mar (Barenreiter) edition of the scores and reflects Beethoven performance style(s) pioneered by the likes of Roger Norrington, Nikolaus Harnoncourt and others. \n\nI don't have anything against fresh thinking when it comes to performing Beethoven, nor do I worship at the altar of tradition. In fact, I'm delighted by Harnoncourt's recordings, and think that Simon Rattle's EMI set, which also uses the Del Mar/Barenreiter scores, has been woefully under-appreciated. (And I think Rattle's cycle is far and away more convincing than Abbado's second, Berlin set.) But there's always going to be room for traditionalist (old scores, big orchestras, modern instruments) performances of Beethoven, particularly when they are executed as cogently and convincingly as they are in Abbado's Vienna Philharmonic cycle. \n\nClearly, this cycle, digitally recorded in the mid-1980s, owes just about everything to what we have come to think of as mainstream, Central European music-making: orchestral sound is full and warm, tempi are urgent but often broad, phrasing and voicing reflect a Viennese performance &quot;grammar&quot; developed over a 100 year period by conductors like Mahler and Weingartner and Krauss and Furtwaengler and Karajan and Boehm. Just to mention those names indicates a wide variety of expressive variation within the core grammar, but still, variations within a coherently identifiable tradition. That tradition may now have come to an end: in a DVD included with Rattle's Vienna set, Sir Simon says the orchestra came to him for something new after realizing that all of the old maestros had passed on and taken the tradition with them. If this is true, Abbado's DGG Vienna Beethoven cycle may represent the last chapter of the old style. And if so, we are lucky that the tradition ended in Abbado's capable hands and was so beautifully captured by DGG's engineering team. (Note: these digital recordings establish once and for all, to my mind, that digital sound need not be harsh and flat and kleig-lit; sound quality here is beautifully rich and full.) \n\nFinal word of a long rant: if you're not put off by what we now need to call &quot;middle of the road&quot; Beethoven, and you're looking for a first-rate example of the incomparable Vienna Beethoven tradition, you can't do better than this set.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:159b9a260977f18323e683a77e1960a641862d9a","amp;dn":"Beethoven+-+The+9+Symphonies+%28Abbado%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159b9a260977f18323e683a77e1960a641862d9a","infoHashBuffer":{"type":"Buffer","data":[21,155,154,38,9,119,241,131,35,230,131,167,126,25,96,166,65,134,45,154]},"announce":[],"urlList":[]}}