{"title":"Heroic Armor of the Italian Renaissance - Filippo Negroli and hi","uid":8387889,"size":75687606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15bf057894b2e81743ea0ffa47390717d36a629a&amp;dn=Heroic+Armor+of+the+Italian+Renaissance+-+Filippo+Negroli+and+hi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1366332868,"description":"Heroic Armor of the Italian Renaissance: Filippo Negroli and his Contemporaries\n0870998722 | 1998 | PDF | 370 pages | English | 72,18 Mb\n\n\nThe second quarter of the sixteenth century witnessed the emergence of a new fashion of armor design based on the forms and ornament found in classical art. Embossed in high relief, richly gilt, and damascened in gold and silver, these lavish parade armors all'antica were worn by Renaissance kings and captains who wished to project an aura of power and virtue by arraying themselves like the heroes of ancient Roman history and mythology. The re-creation of classically inspired armor is invariably associated with Filippo Negroli, the most innovative and celebrated of the renowned armorers of Milan. Within the Negroli family of armorers, Filippo was the best known of his extremely successful generation, which included his brother Francesco, a skilled damascener in the service of Emperor Charles V, and his cousin Giovan Paolo, a talented master who provided armor to the French court. From large numbers of recently uncovered documents in the state, civic, and ecclesiastical archives of Milan, details have been gleaned of Negroli family members, their workshops and employees, marriages and deaths, property and testamentary arrangements, and business dealings with clients and fellow armorers. A digest of the documents is included, and a brief, cogent discussion of the manufacture and commerce of arms in sixteenth-century Milan provides a context for the work of these talented artists. The core of the book is a thorough reexamination of all the armors signed by Filippo Negroli. Additional works are attributed to him, and lost works are identified. The authors confirm the attribution of two magnificently damascened armors to Francesco Negroli, and they present Giovan Paolo Negroli's single signed work along with pieces they consider to be his. Each armor is described, illustrated, and placed in the context of the maker's oeuvre; its history of ownership is discussed; and its treatment in the critical literature is assessed.","torrent":{"xt":"urn:btih:15bf057894b2e81743ea0ffa47390717d36a629a","amp;dn":"Heroic+Armor+of+the+Italian+Renaissance+-+Filippo+Negroli+and+hi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15bf057894b2e81743ea0ffa47390717d36a629a","infoHashBuffer":{"type":"Buffer","data":[21,191,5,120,148,178,232,23,67,234,15,250,71,57,7,23,211,106,98,154]},"announce":[],"urlList":[]}}