{"title":"Computer Hacking Forensics Investigator- Study Guide{BBS}","uid":6622669,"size":12818170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15cdb1b17e8afd0be95fef57bea1433618364ddc&amp;dn=Computer+Hacking+Forensics+Investigator-+Study+Guide%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314053258,"description":"This is the only official, EC-Council-endorsed CHFI (Computer Hacking Forensics Investigator) study guide. It was written for security professionals, systems administrators, IT consultants, legal professionals, IT managers, police and law enforcement personnel studying for the CHFI certification, and professionals needing the skills to identify an intruder's footprints and properly gather the necessary evidence to prosecute. Key features include:\n\n. The Only Official Study Guide for CHFI\nProvides 100% coverage of all exam objectives.\n. Full Web-based Exam\nModeled after the real exam, it also includes explanations of correct and incorrect answers.\n. Exam Objectives\nEach is clearly explained at the beginning of the chapter.\n. Notes and Alerts\nHighlight crucial points of the exam modules.\n. Exam Objectives Fast Track\nBulleted highlights emphasize the important points from the exam's perspective at the end of the chapter.\n. Key Terms\nAll concepts are defined and explained as they appear.\n. Exam Objectives Frequently Asked Questions\nTest what you have learned by reading FAQs based on the material covered in the chapter. Log on to the Syngress Web site to access review questions based on the exam.\nAbout the Author\nDave Kleiman (CAS, CCE, CIFI, CISM, CISSP, ISSAP, ISSMP, MCSE) has worked in the Information Technology Security sector since 1990. Currently, he is the owner of SecurityBreachResponse.com, and is the Chief Information Security Officer for Securit-e-Doc, Inc. Before starting this position, he was Vice President of Technical Operations at Intelliswitch, Inc., where he supervised an international telecommunications and Internet service provider network. Dave is a recognized security expert. A former Florida Certified Law Enforcement Officer, he specializes in computer forensic investigations, incident response, intrusion analysis, security audits, and secure network infrastructures. He has written several secure installation and configuration guides about Microsoft technologies that are used by network professionals. He has developed a Windows Operating System lockdown tool, S-Lok (www.s-doc.com/products/slok.asp ), which surpasses NSA, NIST, and Microsoft Common Criteria Guidelines. Dave was a contributing author to Microsoft Log Parser Toolkit (Syngress Publishing, ISBN: 1-932266-52-6). He is frequently a speaker at many national security conferences and is a regular contributor to many security-related newsletters, Web sites, and Internet forums. Dave is a member of several organizations, including the International Association of Counter Terrorism and Security Professionals (IACSP), International Society of Forensic Computer ExaminersÃ‚Â® (ISFCE), Information Systems Audit and Control AssociationÃ‚Â® (ISACA), High Technology Crime Investigation Association (HTCIA), Network and Systems Professionals Association (NaSPA), Association of Certified Fraud Examiners (ACFE), Anti Terrorism Accreditation Board (ATAB), and ASIS InternationalÃ‚Â®. He is also a Secure Member and Sector Chief for Information Technology at The FBI's InfraGardÃ‚Â® and a Member and Director of Education at the International Information Systems Forensics Association (IISFA).\n\n\n\n    * Paperback: 843 pages\n    * Publisher: Syngress; Stg edition (October 8, 2007)\n    * Language: English\n    * ISBN-10: 1597491977\n    * ISBN-13: 978-1597491976","torrent":{"xt":"urn:btih:15cdb1b17e8afd0be95fef57bea1433618364ddc","amp;dn":"Computer+Hacking+Forensics+Investigator-+Study+Guide%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15cdb1b17e8afd0be95fef57bea1433618364ddc","infoHashBuffer":{"type":"Buffer","data":[21,205,177,177,126,138,253,11,233,95,239,87,190,161,67,54,24,54,77,220]},"announce":[],"urlList":[]}}