{"title":"Fable The Journey [XBOX360] [RF]","uid":7674162,"size":8738846763,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:16b2cab26cdfa72f7277d3bcb29e1199955a6008&amp;dn=Fable+The+Journey+%5BXBOX360%5D+%5BRF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"thenoobish","files":2,"time":1348655006,"description":"Language: English\n\nRegion Free.\n\nSet fifty years after the events of Fable III, the player controls a normal Dweller named Gabriel who has been separated from his tribe. Gabriel comes across Theresa, who has been wounded by a darkness called The Corruption. The Corruption is taking over Albion, and Gabriel must take her to the Tattered Spire to restore her power.\nThe game takes place throughout large portions of Albion. The events of Fable III are still felt during Fable: The Journey. According to developers, Fable: The Journey will read previous Fable III save files and change the game world accordingly. Details about loading these saves remains unclear.\nPlayer decisions will also affect the character's horse who drives the player's carriage throughout the game. If you spur your horse forward quickly with a whip, the horse's health may deteriorate. Alternatively, if you treat your horse well, it may exhibit a healthy glow. According to information revealed at E3 2012, the horse may even learn specific voice commands used when you spur it forward.\nIt has been confirmed that this entry in the franchise does not deal with the ancient Archon bloodline featured in past entries.","torrent":{"xt":"urn:btih:16b2cab26cdfa72f7277d3bcb29e1199955a6008","amp;dn":"Fable+The+Journey+%5BXBOX360%5D+%5BRF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b2cab26cdfa72f7277d3bcb29e1199955a6008","infoHashBuffer":{"type":"Buffer","data":[22,178,202,178,108,223,167,47,114,119,211,188,178,158,17,153,149,90,96,8]},"announce":[],"urlList":[]}}