{"title":"of Montreal - Innocence Reaches (2016) [16.44 FLAC]","uid":15419645,"size":400162721,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16c6e443a18a6d22d7ae3746ee21d7931945ee71&amp;dn=of+Montreal+-+Innocence+Reaches+%282016%29+%5B16.44+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":13,"time":1469621476,"description":"\n  of Montreal - Innocence Reaches (2016) [16.44 FLAC]\r\n\r\n  Genre: Rock\r\n  Styles: Indie, Alternative, Psychedelic \r\n  Source: WEB\r\n  Codec: FLAC\r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Let's Relate\r\n  02 Different for Girls\r\n  03 Gratuitous Abysses\r\n  04 My Fair Lady\r\n  05 Les Chants de Maldoror\r\n  06 A Sport and a Pastime\r\n  07 Ambassador Bridge\r\n  08 Def Pacts\r\n  09 Chaos Arpeggiating\r\n  10 Nursing Slopes\r\n  11 Trashed Exes\r\n  12 Chap Pilot\r\n\r\n  The brainchild of singer/guitarist Kevin Barnes, Of Montreal was among the second wave of bands to emerge from the sprawling Elephant 6 collective. A native of Athens, Georgia, Barnes was inspired to form the euphoric indie pop group in the wake of a broken romance with a woman from Montreal. He signed with Bar/None Records while living in Florida, subsequently moved to Cleveland and Minneapolis in search of compatible bandmates, and finally returned home to collaborate with bassist Bryan Helium (also a member of Athens' Elf Power) and drummer Derek Almstead.\r\n\r\n  Of Montreal's debut album, Cherry Peel, appeared in mid-1997, followed that autumn by an EP entitled The Bird Who Continues to Eat the Rabbit's Flower. From the start, the band buoyed its bright, flamboyant indie pop sound with elements of psychedelia and vaudeville; Of Montreal's earliest records also exhibited a lo-fi sound that bordered on twee pop, although the band steadily shed those influences throughout the early 2000s. After Helium left the group in 1998 to focus on Elf Power full-time, Almstead assumed bass duties, while keyboardist Dottie Alexander and drummer Jamie Huggins both joined the lineup. Nevertheless, the band's second album, 1998's The Bedside Drama: A Petite Tragedy, was recorded primarily as a Barnes solo project.\r\n\r\n  Multi-instrumentalist A.C. Forrester signed on for 1999's sublime The Gay Parade, while the retrospective album Horse &amp; Elephant Eatery followed in the spring of 2000. The group continued with the release of Coquelicot Asleep in the Poppies: A Variety of Whimsical Verse in April 2001 and Aldhils Arboretum in September of 2002, both of which were issued by the Georgia-based label Kindercore Records. With the subsequent folding of Kindercore, the departures of multi-instrumentalist Andy Gonzales and Almstead, and Barnes' marriage, 2003 proved to be an up-and-down year for the group. Barnes' wife, Nina, joined Of Montreal's lineup as the group signed to Polyvinyl Records and delivered one of its most celebrated records, Satanic Panic in the Attic, in early 2004.\r\n\r\n  The following year found Barnes exploring a bouncier, synth-driven avenue with the release of Sunlandic Twins, but things began to get complicated in his personal life at the same time. He and his wife moved to Norway for the birth of their baby. Deprived of familiar touchstones, Barnes fell into a deep depression and, upon returning to the States, continued to travel progressively downhill. He and his wife separated for a time, and she returned to her family in Norway with their new daughter. Through the emotional turmoil, Barnes concocted what was to be his darkest, most personal, and ambitious album yet -- Hissing Fauna, Are You the Destroyer? -- in 2007.\r\n\r\n  Arriving one year later, Skeletal Lamping furthered that ambitious sound by emphasizing Barnes' outrageous alter ego &quot;Georgie Fruit,&quot; whose influence pushed the album toward funk and prog territory. An Eluardian Instance (Jon Brion Remix EP) followed in early 2009, featuring five remixed tracks from the previous album. Of Montreal's tenth studio release, False Priest, arrived the following year and featured cameos from fellow genre-hoppers Janelle Monáe and Solange Knowles. Songs written for that album but not used saw the light of day in April of 2011 with the release of an EP entitled thecontrollersphere. The following year Barnes revisited the raw emotion of Hissing Fauna with the album Paralytic Stalks, exploring themes of self-loathing, revenge, and romantic turmoil to create Of Montreal's most personal offering yet. At the end of 2012, the band issued the Daughter of Cloud compilation, a collection of unreleased B-sides and outtakes from 2008-2011.\r\n\r\n  Arriving in 2013, the full-length Lousy with Sylvianbriar was a huge departure for Barnes' project, finding him recording live to tape with a host of studio musicians, making an album's worth of roots rock-styled compositions indebted to the influence of Neil Young, the Rolling Stones, and other '70s FM radio superstars. After separating from his wife of ten years and touring heavily into 2014, Barnes took a two-week break in New York City in the spring and wrote much of the material for his 13th record, Aureate Gloom. The history of the '70s CBGB music scene and the aftermath of his separation inspired the album's raw, confessional lyrics and punk rock edge. Recorded at Sonic Ranch Studios outside of El Paso, Texas with the same core group of musicians as Lousy with Sylvianbriar -- keyboardist Jojo Glidewell, guitarist Bennett Lewis, bassist Bob Parins, and drummer Clayton Rychlik -- it was released in early 2015. The group's first live recording, the 19-track Snare Lustrous Doomings, which captured October 2014 performances in Portland and San Francisco with the same lineup, was released later in 2015. The following summer saw Barnes and company embrace an updated glam pop for Innocence Reaches, their 14th studio album and ninth with Polyvinyl","torrent":{"xt":"urn:btih:16c6e443a18a6d22d7ae3746ee21d7931945ee71","amp;dn":"of+Montreal+-+Innocence+Reaches+%282016%29+%5B16.44+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c6e443a18a6d22d7ae3746ee21d7931945ee71","infoHashBuffer":{"type":"Buffer","data":[22,198,228,67,161,138,109,34,215,174,55,70,238,33,215,147,25,69,238,113]},"announce":[],"urlList":[]}}