{"title":"Christopher West - Theology of the Body for Beginners","uid":15615259,"size":1719878,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:170a64e9b76763d439f160a53a33d7f25e771b5a&amp;dn=Christopher+West+-+Theology+of+the+Body+for+Beginners+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"catholicstuff","files":5,"time":1471825991,"description":"Christopher West - Theology of the Body for Beginners: A Basic Introduction to Pope John Paul II's Sexual Revolution (EPUB, MOBI, AZW3, PDF)\r\n\r\nBroken families, abortion, AIDS, Internet pornography, sexual abuse scandals, homosexual marriage, our Church and our world are in the midst of a profound sexual crisis. Is there a way out? For such a time as this have we been given Pope John Paul II's Theology of the Body. Based on the words of Jesus, John Paul II's famous reflections on the body and sex take us to the root of the modern crisis and chart the path to an authentic sexual liberation. Yet the Pope's dense scholarship often intimidates the average person. In his book, Theology of the Body Explained, Christopher West offered a more detailed, six-hundred page commentary on John Paul II's Theology of the Body. Here, he provides a short and popular summary of the Pope's revolutionary teaching. What is the meaning of life? Why did God create us male and female? Why is there evil in the world and how do we overcome it? How do we attain true happiness on earth? What kind of joys await us in heaven? How can we experience the love we long for in the depth of our hearts? The first edition of Theology of the Body for Beginners (2004) quickly became an international best-seller. This freshly revised and expanded edition is based on Dr. Michael Waldstein's much improved translation of John Paul II'­s catechesis. New for this edition: All quotations have been updated with the new translation. Key insights discovered through Dr. Waldstein's access to the John Paul II archives have been incorporated. The outline of the text has been substantially reorganized to reflect the newly discovered outline of John Paul's original manuscript. John Paul's hidden and previously untranslated addresses are summarized.\r\n\r\nPlease seed!\r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.se/user/catholicstuff/","torrent":{"xt":"urn:btih:170a64e9b76763d439f160a53a33d7f25e771b5a","amp;dn":"Christopher+West+-+Theology+of+the+Body+for+Beginners+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"170a64e9b76763d439f160a53a33d7f25e771b5a","infoHashBuffer":{"type":"Buffer","data":[23,10,100,233,183,103,99,212,57,241,96,165,58,51,215,242,94,119,27,90]},"announce":[],"urlList":[]}}