{"title":"Fleetwood Mac - Tusk (1979) 2011 HDTracks 24-192-FLAC","uid":11029276,"size":2687728376,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1728e27ac3d18d6f1b5ec58d62008be8d9c32fbd&amp;dn=Fleetwood+Mac+-+Tusk+%281979%29+2011+HDTracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"hal4000","files":-1,"time":1410656326,"description":"While most bands undergo a number of changes over the course of their careers, few groups experienced such radical stylistic changes as Fleetwood Mac. Initially conceived as a hard-edged British blues combo in the late '60s, the band gradually evolved into a polished pop/rock act over the course of a decade. Throughout all of their incarnations, the only consistent members of Fleetwood Mac were drummer Mick Fleetwood and bassist John McVie -- the rhythm section that provided the band with its name. Ironically, they had the least influence over the musical direction of the band. Originally, guitarists Peter Green and Jeremy Spencer provided the band with its gutsy, neo-psychedelic blues-rock sound, but as both guitarists descended into mental illness, the group began moving toward pop/rock with the songwriting of pianist Christine McVie. By the mid-'70s, Fleetwood Mac had relocated to California, where they added the soft rock duo of Lindsey Buckingham and Stevie Nicks to their lineup. Obsessed with the meticulously arranged pop of the Beach Boys and the Beatles, Buckingham helped the band become one of the most popular groups of the late '70s. Combining soft rock with the confessional introspection of singer/songwriters, Fleetwood Mac created a slick but emotional sound that helped 1977's Rumours become one of the biggest-selling albums of all time. The band retained its popularity through the early '80s, when Buckingham, Nicks, and Christine McVie all began pursuing solo careers. The band reunited for one album, 1987's Tango in the Night, before splintering in the late '80s. Buckingham left the group initially, but the band decided to soldier on, releasing one other album before Nicks and McVie left the band in the early '90s, hastening the group's commercial decline.\n\nMore than any other Fleetwood Mac album, Tusk is born of a particular time and place -- it could only have been created in the aftermath of Rumours, which shattered sales records, which in turn gave the group a blank check for its next album. But if they were falling apart during the making of Rumours, they were officially broken and shattered during the making of Tusk, and that disconnect between bandmembers resulted in a sprawling, incoherent, and utterly brilliant 20-track double album. At the time of its release, it was a flop, never reaching the top of the charts and never spawning a true hit single, despite two well-received Top Ten hits. Coming after the monumental Rumours, this was a huge disappointment, but the truth of the matter is that Fleetwood Mac couldn't top that success no matter how hard they tried, so it was better for them to indulge themselves and come up with something as unique as Tusk. Lindsey Buckingham directed both Fleetwood Mac and Rumours, but he dominates here, composing nearly half the album, and giving Christine McVie's and Stevie Nicks' songs an ethereal, floating quality that turns them into welcome respites from the seriously twisted immersions into Buckingham's id. This is the ultimate cocaine album -- it's mellow for long stretches, and then bursts wide open in manic, frantic explosions, such as the mounting tension on &quot;The Ledge&quot; or the rampaging &quot;That's Enough for Me,&quot; or the marching band-driven paranoia of the title track, all of which are relieved by smooth, reflective work from all three songwriters. While McVie and Nicks contribute some excellent songs, Buckingham owns this record with his nervous energy and obsessive production, winding up with a fussily detailed yet wildly messy record unlike any other. This is mainstream madness, crazier than Buckingham's idol Brian Wilson and weirder than any number of cult classics. Of course, that's why it bombed upon its original release, but Tusk is a bracing, weirdly affecting work that may not be as universal or immediate as Rumours, but is every bit as classic. As a piece of pop art, it's peerless.\n\nHDTracks-PCM-24Bit-192Khz.","torrent":{"xt":"urn:btih:1728e27ac3d18d6f1b5ec58d62008be8d9c32fbd","amp;dn":"Fleetwood+Mac+-+Tusk+%281979%29+2011+HDTracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1728e27ac3d18d6f1b5ec58d62008be8d9c32fbd","infoHashBuffer":{"type":"Buffer","data":[23,40,226,122,195,209,141,111,27,94,197,141,98,0,139,232,217,195,47,189]},"announce":[],"urlList":[]}}