{"title":"Great Crimes And Trials Collection 2 06of23 Caryl Chessman 1993 ","uid":10767911,"size":290801444,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:17300b6bd8e676caee6ebc9f16a26fb46d1239e0&amp;dn=Great+Crimes+And+Trials+Collection+2+06of23+Caryl+Chessman+1993+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"MVGroup","files":-1,"time":1408049879,"description":"Great Crimes and Trials: Collection 2\n\nHistory Documentary hosted by Robert Powell, published by Network in 1993 - English narration\n\n\nInformation\n------------------------------\n\nGreat Crimes and Trials: Collection 2\nAt last for the first time here is a major new series of the most extraordinary stories behind the greatest crimes and trials of this century. True stories carefully researched and reconstructed with actual archive footage. Cases which have become almost legendary in the annals of crime and detection.\nNarrated by Robert Powell, Great Crimes and Trials combines new and archive interviews to reconstruct each story, analysing the individual and his motive, explaining how the crime was committed and showing breakthroughs in investigations alongside details of the trial.\n\n\n1)  Charles Starkweather \nBorn in Nebraska, Charlie Starkweather was a dissolute teenager and self-styled rebel. He dreamt of becoming rich and of earning a fortune through crime. In 1958 he realised his fantasies when he set off on the outlaw trail with his schoolgirl lover, 14-year-old Caril Fugate, like a latter day Bonnie and Clyde. In his wake he left 11 motiveless murders until he was finally cornered, captured, and executed in the electric chair.\n\n2)  Howard Hughes Autobiography Hoax \nIn December 1971 the world was amazed when it was announced that author Clifford Irving would be collaborating with millionaire recluse Howard Hughes on his official biography. It was even more astonishing when this was swiftly followed by an announcement from Hughes that the whole thing was a hoax. Irving insisted that this was a misunderstanding, but when Hughes finally broke cover to speak to journalists the ingenious fraud was revealed.\n\n3)  Jean Harris: The Scarsdale Shooting \nOn 10th March 1980, Jean Harris, headmistress of an exclusive East Coast girls school, drove to the house of her lover, Dr Herman Tarnower, author of the best selling Scarsdale Diet, and shot him dead. She had been aware that he wanted to end their relationship, and claimed that his shooting had been an accident while she was trying to persuade him to kill her. The jury was unconvinced and she was found guilty and sentenced to life imprisonment.\n\n4)  The Kidnap of Patty Hearst \nOn 4th February 1974 Patricia Hearst the 19-year-old heiress to one of America's largest media fortunes was kidnapped by an obscure terrorist group, the Symbionese Liberation Army. Within three months she had apparently joined them when she was filmed wielding a gun during a bank raid. Recaptured and tried, Patty was sentenced to seven years imprisonment, but released in January 1979 as an act of Executive Clemency by President Jimmy Carter.\n\n5)  Richard Speck: The Nurse Killer \nIn July 1966 alcoholic ex-marine Richard Speck woke up in Chicago after a night on the town and heard a radio report which sickened him. Eight nurses had been raped and slaughtered in their home. When the police arrived to arrest him, Speck claimed that he had no knowledge of the crime, and he stuck to this story throughout his trial and imprisonment to a sentence of 400 to 1,000 years.\n\n6)  Caryl Chessman: The Red Light Bandit \nAn habitual criminal from childhood, Caryl Chessman was also one of the cleverest of criminals. Condemned to death for repeated rapes, robberies, sexual perversion and kidnapping on 18th May 1948, he used his brilliant mind to learn enough law to carry on a crusade against execution for 12 years.\n\n7)  Roberts, Duddy and Witney \nThe murder of a policeman in Britain is still a rarity, but on 12th August 1966 the nation was shocked when three were gunned down in West London after stopping a car. Within a few days, two petty criminals John Duddy and John Witney - had been arrested, and the description of a third, Harry Roberts, had been publicised all over the country. But it was not to be for another three months, after one of the largest manhunts known in Britain that Roberts was tracked down in Epping Forest where he had been using his military training to evade capture.\n\n8)  Jeremy Bamber \nAfter a desperate phone call appealing for help police raced to a remote farmhouse in Essex, to stop a hysterical young woman running amok with a loaded hunting rifle. They arrived to find her and her family dead, in an apparently straightforward mass shooting followed by suicide. But not everyone was satisfied with his verdict, and several months later the dead girls step brother was arrested and charged with carrying out what had almost become the perfect murder.\n\n9)  Stalin and the Purges \nIn April 1943, Berlin announced that the bodies of 3,000 Polish officers had been found murdered by the Soviets at Katyn Wood. Stalin indignantly denied the accusation, even though all documents on the bodies stopped in 1940 when the men had been in Soviet hands. Only recently did the full truth of who was responsible come out.\n\n10)  The Assassination of Gandhi \nMahatma Gandhi was revered as the father of modern India, whose campaign of non-violent rebellion finally persuaded the British to pull out of the Jewel of their empire. His murder on 20th January 1948 by right-wing fanatics was a severe blow to hopes of avoiding inter-communal violence, as were the assassinations of his successors as leaders of India, Indira and Rajiv Gandhi.\n\n11)  The Assassination of Martin Luther King \nThe last 1950s and 1960s were a time of turmoil in America as the Civil Rights movement fought against racial segregation. Its leader was the charismatic preacher Martin Luther King Jr, and his assassination in April 1968 allegedly by a lone gunman James Earl Ray, gave rise to endless conspiracy theories as to who had funded him to do so.\n\n12)  The Assassination of John F Kennedy \nFew events have shocked a generation more than the murder of President John F Kennedy on 22nd November 1963 in Dallas. Young and charismatic he seemed to promise a new beginning for America and the world, and within hours of his death theories about who had killed him abounded. These were not stilled by the Warren Commissions assertion that there was a single gunman, and this programme looks at some of the other possibilities - such as the Cubans, big business, the Mafia, the KGB.\n\n13)  The A6 Murder \nOn 4th April 1962 James Hanratty was hanged for an apparently motiveless shooting of two lovers on the A6 main road near London. But much of the evidence had been circumstantial, and pointed equally well towards another name, Peter Alphon. When he confessed during an interview that he had carried out the murder many people were amazed that no charges were ever brought and controversy still rages as to whether Hanratty was wrongly executed.\n\n14)  Dennis Nilsen: The Kindly Killer \nDuring the five years from 1978 - 83 an unassuming civil servant who lived in the Muswell Hill area of London became Britains worst mass murderer. Dennis Nilsen, who had been a policeman for a short time, lured at least 15 young men back to his flat, murdered them and then disposed of their remains down the sewer. Only when this became blocked was his ghastly secret discovered, and after his lawyers had failed to establish insanity, he was imprisoned for life.\n\n15)  Charles Whitman: The Austin Sniper \nAlthough happily married, 25-year-old Charles Whitman was a worried man. He knew that he was in the grip of a terrible compulsion and on the verge of doing something appalling. Finally, on 31st July 1966 his self-control snapped and after killing his wife and mother so that they would be spared the shame he climbed the white granite tower of the University of Texas administration building, and started shooting at anyone who moved below. Fifteen people died and thirty were injured before police assault teams got close enough to gun him down.\n\n16)  Richard Ramirez: Night Stalker \nDuring a two year rampage, a sadistic serial killer broke into the homes of families throughout California. He raped, mutilated and tortured more than 25 victims in one of the most vicious sprees in US criminal history. When Richard Ramirez was arrested on 25th August 1985 a bizarre story involving Satanism and cult worship began to emerge, and the killer seem to exercise an extraordinary hold over many people who attended his trial.\n\n17)  The Rosenbergs: Atom Spies? \nOn 19th June 1951 Julius and Ethel Rosenberg walked to the electric chair in Sing Sing prison to become the first married couple in the United States to be executed together. They had been found guilty at the height of the McCarthy anti-Communist witch hunts of spying for the Soviet Union during the Second World War and passing vital secrets of the Manhattan Project, America's atomic bomb programme, to the Russians. To the end they protested their innocence and controversy continues as to whether they were condemned simply to calm the American publics fear of growing Communist power.\n\n18)  The Disappearance of Jimmy Hoffa \nTo this day, the exact fate of Jimmy Hoffa, one of the most corrupt and forceful US union leaders, remains a mystery. Hoffa had built up the Teamsters Union into a massive and rich organisation with close links to organised crime. Brought to trial in 1962 and finally imprisoned in 1967, he was pardoned by Richard Nixon in 1971. Four years later he was lured to a fictitious union meeting and disappeared.\n\n19)  Dan White: The City Hall Killer \nDan White gave up his job with the San Francisco fire department to go into politics. Running on a strongly anti-gay platform he was elected to the post of supervisor but soon found himself in financial trouble. When he resigned in 1978 Mayor George Moscone was persuaded by another supervisor, Harvey Milk, who was the citys first openly gay elected official, to offer the job to a replacement who would support the gay community. Appalled, White withdrew his resignation and when Moscone refused to accept this, he shot him and Milk.\n\n20)  Wayne Williams: The Atlanta Killer \nExperience has taught the Atlanta police department to expect about eight child murders a year - usually within families and usually quickly solved. But in 1979 they realised that they were dealing with a serial killer who preyed on young black children aged between 7 and 14. Before the nightmare was ended with the arrest of 23-year-old Wayne Williams in May 1981, there had been 28 victims, and a national manhunt was in progress.\n\n21)  The Escapes from Alcatraz \nThe name of the forbidding island prison in San Francisco Bay became legendary as the toughest prison housing the worst criminals. From 1934 to 1963 Alcatraz housed many of Americas most notorious criminals including Al Capone, and saw many escape attempts - the worst a full-scale shoot out in 1946.\n\n22)  The KKK Killings \nFounded originally in the aftermath of the American Civil War as a defender of white southerners against the revenge of freed black slaves, this secret society became notorious for its savage methods and white-hooded costume. Revived in the 1920s, its targets became Jews and other minorities as well as blacks. The attempts of the US government to control it were the background of the film Mississippi Burning.\n\n23)  The Boston Brinks Robbery \nA team of 11 thieves, in a precisely timed and choreographed strike, steals more than $2 million from the Brinks Armored Car depot in Boston, Massachusetts. The Great Brinks Robbery, as it quickly became known, was the almost perfect crime. Only days before the statute of limitations was set to expire on the crime, the culprits were finally caught. Tony Pino, a lifelong criminal, was the mastermind behind the audacious theft. Together with Joe McGinnis, he assembled a group that meticulously planned the heist. They staked out the depot for a year and a half to figure out when it was holding the most money. Then, the gang stole the plans for the depot's alarm system and returned them before anyone noticed that they were missing.\n\nScreenshots\n------------------------------\nclick on the thumbnails below to get full-size images &lt;a href=&quot;\nhttp://image.bayimg.com/3167720631b0e1a71b2db1952aa1871977cc54fe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3167720631b0e1a71b2db1952aa1871977cc54fe.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/18d29a655181ca6561fa056305c6ee0a231f3c38.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/18d29a655181ca6561fa056305c6ee0a231f3c38.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/fae141ad0c39bb7311cf624e37ce47a982250556.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/fae141ad0c39bb7311cf624e37ce47a982250556.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/edd10fc961c2f587ce47986327333ac8c515ab43.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/edd10fc961c2f587ce47986327333ac8c515ab43.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/678e9a2489133a6ae43f376b32e23f9d530251c2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/678e9a2489133a6ae43f376b32e23f9d530251c2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/63becb7a896de7a3b93cae34d578d275f0a808dd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/63becb7a896de7a3b93cae34d578d275f0a808dd.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/70ebeb64c060993c48bb467a39875f3748f6bfc8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/70ebeb64c060993c48bb467a39875f3748f6bfc8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/01db8c41100612e7973639870bbded65e890bebe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/01db8c41100612e7973639870bbded65e890bebe.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/76463335311140a46bbd6bc2a017a5e06c340033.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/76463335311140a46bbd6bc2a017a5e06c340033.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/e56d733cf861e2be997088f4bab7780f647cc3d4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/e56d733cf861e2be997088f4bab7780f647cc3d4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/648be66387880eb4f13509113167713519134293.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/648be66387880eb4f13509113167713519134293.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/1a013a194915de007413f23a4b18c5affc74d32e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/1a013a194915de007413f23a4b18c5affc74d32e.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;cc81ada5a28c80ffe2fd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1642 Kbps\n * Video: Resolution: 720 x 480\n * Video: Aspect Ratio: 1.333 (4:3)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: average 25mins\n * Framerate: 25fps\n * Number of Parts: 23\n * Part Size: average 271 MB\n * Container: Mp4\n * Source: TVRip\n * Encoded by: Harry65\n * Thanks to &quot;llamabert&quot;\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Great_Crimes_and_Trials&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Great_Crimes_and_Trials&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Great%20Crimes%20and%20Trials%3A%20Collection%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Great%20Crimes%20and%20Trials%3A%20Collection%201&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Crimes%20That%20Shook%20Britain%20Series%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Crimes%20That%20Shook%20Britain%20Series%201&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:17300b6bd8e676caee6ebc9f16a26fb46d1239e0","amp;dn":"Great+Crimes+And+Trials+Collection+2+06of23+Caryl+Chessman+1993+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17300b6bd8e676caee6ebc9f16a26fb46d1239e0","infoHashBuffer":{"type":"Buffer","data":[23,48,11,107,216,230,118,202,238,110,188,159,22,162,111,180,109,18,57,224]},"announce":[],"urlList":[]}}