{"title":"The Power (Titan #2) by Jennifer L. Armentrout [ePUB]","uid":13646104,"size":428642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1746353672873f08f81c38e2f1af82961fe44e62&amp;dn=The+Power+%28Titan+%232%29+by+Jennifer+L.+Armentrout+%5BePUB%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ebookism","files":3,"time":1456166393,"description":"The Power (Titan #2) by Jennifer L. Armentrout \r\nePUB | 418 KB\r\n\r\nWith any great change, there is always strife, and the Covenant University has become the frontline between pure-bloods who want the Breed Order reinstated and the half-bloods who want the right to control their own destinies.\r\nFate has other plans.\r\nThe violence is escalating and war between the races seems inevitable, and it couldn’t come at a worse time. Hyperion may be out of commission, but Josie and Seth know they have only earned a reprieve. Seth must get Josie fully prepared, which means controlling her newfound abilities, and they need to find the other demigods before the Titans do.\r\nBut the gods are sensing a greater threat.\r\nOnly one thing is more dangerous than a bunch of starved Titans, and that’s an out-of-control Apollyon. The aether in Josie is drawing Seth in deeper, and when lust mixes with love and gives way to power, he knows being close to her is not only dangerous to her, but to everyone around them, but letting her go requires a level of selflessness that just isn’t Seth’s style.\r\nThe paths taken in the past are becoming the roads of the future.\r\nJust as chaos breaks out, familiar faces from the past return, complicating the already strained bond between Josie and Seth, and when the danger from the Titans erupts with devastating consequences, the dark allure of power calls to Seth again, but this time Josie might not be able to pull him back.\r\nAnd when the struggle between power and love becomes the deadliest battleground, there may be no salvation","torrent":{"xt":"urn:btih:1746353672873f08f81c38e2f1af82961fe44e62","amp;dn":"The+Power+%28Titan+%232%29+by+Jennifer+L.+Armentrout+%5BePUB%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1746353672873f08f81c38e2f1af82961fe44e62","infoHashBuffer":{"type":"Buffer","data":[23,70,53,54,114,135,63,8,248,28,56,226,241,175,130,150,31,228,78,98]},"announce":[],"urlList":[]}}