{"title":"[GloryHoleSwallow] Savannah C, Summer A. (Gloryhole Visit)","uid":9423358,"size":361421916,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:17dcf90f06c3f9c719b2e8bcb67a27f6a9feb988&amp;dn=%5BGloryHoleSwallow%5D+Savannah+C%2C+Summer+A.+%28Gloryhole+Visit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"chkm8te","files":1,"time":1388632259,"description":"[GloryHoleSwallow] Savannah C, Summer A. (Savannah C and Summer A Gloryhole Visit)\n\nHere's how the day played out. I took Savannah to the Gloryhole a few weeks ago and in between cocks she was telling me how much she liked eating pussy. You guys know me, I never miss an opportunity so I called Summer to see what she was up to. Summer is more of a sub but loves having her pussy licked so I knew they would be a perfect match. Summer was in class at the time but as soon as I sent her a pic of Savannah she immediately replied &quot;OMG...I'm leaving class now, keep her there!&quot;.\n\nSummer broke the speed record getting there and she was pleasantly surprised to meet Savannah for the first time. Savannah was already more than warmed up and she almost attacked Summer. Savannah didn't waste any time getting Summer out of her school clothes and went to town on her tight wet pussy. She sucked on her clit like she was drinking a vanilla milk shake and made Summer cum twice.\n\nSome lucky bastard got to watch the entire thing and got so worked up himself that he gave them two loads. Savannah sucked the first one out of him while Summer held the back of her head and worked his balls. Savannah was kind enough to share the gift with her new suck buddy. Savannah left the booth to play with some other guys in the hall while Summer got fed a second load. This was the first time Summer even saw a black cock so it was a good initial introduction to interracial cock sucking. Now we just have to get a BBC in that tight white pussy of hers and maybe even in her ass. How about Savannah taking a creampie and Summer licking her clean!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vcd3o7ahej8kkjpulljr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vcd3o7ahej8kkjpulljr.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=jrutsyfi9lv2sp82o36o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=jrutsyfi9lv2sp82o36o.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:17dcf90f06c3f9c719b2e8bcb67a27f6a9feb988","amp;dn":"%5BGloryHoleSwallow%5D+Savannah+C%2C+Summer+A.+%28Gloryhole+Visit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17dcf90f06c3f9c719b2e8bcb67a27f6a9feb988","infoHashBuffer":{"type":"Buffer","data":[23,220,249,15,6,195,249,199,25,178,232,188,182,122,39,246,169,254,185,136]},"announce":[],"urlList":[]}}