{"title":"Shadows of Forgotten Ancestors (Sergei Parajanov, 1964)","uid":4015849,"size":4680839168,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1812194c969544dd58ef7f999205ca17e46a20cc&amp;dn=Shadows+of+Forgotten+Ancestors+%28Sergei+Parajanov%2C+1964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"stochastik","files":45,"time":1202347728,"description":"SHADOWS OF FORGOTTEN ANCESTORS (Tini zabutykh predkiv)\nSergei Parajanov, 1964   USSR\n\n---------------------------------------------------------------------------------\n\nThis is the just released to DVD version from Kino International films. The video quality here is much better -- basically remastered.\n\nWhat you are downloading here is the compressed DVD with all its special features including a 39 minute documentary comparing Andrei Tarkovsky and Sergei Paradjanov.\n\nSpoken language is Ukrainian, but I selected Russian here because there were no other options. Texted languages are English, French, and Spanish.\n\nStats:\nFilesize - 4,680,839,168 bytes (4.35 GB)\nRuntime - 92 min.\nAspect Ratio - 1.33:1\n\n---------------------------------------------------------------------------------\n\n&quot;Adapted from a novel by Ukrainian writer M. Kotsyubinsky, Sergei Paradjanov&amp;#039;s extraordinary merging of myth, history, poetry, ethnography, dance, and ritual (1964) remains one of the supreme works of the Soviet sound cinema, and even subsequent Paradjanov features have failed to dim its intoxicating splendors. Set in the harsh and beautiful Carpathian Mountains, the movie tells the story of a doomed love between a couple belonging to feuding families, Ivan and Marichka, and of Ivan&amp;#039;s life and marriage after Marichka&amp;#039;s death. The plot is affecting, but it serves Paradjanov mainly as an armature to support the exhilarating rush of his lyrical camera movements (executed by master cinematographer Yuri Illyenko), his innovative use of nature and interiors, his deft juggling of folklore and fancy in relation to pagan and Christian rituals, and his astonishing handling of color and music. A film worthy of Dovzhenko, whose poetic vision of Ukrainian life is frequently alluded to.&quot; -- Jonathan Rosenbaum\n\n---------------------------------------------------------------------------------\n\nCredits:\nStarring Ivan Mikolajchuk, Larisa Kadochnikova, Tatyana Bestayeva, Spartak Bagashvili, Nikolai Grinko, and Leonid Yengibarov\nProduction Design Mikhail Rakovsky and G. Yakutovich\nCostume Design Lidiya Bajkova\nEditing M. Ponomarenko\nCinematography Viktor Bestayev and Yuri Ilyenko\nOriginal Music by Miroslav Skorik\nWritten by Ivan Chendej and Sergei Paradjanov\nFrom the story by Mikhaylo Kovsyubinskiy\nAssistant Director David Abashidze\nDirected by Sergei Pardjanov\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\t\t","torrent":{"xt":"urn:btih:1812194c969544dd58ef7f999205ca17e46a20cc","amp;dn":"Shadows+of+Forgotten+Ancestors+%28Sergei+Parajanov%2C+1964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1812194c969544dd58ef7f999205ca17e46a20cc","infoHashBuffer":{"type":"Buffer","data":[24,18,25,76,150,149,68,221,88,239,127,153,146,5,202,23,228,106,32,204]},"announce":[],"urlList":[]}}