{"title":"Weezer - Pinkerton [24 bit FLAC] vinyl","uid":8307908,"size":846623849,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:183ced2da72b40c04aba6ff45590fc7b01155ebb&amp;dn=Weezer+-+Pinkerton+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"24.96","files":-1,"time":1364410862,"description":"  Weezer - Pinkerton (1996) [24 bit FLAC] vinyl\n\n  Released: 1996\n  Source: DGC-25007 / US\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Tired of Sex 3:01\n  A2. Getchoo 2:52\n  A3. No Other One 3:01\n  A4. Why Bother? 2:08\n  A5. Across the Sea 4:32\n  B1. The Good Life 4:17\n  B2. El Scorcho 4:03\n  B3. Pink Triangle 3:58\n  B4. Falling for You 3:47\n  B5. Butterfly 2:53\n\n  From the pounding, primal assault of the opening track, &quot;Tired of Sex,&quot; it's clear from the outset that Pinkerton is a different record than the sunny, heavy guitar pop of Weezer's eponymous debut. The first noticeable difference is the darker, messier sound -- the guitars rage and squeal, the beats are brutal and visceral, the vocals are mixed to the front, filled with overlapping, off-the-cuff backing vocals. In short, it sounds like the work of a live band, which makes it all the more ironic that Pinkerton, at its core, is a singer/songwriter record, representing Rivers Cuomo's bid for respectability. Since he hasn't changed Weezer's blend of power pop and heavy metal (only the closing song, &quot;Butterfly,&quot; is performed acoustically), many critics and much of the band's casual fans didn't notice Cuomo's significant growth as a songwriter. Loosely structured as a concept album based on Madame Butterfly, each song works as an individual entity, driven by powerful, melodic hooks, a self-deprecating sense of humor (&quot;Pink Triangle&quot; is about a crush on a lesbian), and a touching vulnerability (&quot;Across the Sea,&quot; &quot;Why Bother?&quot;). Weezer can still turn out catchy, offbeat singles -- &quot;The Good Life&quot; has a chorus that is more memorable than &quot;Buddy Holly,&quot; &quot;El Scorcho&quot; twists Pavement's junk-culture references in on itself, &quot;Falling for You&quot; is the most propulsive thing they've yet recorded -- but the band's endearing geekiness isn't as cutesy as before, which means the album wasn't as successful on the charts. But it's the better album, full of crunching power pop with a surprisingly strong emotional undercurrent that becomes all the more resonant with each play.","torrent":{"xt":"urn:btih:183ced2da72b40c04aba6ff45590fc7b01155ebb","amp;dn":"Weezer+-+Pinkerton+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"183ced2da72b40c04aba6ff45590fc7b01155ebb","infoHashBuffer":{"type":"Buffer","data":[24,60,237,45,167,43,64,192,74,186,111,244,85,144,252,123,1,21,94,187]},"announce":[],"urlList":[]}}