{"title":"Boardwalk Empire - Volume 2 FLAC","uid":11063251,"size":385297085,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1857897eea23fd3184b34a70793b6c802a4039f7&amp;dn=Boardwalk+Empire+-+Volume+2+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"eika256","files":-1,"time":1411191620,"description":"Boardwalk Empire - Volume 2 FLAC\n\nWhile Boardwalk Empire includes plenty of authentic recordings in its re-creation of the mob wars of the Roaring '20s, Boardwalk Empire, Vol. 2 reaffirms that having contemporary artists interpret the era's songs keeps the HBO series from seeming too archival. Presenting highlights from seasons three and four, the collection features performances from a roster of more established artists than the soundtrack's first volume. The results are often accomplished -- David Johansen slips into the boisterous &quot;Strut Miss Lizzie&quot; like a pinstripe suit -- but not always as thrilling as when younger or lesser-known artists blend almost imperceptibly into the songs. For better or worse, Elvis Costello is unmistakable on his version of &quot;It Had to Be You;&quot; as captivating as he is, he detracts from the illusion of authenticity artists like the National's Matt Berninger creates with his rendition of &quot;I'll See You in My Dreams.&quot; Other inspired pairings include Neko Case, who sounds as effortlessly charismatic and appropriate singing &quot;Nobody Knows You When You're Down and Out&quot; as she is anywhere else, and St. Vincent, whose knowing sweetness tempers the naive admonishments to grin and bear it on &quot;Make Believe.&quot; Two very different grande dames provide some of the album's biggest highlights: Liza Minnelli is just as brassy and sassy as expected on &quot;You've Got to See Mama Ev'ry Night (Or You Can't See Mama at All),&quot; while Patti Smith plays against type on her playful rendition of the sad-sack chestnut &quot;I Ain't Got Nobody.&quot; Performances such as these make Boardwalk Empire, Vol. 2 more theatrical than the first volume, but fans will be pleased to hear more songs by Stephen DeRosa, whose turn as Eddie Cantor is one of the show's highlights. Likewise, this collection introduces Margot Bingham, who joins the cast in season four and showcases her wide range with the flirty &quot;I'm Going South&quot; and the winsome &quot;Somebody Loves Me.&quot; Elsewhere, the show's musical diversity expands with Loudon Wainwright III's &quot;The Prisoner's Song&quot; and Pokey LaFarge's &quot;Lovesick Blues,&quot; both of which add a hillbilly/country feel, and with Rufus Wainwright's &quot;Jimbo Jambo,&quot; an example of the jaunty exoticism of the age that might be a little troubling to modern listeners. On the whole, however, Boardwalk Empire, Vol. 2 is an expansive, entertaining soundtrack that captures just how thoroughly the show crafts its mood and atmospheres. (AllMusic)\n\nTrack list:\n1. David Johansen - Strut Miss Lizzie\n2. Stephen Derosa - Old King Tut\n3. Elvis Costello - It Had To Be You\n4. Vince Giordano &amp; The Nighthawks - Everybody Loves My Baby\n5. Liza Minnelli - You've Got To See Mama Ev'ry Night\n6. Leon Redbone - Baby Won't You Please Come Home\n7. St. Vincent - Make Believe\n8. Pokey Lafarge - Lovesick Blues\n9. Neko Case - Nobody Knows You When You're Down And Out\n10. Karen Elson - Who's Sorry Now\n11. Stephen Derosa - You'd Be Surprised\n12. Margot Bingham - I'm Going South\n13. Vince Giordano &amp; The Nighthawks - Sugarfoot Stomp\n14. Rufus Wainwright - Jimbo Jambo\n15. Kathy Brier - There'll Be Some Changes Made\n16. Margot Bingham - Somebody Loves Me\n17. Chaim Tannenbaum - All Alone\n18. Loudon Wainwright III - The Prisoner's Song\n19. Patti Smith - I Ain't Got Nobody\n20. Matt Berninger - I'll See You In My Dreams\n\nEnjoy and share!","torrent":{"xt":"urn:btih:1857897eea23fd3184b34a70793b6c802a4039f7","amp;dn":"Boardwalk+Empire+-+Volume+2+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1857897eea23fd3184b34a70793b6c802a4039f7","infoHashBuffer":{"type":"Buffer","data":[24,87,137,126,234,35,253,49,132,179,74,112,121,59,108,128,42,64,57,247]},"announce":[],"urlList":[]}}