{"title":"LDS GospeLink 2001 - Mormon ebooks","uid":6841599,"size":1952649547,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18633dc681203ceca43a12e6533591c92f829940&amp;dn=LDS+GospeLink+2001+-+Mormon+ebooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"WilhelmTHE3rd","files":509,"time":1322185953,"description":"RELEASE INFORMATION:\nNumber of disc images (ISO files): 3\nPlatform: Windows XP (or lower)\n\nGospeLink 2001 -- a searchable collection of over 3000 LDS books, works, and \npublications.\n\n\nAs of my releasing this as a torrent, GospeLink 2001 is over 10 years old and no \nlonger sold nor supported (that I'm aware of).  I feel very strongly that everyone \nought to have access to this incredible library without having to pay monthly fees.\nthe need for everyone to have access to these important works far outweighs the \ncontinued profit motive.\n\nIn addition to the GospeLink program, I've also included Yanceyware software, tools,\nand some essential libraries. It was created by an LDS programmer and intended \nprimarily for LDS libraries. It's excellent software. It was initially created for \nfor handheld operating systems, especially PocketPCs and Windows Mobile devices.\nHowever, there is also a Yancey desktop program for Windows operating systems as \nwell. \n\nI will also be releasing another massive Yanceyware ebook library via torrent, the \ncontents of which were converted directly from this Gospel 2001 library. I converted\nthem via a conversion program (Yanceylink, included in this torrent package) to \nYanceyware ebook format.  Most everything of the Gospel 2001 library is included \nexcept the periodicals, such as the Ensign, New Area, Friend, Liahona, etc.  \n(Yanceylink crashed everytime I tried to to convert them).\n\n\nMay the Lord bless you and lead you in your Gospel research.  Please make good use\nof these tools to honor our Lord and Savior, Jesus Christ.\n\n\n","torrent":{"xt":"urn:btih:18633dc681203ceca43a12e6533591c92f829940","amp;dn":"LDS+GospeLink+2001+-+Mormon+ebooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18633dc681203ceca43a12e6533591c92f829940","infoHashBuffer":{"type":"Buffer","data":[24,99,61,198,129,32,60,236,164,58,18,230,83,53,145,201,47,130,153,64]},"announce":[],"urlList":[]}}