{"title":"The Third Kingdom","uid":8835552,"size":2168810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1881e3d8ed83b0985a2e839c8a908e4615d4d8bb&amp;dn=The+Third+Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"420weedman","files":4,"time":1377105276,"description":"From the internationally bestselling author of the Sword of Truth series, comes a new Richard and Kahlan novel, sequel to The Omen Machine.\n\nThe bloodthirsty Jit is dead, and against all odds Richard and Kahlan have survived. But a new menace has attacked them in the Dark Lands. Infected with the essence of death itself, robbed of his power as a war wizard, Richard must race against time to uncover and stop the infernal conspiracy assembling itself behind the wall far to the north. His friends and allies are already captives of this fell combination, and Kahlan, also touched by death's power, will die completely if\nRichard fails.\n\nBereft of magic, Richard has only his sword, his wits, his capacity for insight - and an extraordinary companion, the young Samantha, a healer just coming into her powers.\n\nCompelling, fast-moving, and intense, The Third Kingdom is a powerful tale that welcomes new readers to Terry Goodkind's world, while opening up new vistas of worldbuilding for longtime readers of the adventures of Richard Rahl and Kahlan Amnell.","torrent":{"xt":"urn:btih:1881e3d8ed83b0985a2e839c8a908e4615d4d8bb","amp;dn":"The+Third+Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1881e3d8ed83b0985a2e839c8a908e4615d4d8bb","infoHashBuffer":{"type":"Buffer","data":[24,129,227,216,237,131,176,152,90,46,131,156,138,144,142,70,21,212,216,187]},"announce":[],"urlList":[]}}