{"title":"Adult Children of Emotionally Immature Parents","uid":14468369,"size":626471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18dfddb99dcfc57ac4690f604624f57e31da7bc0&amp;dn=Adult+Children+of+Emotionally+Immature+Parents&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461884595,"description":"If you grew up with an emotionally immature, unavailable, or selfish parent, you may have lingering feelings of anger, loneliness, betrayal, or abandonment. You may recall your childhood as a time when your emotional needs were not met, when your feelings were dismissed, or when you took on adult levels of responsibility in an effort to compensate for your parent’s behavior. These wounds can be healed, and you can move forward in your life.\r\n\r\nIn this breakthrough book, clinical psychologist Lindsay Gibson exposes the destructive nature of parents who are emotionally immature or unavailable. You will see how these parents create a sense of neglect, and discover ways to heal from the pain and confusion caused by your childhood. By freeing yourself from your parents’ emotional immaturity, you can recover your true nature, control how you react to them, and avoid disappointment. Finally, you’ll learn how to create positive, new relationships so you can build a better life.\r\n\r\nDiscover the four types of difficult parents:\r\n\r\nThe emotional parent instills feelings of instability and anxiety\r\nThe driven parent stays busy trying to perfect everything and everyone\r\nThe passive parent avoids dealing with anything upsetting\r\nThe rejecting parent is withdrawn, dismissive, and derogatory","torrent":{"xt":"urn:btih:18dfddb99dcfc57ac4690f604624f57e31da7bc0","amp;dn":"Adult+Children+of+Emotionally+Immature+Parents","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18dfddb99dcfc57ac4690f604624f57e31da7bc0","infoHashBuffer":{"type":"Buffer","data":[24,223,221,185,157,207,197,122,196,105,15,96,70,36,245,126,49,218,123,192]},"announce":[],"urlList":[]}}