{"title":"[WebYoung] - Kenna James , Ariana Marie - Tech Support - 400p","uid":12148976,"size":234308159,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1928b3322c4e5f32cc95fffbe65718799de2f63e&amp;dn=%5BWebYoung%5D+-+Kenna+James+%2C+Ariana+Marie+-+Tech+Support+-+400p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pornboy89","files":1,"time":1437555030,"description":".......:::Screenshots:::.......\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=168007&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=168007&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=611617&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=611617&lt;/a&gt;\n\nDescription:\n\nWorking on her school paper, Kenna James has some bad luck as her mac breaks down. In a panic and not knowing what to do, she calls Ariana Marie, a friend of Samantha's who is tech saavy. Kenna asks her if she could help her out to try and fix it and with pleasure Ariana takes Kenna's address and heads out to save the day.\n\nAriana arrives, checking out the computer situation, while Kenna gets a glimpse of Ariana's figure and likes what she sees! Making sure to decipher the problem, Arianna figures out there was nothing wrong with it all along. Kenna was so grateful for Ariana's help she offered Ariana anything she wanted. Ariana was shy as it showed in her demeanor, stating she didn't fix anything, just a little TLC was needed. Kenna was adamant she was going to get in Ariana's pants and urged her she had to give her something for her help. Kenna offered her a massage but Ariana politely declined, but Kenna was not going to take no for an answer. If Ariana didn't want a massage, maybe there was something else Kenna could do to repay her...\n\nAriana never being with a woman before made her completely shy and submissive. Kenna took charge and promised her it would feel fantastic. Kenna goes down on Ariana licking her sweet shaved pussy resulting in Ariana spazzing from a powerful orgasm. Kenna was craving Ariana's mouth over her pussy as she grabs her arms and places her underneath her open legs. Feeding her sweet pussy lips to Ariana's virgin mouth had Kenna cum very quickly excited at the idea she was Ariana's first. Take a look for yourself at Ariana's hidden talents flourish in this heavenly video!","torrent":{"xt":"urn:btih:1928b3322c4e5f32cc95fffbe65718799de2f63e","amp;dn":"%5BWebYoung%5D+-+Kenna+James+%2C+Ariana+Marie+-+Tech+Support+-+400p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1928b3322c4e5f32cc95fffbe65718799de2f63e","infoHashBuffer":{"type":"Buffer","data":[25,40,179,50,44,78,95,50,204,149,255,251,230,87,24,121,157,226,246,62]},"announce":[],"urlList":[]}}