{"title":"The Magilla Gorilla Show ( Hanna-Barbera ) DVDrip","uid":4684747,"size":2276685824,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:195102663ef44438c39dc33f47305bdc4e292393&amp;dn=The+Magilla+Gorilla+Show+%28+Hanna-Barbera+%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"grnmst001","files":-1,"time":1233192338,"description":"23 episodes and plenty of special features. Among the special features are the Live and Unplugged version of the Magilla Gorilla theme song, an interactive look at the Peebles Pet Shop and an interview with Allan Melvin, the voice of Magilla. There are also eight bonus cartoons included.\n\nSome personal favorites that made these DVD's worth the watch include classic episodes like Private Magilla, where Magilla is drafted into the military and Big Game, where Magilla is adopted and hunted by the same person! Of course, as you would expect he comes out okay and ends up with his very own Butler in the process. The great thing about Magilla Gorilla is the package deal quality of it all. The Complete Series carries the MG name, but includes two other cartoons for every episode Punkin' Puss and Mushmouse, the country bumpkin version of Tom and Jerry and Ricochet Rabbit.\n\nParents will be sure to recognize some subtle things they never caught as kids. You will hear the voice of Scooby Doo in Ricochet Rabbit and Droop-a-long should remind you somewhat of Bugs Bunny and the Mel Blanc franchise. You might even pick up on the interesting way that all the characters seem to hold small resemblances to other characters played in The Flintstones and The Jetsons.\n\nThe only negative thing I can say about Magilla Gorilla: The Complete Series is that a few of the cartoons did not hold up as well in the DVD conversion process than others. However, I have to say the overall quality is excellent. If you're a cartoon lover and you're looking for some quality cartoons for your kids, give Magilla a try. After all, it's time someone took him home and kept him for a change.","torrent":{"xt":"urn:btih:195102663ef44438c39dc33f47305bdc4e292393","amp;dn":"The+Magilla+Gorilla+Show+%28+Hanna-Barbera+%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"195102663ef44438c39dc33f47305bdc4e292393","infoHashBuffer":{"type":"Buffer","data":[25,81,2,102,62,244,68,56,195,157,195,63,71,48,91,220,78,41,35,147]},"announce":[],"urlList":[]}}