{"title":"Maria Schneider Orchestra - The Thompson Fields (2015) [EAC-","uid":13097525,"size":458652651,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:19561a691f6922096739323f627007139bd621db&amp;dn=Maria+Schneider+Orchestra+-+The+Thompson+Fields+%282015%29+%5BEAC-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pucholoco","files":50,"time":1451159776,"description":"Maria Schneider Orchestra - The Thompson Fields (2015)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 414 Mb\r\n                      Full Artwork @ 300 dpi (jpg) -&gt; 46 Mb\r\n\r\n\r\nThere's a wealth of information to be found inside the beautiful packaging that accompanies this release, but a brief Theodore Roosevelt quote may be the most telling piece of text to be found there. It reads: &quot;There is nothing more practical in the end than the preservation of beauty, than the preservation of anything that appeals to the higher emotions in mankind.&quot; That really says it all about this artist and her work, for there is nobody more capable of harnessing emotions in music and projecting and preserving the beauty and power of the natural world in sound than Maria Schneider. She's demonstrated that time and again, and she does it once more on this awe-inspiring release.\r\n\r\nThe Thompson Fields arrives after a lengthy gestation: eight years after the last Maria Schneider Orchestra album—the stunning Sky Blue (ArtistShare, 2007). But if it takes Schneider that long to give proper birth to this quality of recorded music, so be it. You can't rush perfection, and this music is as close as you can get to that lofty and unattainable goal. Across these eight tracks, the Maria Schneider Orchestra puts ornithological ideals into play (&quot;Arbiters Of Evolution&quot;), works with nebulous themes and foreboding thoughts (&quot;Nimbus&quot;), takes a trip into Brazilian territory (&quot;Lembranca&quot;), pays tribute to one of its own dearly departed members (&quot;A Potter's Song&quot;), and bottles the attractively complex lingering scents of nostalgia and sentimentality.\r\n\r\nAs always, the singular personalities in this band help to elevate the music. Gary Versace's accordion wistfully traces its way across vast landscapes; Frank Kimbrough's piano is elemental, conjuring thoughts of gentle winds and the morning dew; Scott Robinson turns the alto clarinet into a thing of elegance and beauty (&quot;Walking By Flashlight&quot;); Marshall Gilkes' trombone and Greg Gisbert's fluegelhorn each balance the weighty and the wondrous in their expressions, eventually crossing paths while cresting the waves of the orchestra (&quot;The Monarch And The Milkweed&quot;); and guitarist Lage Lund draws on light and energy, spinning them both back out in controlled fashion. Those are just a few of the notable names, roles, and deeds, but those descriptions, admittedly, fall short. No words can properly convey the wonders embedded in this music.\r\n\r\nMaria Schneider is truly fearless in her expression of self, creating grand statements and musical reveries built from intimate memories, thoughts, and feelings. Her willingness to share these experiences, her unparalleled skills at molding them into music, and the talents of the musicians who populate her orchestra all contribute to the success that is The Thompson Fields.\r\n\r\nWe're thrilled to announce that The Thompson Fields has been nominated for 'Best Large Jazz Ensemble Album.' Donny McCaslin's tenor solo on &quot;Arbiters of Evolution&quot; was nominated for &quot;Best Improvised Solo,&quot; and Maria was also nominated for 'Best Arrangement Accompanying a Vocal' for &quot;Sue (Or in a Season of Crime) recorded by her orchestra for David Bowie.\r\n\r\n\r\n-------------------------------------------------------------------------\r\nTracklist:\r\n-------------------------------------------------------------------------\r\n\r\n01. Walking By Flashlight\r\n02. The Monarch And The Milkweed\r\n03. Arbiters Of Evolution\r\n04. The Thompson Fields\r\n05. Home\r\n06. Nimbus\r\n07. A Potter's Song\r\n08. Lembranca\r\n\r\n*2015 ArtistShare / Maria Schneider | AS 0137\r\n\r\nPersonnel:\r\nConductor Maria Schneider\r\nAlto Flute, Clarinet, Flute, Saxophone Steve Wilson (saxophonist)\r\nAlto Flute, Bass Flute, Clarinet, Flute, Saxophone Dave Pietro\r\nSaxophone Rich Perry\r\nClarinet, Flute, Saxophone Donny McCaslin\r\nAlto Clarinet, Bass Clarinet, Clarinet, Saxophone Scott Robinson\r\nFlugelhorn, Trumpet Tony Kadleck\r\nFlugelhorn, Trumpet Greg Gisbert\r\nFlugelhorn, Trumpet Augie Haas\r\nFlugelhorn, Trumpet Michael Rodriguez\r\nTrombone Keith O'Quinn\r\nTrombone Ryan Keberle\r\nTrombone Marshall Gilkes\r\nTrombone George Flynn\r\nAccordion Gary Versace\r\nGuitar Lage Lund\r\nPiano Frank Kimbrough\r\nBass Jay Anderson\r\nDrums, Percussion Clarence Penn\r\nPercussion Rogerio Boccato\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!\r\n\r\n\r\n\r\nMaria Schneider Orchestra - Allegresse (2000) [EAC-FLAC]:\r\n  \nhttps://thepiratebay.se/torrent/10663377/Maria_Schneider_Orchestra_-_Allegresse_%282000%29_%5BEAC-FLAC%5D\r\n\r\n\r\nMaria Schneider Orchestra - Sky Blue (2007) [EAC-FLAC]:\r\n   \nhttps://thepiratebay.se/torrent/10642637/Maria_Schneider_Orchestra_-_Sky_Blue_%282007%29_%5BEAC-FLAC%5D\r\n\r\n\r\nMaria Schneider Orchestra - Days Of Wine And Roses (2005) [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/10674620/Maria_Schneider_Orchestra_-_Days_Of_Wine_And_Roses_%282005%29_%5BEAC-F","torrent":{"xt":"urn:btih:19561a691f6922096739323f627007139bd621db","amp;dn":"Maria+Schneider+Orchestra+-+The+Thompson+Fields+%282015%29+%5BEAC-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19561a691f6922096739323f627007139bd621db","infoHashBuffer":{"type":"Buffer","data":[25,86,26,105,31,105,34,9,103,57,50,63,98,112,7,19,155,214,33,219]},"announce":[],"urlList":[]}}