{"title":"Biodome (1996) - DVD Rip - XVID - 16x9 - EMPERORDYNAMITE - Open ","uid":4913638,"size":2141140413,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1a5f4b048839666c9f62d7b13c4bc947eb5f67b0&amp;dn=Biodome+%281996%29+-+DVD+Rip+-+XVID+-+16x9+-+EMPERORDYNAMITE+-+Open+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"kingdan89","files":3,"time":1243309385,"description":"High Quality DVD-Rip. Best of the best!\n\nPOSTER:\n[IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/BioDomeposter.jpg[/IMG]\n&quot;Bio-Dome is a 1996 movie starring Pauly Shore and Stephen Baldwin and directed by Jason Bloom. The story centers on two men named Bud (Shore) and Doyle (Baldwin) and their experience inside a &quot;bio-dome&quot;, a form of a closed ecological system.&quot;\n\nTRAILER: (To view the video click on the green preview image icon\nbellow, you will be directed to my photo bucket where the video is. \n\n[URL=http://s23.photobucket.com/albums/b377/kingdan89/biodome/?action=view&amp;current=Bio-Dome-MovieTrailers-Preview-NYTi.flv][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/th_Bio-Dome-MovieTrailers-Preview-NYTi.jpg[/IMG][/URL]\n\nPLOT:\n\nThe movie begins with a commercial style advertisement about the purpose of the Bio-Dome, to artificially sustain life and maintain homeostasis within the ecosystem. To conduct the experiment, five scientists were chosen to live inside for one year, Earth Day to Earth Day, and live off of the ecosystem.\n\nBud (&quot;Squirrel&quot;) and Doyle (&quot;Stubs&quot;) are best friends who live in Arizona. The scene with them opens on the two pulling a stunt to get out of Earth Day activities with their Earth conscious girlfriends, Monique (Joey Lauren Adams) and Jen (Teresa Hill). When the girls find out about it, they decide to get even by pretending to have met two men at the event and gave Bud and Doyle a red herring location. The two leave to go after them but soon realize they were fooled. On the way home, Doyle finds he needs to urinate. They pull off the road at the Bio-Dome, which they mistake for a mall, and are turned away by a security guard at the entrance. They get around this by using firecrackers as a distraction and by the time they are ready to leave, they find they have been sealed inside.\n\nThe scientists, and chief investor Mr. Dick Leaky, discuss what to do about the situation. Mr. Leaky wants the two out immediately. The scientist in chief, Dr. Noah Faulkner, decides since the experiment depends on the time of one year, they must stay and the system will have to adapt to 7, not 5, people. This soon proves to be a mistake as Bud and Doyle aren't the most environmentally friendly guests. Things aren't helped by the fact that two of the scientists are rather attractive looking and given the fact that they won't be able to have a physical relationship with their girlfriends, they hit on them at every opportunity. This gets out to Monique and Jen and they decide to go to an environmental party. By this time, Bud and Doyle have caused so much trouble, they have been banished to the desert part of the dome and left for dead. While Petra and Mimi object after some time, Faulkner stands firm that nature must take its course and that they be left there.\n\nWhile suffering in the heat, Doyle discovers a key that unlocks a hidden door and the two are out. Given that they've been left for dead, the first thing they do is order a ton of pizza and drinks. The driver tips them off about their girlfriends and the party they are at and they decide to undercut them by throwing a bigger, wilder party. The clincher was they decided to hold it within the dome. As hundreds of people show up, Bud and Doyle admit them through the door they escaped through. The scientist team gets caught up in the party against their will with Faulkner being handcuffed to a light post. While Bud and Doyle are being treated like royalty, Monique and Jen confront them in total shock at the destruction and littering. The next morning, Monique and Jen begin cleaning up the mess caused by the party, making Bud and Doyle feel worse. They realize not only have they made them mad, but they've caused a huge amount of damage to the dome. Mr. Leaky confronts the team with insurance lawyers to assess the damage. Faulkner isn't present, though the handcuffs are as they had been chewed through. As the scientists are sent home, they see Bud and Doyle, who interject and plead for their help to undo the damage. As an ultimatum, Doyle locks the door and swallows the key.\n\nThe team immediately gets to work in restoring homeostasis with chores around the dome. Word gets out and a crowd begins to form at the dome supporting the team's efforts, including Monique and Jen, who forgive Bud and Doyle for their mishap. Meanwhile, Faulkner, still inside as well, has gone insane and wants to get rid of his failure by rigging coconuts as explosives and having them set to detonate at the exact moment the dome is to open again. The team finds he raided a storeroom, leaving a message on the floor. Late one night, Bud and Doyle hear him working on his devices and loosely try to get him back on board. They don't realize they are helping him rig the coconuts. When they are on their own, they play football with one when Doyle trips and the coconut lands and explodes. Realizing the danger, they plead for an early exit, which is unsuccessful. Having only one option, they go back into the dome to confront Faulkner and disable the charges. After some chasing they are able to catch up with him, knock him unconscious, and deactivate the coconuts. As the team heads for the door, Faulkner shows up with one more coconut, but is tripped and the coconut explodes in the entryway. The team emerges from the smoke unharmed and Bud and Doyle and Monique and Jen are reunited. The four drive off having learned their lesson, when Doyle needs to urinate again and the four are last seen driving into a power plant with sirens going off. The movie closes with Faulkner escaping the police in the desert laughing.\n\n\n\n\nFILE INFORMATION:\n\n\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFormat profile                   : OpenDML\nFile size                        : 1.99 GiB\nDuration                         : 1h 34mn\nOverall bit rate                 : 3 014 Kbps\nWriting application              : VirtualDubMod 1.5.4.1 (build 2178/release)\nWriting library                  : VirtualDubMod build 2178/release\n\nVideo\nFormat                           : MPEG-4 Visual\nFormat profile                   : Streaming Video@L1\nFormat settings, BVOP            : Yes\nFormat settings, QPel            : No\nFormat settings, GMC             : No warppoints\nFormat settings, Matrix          : Custom\nCodec ID                         : XVID\nCodec ID/Hint                    : XviD\nDuration                         : 1h 34mn\nBit rate                         : 2 557 Kbps\nWidth                            : 1 024 pixels\nHeight                           : 576 pixels\nDisplay aspect ratio             : 16/9\nFrame rate                       : 23.976 fps\nResolution                       : 24 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.181\nStream size                      : 1.69 GiB (85%)\nWriting library                  : XviD 1.2.1 (UTC 2008-12-04)\n\nAudio\nFormat                           : AC-3\nFormat/Info                      : Audio Coding 3\nCodec ID                         : 2000\nDuration                         : 1h 34mn\nBit rate mode                    : Constant\nBit rate                         : 448 Kbps\nChannel(s)                       : 6 channels\nChannel positions                : Front: L C R, Surround: L R, LFE\nSampling rate                    : 48.0 KHz\nVideo delay                      : 14ms\nStream size                      : 304 MiB (15%)\nAlignment                        : Split accross interleaves\nInterleave, duration             : 96 ms (2.30 video frames)\nInterleave, preload duration     : 96 ms\nLanguage                         : English\n\nSCREENSHOTS:\n[IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-11836.png[/IMG][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-11886.png[/IMG][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-11927.png[/IMG][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-11979.png[/IMG]\n[IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-12016.png[/IMG][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-12060.png[/IMG]\n[IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-12141.png[/IMG][IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-12174.png[/IMG]\n[IMG]http://i23.photobucket.com/albums/b377/kingdan89/biodome/vlcsnap-12255.png[/IMG]","torrent":{"xt":"urn:btih:1a5f4b048839666c9f62d7b13c4bc947eb5f67b0","amp;dn":"Biodome+%281996%29+-+DVD+Rip+-+XVID+-+16x9+-+EMPERORDYNAMITE+-+Open+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a5f4b048839666c9f62d7b13c4bc947eb5f67b0","infoHashBuffer":{"type":"Buffer","data":[26,95,75,4,136,57,102,108,159,98,215,177,60,75,201,71,235,95,103,176]},"announce":[],"urlList":[]}}