{"title":"Element Encyclopedia of the Psychic World, The - Cheung, Theresa","uid":9151975,"size":1718480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b43cf254c108a32638551a47cba504b33e3656b&amp;dn=Element+Encyclopedia+of+the+Psychic+World%2C+The+-+Cheung%2C+Theresa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":1,"time":1383710931,"description":"This is the definitive A-Z reference book on all things psychic, mysterious and paranormal - the marvels, secrets and mysteries of the visible and the invisible world. This wonderful guide covers everything you could want to know including ghosts, strange phenomena, people, places, events, and ideas. Featuring over 800 A-to-Z entries, this Psychic Encyclopedia is a fascinating compendium of worldwide paranormal activity. With explanations of strange phenomena from both folklore and modern scientific research. Factual information on and explanations of: mediums and spiritualists to near-death experience, ghosts, levitation, telepathy, astral travel, precognition, all forms of divination (tarot, runes, crystal balls, tea leaves, etc.), evidence for the afterlife, contacting spirit guides, haunted sites, famous historical figures, haunted places and documented experiments, and much more. A complete reference of paranormal myth and folklore - and the myths and legends surrounding ghosts and spirits in different cultures throughout the world, from famous ghost stories to various beliefs and superstitions that have taken root in different countries.\nGenre: Non-Fiction&gt; Paranormal","torrent":{"xt":"urn:btih:1b43cf254c108a32638551a47cba504b33e3656b","amp;dn":"Element+Encyclopedia+of+the+Psychic+World%2C+The+-+Cheung%2C+Theresa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b43cf254c108a32638551a47cba504b33e3656b","infoHashBuffer":{"type":"Buffer","data":[27,67,207,37,76,16,138,50,99,133,81,164,124,186,80,75,51,227,101,107]},"announce":[],"urlList":[]}}