{"title":"Marvel NOW! Week 9 (darkhomr) [TPB]","uid":8004035,"size":346389734,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1b7c28027597f0877a9084079e8b6c04609ff2f4&amp;dn=Marvel+NOW%21+Week+9+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dadrkhomr","files":10,"time":1357843415,"description":"Starting the week of January 9, 2013 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/aa3-1.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ff3.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ssm1.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/th3.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/xml4.jpg[/IMG]\n\nAvengers Arena #3 (CBR 1/9/2013)\n\nX-23 vs. ANNIHILATION's Cammi!  A mystery opponent vs. AVENGERS ACADEMY's Sentinel!  Who is the killer stalking the competitors in their sleep?  Plus: Darkhawk equals death! \n\nCable And X-Force #3 (CBR 1/9/2013)\n\nWhere has Colossus been to post-AVX and what is wrong with his powers?  Why are Cable and his team attacking a civilian company?  These mysteries and more are revealed! \n\nFantastic Four #3 (CBR 1/9/2013)\n\nA new year on a new world!  The Richards family rings in 365 days of adventure on a brand new planet!  Someone's having second thoughts. Really? Already?  How long can Reed keep his secret?  How long can anything be kept a secret when you're travelling through time &amp; space with your family?\n\nScarlet Spider #13 (CBR 1/9/2013)\n\n'IN THE MIDST OF WOLVES' PART ONE OF THREE  Brand new arc! Mysteries come to light as a threat from Mexico comes for Aracely, the girl Scarlet Spider saved in issue ONE.  An old foe of Spider-Man's returns, the mutant werewolf CARLOS LOBO... and he's not alone.  PLUS: What is the secret of Kaine's new powers? How did he come back to life after the Grim Hunt? The answers begin here, as everything changes for the man called Kaine. \n\nSuperior Spider-Man #1 (CBR 1/9/2013)\n\nPeter Parker spent a lifetime living up to the responsibilities his powers foisted upon him but his Amazing story finally ended dramatically in the historic Spider-Man #700. The new Amazing Spider-Man has arrived and he is better in every single way. Smarter, stronger...Superior. \n\nThor God Of Thunder #4 (CBR 1/9/2013)\n\nThousands of years in the future the last god king of a ruined Asgard makes his final stand against the berserker legions of the God Butcher.  But even a king can fall. Even King Thor.\n\nThunderbolts #3 (CBR 1/9/2013)\n\nThe Thunderbolts are tearing their way through a bloody mission!  But will even this crew approve of the team's NEWEST MEMBER?  Yeah, that's right-the RED LEADER. \n\nWolverine and the X-Men #23 (CBR 1/9/2013)\n\nWolverine vs. Frankenstein!  The Murder Circus claims its victims! \n\nX-Men Legacy #4 (CBR 1/9/2013)\n\nLEGION vs. THE X-MEN!  Two new villains begin plotting Legion's demise. And little does he know, one of them is lurking within his own psyche, and the other is now hiding amongst the X-Men themselvesÃ– \n\n","torrent":{"xt":"urn:btih:1b7c28027597f0877a9084079e8b6c04609ff2f4","amp;dn":"Marvel+NOW%21+Week+9+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b7c28027597f0877a9084079e8b6c04609ff2f4","infoHashBuffer":{"type":"Buffer","data":[27,124,40,2,117,151,240,135,122,144,132,7,158,139,108,4,96,159,242,244]},"announce":[],"urlList":[]}}