{"title":"[Marijuana]SeeMoreBuds.Vol.1-3.DVD.rips","uid":4215999,"size":1535077514,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ba5c6dc4e9b7ce76937c777239a29829826c53e&amp;dn=%5BMarijuana%5DSeeMoreBuds.Vol.1-3.DVD.rips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"toetag","files":5,"time":1212343286,"description":"I was too stoned to do a perfect job but most of it is there. Shrunk rips of the first 3 SeeMoreBuds DVDs. Most BT clients will let you select just the files you want. The first one is .avi and the next two are .mkv h.264 from Handbrake which may have missed a bit. The full DVDs are out there if someone wants to improve. \n\n\nSeeMoreBuds Vol.1 - 15 Pounds in 80 Days\n\nWatch as a veteran marijuana grower shows you how to set up three simple rooms.\n\nHarvesting an Amazing 15 Pounds in 80 days. That&amp;#039;s 60+ lbs a year!!!\n\nEverything you will see is easily replicated. Watch as a master grower addresses the following issues:\n\n    * Nutrients: The Perfect Mixture\n    * Ventilation: Managing Heat (A real Trick with 11\n      High Pressure Sodium bulbs)\n    * Lighting: Fluorescent and HPS\n    * Clones: Increased Success Rate\n    * Harvest: Curing The Correct Way\n    * Bugs: Prevention And Eradication\n      ....and Much More....\n\nIf you are going to grow marijuana, you must see this DVD. SeeMoreBuds has come out to share and dispell the myths, &quot;that growing is hard&quot;.\n\nSeeMoreBuds reveals a simple &quot;add water&quot; technique that produces some of the biggest yields and kindest herb of modern times.\n\n\n\nSeeMoreBuds Vol.2 - 6 Gardens, 6 Growers\n\nSeeMoreBuds Volume 2 is the ultimate tour of 6 different grows. SeeMoreBuds visits Indoor, outdoor, hydroponic, aeroponic, and soil gardens. You will witness fluorescent lighting and High Intensity Discharge lighting (High Pressure Sodium, Metal Halide) gardens of all sizes.\n\nLearn about cannabis growing from not just one gardener but 6 different gardeners. Access to your peers&amp;#039; gardens is very limited...\n\nSeeMoreBuds has opened the door for you. After watching this video the beginning grower will have a clear idea of the many possibilities available to him/her. The advanced grower will learn from the many details and nuances that SeeMoreBuds points out as you tour these 6 gardens. SeeMoreBuds will show you what these gardeners are doing correctly and what they can do to improve.\n\n&quot;This is better than a 1 year subscription to the magazines&quot;\n     Julian Costa - Santa Barbara, CA\n\nSome of the key elements in SeeMoreBuds Volume 2:\n\n   1. Learn how to grow big buds in a small garden\n   2. Learn different cloning techniques\n   3. How to make a perpetual harvest of non-stop buds\n   4. Proper watering technique that makes transplanting obsolete\n   5. Predators of the garden and how to fight them as never seen before\n   6. How to sex a plant (extreme close up macro shots)\n   7. 6 different set ups of all different sizes, from basements to closets\n   8. Easy winning  soil mixtures\n   9. Detailed DVD menu to jump to your favorite garden\n  10. Access to so many gardens with SeeMoreBuds as your tour guide!\n  11. Indoor, Outdoor, Aeroponic, Hydroponic gardens\n\n\n\nSeeMoreBuds Vol.3 - The Perfect Garden\n\nSeeMoreBuds has been the most prolific presenter of marijuana gardens in the past 4 years. SeeMore brings you 8 new fabulous gardens, in one DVD, including, THE PERFECT GARDEN.\n\nWith unprecedented access, SeeMore examines 8 never before filmed or photographed gardens. SeeMore gives you intimate access into the workings of these gardens. Whether it is the 11,000 watt mega garden or the 2400 watt medical grow room, SeeMore shows, explains and reveals these gardens with both great verbal and visual articulation.\n\nNever before have so many underground gardens been so accessible to the public! No other DVD, MAGAZINE, or BOOK shows this many plants, this many grow rooms, or this much insight into cannabis cultivation. If your goal is to learn the fundamentals of setting up a grow room and then using that grow room to get massive yields, this is the DVD for you.\n\n&quot;A 12 month subscription to any of the numerous cannabis magazines did not inspire me as much as The Perfect Garden&quot;\nHarper - Humbolt County, California \n\n","torrent":{"xt":"urn:btih:1ba5c6dc4e9b7ce76937c777239a29829826c53e","amp;dn":"%5BMarijuana%5DSeeMoreBuds.Vol.1-3.DVD.rips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba5c6dc4e9b7ce76937c777239a29829826c53e","infoHashBuffer":{"type":"Buffer","data":[27,165,198,220,78,155,124,231,105,55,199,119,35,154,41,130,152,38,197,62]},"announce":[],"urlList":[]}}