{"title":"The Rack (VHS) [1956] Paul Newman","uid":6453537,"size":1007337525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1baab9b2a9e740ce22024e8297a492232bb001f6&amp;dn=The+Rack+%28VHS%29+%5B1956%5D+Paul+Newman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1307518159,"description":" &lt;a href=&quot;http://bayimg.com/eanljAacF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/eanljAacF&lt;/a&gt;\n\nThe Rack (1956) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0049652/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0049652/&lt;/a&gt;\n\nThe Rack is a 1956 American war drama film directed by Arnold Laven and starring Paul Newman, Wendell Corey, Lee Marvin and Walter Pidgeon. After two years in a North Korean prison camp, an American officer returns home, only to be charged with collaboration by his own side. He is forced to defend his actions in court.\n\n\n Paul Newman ...  Capt. Edward W. Hall Jr. \n Wendell Corey ...  Maj. Sam Moulton \n Walter Pidgeon ...  Col. Edward W. Hall Sr. \n Edmond O'Brien ...  Lt. Col. Frank Wasnick \n Anne Francis ...  Aggie Hall \n Lee Marvin ...  Capt. John R. Miller \n Cloris Leachman ...  Caroline \n Robert Burton ...  Col. Ira Hansen \n Robert F. Simon ...  Law Officer (as Robert Simon) \n Trevor Bardette ...  Court President \n Adam Williams ...  Sgt. Otto Pahnke \n James Best ...  Millard Chilson Cassidy \n Fay Roope ...  Col. Dudley Smith \n Barry Atwater ...  Maj. Byron Phillips \n\nThe wildfire success of The Caine Mutiny (1954) sent the studios scouring their script departments for other military courtroom dramas to bring to the big screen. Before you could say &quot;unfit for active duty,&quot; Warners had The Court-Martial of Billy Mitchell (1955) before the cameras; MGM soon followed suit with The Rack (1956), a taut psychological drama about a Korean War traitor. The huge difference here was that, unlike Warner's big budget color and Cinemascope production, Metro lensed their movie in black and white, primarily choosing cast and crew from their former enemy - that dreaded little video box, television. The modestly budgeted result proved a smart move for reasons beyond economics. MGM had a lot banking on rising star Paul Newman, who was already signed to portray fighter Rocky Graziano in their upcoming biopic, Somebody Up There Likes Me (1956). The Rack would provide an excellent showcase for the actor, allowing him a wide range of emotions from self-assurance to complete breakdown. Originally the part was offered to Glenn Ford, who turned the role down for fear of typecasting; he had previously appeared in another courtroom drama for MGM - Trial (1955) - but, in actuality, he harbored severe reservations about portraying such an overwrought, conflicted character.\n\nBy the mid-50s TV was swiftly becoming the movies' major testing ground for new talent such as Paul Newman, and The Rack (1956) is virtually a textbook example of this practice. It mirrors George Sanders sardonic (and prophetic) reply to Marilyn Monroe as she considers a TV audition in All About Eve: &quot;That's all television is - auditions.&quot; Aside from Newman, the stellar cast contains a number of stage and screen luminaries, who were currently making themselves familiar to television audiences: Edmond O'Brien, Wendell Corey, and character actors Robert Simon, Adam Williams and Barry Atwater. Furthermore, The Rack was peppered with an unusually select group of thespians who would eventually become familiar to future moviegoers: Cloris Leachman, Robert Blake, Dean Jones, James Best, Lee Marvin and Rod Taylor. As for the director, the prolific Arnold Laven, he would make his name in 60s television - being one of the prime forces behind the popular Western series, The Big Valley (1965-1969). Most prominently, however, was the source material for The Rack, a teleplay by Rod Serling, who, along with contemporaries Paddy Chayefsky and Horton Foote, set incredibly high standards for television drama before moving on to feature films.\n\nAlthough The Rack finished shooting before the Graziano picture, Metro wisely held up release until Somebody Up There Likes Me opened nationally, thereby confirming Newman's promise as a worthy rival to Brando, Clift and the late James Dean. With the release of The Rack, Newman received more critical acclaim and was able to distance himself a little more from his 1954 appearance in The Silver Chalice, a movie he personally detested. For MGM, The Rack would prove a profitable surprise, particularly later in TV syndication, where it became a perennial favorite during the 1960s and 1970s, mainly due to Newman's presence and the extraordinary supporting players, so many of whom came into their own during the subsequent two decades.\n\n","torrent":{"xt":"urn:btih:1baab9b2a9e740ce22024e8297a492232bb001f6","amp;dn":"The+Rack+%28VHS%29+%5B1956%5D+Paul+Newman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1baab9b2a9e740ce22024e8297a492232bb001f6","infoHashBuffer":{"type":"Buffer","data":[27,170,185,178,169,231,64,206,34,2,78,130,151,164,146,35,43,176,1,246]},"announce":[],"urlList":[]}}