{"title":"Louise Hay - I Can Do It","uid":4087536,"size":72930145,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c2186c2cc3306d88010d8bc2e5a3820a2b62fac&amp;dn=Louise+Hay+-+I+Can+Do+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"praeator","files":10,"time":1205895920,"description":"Book Description\nIn this concise yet information-packed book?which you can listen to on the enclosed CD or read at your leisure?bestselling author Louise L. Hay shows you that you &quot;can do it&quot;?that is, change and improve virtually every aspect of your life?by understanding and using affirmations correctly.\n\nLouise explains that every thought you think and every word you speak is an affirmation. Even your self-talk, your internal dialogue, is a stream of affirmations. You?re affirming and creating your life experiences with every word and thought. Your beliefs are merely habitual thinking patterns that you learned as a child, and many of them work very well for you. But other beliefs may be limiting your ability to create the very things you say you want. You need to pay attention to your thoughts so that you can begin to eliminate the ones creating experiences that you don?t want.\n\nAs Louise discusses topics such as health, forgiveness, prosperity, creativity, relationships, job success, and self-esteem, you?ll see that affirmations are solutions that will replace whatever problem you might have in a particular area.\n\nBy the end of this book, you?ll be able to say &quot;I can do it&quot; with confidence, knowing that you?re on your way to the wonderful, joy-filled life you deserve.\n\nAbout the Author\nLouise L. Hay is a metaphysical lecturer and teacher and the bestselling author of numerous books, including You Can Heal Your Life trade ? 0-937611-01-8, which has sold 30 million worldwide; You Can Heal Your Life Gift edition?1-56170-628-0; and Empowering Women?1-56170-609-4. Her works have been translated into 25 different languages in 33 countries throughout the world. Since beginning her career as a Science of Mind minister in 1981, Louise has assisted thousands of people in discovering and using the full potential of their own creative powers for personal growth and self-healing. Louise is the founder and chairman of Hay House, Inc., a publishing company that disseminates books, audios, and videos that contribute to the healing of the planet. Louise lives in San Diego, California, where she spends her time loving life, gardening, and writing. \n\nPublisher: Hay House; Har/Com edition (January 1, 2004)\n &lt;a href=&quot;\nhttp://www.hayhouse.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hayhouse.com&lt;/a&gt;","torrent":{"xt":"urn:btih:1c2186c2cc3306d88010d8bc2e5a3820a2b62fac","amp;dn":"Louise+Hay+-+I+Can+Do+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c2186c2cc3306d88010d8bc2e5a3820a2b62fac","infoHashBuffer":{"type":"Buffer","data":[28,33,134,194,204,51,6,216,128,16,216,188,46,90,56,32,162,182,47,172]},"announce":[],"urlList":[]}}