{"title":"Cross Site Scripting (XSS) Attacks for Pentesters","uid":11798480,"size":170505999,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1c8c5a5fbf0e4b52c03bbbb513364d37998efbb7&amp;dn=Cross+Site+Scripting+%28XSS%29+Attacks+for+Pentesters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Dr.Lotus","files":16,"time":1428272320,"description":"[IMG]http://extraimago.com/images/2015/02/23/vlcsnap-2015-02-23-07h28m50s58.png[/IMG]\n\n[b]COURSE DESCRIPTION[/b]\n\nCross Site Scripting or XSS is still one of the most common injection vulnerability that exist in modern as well as legacy Web Applications. This course will teach XSS in-depth and even talk about the lesser known derivatives of XSS called Mutation XSS (mXSS) and Relative Path Overwrite XSS (RPO XSS). If you are interested in learning about the different types of XSS, different context in XSS, and about real world red team XSS Exploitation, then this course is for you and it does not take hours. Invest just 2 hours and master XSS in-depth.\n\nThis course is completely hands-on and every concept is explained with a demo or exercise. This allow students to try out all the things that they have learned. This course explains XSS, its types, context and also discuss about exploiting XSS vulnerabilities in real world where you can perform offensive attacks ranging from Keylogging, Cookie Stealing, Phishing, Victim/Browser/Network Fingerprinting to much advanced attacks like reverse TCP shell, Driveby Attacks etc with OWASP Xenotix XSS Exploit Framework.\n\nOWASP Xenotix XSS Exploit Framework is an Advanced Cross Site Scripting Vulnerability Detection and Exploitation Framework written by the author of this course. Finally we will also discuss about XSS Protection where we discuss about Input Validation, Context Sensitive output escaping and the various security headers that help us to mitigate XSS. Also as a take away you will get &quot;The Ultimate XSS Protection Cheat sheet&quot; from OpenSecurity.\n\nOriginal Course Link:\n\n[code]https://www.udemy.com/cross-site-scripting-xss-attacks-for-pentesters/[/code]","torrent":{"xt":"urn:btih:1c8c5a5fbf0e4b52c03bbbb513364d37998efbb7","amp;dn":"Cross+Site+Scripting+%28XSS%29+Attacks+for+Pentesters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8c5a5fbf0e4b52c03bbbb513364d37998efbb7","infoHashBuffer":{"type":"Buffer","data":[28,140,90,95,191,14,75,82,192,59,187,181,19,54,77,55,153,142,251,183]},"announce":[],"urlList":[]}}