{"title":"Josef Sudek (Photography Art Ebook).pdf","uid":10171851,"size":14307607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c8d81f917ea47c9e9be924b62165fa61de8e5ed&amp;dn=Josef+Sudek+%28Photography+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1400373997,"description":"2001 / Phaidon / English / pdf / 125 pag / 13.6 MB\n\nThis volume - investigating the work of a particular photographer, in this case, Josef Sudek - comprises a 4000-word essay by an expert in the field, 55 photographs presented chronologically, each with a commentary, and a biography of the featured photographer.\n\nLittle-known in the West, Czech photographer Josef Sudek (1896-1976), who lost an arm in WW I, endured from 1938 onwards the hardships of Nazi and Soviet occupations, but persisted in his art, producing an intensely personal and emotional body of work. That work is classified in this luxurious monograph into three major categories: Prague city panoramas; architectural and street studies comparable to Eugene Atget's Paris portfolios; and evocative &quot;mood&quot; compositions--views of an ancient Greek coin, a Gothic church, an Art Nouveau window, bare winter branches, chestnuts in bloom. In a preface, Kirschner, photography curator of the Museum of Decorative Arts in Prague, recalls how Sudek created from limited settings a &quot;Magic Garden&quot; of photographs--and, in contrast to most of his work, at times embraced surrealism: his often startling use of a glass eye as a prop was a favored device. ","torrent":{"xt":"urn:btih:1c8d81f917ea47c9e9be924b62165fa61de8e5ed","amp;dn":"Josef+Sudek+%28Photography+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c8d81f917ea47c9e9be924b62165fa61de8e5ed","infoHashBuffer":{"type":"Buffer","data":[28,141,129,249,23,234,71,201,233,190,146,75,98,22,95,166,29,232,229,237]},"announce":[],"urlList":[]}}