{"title":"Prestressed Concrete 5th Edition Upgrade: ACI, AASHTO, IBC 2009","uid":6462695,"size":41898422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d7c599e4735c735bcdc58bb6d5579bc6325590c&amp;dn=Prestressed+Concrete+5th+Edition+Upgrade%3A+ACI%2C+AASHTO%2C+IBC+2009+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1307834289,"description":"Prestressed Concrete 5th Edition Upgrade: ACI, AASHTO, IBC 2009 Codes Version (5th Edition) by Edward G. Nawy\nProduct Description\nCompletely revised to reflect the new ACI 318-08 Building Code and International Building Code, IBC 2009, this popular book offers a unique approach to examining the design of prestressed concrete members in a logical, step-by-step trial and adjustment procedure. Integrates handy flow charts to help readers better understand the steps needed for design and analysis. Includes a revised chapter containing the latest ACI and AASHTO Provisions on the design of post-tensioned beam end anchorage blocks using the strut-and-tie approach in conformity with ACI 318-08 Code. Offers a new complete section with two extensive design examples using the strut-and-tie approach for the design of corbels and deep beams. Features an addition to the elastic method of design, with comprehensive design examples on LRFD and Standard AASHTO designs of bridge deck members for flexure, shear and torsion, conforming to the latest AASHTO specifications. Includes a revised chapter on slender columns, including a simplified load-contour biaxial bending method which is easier to apply in desiign, using moments rather than loads in the reciprocal approach. A useful construction reference for engineers.\n\nAbout the Author\nDR. EDWARD G. NAWY is a distinguished profession in the Department of Civil and Environmental Engineering at Rutgers, The State University of New Jersey. He has been active in the ACI and PCI since 1949 and is internationally recognized for his extensive work in the fields of reinforced and prestressed concrete, particularly in the areas of crack and deflection control. Dr. Nawy has published in excess of 160 papers in numerous technical journals worldwide and is the author of Reinforced Concrete: A Fundamental Approach, 4th Edition, Ã‚Â©2000, published by Prentice Hall, Fundamentals of High Performance Concrete, 2nd Edition, Ã‚Â©2000, published by John Wiley and Sons, and Concrete Construction Engineering Handbook, Ã‚Â©1998, published by CRC Press. He is the recipient of several major awards, including the Henry L. Kennedy Award of the ACI, honorary professorship, Nanjing Institute of Technology, and is Evaluator for the Accreditation Board for Engineering and Technology (ABET). He is licensed Professional Engineer in the States of New York, New Jersey, Pennsylvania, California and Florida, and has been a consultant in structural engineering to agencies throughout the United States.\n\nProduct Details\nHardcover: 984 pages\nPublisher: Prentice Hall; 5 edition (August 21, 2009)\nLanguage: English\nISBN-10: 0136081509\nISBN-13: 978-0136081500\n\n[poly-technic.blogspot]","torrent":{"xt":"urn:btih:1d7c599e4735c735bcdc58bb6d5579bc6325590c","amp;dn":"Prestressed+Concrete+5th+Edition+Upgrade%3A+ACI%2C+AASHTO%2C+IBC+2009+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7c599e4735c735bcdc58bb6d5579bc6325590c","infoHashBuffer":{"type":"Buffer","data":[29,124,89,158,71,53,199,53,188,220,88,187,109,85,121,188,99,37,89,12]},"announce":[],"urlList":[]}}