{"title":"OBDII Trouble Codes 1.14 Android APK Free","uid":11769583,"size":5275548,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:1d96abf27bf1c04a857cf98c412b7ad65ab58e19&amp;dn=OBDII+Trouble+Codes+1.14+Android+APK+Free&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1427019559,"description":"This app is the most complete offline OBD2 (EOBD) diagnostic trouble code definitions database. It contains more than 18500 error descriptions. It is the most full database in market.\n\nVery simple to use! You don't even have to select your car model. Just enter your fault code and app will show you all supported descriptions. No Internet connection needed, no longer spend hours to search for single code description, looking at check engine light. OBDII trouble code lookup has never been easier.\n\nIf you have cable, bluetooth or WiFi OBDII fault code reader (adapter) (ELM327, PLX Kiwi, OBDLink or any other) you need this app for code description because most of code scanners does not contain full DTC (diagnostic trouble code)  database and displays only meaningfull numbers. Be prepared for any troubles wherever you are!\n\nYou can select and copy error description with simple long press on text, and then paste it in SMS, e-mail or wherever you want! (Android 3.0 and later only)\n\nIf your car supports OBD II or EOBD, then you can already use almost 5000 generic OBDII codes. These codes are from PowerTrain series (P0XXX, P2XXX, P34XX), Body Series (B0XXX), Chassis series (C0XXX), Network series (U0XXX, U2XXX, U3XXX).\n\nAlso there is a list of more than 13500 additional manufacturer specific codes.\nSupported manufacturers with specific codes:\nAcura\nAlfa Romeo\nBMW\nChrysler / Dodge / Jeep\nCitroen / Peugeot\nDaewoo\nFiat\nFord\nGeo\nGM (Buick, Cadillac, Chevrolet, GMC, Hummer, Pontiac)\nHonda\nHyundai\nInfinity\nIsuzu\nJaguar\nKia\nLamborghini\nLand Rover\nLexus \nLincoln\nMazda\nMercedes\nMercury\nMini\nMitsubishi\nNissan\nOldsmobile\nOpel / Vauxhall\nPlymouth\nPorsche\nRenault (DF codes)\nSaab\nSaturn\nScion\nSubaru\nSuzuki\nToyota\nVolskwagen Audi Group\nVolvo\n\n\nNote that it is impossible to create complete OBD DTC database. Manufacturers adding new codes and changing old ones. So if you cannot find your code or if you think that some code not correct anymore, please write us!\nYou have to use special scantool for connecting to OBDII scanner (for example,  Torque Lite, Torque Pro, Dashcommand or Car Gauge)","torrent":{"xt":"urn:btih:1d96abf27bf1c04a857cf98c412b7ad65ab58e19","amp;dn":"OBDII+Trouble+Codes+1.14+Android+APK+Free","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d96abf27bf1c04a857cf98c412b7ad65ab58e19","infoHashBuffer":{"type":"Buffer","data":[29,150,171,242,123,241,192,74,133,124,249,140,65,43,122,214,90,181,142,25]},"announce":[],"urlList":[]}}