{"title":"BBC.The.Story.of.India.4of6.Ages.of.Gold.XviD.AC3.","uid":4283103,"size":782526464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1e6f07116ea1d6bfd985f12dc4a4411e52d7481a&amp;dn=BBC.The.Story.of.India.4of6.Ages.of.Gold.XviD.AC3.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"circlensess","files":1,"time":1215536232,"description":"The Story of India\n\nTravel Documentary hosted by Michael Wood and published by BBC in 2007 - English narration\n\n\nInformation\n------------------------------\n\nThe world&amp;#039;s largest democracy and a rising economic giant, India is now as well known across the globe for its mastery of computer technology as it is for its many-armed gods and its famous spiritual traditions. But India is also the world&amp;#039;s most ancient surviving civilisation, with unbroken continuity back into prehistory.\nLike other great civilisations - Greece or Egypt for example, over the millennia it has enjoyed not just one but several brilliant golden ages in art and culture. Its great thinkers and religious leaders have permanently changed the face of the globe. But while the glories of Rome, Egypt, and Greece, have all been the subject of TV portraits, as yet there has been no television story of India on our screens. This series sets out for the first time to do that: to show a world audience the wonders of India; the incredible richness and diversity of its peoples, cultures and landscapes; and the intense drama of its past, including some of the most momentous, exciting and moving events in world history.\nuntitled image\nIn this landmark six-part series for PBS and the BBC, Michael Wood will embark on a dazzling and exciting journey through today&amp;#039;s India, &amp;#039;seeking in the present for clues to her past, and in the past for clues to her future&amp;#039;.\n\n\n1) Beginnings \nMichael Wood journeys through the subcontinent, tracing the incredible richness and diversity of its peoples, cultures and landscapes. Through ancient manuscripts and oral tales Michael charts the first human migrations out of Africa. He travels from the tropical backwaters of South India through lost ancient cities in Pakistan to the vibrant landscapes of the Ganges plain. In Turkmenistan dramatic archaeological discoveries cast new light on India&amp;#039;s past.\n\n2) The Power of Ideas \nMichael Wood&amp;#039;s epic series moves on to the revolutionary years after 500BC - the Age of the Buddha. Travelling by rail to the ancient cities of the Ganges plain, by army convoy through Northern Iraq, and on down the Khyber Pass, he shows how Alexander the Great&amp;#039;s invasion of India inspired her first empire.\n\n3) Spice Routes and Silk Roads \nIn this episode he traces India in the days of the Roman Empire. In Kerala the spice trade opened India to the world, whilst gold and silk bazaars in the ancient city of Madurai were a delight for visiting Greek traders. From the deserts of Turkmenistan Michael travels down the Khyber Pass to Pakistan to discover a forgotten Indian Empire that opened up the Silk Route and at Peshawar built a lost Wonder of the World.\n\n4) Ages of Gold \nDocumentary series about the history of India. Presenter Michael Wood seeks out the achievements of the country&amp;#039;s golden age, discovering how India discovered zero, calculated the circumference of the Earth and wrote the world&amp;#039;s first sex guide, the Kama Sutra. In the south, he visits the giant temple of Tanjore and sees traditional bronze casters, working as their ancestors did 1,000 years ago.\n\n5) The Meeting of Two Oceans \nThe documentary series about the history of India charts the coming of Islam to the subcontinent and one of the greatest ages of world civilisation: the Mughals. Michael Wood visits Sufi shrines in Old Delhi, desert fortresses in Rajasthan and the cities of Lahore and Agra, where he offers a new theory on the design of the Taj Mahal. He also looks at the life of Akbar, a Muslim emperor who decreed that no one religion could hold the ultimate truth, but whose dream of unity ended in civil war.\n\n6) Freedom \nThis episode examines the British Raj and India&amp;#039;s struggle for freedom. Wood reveals how in South India a global corporation came to control much of the subcontinent, and explores the magical culture of Lucknow, discovering the enigmatic Briton who helped found the freedom movement. He traces the Amritsar massacre, the rise of Gandhi and Nehru, and the events that led to the Partition of India in 1947.\n\nScreenshots\n------------------------------\n\n\nTechnical Specs\n------------------------------\n\n\n* AVI File Details\n\n1) \n\n1) \n\n1) \n\n1) \n\n1) \n\n1) \n====\n* Name.........:\n* Filesize.....: 746 MB (or 764,318 KB or 782,661,632 bytes)\n* Runtime......: 00:59:02 (88,550 fr)\n* Video Codec..: XviD\n* Video Bitrate: 1571 kb/s\n* Audio Codec..: ac3 (0x2000) Dolby Laboratories, Inc\n* Audio Bitrate: 192 kb/s (96/ch, stereo) CBR\n* Frame Size...: 704x400 (1.76:1) [~7:4]\n\n\n\nLinks\n------------------------------\n\n1) Related Documentaries \n* Around the World in 80 Treasures\n* The Art of Travel\n* Rick Steves&amp;#039; Europe\n* The Delights of Turkey\n* In Search of the Trojan War\n* Paul Merton in China\n\n2) ed2k Links \n\n\n\n\n\n\nSource: http://docuwiki.net/index.php?title=The_Story_of_India","torrent":{"xt":"urn:btih:1e6f07116ea1d6bfd985f12dc4a4411e52d7481a","amp;dn":"BBC.The.Story.of.India.4of6.Ages.of.Gold.XviD.AC3.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6f07116ea1d6bfd985f12dc4a4411e52d7481a","infoHashBuffer":{"type":"Buffer","data":[30,111,7,17,110,161,214,191,217,133,241,45,196,164,65,30,82,215,72,26]},"announce":[],"urlList":[]}}