{"title":"Back to the Future Trilogy","uid":5601556,"size":1756907142,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:205c15ca3e175fcb95e587e7f032146bb64cbc2b&amp;dn=Back+to+the+Future+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rockinator555","files":3,"time":1275342266,"description":"The Back to the Future series is a comedic  science fiction adventure film series written by Bob Gale  and Robert Zemeckis, directed by Zemeckis, produced by Amblin Entertainment and distributed by Universal Pictures. The main plot follows the adventures of a high school student Marty McFly (Michael J. Fox) and eccentric scientist Dr. Emmett Brown (Christopher Lloyd) as they use a modified DeLorean automobile to time travel to different periods of the history of Hill Valley, California.\n\nThe first film was the highest-grossing film of 1985 and became an international phenomenon, leading to the second and third films which were filmed back-to-back and released in 1989 and 1990 respectively. Though the two sequels did not perform quite as well at the box office as the first film, the trilogy remains immensely popular after nearly a quarter century and has yielded such spin-offs as an animated television series and a motion-simulation ride at the Universal Studios Theme Parks in Universal City, California (now closed); Orlando, Florida (now closed), and Osaka, Japan. The film's visual effects were done by Industrial Light and Magic. All together, the trilogy was nominated for five Academy Awards, one of which (Best Sound Editing) was won.\n\n--http://en.wikipedia.org/wiki/Back_to_the_Future_%28film_series%29--","torrent":{"xt":"urn:btih:205c15ca3e175fcb95e587e7f032146bb64cbc2b","amp;dn":"Back+to+the+Future+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205c15ca3e175fcb95e587e7f032146bb64cbc2b","infoHashBuffer":{"type":"Buffer","data":[32,92,21,202,62,23,95,203,149,229,135,231,240,50,20,107,182,76,188,43]},"announce":[],"urlList":[]}}