{"title":"Jesse Ventura - American Conspiracies - Lies, Lies, and More Dir","uid":15448506,"size":1226829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21095e1042bc22afe60387e7d42d66b511e94ede&amp;dn=Jesse+Ventura+-+American+Conspiracies+-+Lies%2C+Lies%2C+and+More+Dir&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469919022,"description":"https://extraimago.com/images/2016/07/30/c3ea1b4e922cfdbc6de457a8edca0d48-d.jpg\r\n\r\nJesse Ventura - American Conspiracies - Lies, Lies, and More Dirty Lies that the Government Tells Us 2011\r\n\r\nIn this explosive account of wrongful acts and ensuing cover-ups, Jesse Ventura takes a systematic look at the wide gap between what the government knows and when the government knows it, and what is revealed to the American people and when it is revealed. The media is complicit in these acts of deception, often refusing to consider alternate possibilities and dismissing voices that diverge from public opinion. In American Conspiracies, Ventura looks closely at the theories that have been presented over the years and examines the truth, as well as the lies.\r\n\r\nThe assassinations of Abraham Lincoln, the Kennedys, and Martin Luther King Jr.—these cases and more need to be re-examined in Ventura’s eyes. Was Watergate presented honestly, or was the CIA involved? Did the Republican Party set out to purposefully steal two elections? Has all of the evidence on 9/11 been presented, or is there another angle that the media is afraid to explore? And finally, is the collapse of today’s financial order and the bailout plan by the Federal Reserve the widest-reaching conspiracy ever perpetrated? Nothing gets by Jesse Ventura in American Conspiracies","torrent":{"xt":"urn:btih:21095e1042bc22afe60387e7d42d66b511e94ede","amp;dn":"Jesse+Ventura+-+American+Conspiracies+-+Lies%2C+Lies%2C+and+More+Dir","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21095e1042bc22afe60387e7d42d66b511e94ede","infoHashBuffer":{"type":"Buffer","data":[33,9,94,16,66,188,34,175,230,3,135,231,212,45,102,181,17,233,78,222]},"announce":[],"urlList":[]}}