{"title":"The Rolling Stones - Flowers (1967) WMA320","uid":6314974,"size":96331421,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2127ffb30e848162a073e76985712a7aa5f12f3c&amp;dn=The+Rolling+Stones+-+Flowers+%281967%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302672242,"description":"OK...To understand Flowers, you have to first realize the context in which it was released. Flowers was released as an American only album of material that was not issued on previous albums, material that was cut from the American versions of albums released in their full 14 track format in Britain, or singles that had not made it into an album yet. Also don't forget that the Stones weren't touring at the time, attempting to find the same refuge that the Beatles had in their studio to try some experimentation a la Sgt. Peppers which became Satanic Majesties. Now that the proper context has been established, this album finds the Rolling Stones at the peak of their mid-60's creative power. Group founder Brian Jones had not yet cashed out on his drug and alcohol binges and he was totally into what has retrospectively been dubbed &quot;flavoring&quot; the albums and tracks that the Stones were putting out. The album is strung together with singles: &quot;Ruby Tuesday&quot; b/w &quot;Let's Spend the Night Together&quot;, &quot;Have You Seen Your Mother?&quot;, &quot;Mother's Little Helper&quot;, and &quot;Lady Jane&quot;. This material coupled with the leftovers from the British releases of Aftermath and Between the Buttons helps make this album somewhat eclectic like the other two albums but no less entertaining. The psycho-Bo Diddley &quot;Please Go Home&quot; is great 60's style garage-psyche rock. Anytime the Stones go Bo Diddley is worth listening to, by the way. &quot;Out of Time&quot; is a great companion piece to &quot;Under My Thumb&quot; from Aftermath, as it features much of the same instrumentation, with Brian Jones anchoring the song on his marimbas once again. &quot;Back Street Girl&quot; and &quot;Ride on Baby&quot; both fall into the same vein, with the use of the classical instruments on the rock tracks for that mock-Baroque feel that many of the 60's bands like the Kinks and Yardbirds went for with their use of harpsichords, etc. &quot;Sitting on a Fence&quot; and &quot;Take It or Leave It&quot; are also like songs, with similar feels and good acoustic guitar work. &quot;My Girl&quot; to me is the one oddity on the album but somehow it works with the eclecticness of the finished product. \nThis album was one of the first albums that I ever bought when I got into the Rolling Stones. It was also the first Stones album that I bought my fiancee when we were 16. We both loved it and I have never regretted that choice. For me, the albums Aftermath and Between the Buttons represent height of the Stones in the 60's before they changed directions forever. This album, Flowers, bridges the two in the same way that Rubber Soul and Revolver were bridged by Yesterday and Today. These albums form critical trilogies of albums at points where two bands were reaching critical mass just as the dream of the 60's was ending for so many. \nNow for the disclaimer: as some reviewers have pointed out, this album is not part of the canon of Rolling Stones albums. That may be true but when you compare this album to others such as Exile on Main Street and Sticky Fingers or Beggars Banquet and Let It Bleed, but you are essentially comparing different bands and different times when holding Flowers against these rockers. Flowers is a great album that is completely misunderstood and underestimated. This album came out in 1967 and when compared with other albums of that time and place it shines with the best of them.\n\nby Hobart Arms\n\nTRACKLIST:\n\n01 - Ruby Tuesday.wma                                                 \n02 - Have You Seen Your Mother, Baby.wma                              \n03 - Let's Spend The Night Together.wma                               \n04 - Lady Jane.wma                                                    \n05 - Out Of Time (Version 2).wma                                      \n06 - My Girl.wma                                                      \n07 - Back Street Girl.wma                                             \n08 - Please Go Home.wma                                               \n09 - Mother's Little Helper.wma                                       \n10 - Take It Or Leave It.wma                                          \n11 - Ride On, Baby.wma                                                \n12 - Sittin' On A Fence.wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:2127ffb30e848162a073e76985712a7aa5f12f3c","amp;dn":"The+Rolling+Stones+-+Flowers+%281967%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2127ffb30e848162a073e76985712a7aa5f12f3c","infoHashBuffer":{"type":"Buffer","data":[33,39,255,179,14,132,129,98,160,115,231,105,133,113,42,122,165,241,47,60]},"announce":[],"urlList":[]}}