{"title":"The Mary Onettes - Islands [2009]","uid":5863981,"size":88183616,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:212b08ba8359ebf75a7c3d17c88e32839f2df694&amp;dn=The+Mary+Onettes+-+Islands+%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"80zforever","files":12,"time":1286072777,"description":"Sometimes you hear a song, album, band at just the right time and it just clicks with you. At another point in your life, you might have thought it was okay but at the right time, it's stellar. And The Mary Onettes are stellar to me.\n\nThe resounding theme of this album is the passing of time, the lament that youth is fading and there is no way to get it back. Not exactly happy material. I turned 47 this summer and have since, on too many occasions, realized there is a good possibility that my life is more than half over. Not a pleasant thought on the best of days. I've also finally found the life I should be living. I don't think I've necessarily wasted my life to this point because I wouldn't be where I am without everything I've gone through. I don't wish I was younger but I do wish I had more time to spend right now. As personal as all this is, it is these thoughts and feelings that makes Islands mean so much to me.\n\nEven without the relevance, this would be a good album. &quot;God Knows I Had Plans&quot;, &quot;Dare&quot;, &quot;The Disappearance of My Youth&quot; and &quot;Puzzles&quot; are standouts. The rest are nearly as good. As I stated earlier, this may not be the happiest of albums and won't appeal to everyone. It just works for me. I love these guys and their music. They remind me of the best of times in my life, the 80s.\n\nSo two albums in and The Mary Onettes just keep getting better and better. They are definitely a favorite band and Islands is one of those albums that will forever mean so much to me.\n\n1 Puzzles  4:33 \n2 Dare  3:46 \n3 Once I Was Pretty  4:13 \n4 Cry for Love  3:59 \n5 The Disapperance of My Youth  3:55 \n6 God Knows I Had Plans  4:19 \n7 Symmetry  3:58 \n8 Century  4:37 \n9 Whatever Saves Me  3:55 \n10 Bricks  5:09 \n","torrent":{"xt":"urn:btih:212b08ba8359ebf75a7c3d17c88e32839f2df694","amp;dn":"The+Mary+Onettes+-+Islands+%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212b08ba8359ebf75a7c3d17c88e32839f2df694","infoHashBuffer":{"type":"Buffer","data":[33,43,8,186,131,89,235,247,90,124,61,23,200,142,50,131,159,45,246,148]},"announce":[],"urlList":[]}}