{"title":"Railworks TS2015 Just Trains The Mayflower Line - GEML Manningtr","uid":12012344,"size":168254406,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:214b93174e3c4fe84be59e05b2135d6ed8377849&amp;dn=Railworks+TS2015+Just+Trains+The+Mayflower+Line+-+GEML+Manningtr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TS2015","files":1,"time":1434232691,"description":"If you own the Great Eastern Main Line London-Ipswich Route Add-On and have noticed that the part of the line from around a mile outside of Manningtree to Harwich Town is track only and has no scenery or detail, Just Trains brings you the missing parts to make the Mayflower line shine in glorious detail!  \n\nRunning approximately 11 miles, alongside the River Stour in the East of Essex, the Line from Manningtree to Harwich is known as the Mayflower Line and is electrified by 25kV overhead line equipment.\n\nFive new stations including the International Terminal at Harwich are included along with many custom-built objects to add realism to your drive. The Parkeston Marshalling Yard to the west of Harwich International station and the Harwich Refinery are included.  \n\nA set of 23 brand new scenarios (14 Standard and 9 Free Roams) are included and not only cover the Mayflower line but also other parts of the Great Eastern Main Line London-Ipswich Route Add-On. (Note: additional stock, not supplied, is required to allow some of the scenarios to operate.)\n\nAlso included is a set of reskins for the containers that come with the Freightliner Class 70 and Class 86 Loco Packs, (not supplied, available to purchase from Steam).\n\nNote: You must have the Great Eastern Main Line London-Ipswich Route (available via Steam) installed to allow this add-on to work.\n\nNOTE---&gt; THIS WORKS ON LEGIT &amp; PIRATED VERSION'S OF TS2015","torrent":{"xt":"urn:btih:214b93174e3c4fe84be59e05b2135d6ed8377849","amp;dn":"Railworks+TS2015+Just+Trains+The+Mayflower+Line+-+GEML+Manningtr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214b93174e3c4fe84be59e05b2135d6ed8377849","infoHashBuffer":{"type":"Buffer","data":[33,75,147,23,78,60,79,232,75,229,158,5,178,19,93,110,216,55,120,73]},"announce":[],"urlList":[]}}