{"title":"Everything Everything - Man Alive [2010] [EAC,log,cue. FLAC]","uid":9103646,"size":354601263,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:216a9f784fb01f9b34ab49a1a6c8d5449db39ffb&amp;dn=Everything+Everything+-+Man+Alive+%5B2010%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":14,"time":1382812451,"description":"Artist: Everything Everything\nRelease: Man Alive\nReleased:  2010\nLabel:   Geffen\nCatalog#:  2733978\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: uk\nStyle:experimental, indie Rock\n\n\n\n01. MY KZ, UR BF (3:38)\n02. Qwerty Finger (3:53)\n03. Schoolin' (4:40)\n04. Leave The Engine Room (3:09)\n05. Final Form (5:29)\n06. Photoshop Handsome (3:19)\n07. Two For Nero (4:22)\n08. Suffragette Suffragette (4:06)\n09. Come Alive Diana (4:16)\n10. NASA Is On Your Side (5:07)\n11. Tin (The Manhole) (4:29)\n12. Weights (5:40)\n\nPlaced further down the prestigious BBC Sound of 2010 poll than fellow Mancunians Hurts and Delphic, art pop quartet Everything Everything have since quietly gone on to become the city's most celebrated new band, receiving nominations for both the Ivor Novello Awards and the Mercury Music Prize as well as earning favorable comparisons with indie greats such as XTC, Talking Heads, and Radiohead. Produced by David Kosten (Bat for Lashes, Guillemots), their debut album, Man Alive, certainly justifies the attention. Packed with barbershop quartet harmonies, experimental rhythms, and often unintelligible lyrics, its 12 buoyant tracks weave around a playful but intelligent melting pot of sounds like a hyperactive toddler, whether channeling the staccato R&amp;B of early Timbaland on &quot;Schoolin',&quot; echoing the downbeat electronica of Thom Yorke's solo work on &quot;Final Form,&quot; or venturing into indie disco territory on the brilliantly jerky &quot;My KZ, Ur BF&quot; and the &quot;almost as trippy as its video&quot; &quot;Photoshop Handsome.&quot; Indeed, the album, defined by Jonathan Higgs' giddy falsetto, appears to revel in its fidgetiness, often changing course midsong, as on &quot;Suffragette Suffragette,&quot; which lurches from Vampire Weekend-esque Afro-beat to monstrous Led Zeppelin blues-rock and back again, and &quot;Qwerty Finger,&quot; whose initial fuzzy garage rock sound makes way for a rather tortured slice of dreamy prog. But before any seasickness begins to kick in, Everything Everything provide a few more calming numbers, and while they would perhaps have been better off sequenced throughout the album rather than toward the end, the chiming dubstep of &quot;NASA Is on Your Side,&quot; the harpsichord-led baroque pop of &quot;Two for Nero,&quot; and the somber nu-synth of &quot;Tin (The Manhole)&quot; show they're no less innovative when embracing their more melancholic side. Higgs has stated that the one rule while recording Man Alive was &quot;not to sound like anyone else,&quot; and while their influences are obvious, they've pieced them together in such a stylish and creative way that it's difficult to deny that they've accomplished what they set out to achieve.","torrent":{"xt":"urn:btih:216a9f784fb01f9b34ab49a1a6c8d5449db39ffb","amp;dn":"Everything+Everything+-+Man+Alive+%5B2010%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"216a9f784fb01f9b34ab49a1a6c8d5449db39ffb","infoHashBuffer":{"type":"Buffer","data":[33,106,159,120,79,176,31,155,52,171,73,161,166,200,213,68,157,179,159,251]},"announce":[],"urlList":[]}}