{"title":"Harrison's Manual of Oncology, 2E [Epub] [StormRG]","uid":10252235,"size":20418458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:217383af5ff0107c81112deffe8e6c3434ed9d31&amp;dn=Harrison%27s+Manual+of+Oncology%2C+2E+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401323184,"description":"Author: Bruce Chabner , Jr., Thomas Lynch, Dan Longo \nPaperback: 608 pages\nPublisher: McGraw-Hill Professional; 2 edition (November 25, 2013)\nLanguage: English\nISBN-10: 0071793259\nISBN-13: 978-0071793254\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nA CONCISE YET THOROUGH OVERVIEW OF THE MEDICATIONS AND APPROACHES USED IN CANCER CARE--BACKED BY THE AUTHORITY OF HARRISON'S\nHarrison's Manual of Oncology is a carry-anywhere guide to the care of patients with cancer. Enhanced by the latest published results, this valuable clinical companion features numerous tables and succinct, outline-style text that puts important information at your fingertips. You will find content that goes beyond the treatment of primary or metastatic disease to encompass the treatment of all therapeutic complications.\n\nThe opening sections of Harrison's Manual of Oncology are devoted to the classes of agents used to treat cancer and reviews their pharmacology and mechanisms of action. This section is followed by a detailed discussion of the diagnosis, staging, and treatment of all major types of cancer. There is a strong focus on symptom management and complications of treatment, including pain, nausea and vomiting, anemia, febrile neutropenia, metabolic emergencies, thrombosis, psychological issues, and end-of-life care.","torrent":{"xt":"urn:btih:217383af5ff0107c81112deffe8e6c3434ed9d31","amp;dn":"Harrison%27s+Manual+of+Oncology%2C+2E+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217383af5ff0107c81112deffe8e6c3434ed9d31","infoHashBuffer":{"type":"Buffer","data":[33,115,131,175,95,240,16,124,129,17,45,239,254,142,108,52,52,237,157,49]},"announce":[],"urlList":[]}}