{"title":"Radio Tarifa - Rumba Argelina [FLAC] TQMP","uid":6002891,"size":321304927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21c54d873eda190a49a85c302a214ec36adc6735&amp;dn=Radio+Tarifa+-+Rumba+Argelina+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pastafari","files":-1,"time":1291230972,"description":"Radio Tarifa - Rumba Argelina\n1996\n\nBrought to you by TQMP\nThe Quality Music Project\n\nBiography --\n\nRadio Tarifa is one the outstanding world music groups of the turn of their time. Their name derives from the town of Tarifa, which is the part of Spain nearest to Morocco. The group's mixture of Spanish and Arabic music is not itself new (see Juan PeÃƒÂ±a Lebrijano. for example). What is new is that instead of simply fusing musical styles as they currently exist, Radio Tarifa goes back in time to the common past of those styles, back to before 1492 when the Moors and Jews were exiled from Spain, and imagines a shared style that might have evolved had history been different, including not just elements of Spanish and Arabic music but also other musics of the Mediterranean, of the Middle Ages, of the Caribbean. This invented style is not only fascinating in its own right, but sheds light upon the real styles of Spain, most notably flamenco. Until the success of their first album Rumba Argelina, Radio Tarifa was not a full-fledged performing band, but a nucleus of three musicians who brought other performers into the studio as needed. This nucleus consists of Spaniards FaÃƒÂ­n SÃƒÂ¡nchez DueÃƒÂ±as (percussion and other instruments) and BenjamÃƒÂ­n Escoriza (vocals) and Frenchman Vincent Molino - sometimes listed as Vincent Molino Cook - (winds). Arranger DueÃƒÂ±as might fairly be described as the leader and theoretician of the group. He and Molino founded an early music group, playing music from the late Middle Ages and Renaissance) called Ars Antiqua Musicalis, although this group was never commercially successful. Later DueÃƒÂ±as met BenjamÃƒÂ­n Escoriza, a troubadour flamenco singer raised by Gypsies. The last piece was in place. Rumba Argelina was a work of love and vision and experimental daring recorded in 1993, released in Europe by World Circuit Records in 1996 and finally landing on American shores in 1997 via a collaboration of World Circuit and Nonesuch. The critical and popular success of Rumba Argelina made it possible for Radio Tarifa to put together a full-fledged touring band, which has crossed both Europe and the United States, as well as enabling a follow-up album Temporal, which means &quot;Storm.&quot; This second album, from 1997, moves in the direction of the roots of flamenco and is less pan-Mediterranean than its predecessor and was also a success. Cruzando el Rio appeared in spring 2001.\n-- All Music Guide\n\nReview --\n\nThe concept of this debut album from Spain's leading roots ensemble is that you are listening to a radio broadcast in Tarifa, Spain's southernmost point, so that you might hear a mixture of sounds from Spain and North Africa. And indeed fuzzy, distant radio sounds introduce one song and close the album. The album features an incredible variety of instruments, including among many others: guitar, tar (Persian lute), buzuki (Greek mandolin), derbouka (North African clay drum), ney (Arabic flute), crumhorn (a loud, buzzing Medieval wind instrument), and the Indian harmonium. The group is not shy about including modern popular instruments like soprano and tenor saxophone, electric organ, and electric bass. The album features almost as many styles as it does instruments, yet they tend to come together as one new style, rather than sounding like a musical salad. The album starts off with the title track, a smooth mix of rumba and flamenco. &quot;Oye, China&quot; is a love lament that plays the layered clip-clop rhythm of the plucked instruments off the more continuous sounds of the accordion and the breathy nsuri (Indian bamboo flute). &quot;Lamma bada&quot; is a straight reading of one of the most oft-played tunes of the Arab world, using Radio Tarifa's favored instruments, retaining the song's modal structure (i.e., all the instruments, even the bass, playing the same line at once). One song later in the album stands out from all the rest. It is an adaptation of a song by a Medieval troubadour named Walter von der Vogelweide originally called &quot;Nu Alrest Lebe Ich Mir Werde,&quot; but which Radio Tarifa simply calls &quot;Nu Alrest.&quot; Dominated by the crumhorns and the melancholy tenor of Javier Raibal, &quot;Nu Alrest&quot; carries a potent charge of fantasy and sadness, conjuring images of crossing the desert alone on camel. It is imagination like this that makes Rumba Argelina one of the most important world music albums of the 1990s.\n-- All Music Guide\n\nRadio Tarifa imagined a playlist for a mythic radio station at the meeting point of North Africa and Spain - flamenco guitars and ouds, Arabic drums and Gallician bagpipes - then made it happen, brilliantly.\n-- The Observer (50 Essential CDs From Around The World)\n\nTracks\n1- Rumba Argelina\n2- Oye China\n3- Lamma Bada\n4- Man~ana\n5- La canal\n6- El baile de la bola\n7- Soledad\n8- La mosca\n9- Tangos del Agujero\n10- Nu alrest\n11- La pastora\n12- Ronda de Sanabria\n13- Bulerias Turcas\n14- Nin~a\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:21c54d873eda190a49a85c302a214ec36adc6735","amp;dn":"Radio+Tarifa+-+Rumba+Argelina+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c54d873eda190a49a85c302a214ec36adc6735","infoHashBuffer":{"type":"Buffer","data":[33,197,77,135,62,218,25,10,73,168,92,48,42,33,78,195,106,220,103,53]},"announce":[],"urlList":[]}}