{"title":"The Pastels - Up For A Bit With The Pastels [1987] [FLAC]","uid":8089904,"size":220710221,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21f7c26a08993df16b66567137f3edc6ed28f4fc&amp;dn=The+Pastels+-+Up+For+A+Bit+With+The+Pastels+%5B1987%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dickspic","files":12,"time":1359690485,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: The Pastels\nRelease: Up For A Bit With The Pastels\nDiscogs: 1217551\nReleased: 1987 / 1997\nLabel: Glass Records / Velvel\nCatalog#: GLALP 021 / VEL 79754\nFormat: FLAC / Lossless / Log (100%) / Cue / CD Reissue\nCountry: US\nStyle: Rock, Alternative Rock, Indie Rock\n\nTracklisting:\n\n01. Ride\n02. Up For A Bit\n03. Crawl Babies\n04. Address Book\n05. I'm Alright With You\n06. Hitchin' A.\n07. Get 'Round Town\n08. Automatically Yours\n09. Baby Honey\n10. If I Could Tell You\n\nWhether (unjustly) qualified as either shambling, twee, or the ultimate C-86 band, the Pastels remain practically unparalleled for their influence on alternative music. For instance, the breakthrough of 2009's indie darlings the Pains of Being Pure at Heart is yet another reconfirmation of the Pastels' enduring legacy. Similarly, the appeal of Belle &amp; Sebastian would be hard to imagine without the example set by their fellow townsmen. Combining classic '60s pop with the D.I.Y. ethos of punk, Up for a Bit with the Pastels evokes -- in retrospective -- the same air of mystery and excitement as Belle &amp; Sebastian's Tigermilk. Both records made you want to cherish a newfound pop gem and share it with as few people as possible. Unfortunately, that's exactly what a few too many people did from 1987 onwards. A five-year prologue of scattershot single releases for different labels preceded the Pastels' debut. Pioneering a typically mid-'80s branch of jangling guitar pop, they distinguish themselves through an eclectic mix of apocalyptic orchestration (the opening &quot;Ride,&quot; sweeping closer &quot;If I Could Tell You&quot;) and rockabilly swagger (&quot;Get 'Round Town&quot;). Both approaches brilliantly come together in the album's title track, enlivened with assorted woops, hollers, and bells. Another standout is the single &quot;Crawl Babies&quot; with its classic bed-sitter's line: &quot;I want to build her up/Up as tall as a church/Just to watch her falling down.&quot; Elsewhere, there's a slight psychedelic edge to &quot;Baby Honey,&quot; a classic from the Pastels' canon which would be revamped several times. With its hypnotic drone and free jazz saxophone, it makes the band a certifiable contender for the '80s answer to the Velvet Underground. Together with &quot;I'm Alright with You,&quot; it would appear in its earlier incarnation on 1988's singles collection Suck on the Pastels. Although the re-recordings fit in well enough, the altogether rewarding debut might have been truly indispensable if other, previous 7&quot;-only gems from this period had been included, like &quot;Comin' Through&quot; or especially &quot;Breaking Lines&quot; which had been selected for NME's legendary C86cassette. Unwittingly, the Pastels found themselves at the front of saving pop music from the claws of the majors intent on sanitizing rock. Ever since, they seem to have been condemned to forever being a band's band, hailed by the likes of Kurt Cobain. Now that's what I call, to quote one of the band's later album tracks, an &quot;unfair kind of fame.&quot;\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:21f7c26a08993df16b66567137f3edc6ed28f4fc","amp;dn":"The+Pastels+-+Up+For+A+Bit+With+The+Pastels+%5B1987%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f7c26a08993df16b66567137f3edc6ed28f4fc","infoHashBuffer":{"type":"Buffer","data":[33,247,194,106,8,153,61,241,107,102,86,113,55,243,237,198,237,40,244,252]},"announce":[],"urlList":[]}}