{"title":"History of World Art - by Upjohn, Wingert, Mahler (Art Ebook).pd","uid":11415597,"size":243195288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:220cd3eba15eae02c2e11b514d418e7f98db8cca&amp;dn=History+of+World+Art+-+by+Upjohn%2C+Wingert%2C+Mahler+%28Art+Ebook%29.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1415575806,"description":"Pdf / English / 1958 Oxford / 876 pages / 231 MB\n\nHISTORY OF WORLD ART 2ND ED\n\nby Everard M. Upjohn, Paul S. Wingert, and Jane Gaston Mahler\n\nThis is a revised and enlarged edition of an authoritative introduction to the history of world art. Broader in scope than any comparable survey, the volume examines architecture, sculpture, painting, and the minor arts from pre-history to the present.\n\nThe text has been enlarged to include a chapter on Pre-Historic Art, another on the arts of the American Indians in Peru and Mexico, and a third on the Art of Primitive Peoples. The chapters on the arts of the twentieth century in Europe and America have been greatly expanded to incorporate the further artistic achievement and increased historical perspective of the past decade. Full attention is also given to the art of the Near and Far East.\n\nThe illustrations, previously grouped at the front of the book, have been integrated with the text. In almost every case the illustration of a particular work of art is reproduced at the point of discussion. In addition to 702 illustrations in black and white, the new edition has seventeen color plates, on which twenty five works of art are reproduced","torrent":{"xt":"urn:btih:220cd3eba15eae02c2e11b514d418e7f98db8cca","amp;dn":"History+of+World+Art+-+by+Upjohn%2C+Wingert%2C+Mahler+%28Art+Ebook%29.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"220cd3eba15eae02c2e11b514d418e7f98db8cca","infoHashBuffer":{"type":"Buffer","data":[34,12,211,235,161,94,174,2,194,225,27,81,77,65,142,127,152,219,140,202]},"announce":[],"urlList":[]}}