{"title":"You Might Remember Me (Phil Hartman) - Mike Thomas Audiobook MP3","uid":11692551,"size":278267318,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:223ab1ecb6b95c6feb7fad0e07c2bf97bdeb810d&amp;dn=You+Might+Remember+Me+%28Phil+Hartman%29+-+Mike+Thomas+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":22,"time":1423594757,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nYou Might Remember Me: The Life and Times of Phil Hartman\n\nWritten by: Mike Thomas\nNarrated by: Corey Snow\nLength: 9 hrs and 35 mins\nUnabridged Audiobook\nRelease Date:11-18-14\n\nBeloved TV comedic actor Phil Hartman is best known for his eight brilliant seasons on Saturday Night Live, where his versatility and comedic timing resulted in some of the funniest and most famous sketches in the television show's history. Besides his hilarious impersonations of Phil Donahue, Frank Sinatra and Bill Clinton, Hartman's other indelible characters included Cirroc the Unfrozen Caveman Lawyer, Eugene the Anal Retentive Chef and, of course, Frankenstein. He also starred as pompous radio broadcaster Bill McNeal in the NBC sitcom NewsRadio and voiced numerous classic roles - most memorably washed-up actor and commercial pitchman Troy McClure - on Fox's long-running animated hit The Simpsons. But Hartman's seemingly charmed life was cut tragically short when he was fatally shot by his troubled third wife, Brynn, who turned a gun on herself several hours later. The shocking and headline-generating turn of events stunned those closest to the couple as well as countless fans who knew Phil only from afar.\nNow, for the first time ever, the years and moments leading up to his untimely end are described in illuminating detail through information gleaned from exclusive interviews with scores of famous cast mates, close friends and family members as well as private letters, audio/video recordings, extensive police records, and more.\nBoth joyous tribute and serious biography, Mike Thomas' You Might Remember Me is a celebration of Phil Hartman's multi-faceted career and an exhaustively reported, warts-and-all examination of his often intriguing and sometimes complicated life - a powerful, humor-filled and disquieting portrait of a man who was loved by many, admired by millions and taken from them far too early","torrent":{"xt":"urn:btih:223ab1ecb6b95c6feb7fad0e07c2bf97bdeb810d","amp;dn":"You+Might+Remember+Me+%28Phil+Hartman%29+-+Mike+Thomas+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223ab1ecb6b95c6feb7fad0e07c2bf97bdeb810d","infoHashBuffer":{"type":"Buffer","data":[34,58,177,236,182,185,92,111,235,127,173,14,7,194,191,151,189,235,129,13]},"announce":[],"urlList":[]}}