{"title":"PBS.Lincoln.4of4.Now.He.Belongs.to.the.Ages.1865.VHSRip.x264.AAC","uid":11914540,"size":752121130,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:224586d7e94f013f3021a73eb93710e5738c6dbc&amp;dn=PBS.Lincoln.4of4.Now.He.Belongs.to.the.Ages.1865.VHSRip.x264.AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"MVGroup","files":1,"time":1431517239,"description":"Lincoln\n\nBiography Documentary hosted by James Earl Jones, published by PBS in 1992 - English narration\n &lt;a href=&quot;\nhttp://docuwiki.net/images/e/ed/Lincoln-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/e/ed/Lincoln-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\n&quot;Lincoln&quot; captures the drama of this amazing man in his own words. Drawn from letters, speeches and diaries, Lincoln's words are brought to life by the voice of the acclaimed actor Jason Robards, in a moving performance. Robards' reading are complemented by the voices of of an all-star cast that includes Glenn Close as Mary Todd Lincoln and narration by James Earl Jones. Produced by the Emmy Award-winning producer Peter W. Kunhardt, with Philip B. Kunhardt III and Philip B. Kunharddt Jr.\n\n\n1)  The Making of a President 1860 - 1862 \nWe journey back from the White House to Lincoln's poor backwoods home, and visit the roots from which his legend grew. Lincoln's words, and those of the people who knew him, are made vivid by exceptional photographs from the definitive Lincoln archives. They capture not only the president's powerful face and those of his family and contemporaries, but also many personal details that reveal so much - images of his home, his horse, his barn, his dog, his books, and even his back yard.\nFrom humble beginnings, &quot;Lincoln&quot; traces the growth of the man's ambition to succeed and his simple eloquence, which moved all those who heard him speak. It takes to the threshold of Lincoln's greatest challenge - to be both America's President and the Union Army's Commander-in-Chief. at the eye of the hurricane that was the Civil War, Lincoln held the moral compass to guide his nation onward.\n\n2)  The Pivotal Year 1863 \nThis episode reveals how Lincoln faced up to the difficult decisions that confronted his presidency during the most crucial year of the Civil War.\nIn calling for the abolition of slavery, Lincoln changed forever how America would define the meaning of the phrase &quot;all men are created equal.&quot; The man who had won fame for his historic debates against slavery finally held the power to end the scourge.\nAs the Civil War raged around him, he struggled as Commander-in-Chief, searching for a general who could truly lead the Union Army. In this year of frustration, we see the steely side of the gentle man, and his determination to hold the nation together.\nIn one of the most poignant episodes in Lincoln's life, we also hear the story behind the President's magnificent Gettysburg Address. Distraught by so many battlefield casualties, Lincoln put into words for all time the pain of war and the debt which people owe those who would would give their lives for their country. His eloquence echoes as powerfully today.\n\n3)  I Want to Finish this Job 1864 \nThe turmoil of the Civil War formed the backdrop for Lincoln's re-election campaign in 1864, and we see how this explosive drama plays out. With Ulysses S. Grant now in charge of the Union armies, the bloodiest fighting of the war was underway, and the death toll continued to rise. Lincoln's call for more soldiers made the president unpopular, and his enemies hatched plans for his defeat.\nBehind the scenes, we get an intimate view of gow Lincoln the man coped with the pain of so many casualties. While he was sorely tested by the cruel conflicts of war, his compassion never flagged. Above all, he wanted to finish the job of preserving the Union.\nOn election day, we see a side of Lincoln less often celebrated - his wonderful sense of self-deprecating humor. While the power-brokers of Washington circled around him, awaiting the voters' verdict, Lincoln read aloud from a book of humor to lighten the mood - much to the chagrin of his quarreling advisors.\n\n4)  Now He Belongs to the Ages 1865 \nThe drama of Abraham Lincoln's life seemed destined to close with the war he fought so hard to end. While the Union Army moved closer to final victory, Lincoln's plea for conciliation could not be heard in all quarters. As the war drew to a close, the President was secretly marked for assassination.\nIn the chilling conclusion of &quot;Lincoln&quot;, we see how his enemies plotted their final revenge. The fanatical mania of assassin John Wilkes Booth mirrored the collective rage of those who thought the President had dishonored their heritage and traditions. The last days and hours of Lincoln's life are captured in this episode. It reveals how Lincoln's own dreams foreshadowed his impending death, and how his extraordinary series of public funerals across the land helped launch the legend that has only grown with time.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;91d9f8f6f9d1dda2bfa0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: ~1790 Kbps (CRF 19)\n * Video Resolution: 640x470 - 640x472 - 640x474 (Different Cropping)\n * Video Aspect Ratio: 4:3\n * Framerate: 23.976 fps\n * Audio Codec: AAC-LC (Nero)\n * Audio Quality: 0.50 48KHz (~150 Kbps)\n * Audio Channels: 2\n * Run-Time: ~54mn (each)\n * Number of Parts: 3\n * Part Size: ~750 MiB\n * Container: MP4\n * Released: 1992\n * Source: VHS (Commercial - NTSC)\n * Capper: KarMa\n * Subtitles: English - Merged in the MP4\n\n1)  Further Information \n * http://www.imdb.com/title/tt0104732/?ref_=ttmd_md_nm\n\n2)  Related Documentaries \n * http://docuwiki.net/?title=The%20Civil%20War\n * http://docuwiki.net/?title=Abraham%20Lincoln%3A%20Saint%20or%20Sinner\n * http://docuwiki.net/?title=The%20Divided%20Union%20-%20American%20Civil%20War%201861-1865\n * http://docuwiki.net/?title=The%20Address\n * http://docuwiki.net/?title=Lincoln%20at%20Gettysburg\n * http://docuwiki.net/?title=The%20African%20Americans%3A%20Many%20Rivers%20to%20Cross\n\nSource: http://docuwiki.net/index.php?title=Lincoln","torrent":{"xt":"urn:btih:224586d7e94f013f3021a73eb93710e5738c6dbc","amp;dn":"PBS.Lincoln.4of4.Now.He.Belongs.to.the.Ages.1865.VHSRip.x264.AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"224586d7e94f013f3021a73eb93710e5738c6dbc","infoHashBuffer":{"type":"Buffer","data":[34,69,134,215,233,79,1,63,48,33,167,62,185,55,16,229,115,140,109,188]},"announce":[],"urlList":[]}}