{"title":"The Missing 2014 S01E02 x264 - GHOST DOG","uid":11376169,"size":354744229,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:225bd249284818e54eb0bd13e35dbc79b9d578a7&amp;dn=The+Missing+2014+S01E02+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"marxph","files":-1,"time":1415148003,"description":"The Missing is a drama told through a delicate and complex narrative that reflect the frantic battle for a lost child. When five year-old Oliver disappears from his holiday in France, it causes a manhunt that will last for many years. The series will go inside the mind of the father, Tony, a man desperate to find his lost son. Tony's frantic and exhausting search breaks his marriage to Emily and begins to consume his life. Julien who was the detective who had launched the initial search for the child, also finds himself drawn back into the hunt, in a desperate attempt to resolve the mystery of Oliver's disappearance. The story will be two over two time frames and in two countries.\n\nEpisode 2 of 8:\n\n2006: Three days since Oliver's disappearance, and with little information to go on, suspicion immediately falls on a known paedophile living in the area. With police protocol keeping Tony and Emily firmly in the dark, Tony is tempted when ambitious journalist, Malik Suri, comes forward with illegally obtained information on the suspect in custody. Then the suspect is released with a seemingly concrete alibi. A generous benefactor reaches out to Tony and Emily when they are at their lowest ebb, offering a financial reward for anyone coming forward with information relating to Oliver's disappearance.\n\nPresent day: Tony's attempt to reopen the investigation gathers momentum as he and Julien finally find the first bit of solid evidence. While Tony continues on his mission to find out the truth about what exactly happened to his son, both Emily and Julien have to deal with problems in their own lives.\n\n===================================================================================\nSource.......: HDTV\nRipper.......: marxph\nSize.........: 338MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:225bd249284818e54eb0bd13e35dbc79b9d578a7","amp;dn":"The+Missing+2014+S01E02+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"225bd249284818e54eb0bd13e35dbc79b9d578a7","infoHashBuffer":{"type":"Buffer","data":[34,91,210,73,40,72,24,229,78,176,189,19,227,93,188,121,185,213,120,167]},"announce":[],"urlList":[]}}