{"title":"JLA - Avengers 1-4 (2003)","uid":3925514,"size":136823795,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2286812379d8999ae518cb09fbe66a6dc6d02501&amp;dn=JLA+-+Avengers+1-4+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Zero_Assassin","files":5,"time":1197061767,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/JLA/Avengers&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/JLA/Avengers&lt;/a&gt;\n\nJLA/Avengers\nFrom Wikipedia, the free encyclopedia\nJump to: navigation, search\nJLA/Avengers\n\n\nCover for JLA/Avengers #1 (2004). Art by George Perez.\nPublisher \tDC Comics\nMarvel Comics\nFormat \tPrestige format limited series\nPublication dates \tSeptember 2004 - April 2005\nNumber of issues \tJLA/Avengers #1, 3\nAvengers/JLA #2, 4\nMain character(s) \tAvengers\nJustice League\nCreative team\nWriter(s) \tKurt Busiek\nArtist(s) \tGeorge PÃƒÂ©rez\nColorist(s) \tTom Smith\n\nJLA/Avengers is a crossover limited series published by DC Comics and Marvel Comics, and features two teams of superheroes, DC Comics&amp;#039; Justice League of America and Marvel&amp;#039;s Avengers.\nContents\n\n    * 1 Publication history\n    * 2 Plot summary\n    * 3 See also\n    * 4 References\n    * 5 External links\n\n[edit] Publication history\n\nIn 1979, DC and Marvel agreed to co-publish a crossover series. The series was to be written by Gerry Conway and drawn by George PÃƒÂ©rez. Conway and PÃƒÂ©rez began work on the series in 1981, but editorial disputes prevented the story from being completed.\n\nAn agreement was eventually made between the two companies, with the story to be written by Kurt Busiek and drawn by George Perez.\n\nAvengers/JLA eventually became a 4-issue comic book mini-series jointly published by Marvel Comics and DC Comics in late 2003 through early 2004. The mini-series was published in the 48-page Prestige Format. Issues #1 and #3 were published by Marvel Comics under the title JLA/Avengers while issues #2 and #4 were published by DC Comics with the title Avengers/JLA. The story as a whole was reprinted by DC Comics in 2005 as a 2-volume collector&amp;#039;s edition hardcover.\n\n[edit] Plot summary\n\nKrona, an exiled villain from the DC Universe who has gained the powers of entropy, begins destroying entire universes in his obsession to find out how they are created. The Grandmaster, an alien from the Marvel Universe who is obsessed with games, offers to give Krona the knowledge he seeks in return for not destroying his universe - but only if he can beat him in a game. The game involves manipulating the Avengers and the Justice League into trying to obtain twelve items of power (six from each universe - the DC items being the Spear of Destiny; the Book of Eternity; the Orb of Ra; the Psycho Pirate&amp;#039;s Medusa Mask; Uthool&amp;#039;s Green Bell; Nyorlath&amp;#039;s Silver Wheel; Calythos&amp;#039;s Red Jar; and the Green Lantern Power Battery of Kyle Rayner; and the Marvel items being the Ultimate Nullifier; the Evil Eye; the Wand of Watoomb; the Casket of Ancient Winters; the Cosmic Cube; and the Infinity Gems) that have been hidden around across the two worlds. The New God Metron of the DC Universe also helps to trick the heroes into participating. They battle members from the opposing team until a final confrontation during which Krona and the Grandmaster betray each other.\n\nKrona scans the Grandmaster&amp;#039;s mind and learns the secret of universal destruction, while the Grandmaster uses the power of the twelve artifacts to merge the two universes and trap Krona at their epicentre. Krona then retaliates by killing the Grandmaster and causing the universes to collapse. The Avengers and the Justice League join forces to battle Krona, and due to several chronal distortions are aided by past members of both teams. Krona is finally defeated, and implodes to become a &quot;cosmic egg&quot; from which a universe will eventually be born. The two universes are returned to normal with no evidence of Krona&amp;#039;s tampering.\n\nThe Cosmic Egg reappears in DC Comics&amp;#039; title JLA.[1]","torrent":{"xt":"urn:btih:2286812379d8999ae518cb09fbe66a6dc6d02501","amp;dn":"JLA+-+Avengers+1-4+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2286812379d8999ae518cb09fbe66a6dc6d02501","infoHashBuffer":{"type":"Buffer","data":[34,134,129,35,121,216,153,154,229,24,203,9,251,230,106,109,198,208,37,1]},"announce":[],"urlList":[]}}