{"title":"Ascendant (Latest With 1.2 Patch) (GOG)","uid":10903028,"size":644932936,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:22993c258865d7ada546de72f4afb3ada75a546d&amp;dn=Ascendant+%28Latest+With+1.2+Patch%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Sarah116","files":-1,"time":1409211268,"description":"Hey guys, here the latest version of &quot;Ascendant&quot;. Hope you guys enjoy and please help seed. If you like, don't be afraid to buy.\n &lt;a href=&quot;\nhttp://www.gog.com/game/ascendant&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/ascendant&lt;/a&gt;\n\n\n-----------------\n\n\nChangelog for version 1.2.0: \n\nNew Stuff and Bug Fixes \n\nNew game difficulties added: Baby, Normal, and Rage. \nTime-based leaderboards added for each difficulty. \nFixed a bug that would prevent Humbaba from exiting an invulnerable state. \nFixed a bug that would prevent the Ascended bosses from attacking after \ncutscenes. \nMap generation has been fixed. Players should now no longer be stuck \nwithout a boss room in the Winter levels. \nA certain boss room door has been removed from the wall. (Sorry, TorNis) \nHachiman event rooms now occasionally reward players correctly with the \nBlessing of Hachiman instead of the Blessing of Gran Bwa. \nPots in the shooting gallery will now properly self-destruct after 30 \nseconds if they do not initially break on impact. \n\nBlessings \n\nKamoho Blessing on weapons now awards players with 5 influence every \ntime an enemy is eaten. \nKamoho Blessing on spell has had its homing buff effect doubled. \nSpell homing in general has been doubled. \nZephyrus Blessing on weapon has had its proc chance increased from 10% \nto 15%. Additionally, its launch force has been doubled. \nZephyrus Blessing on spells now instantly staggers most enemies in \naddition to its current knockback. \nBlessing of Kali now saves the player's life when spending health in \nvarious event rooms and blood shops. \nTlaloc Blessing on spell has had its delay raised from 0.1 seconds to \nevery 0.4 seconds. \nGameplay Changes \nDemon pot projectiles have been made more visible. \nEnemy shields are now initially much weaker but scale as the game \nprogresses. \nLaunch force has been increased on The Twig. \nThe restart option has been removed upon winning the game. This allowed \nplayers to replay the game as the character they had won the game with. \nOthers \nThere Can be Only One Steam Achievement has been fixed. \nA script has been added to check and see if players have completed \ncertain achievements and award them. This will check to see if players \nhave completed New Challenger based achievements and journal-based \nachievements (e.g. Heavy Breathing - Discover every breath). \n1280x1024 resolution added in the Settings menu. \n\nDifficulty Mode Clarification \n\nBaby Mode \nAll characters start with an additional max heart \nInvulnerability Time (after being struck) is increased by 0.75 seconds \nPots drop more loot \nHealth pickups drop more frequently \nAll damage is reduced by a quarter heart (down to a minimum of a quarter \nheart) \nNormal Mode \nThe same mode you have been playing since launch \nRage Mode \nStronger enemy variants work their way in earlier \nRooms generally have more enemies earlier \nEnemies have more hp \nBosses have more hp \nAll damage is increased by a quarter heart \n","torrent":{"xt":"urn:btih:22993c258865d7ada546de72f4afb3ada75a546d","amp;dn":"Ascendant+%28Latest+With+1.2+Patch%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22993c258865d7ada546de72f4afb3ada75a546d","infoHashBuffer":{"type":"Buffer","data":[34,153,60,37,136,101,215,173,165,70,222,114,244,175,179,173,167,90,84,109]},"announce":[],"urlList":[]}}