{"title":"Illustrated Manual of Sniper Skills","uid":6294508,"size":8907870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22a9134123c718d3951ab27ec02b8b6c424db584&amp;dn=Illustrated+Manual+of+Sniper+Skills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Djofullinn","files":1,"time":1301943625,"description":"Synopsis\n\nThis heavily illustrated manual provides a timely, in-depth review of the art of sniping in war and anti-terrorist environments.  Drawing on a vast, firsthand knowledge of sniper skills, former British Army sniper and sniper instructor Mark Spicer describes the role of the sniper in peace and in war, in reconnaissance and counter-surveillance, in cities, in vehicles, at night and by day.  He presents crucial information about training and equipment, judgment and positioning, details of great relevance to professional marksmen, both military and law enforcement. This comprehensive manual will also be of interest to hunters, weapons enthusiasts, competition shooters, and paintball participants. Illustrations, diagrams, and related information throughout.\n\nMark Spicer, a former British Army sniper and sniper instructor, has vast practical and training experience and has worked with and trained snipers of many of the world's military forces as well as law enforcement special weapons and tactics units. During his active-duty career he served in Northern Ireland, Kosovo, the Falkland Islands, Canada, France, Germany, Kenya, the USA, and of course the UK.  He has been guest instructor at many NATO sniper training schools, including that of the U.S. Marine Corps, and has instructed members of Britain's famed Special Air Service (SAS) and the Parachute and Gurkha regiments.  He was also recently called as an expert witness in the &quot;Washington sniper trials,&quot; and has appeared in a History Channel series on sniping.  Spicer has contributed to many professional military journals, and is author of Sniper: The Techniques and Equipment of the Deadly Marksman.  Retired from active service in 2005, Spicer now works as a security adviser to international business concerns.\n &lt;a href=&quot;\nhttp://search.barnesandnoble.com/Illustrated-Manual-of-Sniper-Skills/Mark-Spicer/e/9780760326749&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://search.barnesandnoble.com/Illustrated-Manual-of-Sniper-Skills/Mark-Spicer/e/9780760326749&lt;/a&gt;","torrent":{"xt":"urn:btih:22a9134123c718d3951ab27ec02b8b6c424db584","amp;dn":"Illustrated+Manual+of+Sniper+Skills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a9134123c718d3951ab27ec02b8b6c424db584","infoHashBuffer":{"type":"Buffer","data":[34,169,19,65,35,199,24,211,149,26,178,126,192,43,139,108,66,77,181,132]},"announce":[],"urlList":[]}}