{"title":"Annette Peacock - X-Dreams [1978] [EAC,log,cue. FLAC]","uid":8764430,"size":223161946,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:22b9624fa66767751b7325bbd9a2b656738808ec&amp;dn=Annette+Peacock+-+X-Dreams+%5B1978%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":9,"time":1375301858,"description":"Artist: Annette Peacock\nRelease: X-Dreams\nReleased: 1978\nLabel: [1996]See For Miles Records\nCatalog#: RBR007-D\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: electronic, jazz, avant.garde\n\n\n1 My Mama Never Taught Me How To Cook\n2 Real &amp; Defined Androgens\n3 Dear Bela\n4 This Feel Within\n5 Too Much In The Skies\n6 Don't Be Cruel\n7 Questions\n\nSongwriter, composer, singer, and pianist Annette Peacock seemingly roared out the woodwork with X-Dreams in 1978. Few if any remembered her RCA debut I'm the One in 1970, a synthesizer-laced experiment with &quot;straight&quot; rock. That record, known more for its riffs and pop songs than Peacock's now trademark brand of iconoclastic jazz/rock/funk/classical compositions, sold modestly enough that it took four years before the completion and release of her X-Dreams follow-up. The large roster of studio musicians listed in the credits is the only hint that this record wasn't made in a standard session. And speaking of musicians, check this list: guitarists include both Chris Spedding and the late Mick Ronson; drummer Bill Bruford presides here, along with Rick Marotta; Dave Chambers and two others make up the saxophone choir; and everyone from Kuma Harada, Stu Woods, and Steve Cook plays bass. Peacock does nothing but sing and recite her wild poetry. Never have jazz dynamics come together and embraced rock's worship of the almighty riff so seamlessly, beginning with the opener, &quot;Mama Never Taught Me How to Cook,&quot; with its brazen approach to revealing childhood incest and liberation not only in spite of it, but because of it! Guitars and keyboards dust the floor with one another as Peacock tells a tale of defiance, and an optimism that is taken not given. And yes, despite the subject matter, it is an erotic, tense mess of a song, glorious in its freewheeling temperament and unapologetic confession. In the 11-minute &quot;Real &amp; Defined Androgenes,&quot; Peacock's sexual politics ask more questions than they reveal about her thought process. Inside those questions, she lets saxophones and keyboards bleat and skronk their way through her sultry delivery on all the topics addressed by such sexual philosophers before her as the Marquis de Sade, Georges Bataille, Laure, and Pauline Reage. As if to balance out her growing testament on relationships, she adds two wonderful tracks from love's sadder side coming straight out of the blues. The first is &quot;Dear Bela,&quot; truly a letter written with the intention of a one-sided conversation. A choir of saxes carries the vocal right into the listener's body so she too can feel the hurt. The other is perhaps the most amazing cover ever of the old Otis Blackwell/Elvis Presley classic, &quot;Don't Be Cruel.&quot; Funky, chunky, and lean, this bed of electric pianos and guitars gives Peacock a soft place to fall for taking so many chances with not only her vocal but the blues form itself. She turns the melody back on itself and in turn this bluesy rockabilly number becomes a gorgeously bluesed-out jazz number. Spedding's guitar playing here is nothing less than stunning in both its understatement and the inventive manner in which he keeps the track rooted to its traditional setting while playing Peacock's new arrangement. One is truly contained within the other. There are no weak moments on X-Dreams, and despite its age, the album still sounds a bit ahead of its time. Peacock may have been wringing her own personal exorcism from these tracks, but for the rest of us, she offered a guidebook of complex emotional terrain, a treatise on the messy state of love, and a musical dissertation on how to integrate the nuances of form in rock and jazz.","torrent":{"xt":"urn:btih:22b9624fa66767751b7325bbd9a2b656738808ec","amp;dn":"Annette+Peacock+-+X-Dreams+%5B1978%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22b9624fa66767751b7325bbd9a2b656738808ec","infoHashBuffer":{"type":"Buffer","data":[34,185,98,79,166,103,103,117,27,115,37,187,217,162,182,86,115,136,8,236]},"announce":[],"urlList":[]}}