{"title":"Ann Rule Pack.rar","uid":7191258,"size":40925900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:233f5661cd80a51a3bc129f784c4d3105371aa2d&amp;dn=Ann+Rule+Pack.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tduckin","files":-1,"time":1334630681,"description":"Every Ann Rule Book on B&amp;N\n\n\nAnn Rule was born on October 22, 1935 in Lowell, Michigan to Chester R. &quot;Stack&quot; Stackhouse and Sophie Hansen. Her mother was a school teacher, specializing in developmentally disabled children and her father was a basketball, football and track coach. Due to her father's career, they often moved as she grew up.[2]\nAnn was surrounded by family following careers in law enforcement. Her grandfather and uncle were sheriffs in Michigan, another uncle was a medical examiner and a cousin was a prosecutor. She spent her summers with her grandparents doing volunteer work in the local jail.[2]\nShe eventually graduated from Coatesville High School then attended the University of Washington. She majored in creative writing, along with minors in criminology, penology and psychology. She extended her education for two more years at Highline Community College by taking criminal courses such as crime scene investigation, to include photography, police administration and several others. She continues her adult education in criminal studies to this day and even teaches courses herself.[2]\nShe presently lives in the Puget Sound area of Washington state and is a mother of five and a grandmother of three. Her daughter, Leslie Rule, is also a published author.","torrent":{"xt":"urn:btih:233f5661cd80a51a3bc129f784c4d3105371aa2d","amp;dn":"Ann+Rule+Pack.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"233f5661cd80a51a3bc129f784c4d3105371aa2d","infoHashBuffer":{"type":"Buffer","data":[35,63,86,97,205,128,165,26,59,193,41,247,132,196,211,16,83,113,170,45]},"announce":[],"urlList":[]}}