{"title":"PC_The.Sting!.(NeoSoftware)-(ToeD)","uid":3733538,"size":227380862,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23839bd83696ccca7171c241515dc22488e9e8ba&amp;dn=PC_The.Sting%21.%28NeoSoftware%29-%28ToeD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Subzero!","files":9,"time":1183667834,"description":"\nOutplan the Crock - Outsmart the Cops!\n\n\nThe One Eyed Dude\n\n  delivers you with\n\n..:: The Sting! (c) JoWood/Neo! Software ::..\n\n\n\n:. about .:\n\nThe Sting!...\n\nFor criminals, crime may not pay, but the entertainment industry has sure done well by it. \nCountless films and TV shows have tapped into the supposedly glamorous and alluring side\nof crime, making stylish, romantic rebels out of mafiosi and art thieves. Of course, the game\nindustry has tried to muscle in on this thematic turf, but with less obvious success. \nNow, publisher JoWooD is taking a stab at the crime genre with The Sting!, \na lighthearted burglary simulator that manages to be entertaining despite \nsome real weaknesses and peculiarities.\n\nYour overall goal in The Sting! is simple: carry out progressively harder heists and make\noff with as much loot as possible. The more cash and valuables you swipe, the better tools\n(crowbars, lock picks, drills, and so forth) and larger getaway vehicles you can buy, which \nwill in turn let you carry off even more stolen goods. The basic gameplay is divided into a \nreal-time component and a planning segment, but not in the same way as a game like \nRogue Spear, as you might expect. Instead of planning a mission and then carrying it out \nin real time, you use the real-time component to explore the city, sell loot at the pawnshop, \nbuy a new getaway vehicle at the auto dealer, or meet new thugs who might join you as \naccomplices.\n\n\nMatt chooses equipment and accomplices before a mission. The heart of the game actually \nplays out at Matt&amp;#039;s hotel room desk. From here, you&amp;#039;re presented with a number of buildings \nto rob, like a museum or a ritzy hotel. Then, using a VCR-style control, you act out and record \na virtual robbery of the building in question. You go through the motions, breaking into safes \nand sneaking around to avoid making too much noise or being spotted. Each shop owner or \nsecurity guard has a bright cone of light representing its field of view, and these cones show \nthrough walls and floors, so you can track them easily in multistory buildings. There&amp;#039;s also a \nmeter that shows how much noise you&amp;#039;re making when prying open a window or jimmying a \nlock on a cabinet. If you think you might have been spotted or heard, you can just rewind the \nplan to any point and try a different tactic from there. If you&amp;#039;re not sure what to do next, you \ncan stop the action at will, and time will freeze temporarily while you assess the situation. \nNo matter what happens, you can&amp;#039;t get caught while planning since Matt is really back in his \nhotel room the whole time.\n\nOnce you&amp;#039;ve devised a plan that you like, you then view it as a noninteractive movie. Here, you just \nwatch or fast-forward to the end, and that&amp;#039;s it. You&amp;#039;ll now see for sure whether your plan worked: \nIt&amp;#039;s easy to think you were successful while planning the robbery, but you might later discover that \nyou tripped an alarm or were seen, putting an end to the mission. Just as you can&amp;#039;t really &quot;lose&quot; \nwhile planning, a failed execution of your final plan doesn&amp;#039;t really hurt you: you won&amp;#039;t have to face \nthe authorities or trigger-happy store owners. (For that matter, the game doesn&amp;#039;t feature any \nviolence at all.) While it&amp;#039;s dull to watch a movie of what you just carried out in the planning stage,\nthe planning itself can be mentally engaging. \n\nThe Sting! isn&amp;#039;t about action--it&amp;#039;s about pattern observation, evasion, and cleverness.\n\nControlling Matt or his accomplices is generally easy. The third-person camera can be zoomed and\nrotated easily with the mouse, though walls and other objects can block your view at times. \nYou can also switch to a first-person view temporarily. Objects Matt and his accomplices can interact \nwith will become highlighted when you move the cursor over them. Then, when you hold down the\nmouse button, the game will display icons for actions such as talking,manipulating, and observing. \nHaving just a few logical options like these streamlines gameplay and keeps you from having\nto guess what you&amp;#039;re supposed to do at different junctures. Taking a cab or talking to other characters,\nlike the clownish pawnshop owner, Ali, is equally simple thanks to the game&amp;#039;s straightforward menus \nand dialogue trees.\n\nYou&amp;#039;ll break into museums, hotels, and other buildings in The Sting! Though it&amp;#039;s a game about crime, \nThe Sting! is presented in the style of an illustrated children&amp;#039;s book or cartoon. For instance, each character&amp;#039;s \nproportions are all grotesquely exaggerated, so Matt&amp;#039;s chin takes up half his head. Taxicabs are strange \nbulbous things that bounce as they chug down the road. The game also uses lots of simplified colors and\ntextures, which help create a gloomy city as a five-year-old might imagine it. But that&amp;#039;s not necessarily a bad\nthing, as the graphics can be charming--at least once in a while. Also, a few of the little details, like the \nstreetlights glowing in the fog, are pleasant, though far from spectacular. Unfortunately, The Sting! occasionally\nhas severe clipping problems, which sometimes place two characters in the same spot at once. And like the \ngame&amp;#039;s graphics, only bits and pieces of the game&amp;#039;s sound really stand out, like the jazzy music score that \nbrings Henry Mancini&amp;#039;s compositions to mind but doesn&amp;#039;t really match their quality. The game is less emotionally \ninvolving than it could be since its sound effects are infrequent and dull, and you hear voice-overs only during the\nintro movie and cutscenes.\n\nThe Sting! has a cartoony, childlike presentation that doesn&amp;#039;t fit its subject particularly well and also makes\nyou wonder who JoWooD is trying to appeal to. \nThe Sting! looks and, in many ways, plays much like a more complex version of the Chicken Run game adaptation, \nwhich was geared toward young players. Some older players might be turned off by the cutesy visuals or just not \nfind them appropriate to the gameplay. The complete lack of violence also reinforces the idea that The Sting! is in \nsome ways a kids&amp;#039; game. There&amp;#039;s nothing wrong with an all-ages game, but here, the overall effect is a bit \nschizophrenic. Even with the questionable atmosphere and strange real-time/planning/movie setup, \nThe Sting! does offer an enjoyable amount of tension and mental challenge as you creep around stores at night and \nrun for cover when guards stroll by. The strategies you&amp;#039;ll use to play the game certainly aren&amp;#039;t particularly deep or \ncomplex, but simple entertainment is hardly a bad thing, and more often than not, The Sting! provides plenty of it.\n\n\n\n:. install .:\n\n1.: Unrar and mount ISO, double click Autorun.exe and follow on screen text (important)\n\n2.: install, when finished copy crack from folder CRACK (see mounted iso) to your\n     game install folder!. thats it, look at START MENU, start game, play, enjoy, \n\n\nthere is more to come! this evening!...\n\n\n-ToeD","torrent":{"xt":"urn:btih:23839bd83696ccca7171c241515dc22488e9e8ba","amp;dn":"PC_The.Sting%21.%28NeoSoftware%29-%28ToeD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23839bd83696ccca7171c241515dc22488e9e8ba","infoHashBuffer":{"type":"Buffer","data":[35,131,155,216,54,150,204,202,113,113,194,65,81,93,194,36,136,233,232,186]},"announce":[],"urlList":[]}}