{"title":"Scale-up in Chemical Engineering 2nd ed - Marko Zlokarnik","uid":12111109,"size":3122607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23851b47410b98e0c292c3dd31cc1e30fe0bae09&amp;dn=Scale-up+in+Chemical+Engineering+2nd+ed+-+Marko+Zlokarnik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1436575315,"description":"Scale-up in Chemical Engineering 2nd ed - Marko Zlokarnik (Wiley-VCH, 2006).pdf\n\nISBN 3527314210\n\nCovering the important task of the scale-up of processes from the laboratory to the production scale, this easily comprehensible and transparent book is divided into two sections. The first part details the theoretical principles, introducing the subject for readers without a profound prior knowledge of mathematics. It discusses the fundamentals of dimensional analysis, the treatment of temperature-dependent and rheological material values and scale-up where model systems or not available or only partly similar. All this is illustrated by 20 real-world examples, while 25 exercises plus solutions new to this edition practice and monitor learning.\nThe second part presents the individual basic operations and covers the fields of mechanical, thermal, and chemical process engineering with respect to dimensional analysis and scale-up. The rules for scale-up are given and discussed for each operation. Other additions to this second edition are dimensional analysis of pelleting processes, and a historical overview of dimensional analysis and modeling, while all the chapters have been updated to take the latest literature into account.\nWritten by a specialist with more than 40 years of experience in the industry, this book is specifically aimed at students as well as practicing engineers, chemists and process engineers already working in the field","torrent":{"xt":"urn:btih:23851b47410b98e0c292c3dd31cc1e30fe0bae09","amp;dn":"Scale-up+in+Chemical+Engineering+2nd+ed+-+Marko+Zlokarnik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23851b47410b98e0c292c3dd31cc1e30fe0bae09","infoHashBuffer":{"type":"Buffer","data":[35,133,27,71,65,11,152,224,194,146,195,221,49,204,30,48,254,11,174,9]},"announce":[],"urlList":[]}}