{"title":"Skype For Android v2.5","uid":7610081,"size":12112117,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2397fda1e58593735c95d8534a6ec58d7da623cf&amp;dn=Skype+For+Android+v2.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"YahSoft","files":-1,"time":1347040485,"description":"Price on Google Play: Free\nCaregorie: Comunication\nProducer: Skype\n***********************\n\n Call free Skype-to-Skype phones and tariffs by the SkypeChamadas voice and video free for anyone who also use Skype, whether a user of Android, iPhone, Mac or PC, and also chat messages to your friends and relatives no matter where estejam.Recursos: - Chat, voice and video with free Skype-to-Skype through 3G or WiFi - Make calls and send SMS from low cost calls to landlines and mobiles from Android. - \n\nSend photos, and video files to your contacts. - High sound quality on calls to other Skype users. - Talk face to face or show what you're seeing with cameras front and traseira.Para more information, visit the FAQ page about Skype for Android:\n\nNOTES: Due to Android restrictions, devices with Android 2.2 installed can only use the rear camera. Devices with Android 2.3 or later can use the front and rear cameras. If you're using Android 2.2 (Froyo) or later on a device not listed below, should be able to enable video calling in Skype settings. Note that the quality of video calls may not be as good as the compatible devices below. You can not make video calls on your phone if this setting is unavailable. * Rates data carrier may apply. \n\nWe recommend a transmission plan unlimited data connection or WiFi","torrent":{"xt":"urn:btih:2397fda1e58593735c95d8534a6ec58d7da623cf","amp;dn":"Skype+For+Android+v2.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2397fda1e58593735c95d8534a6ec58d7da623cf","infoHashBuffer":{"type":"Buffer","data":[35,151,253,161,229,133,147,115,92,149,216,83,74,110,197,141,125,166,35,207]},"announce":[],"urlList":[]}}