{"title":"Mikhail Botvinnik - Half a Century of Chess","uid":8849163,"size":13767163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23a436d31b57aecfc271b0f288704435b55fa3bf&amp;dn=Mikhail+Botvinnik+-+Half+a+Century+of+Chess&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1377477262,"description":"FOREWORD TO THE ENGLISH EDITION\nSeveral books of my games have appeared in English in the past. Some of those games were annotated by chess masters, while others used partly my own comments taken from previously published games. For this book, however, I have personally selected ninety of my most noteworthy games (played over a period of over forty years) and I have provided them with new annotations.\nMr. Yu. Metayev, Director of the Moscow Publishing House -Fizkultura i Sport-, had been trying for some time to talk me into writing a book like this for Soviet readers, but I just could not bring myself to get down to it. It was Emanuel Strauss, my colleague in the electronic field, who during our talks in Moscow persuaded me to write this book. I have included my impressions of the chess and human aspects of my opponents (if they are well-known players), as well as typical episodes from tournament life.\nMy first appearance abroad was in England at Hastings (alas, I was not very successful).\nBut my first great success was also in England, at Nottingham in 1936. Incidentally, the unrealized match for the World Championship between Alekhine and myself was also planned to be held in England. In the subsequent years the number of my chess friends in England has in no way diminished. I hope that by publishing this book no harm will be done to the popularity of a past chess player. His games and his comments should come to his defence!\nMoscow\nM. M. BOTVINNIK ","torrent":{"xt":"urn:btih:23a436d31b57aecfc271b0f288704435b55fa3bf","amp;dn":"Mikhail+Botvinnik+-+Half+a+Century+of+Chess","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23a436d31b57aecfc271b0f288704435b55fa3bf","infoHashBuffer":{"type":"Buffer","data":[35,164,54,211,27,87,174,207,194,113,176,242,136,112,68,53,181,95,163,191]},"announce":[],"urlList":[]}}