{"title":"[Digital Tutors] Quick Start to Animation in MODO (Vol.1)-KTR","uid":10931736,"size":288134503,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:23edab7b6e70d2c3effe05d43c45e5628358efc6&amp;dn=%5BDigital+Tutors%5D+Quick+Start+to+Animation+in+MODO+%28Vol.1%29-KTR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xKTRx","files":11,"time":1409408991,"description":"[Digital Tutors] Quick Start to Animation in MODO (Vol.1)-KTR\n==============================================================\n\n\nPUBLISHER....:  Digital Tutors         \nLANGUAGE......: ENGLISH \nLEVEL.........: BEGINNER\nRUNTIME......:  59m 8s\nSOFTWARE.....:  MODO 801\n\n\nAbout this course::\n\nWelcome you to the Quick Start to Animation in MODO. Quick Starts are a series of specially constructed tutorials meant to be followed in sequence and include valuable exercises to reinforce learned concepts. \n\nThe lesson format for these Quick Starts will be similar to other introductory training from Digital-Tutors. We'll go through MODO's Animation Tools in a very methodical way, making sure to cover the tools and techniques that are most important in enabling you to get up and running quickly. Each Volume of a Quick Start will build upon the previous Volume, enabling us to progressively build up a complex project into a finished state. \n\nIn this initial Volume, we'll cover the basics of getting started with the animation tools in MODO. We'll learn how to set our animation preferences and set keyframes. We'll learn about MODO's Dope Sheet, which is used to retime animation. We'll also jump into the Graph Editor, and learn how it can be used to polish and cycle animation in MODO. To conclude the tutorial, we'll learn how to view our work in real-time. \n\nWhile building a project together, you'll be provided with valuable knowledge, and the real power comes from being able to take the techniques you've learned and apply them in a different way to your own work. With this in mind, you'll be presented with an assignment immediately following each Volume. These assignments will challenge you to take the skills that you've learned in a particular Volume and apply them to a different asset. \n\nThese tutorials are designed to be taken in sequence so we really encourage you to start with this Volume and proceed all the way through to Volume 3, all so you can take advantage of the periodic assignments along the way to get the full learning experience.\n\n\n\nTopics include:\n\n1.Introduction and project overview\n\n2.Setting your animation preferences in MODO\n\n3.Exploring MODO's timeline and playback controls\n\n4.Keyframing in MODO\n\n5.Working with MODO's Set Key modes\n\n6.Auto key\n\n7.Utilizing MODO's Dope Sheet\n\n8.The Graph Editor\n\n9.Cycling animation in MODO\n\n10.Previewing animation in real-time\n\n11.Volume 1 assignment\n","torrent":{"xt":"urn:btih:23edab7b6e70d2c3effe05d43c45e5628358efc6","amp;dn":"%5BDigital+Tutors%5D+Quick+Start+to+Animation+in+MODO+%28Vol.1%29-KTR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23edab7b6e70d2c3effe05d43c45e5628358efc6","infoHashBuffer":{"type":"Buffer","data":[35,237,171,123,110,112,210,195,239,254,5,212,60,69,229,98,131,88,239,198]},"announce":[],"urlList":[]}}