{"title":"NY77: The Coolest Year in Hell","uid":4452872,"size":1376320100,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:242e07c1b05e5a897802fdfb98b5a21c6bd0d039&amp;dn=NY77%3A+The+Coolest+Year+in+Hell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"brattman","files":1,"time":1224346761,"description":"New York City, 1977 - It was a time when the city had fallen into decay, with too few jobs, money, police, schools, and social services. There was a city wide blackout with major looting, a serial killer on the loose, and the Bronx was burning. And yet out of the chaos emerged one of the most creative times any city has ever encountered.\n\nExecutive Produced by Academy Award Nominee Nanette Burstein (&quot;The Kid Stays in the Picture&quot;), &quot;NY77: The Coolest Year In Hell&quot; is a two-hour documentary that tells the story of one astonishing year in New York City history. Premiering Saturday, August 11 at 9PM*, the documentary is told chronologically and weaves together the stories of the emergence of hip hop, punk and disco, graffiti art, and sexual liberation. In the background are the major political events and social issues of the day -- crime, urban decay, financial woes, the infamous blackout, drugs, Son of Sam, the bitter mayoral election and the overall poverty that gripped the city.\n\nOut of chaos came creation. From the South Bronx came hip hop. From the Lower East Side, the thrashing guitars of punk. And all over the city, a disco revolution was underway. Elaborate, finely crafted graffiti art decorated the subway cars and break-dancers shimmied in the streets. The sexual revolution was in full swing. In January 1977, most of this activity existed in its own underground bubble. Yet by the end of the year this artistic expression was on its way to mainstream America, and would be with us for generations to come.\n\nThe documentary uses groundbreaking animation to help tell the story, and features interviews with those who lived it, including Ed Koch, Geraldo Rivera, Jimmy Breslin, Gloria Gaynor, Afrika Bambaataa, Chris Stein (Blondie), Richard Hell, KRS-One, Grandmaster Caz, DJ Disco Wiz, Legs McNeil, Annie Sprinkle, Al Goldstein, Tommy Ramone, Jellybean Benitez, Lee Quinones, and many more.","torrent":{"xt":"urn:btih:242e07c1b05e5a897802fdfb98b5a21c6bd0d039","amp;dn":"NY77%3A+The+Coolest+Year+in+Hell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"242e07c1b05e5a897802fdfb98b5a21c6bd0d039","infoHashBuffer":{"type":"Buffer","data":[36,46,7,193,176,94,90,137,120,2,253,251,152,181,162,28,107,208,208,57]},"announce":[],"urlList":[]}}