{"title":"H.Paul Honsinger - Wezwał Nas Honor [PL]","uid":13635101,"size":612425890,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2436360cab6149fca0ae08eafc862ae9d8129094&amp;dn=H.Paul+Honsinger+-+Wezwa%C5%82+Nas+Honor+%5BPL%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"everdarksoul","files":46,"time":1456057575,"description":"Audiobook PL - 44 części /   \r\nrozmiar: 582 MB / czas: 13:58:19\r\nczyta: Roch Siemianowski\r\n\r\nWezwał Nas Honor - to opowieść dziejąca się w przyszłości - w roku 2315 - kiedy to Unia Terrańska toczy od ponad trzydziestu lat krwawą i wyniszczającą wojnę z Hegemonią Krag. Jest to rasa przypominająca wielkie szczury, która pragnie zguby ludzkości. Wiele światów nalężących dotąd do ludzi zostało już utraconych, a o zamieszkałej na nich ludności wszelki słuch zaginął... Sytuacja Unii jest bardzo dramatyczna - a dodatkowo, po użyciu straszliwej broni biologicznej, pod znakiem zapytania staje cała przyszłość całej Rasy Ludzkiej...\r\n\r\nAkcja książki zaczyna się w momencie, gdy świeżo awansowany do stopnia komandora-porucznika Maxime Tindall Robichaux, otrzymuje dowodzenie najnowocześniejszym okrętem we flocie Unii Terrańskiej - USS Cumberland. Jest to okręt najnowszej generacji, który posiada zdolności jakich nie posiada żaden starszy okręt, ale… niestety nie do końca.\r\nKiedy bowiem Max trafia na pokład swojego okrętu, uświadamia sobie że &quot;coś jest nie tak&quot;. Szybko odkrywa, że załoga została zdemoralizowana przez swojego poprzedniego dowódcę i teraz ciężar zrobienia z nich prawdziwych wojowników spadł na jego barki. Na szczęście nowemu dowódcy do pomocy zostają przydzieleni bardzo doświadczeni oficerowie i podoficerowie. Na pokład trafia też doktor Ibrahim Sahin - znakomity, doświadczony lekarz i szeroko wykształcony człowiek. Po niedługim czasie staje się także najlepszym przyjacielem Maxa.\r\nDzięki ich połączonym wysiłkom okręt zaczyna przypominać prawdziwy okręt wojenny - a co ważniejsze: szybko okazuje się, że jest w stanie wygrać z potężniejszym przeciwnikiem - nawet pomimo dysproporcji w tonażu i sile ognia. Podczas pełnienia misji, załoga okrętu odkrywa plan - który może umożliwić Rasie Krag zadanie jednego - śmiertelnego - ciosu ludzkości. Zaczyna się gra o najwyższą stawkę…\r\n\r\nHonsinger wykreował na bohaterów swojej powieści prawdziwych &quot;ludzi ze stali&quot; - którzy dla ratowania swojego narodu (rasy) są gotowi do poświęceń, nawet za najwyższą cenę. Pokazane na kartach powieści postacie są krwiste, a ich myśli i doświadczenia wpływają na podejmowane przez nie decyzje. Ludzie służący na pokładzie USS Cumberland, to jednak nie super-ludzie - tylko zwyczajni marynarze, który mają swoje wymagania i potrzeby - a nawet mający problemy: czy to natury psychicznej czy zdrowotnej. Nawet dowódca okrętu nie jest tak doskonałym człowiekiem, jakim na pozór się wydaje. Po czasie zdajemy sobie sprawę, że komandor-porucznik Robichaux jest także mocno dotknięty piętnem tej długotrwałej wojny...\r\nW powieści tej, autor bardzo dokładnie opisuje zarówno funkcje jak i sposoby działania poszczególnych broni oraz urządzeń USS Cumberland - poczynając od armat impulsywnych, pociskach rakietowych, a kończąc na nawigacji w przestrzeni. Czytelnik może też nie raz zanurzyć się w głęboką sieć galaktycznej polityki, czy powiązań handlowych, a także poczuć strach jaki wywołuje świadomość nieuchronności pewnych wydarzeń...\r\nWszystko to czyni fabułę niezwykle mocno trzymającą w napięciu, a dodatkową widowiskowość zapewniają m.in. znakomite ukazanie kosmicznych abordaży przy użyciu broni białej oraz bitwy toczonee przy użyciu rakiet czy dział - na wiele godzin wciągną czytelnika, pozawalają mu się poczuć tak, jakby niemal sam stał na mostku okrętu pośrodku bitwy...\r\n\r\nWezwał nas Honor to pierwszy tom serii &quot;Man of War&quot; - napisanej przez H. Paula Honsingera. Powieść została wydana w grudniu 2014 roku przez wydawnictwo Drageus, które na swoim koncie ma też wydanie serii Iana Douglasa - Star Carrier. Na chwilę obecną, w języku polskim ukazały się trzy powieści cyklu &quot;Man Of War&quot;.\r\n\r\ncykl Man of War:\r\n\r\n1 - Wezwał Nas Honor\r\n2 - Honor To My\r\n3 - Bracia W Chwale","torrent":{"xt":"urn:btih:2436360cab6149fca0ae08eafc862ae9d8129094","amp;dn":"H.Paul+Honsinger+-+Wezwa%C5%82+Nas+Honor+%5BPL%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2436360cab6149fca0ae08eafc862ae9d8129094","infoHashBuffer":{"type":"Buffer","data":[36,54,54,12,171,97,73,252,160,174,8,234,252,134,42,233,216,18,144,148]},"announce":[],"urlList":[]}}