{"title":"The Attack of the Super Monsters","uid":3717390,"size":712389762,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2442a7fc6a5a0c232e23581e34b9b151435327d0&amp;dn=The+Attack+of+the+Super+Monsters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"poppyland1","files":1,"time":1182185253,"description":"You may think you know the meaning of the word, \\&quot;schlock.\\&quot; You may believe that you\\&amp;#039;ve been exposed to some truly pitiful films over the course of your life. Watch \\&quot;The Attack of the Supermonsters,\\&quot; however, and you will realize that you only THOUGHT you\\&amp;#039;d seen disgracefullly bad films. \n\nThis ordeal may be easier if you don\\&amp;#039;t know what to expect, but if you must know more about what you\\&amp;#039;re getting into, here\\&amp;#039;s a description: Imagine that somebody created a covert tax shelter in the form of a kids\\&amp;#039; Sci-Fi series that was so attrocious, it would have to lose money. Shrewd investors in cahoots with the producer could appear to lose much more than they\\&amp;#039;d ever spent on the show, thus reducing their tax burden. \n\nThat\\&amp;#039;s my best guess as to how this came into being. We\\&amp;#039;re talking about mid-1980s era Japanese Sci-Fi animation that\\&amp;#039;s highly derivative of classics such as Space Battleship Yamato/Starblazers and Gatchaman/Battle of the Planets. There are also dinosaurs portrayed by guys in rubber suits who destroy cities while (being fluent in English) shouting things like, \\&quot;Humans are vermin and must be exterminated....and destroyed!\\&quot; \n\n\\&quot;Guys in rubber suits?\\&quot; you\\&amp;#039;re thinking, \\&quot;Didn\\&amp;#039;t he just say this was an animated series?\\&quot; \n\nYeah. Well, They had this brilliant idea of combining live-action giant monsters --as well as miniature model transforming spaceship effects-- with a cast of cartoon animated human characters. Don\\&amp;#039;t ask me why. \n\nWhat I\\&amp;#039;m uploading here is the 84 minute feature film --if you can call it that-- which was created by chopping up the series and pasting several episodes together. Normally, when a TV series is so cynically strip-mined into a two-hour theatrical release (as was done with Space Battleship Yamato and the original Battlestar Galactica, to name two examples), you sit there missing all the stuff that you know damned well is canonical to the story, but wound up on the cutting room floor. In the case of Attack of the Super Monsters, however, anything done to reduce your investment of time can only be seen as an act of mercy. \n\nDon\\&amp;#039;t say I didn\\&amp;#039;t warn you. \n\n\n\n\nBy the way, this is the very first torrent that I\\&amp;#039;ve ever attempted to originate and seed on this site. Wish me luck? Gimme a high-five? I just hope this works....","torrent":{"xt":"urn:btih:2442a7fc6a5a0c232e23581e34b9b151435327d0","amp;dn":"The+Attack+of+the+Super+Monsters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2442a7fc6a5a0c232e23581e34b9b151435327d0","infoHashBuffer":{"type":"Buffer","data":[36,66,167,252,106,90,12,35,46,35,88,30,52,185,177,81,67,83,39,208]},"announce":[],"urlList":[]}}