{"title":"Gaudi and Nusrat Fateh Ali Khan - Dub Qawaali","uid":4043304,"size":49849777,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:246c712ea9441c8c2ea6a1b41e69d3c79c8cbe9c&amp;dn=Gaudi+and+Nusrat+Fateh+Ali+Khan+-+Dub+Qawaali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"esserhaddon","files":12,"time":1203783944,"description":"Gaudi and Nusrat Fateh Ali Khan - Dub Qawaali - 2007\n\nMP3/CBR 128\n\nNusrat Fateh Ali Khan was and is still very much considered to be the greatest Qawwal (singer of Qawwali music) in the world; not only recognized as a legend in his native Pakistan he also took his musical messages of peace, love and spirituality to the international stage, earning him the title of Pakistan?s premier ambassador of Qawwali music. The origins of Qawwali music trace back over seven hundred years to the spiritual Samah songs of Persia and the mystical faith of Sufism.\n\nSo, what happens when you unite one of world?s most revered voices with a long-time veteran of global music production? Dub Qawwali, by London-based producer/artist Gaudi reveals the answer. The album blends organic and digital dub stylings with original vocals from Pakistan?s beloved Ustad Nusrat Fateh Ali Khan. The result is a moving body of work that respectfully brings Khan?s Qawwali songs together with Jamaican dub via superb 21st century studio techniques. Dub Qawwali is a celebration of Nusrat Fateh Ali Khan?s life and is being released on Six Degrees Records in August 2007, marking the 10-year anniversary of his death.\n\nGaudi was one of six producers who were initially offered a single Nusrat track to remix by the Lemon Group ? owners of the song publishing of Nusrat Fateh Ali Khan?s works from 1968-1974, in association with Khan?s original Pakistani label Rehmat Gramophone. The company loved what Gaudi had done with the material and offered him complete access to the recording sessions from 35 years ago, including rare and unreleased vocal parts. The original studio reels where sent to Gaudi?s studio in London in 2005 and work began.\n\nThe album opens with the soft tones of ?Bethe Bethe Kese Kese?; a nostalgic and warm track where melodious Flute and Strings echo contemplative vocals. A firm stepper rhythm anchors and drives the track while Sarangi adds dimension to this wistful introduction. This is also the first track that Gaudi produced in the series and very much provided the drive and direction that is evident throughout the rest of the album. ?Tera Jana Kere Rang Lawe? is a dub influenced roots reggae track combining passionate and melancholic Strings with a roots dub bassline. Its uncluttered feel and rolling Bass spiced with off-beat Tabla gives space and groove. The vocals in ?Dil Da Rog Muka Ja Mahi? inspired the inclusion of a theme from the Kraftwerk track ?The Model? used by permission from the legendary German electro-pioneers in this remarkable excursion of a track; analogue Synthesizers give authenticity to its 1977 origins, while Hammond organ, a deep bassline and fills of dubbed up percussive echo keep the reggae flavors rolling. ?Ena Akhiyan Noo? is positive and evocative; an upbeat reggae theme supporting emotive and expansive vocal passages is spiced up with rub-a-dub flavors and breaks of hypnotic chant. You don?t have to understand Urdu, Punjabi or Persian to feel the sentiment evoked on Dub Qawwali, it is a work of truly international appeal.\n\nThe use of vintage analogue studio equipment and dub production techniques such as tape echoes, valve amps, Fender Rhodes, spring reverbs, Hammond organ and Moog, characterizes Gaudi?s production style, however it is not without its share of 21st century intervention and wizardry? Individual tracks from the original 70?s multi-track recordings often contained multiple parts together on them. These had to then be carefully cleaned up in order to make them usable in a way that would enable the composition of these new works. (This included much of the vocal parts which where mixed in the same track as the Harmonium and other instruments!) \n\nGaudi?s attention to detail paid off. Dub Qawwali revives Nusrat Fateh Ali Khan?s vocals in a truly distinctive fashion ? a vital accomplishment given Khan?s stature. The legendary Pakistani artist has inspired the likes of Peter Gabriel, Michael Brook and Eddie Vedder and is in the Guinness Book of Records for having the world?s largest recorded output by a Qawwali artist ? a total of 125 albums. Gaudi, aware of the gravity of re-working such a prolific and globally respected artist was moved to comment: ?After 26 years of music activity I have to say that this is one of the most important productions I have ever done.?\n\nMore information: http://www.gaudimusic.com/\n\nEnjoy!","torrent":{"xt":"urn:btih:246c712ea9441c8c2ea6a1b41e69d3c79c8cbe9c","amp;dn":"Gaudi+and+Nusrat+Fateh+Ali+Khan+-+Dub+Qawaali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246c712ea9441c8c2ea6a1b41e69d3c79c8cbe9c","infoHashBuffer":{"type":"Buffer","data":[36,108,113,46,169,68,28,140,46,166,161,180,30,105,211,199,156,140,190,156]},"announce":[],"urlList":[]}}