{"title":"X-Men - Essential Readings HQ Collection","uid":9487337,"size":1622535813,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:24907c146d2bd649471da656e6a217c58e6bd254&amp;dn=X-Men+-+Essential+Readings+HQ+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1389924124,"description":"The idea of this torrent is simple - what if you've never heard of the X-Men? Or never read anything about them? How would you catch-up? Well, this collection is designed to cover nearly 20 years of X-Men stories in one go, covering the period of 1963-1982, and all in as high quality as possible. Many of these releases are NEW to TPB and/or in higher resolution than what has been available previously, so even if you own everything here it still may be to your benefit to check out the quality levels and choose which is better for you. \n\nI have divided this torrent into 4 parts, as follows:\n\n01 Origins, Neal Adams, Second Genesis - This covers the early period of the X-Men as well as the influence of Neal Adams toward the latter part of the first run, before cancellation. Instead of including Stan Lee's work, I have instead used the recent X-Men: Season One for two reasons; one, because it is a terrific modern retelling and covers quite a lot of early X-Men material and two, I mistakenly left it off my Marvel: Season One torrent, lol! The X-Men returned in a big way in 1975 with Giant-Size X-Men 01, and that is included here via the best release version. This section contains X-Men: Season One (Digital, Zone-Empire), Marvel Masterworks - The X-Men Volume 6 (Bchry-DCP) and Giant-Size X-Men 01 (Dobis P.R.-Novus-HD).\n\n02 X-Men (Uncanny X-Men) v1 094-096, 100-105, 107-110) - This period covers the rebirth of the X-Men with issue 94, the first of Chris Claremont's long and lauded run that transformed the X-Men into one of Marvel's flagship titles, and among the most popular of teams. Stories in here include most of the original five X-Men leaving, the death of Sunfire, the rise of Phoenix, and the initial introductions of the Shi'ar and Starjammers. Contains X-Men 094-096 (TolEressea-Novus-HD), X-Men 100-110 excluding 106 (TLK-Empire-HD).\n\n03 Marvel Masterworks: Claremont and Byrne - from issue 111, John Byrne joined Chris Claremont as co-plotter and penciler of the series and their fruitful collaboration produced some of the finest Marvel stories ever written, most notably the Dark Phoenix Saga which is presented full in Volume 5. Contains Marvel Masterworks - The Uncanny X-Men Volumes 3,4,5 (by Bchry-DCp, collecting issues 111-140 of X-Men).\n\n04 Days of Future Past + Marvel Graphic Novels - DOFP is one of the most famous and successful stories in comic history, and rightly so; it is a great exploration of future dystopia and whether it can (or should) be averted. This is a brand new digital release of the trade paperback. Also, the two MGCs that were consecutively released featuring the X-Men - The New Mutants and God Loves, Man Kills - are both excellent representations of the era as well as the greatly improving writing that marked Claremont's run. The latter, especially, is among my personal favorite X-Men stories as it deals with religious fanatics Reverend William Stryker and his Purifiers, and the X-Men aligning with Magneto to prevent genocide in the name of God. Powerful stuff. Days of Future Past is courtesy of Zone-Empire, New Mutants is a 2048px release by Minutemen-Syl3ntBob, and God Loves, Man Kills is Bchry-DCP release.\n\nMany thanks to the incredible work of the scanners I've listed - really excellent stuff that I was able to find. Also, shout out to STFMaryville, blackcanary and MrclScans for originally posting some of the stuff in this torrent on Pirate Bay. You are awesome people!\n\nEnjoy and as always, please seed, thanks! :-)","torrent":{"xt":"urn:btih:24907c146d2bd649471da656e6a217c58e6bd254","amp;dn":"X-Men+-+Essential+Readings+HQ+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24907c146d2bd649471da656e6a217c58e6bd254","infoHashBuffer":{"type":"Buffer","data":[36,144,124,20,109,43,214,73,71,29,166,86,230,162,23,197,142,107,210,84]},"announce":[],"urlList":[]}}