{"title":"Secrets of Modern Chess Strategy (John Watson)","uid":9063626,"size":21039420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24e6b279df2b302053055d5e06d8bac029fc1832&amp;dn=Secrets+of+Modern+Chess+Strategy+%28John+Watson%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1382067876,"description":"It is now seventy years since Nimzowitsch wrote his monumental work &quot;My System.&quot; While it remains a fundamental work on chess strategy, the way chess positions are handled has changed greatly since Nimzowitsch's time - both refinements to existing ideas, and completely new concepts. John Watson's book fulfils the need for a thorough, profound work on the modern handling of chess positions, and how Nimzowitsch's theories - still controversial and revolutionary at the time My System was written - have been refined and used alongside classical concepts.\n\nThe first section of the book discusses how the understanding of classical themes, such as pawn majorities, the centre, and structural weaknesses, have been refined. Watson then moves on to discuss new concepts, including the willingness of modern players to accept backward pawns in return for dynamic play, the idea of a good 'bad' bishop, knights finding useful roles at the edge of the board and the exchange sacrifice idea that became prevalent with the post-war Soviet champions. This profound yet thoroughly practical work is rounded off with sections on prophylactic thinking, dynamism, modern concepts as they apply to the critical contemporary opening systems, and some thoughts on the future of chess.\n\n\n-- About the author --\n\n\nInternational Master John Watson is one of the world's most respected writers on chess. In 1999, his Secrets of Modern Chess Strategy won 'Chess Book of the Year' awards in the USA and the UK. He reviews chess books for The Week in Chess and hosts a weekly radio show on the Internet Chess Club. As a trainer, he has worked with many talented pupils, including Tal Shaked.","torrent":{"xt":"urn:btih:24e6b279df2b302053055d5e06d8bac029fc1832","amp;dn":"Secrets+of+Modern+Chess+Strategy+%28John+Watson%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e6b279df2b302053055d5e06d8bac029fc1832","infoHashBuffer":{"type":"Buffer","data":[36,230,178,121,223,43,48,32,83,5,93,94,6,216,186,192,41,252,24,50]},"announce":[],"urlList":[]}}