{"title":"Four Fish: The Future of the Last Wild Food","uid":9991860,"size":277474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24eea28033229b5b7cf5e8a33a93801172d54d42&amp;dn=Four+Fish%3A+The+Future+of+the+Last+Wild+Food&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":-1,"time":1397859945,"description":"Four Fish: The Future of the Last Wild Food\n\nEnglish | 2010 | ISBN: 1594202567 | 304 pages | epub | 0,3 MB\n\nIn this unusually entertaining and nuanced investigation into global fisheries, New York Times seafood writer Greenberg examines our historical relationship with wild fish. In the early 2000s, Greenberg, reviving his childhood fishing habit, discovered that four fish--salmon, tuna, bass, and cod--&quot;dominate the modern seafood market&quot; and that &quot;each is an archive of a particular, epochal shift&quot;: e.g., cod, fished farther offshore, &quot;herald the era of industrial fishing&quot;; and tuna, &quot;the stateless fish, difficult to regulate and subject to the last great gold rush of wild food... challeng us to reevaluate whether fish are at their root expendable seafood or wildlife desperately in need of our compassion.&quot; \n\nHe found that as wild fisheries are overexploited, prospective fish farmers are likely to ignore practical criteria for domestication--hardiness, freely breeding, and needing minimal care--instead picking traditionally eaten wild-caught species like sea bass &quot;a failure in every category.&quot; Greenberg contends that ocean life is essential to feeding a growing human population and that rational humans should seek to sustainably farm fish that can &quot;stand up to industrial-sized husbandry&quot; while maintaining functioning wild food systems.\n","torrent":{"xt":"urn:btih:24eea28033229b5b7cf5e8a33a93801172d54d42","amp;dn":"Four+Fish%3A+The+Future+of+the+Last+Wild+Food","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24eea28033229b5b7cf5e8a33a93801172d54d42","infoHashBuffer":{"type":"Buffer","data":[36,238,162,128,51,34,155,91,124,245,232,163,58,147,128,17,114,213,77,66]},"announce":[],"urlList":[]}}