{"title":"Talc Tolchin Learn The Essentials Of Piano Volume 1 VHSRip","uid":9401592,"size":165625856,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:260f658bc80c9a815db76c4ab79acdb87cc7179d&amp;dn=Talc+Tolchin+Learn+The+Essentials+Of+Piano+Volume+1+VHSRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pizzaslice","files":-1,"time":1388082739,"description":"Talc Tolchin Learn The Essentials Of Piano Volume 1 [1987, instructional videos, VHSRip]\n\n\n\nTalc Tolchin - Learn The Essentials Of Piano - Volume 1 - Getting Started\n\n\nYear : 1987 Genre : instructional video Duration : 1:55:36 \n\n\nDescription : Professional musician and teacher Talc Tolchin advocates theory and ear training over note reading. This piano video / dvd includes all the basics you'll need to get started on the keyboard. &quot;Learn the Essentials of Piano Volume I&quot; is Geared for the Beginner, the Student wishing to brush up on Basic Theory, or someone has WHO HAD A reading-oriented Approach to music and Would like to Experience A Contemporary Approach more. Piano Lesson 1 orients you to the keyboard, naming the notes, and the challenge of keeping time. Piano Lesson 2 introduces the concept of scales, focusing on the major scales and their fingering. Piano Lesson 3 gives suggestions on how you can rearrange scales and apply them when improvising, with Talc supplying the chordal rhythmic background. Piano Lesson 4 gives you an understanding of how all the major and minor chords are based on the scales you have learned. It then applies them to an actual piece of music, Pachelbel's Canon. Piano Lessons 5 and 6 take four chords and show step-by-step the variety you can express through rhythm. Methods of using simple bass lines are also worked in with the chords. English Language course, there are also all the other parts of the ear training to jazz improvisation, if you need to lay out the week) \n\n\nQuality : VHSRip Format : AVI Video codec : XviD Video : 512 x 384 (4:3) 29,970 Hz Audio : 48000 Hz, Joint Stereo, 67 kbit / s \n","torrent":{"xt":"urn:btih:260f658bc80c9a815db76c4ab79acdb87cc7179d","amp;dn":"Talc+Tolchin+Learn+The+Essentials+Of+Piano+Volume+1+VHSRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"260f658bc80c9a815db76c4ab79acdb87cc7179d","infoHashBuffer":{"type":"Buffer","data":[38,15,101,139,200,12,154,129,93,183,108,74,183,154,205,184,124,199,23,157]},"announce":[],"urlList":[]}}