{"title":"Carbon Nanotube Science - Synthesis, Properties and Applications","uid":15388169,"size":8683834,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:265f1b54c88a0a1e839a854fff5d5ea67e3ae866&amp;dn=Carbon+Nanotube+Science+-+Synthesis%2C+Properties+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469307908,"description":"Carbon Nanotube Science - Synthesis, Properties and Applications - Peter J.F. Harris (CUP, 2009).pdf\r\n\r\nCarbon nanotubes represent one of the most exciting research areas in modern science. These molecular-scale carbon tubes are the stiffest and strongest fibres known, with remarkable electronic properties, and potential applications in a wide range of fields. Carbon Nanotube Science is a concise, accessible book, presenting the basic knowledge that graduates and researchers need to know. Based on the successful Carbon Nanotubes and Related Structures, this book focuses solely on carbon nanotubes, covering the major advances made in recent years in this rapidly developing field. Chapters focus on electronic properties, chemical and bimolecular functionalisation, nanotube composites and nanotube-based probes and sensors. The book begins with a comprehensive discussion of synthesis, purification and processing methods. With its comprehensive coverage of this active research field, this book will appeal to researchers in a broad range of disciplines, including nanotechnology, engineering, materials science and physics","torrent":{"xt":"urn:btih:265f1b54c88a0a1e839a854fff5d5ea67e3ae866","amp;dn":"Carbon+Nanotube+Science+-+Synthesis%2C+Properties+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265f1b54c88a0a1e839a854fff5d5ea67e3ae866","infoHashBuffer":{"type":"Buffer","data":[38,95,27,84,200,138,10,30,131,154,133,79,255,93,94,166,126,58,232,102]},"announce":[],"urlList":[]}}