{"title":"Wood Modification-Chemical,Thermal and Other Processes","uid":6725060,"size":6752879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2739df4317f8704a4440ff69b545a068ddb8ac08&amp;dn=Wood+Modification-Chemical%2CThermal+and+Other+Processes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317911114,"description":"This book is exclusively concerned with wood modification, although many of these processes are generic and can be applied to other lignocellulosic materials. There have been many rapid developments in wood modification over the past decade and, in particular, there has been considerable progress made in the commercialisation of technologies.  Topics covered include:\n\n    * The use of timber in the 21st century\n    * Modifying the properties of wood\n    * Chemical modification of wood: Acetic Anhydride Modification and reaction with other chemicals\n    * Thermal modification of wood\n    * Surface modification\n    * Impregnation modification\n    * Commercialisation of wood modification\n    * Environmental consideration and future developments\n\nThis is the first time that a book has covered all wood modification technologies in one text. Although the book covers the main research developments in wood modification, it also puts wood modification into context and additionally deals with aspects of commercialisation and environmental impact.\n\nThis book is very timely, because wood modification is undergoing huge developments at the present time, driven in part by environmental concerns regarding the use of wood treated with certain preservatives. There has been considerable commercial interest shown in wood modification over the past decade, with products based upon thermal modification, and furfurylation now being actively being marketed. The next few years will see the commercialisation of acetylation and impregnation modification. This is a new industry, but one that has enormous potential.\n\nThis book will prove useful to all those with an interest in wood modification including researchers, technologists and professionals working in wood science and timber engineering, wood preservation, and well as professionals in the paper and pulp industries, and those with an interest in the development of renewable materials.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 260 pages\n    * Publisher: Wiley (March 13, 2006)\n    * Language: English\n    * ISBN-10: 0470021721\n    * ISBN-13: 978-0470021729","torrent":{"xt":"urn:btih:2739df4317f8704a4440ff69b545a068ddb8ac08","amp;dn":"Wood+Modification-Chemical%2CThermal+and+Other+Processes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2739df4317f8704a4440ff69b545a068ddb8ac08","infoHashBuffer":{"type":"Buffer","data":[39,57,223,67,23,248,112,74,68,64,255,105,181,69,160,104,221,184,172,8]},"announce":[],"urlList":[]}}