{"title":"The.Ascent.of.Woman.s01e02.EN.SUB.WEBRIP.[MPup]","uid":12423092,"size":1072407342,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27609ebd4de90fe7a906107bbd6f374ec28bcfc3&amp;dn=The.Ascent.of.Woman.s01e02.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"makinapufterpup","files":2,"time":1442330142,"description":"The.Ascent.of.Woman.s01e02.EN.SUB.WEBRIP.[MPup]\nSeparation\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]2 of 4[/b]\n\nDr Amanda Foreman explores how early civilisations dealt with the status of women. Amanda explores the role of women in Asia under Confucianism and Buddhism.\n\n[img]http://extraimago.com/images/2015/09/15/d92f937b3c40e04365eb143bd927143b.jpg[/img]\n\nTravelling to Vietnam, China and Japan, Dr Amanda Foreman explores the role of women in Asia under the philosophy religions of Confucianism and Buddhism. Covering a period from the 1st century AD to the present day, she'll look at how Asian ideals of feminine virtue and the division of space between the female world of the home and male world of business and politics became a hallmark of Chinese identity. Part of yin and yang, they have cast a long shadow across women's lives, not just in China, but across Asia.\n\nOn the one hand, empowered by faiths such as Buddhism and Shinto, many women confronted the limits placed on their sex. They include Vietnam's Trung Sisters, who mounted the first armed rebellion against China, Empress Wu, the only woman to have ruled China in her own right, and the female writers of 12th century Japan such as Murasaki Shikibu, who created Japan's great literacy masterpieces, including the world's first novel - The Tale of Genji.\n\nOn the other hand, these limitations created ideals of beauty that advocated immobility and artifice, and were a world away from low-status work and labour. If they could lead to dynastic power and in some cases considerable sexual freedom, they also culminated in one of the most troubling and least understood beauty rituals in women's history: Chinese foot-binding, whose painful legacy would last right up to the 20th century","torrent":{"xt":"urn:btih:27609ebd4de90fe7a906107bbd6f374ec28bcfc3","amp;dn":"The.Ascent.of.Woman.s01e02.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27609ebd4de90fe7a906107bbd6f374ec28bcfc3","infoHashBuffer":{"type":"Buffer","data":[39,96,158,189,77,233,15,231,169,6,16,123,189,111,55,78,194,139,207,195]},"announce":[],"urlList":[]}}