{"title":"Penetration Testing With BackBox [PDF] [StormRG]","uid":9822658,"size":3880171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:284c0433a432c288994827e60920be38af279f5b&amp;dn=Penetration+Testing+With+BackBox+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"steelballz","files":-1,"time":1395717673,"description":"Description\nPenetration Testing With BackBox\nAuthor:Stefan Umit Uygur\nPublished:Feb. 20 2014\nPublisher:Packt Publishing \nISBN-10:1783282975\nISBN-13:9781783282975\nASIN:B00IKCTYJS\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nIn Detail\n\nBackBox is an amazing Linux security distribution designed to keep in mind the needs of security and system administration specialists. It has been developed to perform penetration tests and security assessments. Designed to be fast and easy to use while providing a minimal yet complete desktop environment, Backbox comes with its own software repositories and is continually updated to the latest stable version of the most widely used and best-known ethical hacking tools.\n\nThis book provides an exciting introduction to BackBox Linux in order give you familiarity with and understanding of this amazing Linux security distro, making you feel comfortable with both the subject of pen-testing and BackBox. The book progresses through topics based on standard cases of penetration testing from the initial steps to the final procedures.\n\nThis book will help you discover the exciting world of penetration testing through a series of step-by-step, practical lessons. Penetration Testing with BackBox is organized into eight chapters. Starting with an introduction to BackBox Linux in order to give you a solid grounding of this amazing Linux security distro, including both its design philosophy and feature set, before moving on to practical tutorials in using BackBox. The book is arranged in a chronological order based on standard cases of penetration testing. For those more experienced in the use of penetration testing tools, each chapter can be read independently, providing a detailed overview of how BackBox will augment your arsenal of tools at each step of the penetration testing process.\n\nThroughout this book, you will be given a clear picture of IT security cases by having one of the most popular topics of penetration testing demonstrated in a user-friendly way. By the end of the book, you will have learned all the fundamental skills needed to use BackBox for ethical hacking.\nApproach\n\nThis practical book outlines the steps needed to perform penetration testing using BackBox. It explains common penetration testing scenarios and gives practical explanations applicable to a real-world setting.\nWho this book is for\n\nThis book is written primarily for security experts and system administrators who have an intermediate Linux capability. However, because of the simplicity and user-friendly design, it is also suitable for beginners looking to understand the principle steps of penetration testing.\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:284c0433a432c288994827e60920be38af279f5b","amp;dn":"Penetration+Testing+With+BackBox+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284c0433a432c288994827e60920be38af279f5b","infoHashBuffer":{"type":"Buffer","data":[40,76,4,51,164,50,194,136,153,72,39,230,9,32,190,56,175,39,159,91]},"announce":[],"urlList":[]}}