{"title":"Doctor Who - Season 06 - (1968-69) - 44 Episodes","uid":9074119,"size":3567356821,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:286ed86fc18b0726168075868a880e1f498f564e&amp;dn=Doctor+Who+-+Season+06+-+%281968-69%29+-+44+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bnaron","files":44,"time":1382256686,"description":"The sixth season of British science fiction television series Doctor Who began on 10 August 1968 with the first story of season 6 The Dominators and ended Patrick Troughton's reign as the Doctor with its final story The War Games. Patrick Troughton, Frazer Hines and Wendy Padbury make their final appearances as the Second Doctor, Jamie McCrimmon and Zoe Heriot respectively. Troughton and his fellow actors collectively decided that the workload of Doctor Who was exhausting them, and that they would soon depart from the show. Doctor Who season 7 onwards would never have such a high number of episodes again. The three actors remained with the show until the conclusion of the final season six serial The War Games.\n\n1.  The Dominators - Five Episodes\n\n    Synopsis: An alien craft bearing the imperious and ruthless Dominators\n    arrives on the peaceful planet of Dulkis. \n\n2.  The Mind Robber - Five Episodes\n\n    Synopsis: By blowing a fluid link, the Doctor is forced to use the\n    emergency unit to take the TARDIS away from danger and indeed out\n    of reality itself: to the Land of Fiction. \n\n3.  The Invasion - Eight Episodes\n    Episodes 1 and 4 are ANIMATED reconstructions.\n\n    Synopsis: The Doctor arrives in late twentieth-century London.\n    He soon finds out that the Cybermen are hidden somewhere on Earth\n    and planning an invasion. \n\n4.  The Krotons - Four Episodes\n\n    Synopsis: On an unnamed planet, a race called the Gonds are \n    subject to the mysterious Krotons, unseen beings to whom they\n    provide their brightest members as 'companions'.\n\n5.  The Seeds of Death - Six Episodes\n\n    Synopsis: The Ice Warriors are hiding on the Moon and planning\n    to destroy every living thing on Earth. I can not tell if this\n    is the Special Edition or not. One must assume it is not.\n\n6.  The Space Pirates - Six Episodes\n    All but episode 2 are reconstructions.\n\n    Synopsis: Space beacons on the space lanes are being blown up\n    and plundered for precious argonite by a gang of space pirates\n    led by Caven and his associate Dervish. \n\n7.  The War Games - Ten Episodes\n\n    Synopsis: On an alien planet, the Doctor uncovers a diabolic\n    plot to conquer the universe. Brainwashed soldiers are abducted\n    from Earth and forced to fight in simulated environments,\n    reflecting the periods in history whence they were taken. The\n    aliens' aim is to produce a super army from the survivors. This is\n    Patrick Troughton's Final appearance as the Doctor.\n","torrent":{"xt":"urn:btih:286ed86fc18b0726168075868a880e1f498f564e","amp;dn":"Doctor+Who+-+Season+06+-+%281968-69%29+-+44+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286ed86fc18b0726168075868a880e1f498f564e","infoHashBuffer":{"type":"Buffer","data":[40,110,216,111,193,139,7,38,22,128,117,134,138,136,14,31,73,143,86,78]},"announce":[],"urlList":[]}}