{"title":"Joseph Fink, Jeffrey Cranor - Welcome to Night Vale - A Novel","uid":12753944,"size":347475558,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:289abd2cc32a7319821a24358c347a852c9687bc&amp;dn=Joseph+Fink%2C+Jeffrey+Cranor+-+Welcome+to+Night+Vale+-+A+Novel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":11,"time":1447422624,"description":"\nFrom the creators of the wildly popular Welcome to Night Vale podcast comes an imaginative mystery of appearances and disappearances that is also a poignant look at the ways in which we all struggle to find ourselves...no matter where we live.\r\n\r\nLocated in a nameless desert somewhere in the great American Southwest, Night Vale is a small town where ghosts, angels, aliens, and government conspiracies are all commonplace parts of everyday life. It is here that the lives of two women, with two mysteries, will converge.\r\n\r\nNineteen-year-old Night Vale pawn shop owner Jackie Fierro is given a paper marked &quot;KING CITY&quot; by a mysterious man in a tan jacket holding a deerskin suitcase. Everything about him and his paper unsettles her, especially the fact that she can't seem to get the paper to leave her hand and that no one who meets this man can remember anything about him. Jackie is determined to uncover the mystery of King City and the man in the tan jacket before she herself unravels.\r\nNight Vale PTA treasurer Diane Crayton's son, Josh, is moody and also a shape-shifter. And lately Diane's started to see her son's father everywhere she goes, looking the same as the day he left years earlier, when they were both teenagers. Josh, looking different every time Diane sees him, shows a stronger and stronger interest in his estranged father, leading to a disaster Diane can see coming, even as she is helpless to prevent it.\r\n\r\nDiane's search to reconnect with her son and Jackie's search for her former routine life collide as they find themselves coming back to two words: &quot;KING CITY&quot;. It is King City that holds the key to both of their mysteries, and their futures...if they can ever find it.\r\n\r\n\r\nRead by Cecil Baldwin\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged\r\n\r\nPerformed by Welcome to Night Vale podcast narrator Cecil Baldwin and special guests Dylan Marron, Retta, Thérèse Plummer, and Dan Bittner, with music by Disparition","torrent":{"xt":"urn:btih:289abd2cc32a7319821a24358c347a852c9687bc","amp;dn":"Joseph+Fink%2C+Jeffrey+Cranor+-+Welcome+to+Night+Vale+-+A+Novel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"289abd2cc32a7319821a24358c347a852c9687bc","infoHashBuffer":{"type":"Buffer","data":[40,154,189,44,195,42,115,25,130,26,36,53,140,52,122,133,44,150,135,188]},"announce":[],"urlList":[]}}