{"title":"A Heat Transfer Textbook 4th ed - John H. Lienhard (2011)","uid":11996338,"size":20004861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28be1776b97c2176b6218162a43f7a12bc4387dc&amp;dn=A+Heat+Transfer+Textbook+4th+ed+-+John+H.+Lienhard+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1433673893,"description":"This introduction to heat transfer offers advanced undergraduate and graduate engineering students a solid foundation in the subjects of conduction, convection, radiation, and phase-change, in addition to the related topic of mass transfer. A staple of engineering courses around the world for more than three decades, it has been revised and updated regularly by the authors, a pair of recognized experts in the field. The text addresses the implications, limitations, and meanings of many aspects of heat transfer, connecting the subject to its real-world applications and developing students' insight into related phenomena. \nThree introductory chapters form a minicourse in heat transfer, covering all of the subjects discussed in detail in subsequent chapters. This unique and effective feature introduces heat exchangers early in the development, rather than at the end. The authors also present a novel and simplified method for dimensional analysis, and they capitalize on the similarity of natural convection and film condensation to develop these two topics in a parallel manner. Worked examples and end-of-chapter exercises appear throughout the book, along with well-drawn, illuminating figures","torrent":{"xt":"urn:btih:28be1776b97c2176b6218162a43f7a12bc4387dc","amp;dn":"A+Heat+Transfer+Textbook+4th+ed+-+John+H.+Lienhard+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28be1776b97c2176b6218162a43f7a12bc4387dc","infoHashBuffer":{"type":"Buffer","data":[40,190,23,118,185,124,33,118,182,33,129,98,164,63,122,18,188,67,135,220]},"announce":[],"urlList":[]}}