{"title":"Lies, Damned Lies, and Drug War Statistics","uid":6644711,"size":2772972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28d3a9eaac27d9211adb3eaceb1b089712a894d4&amp;dn=Lies%2C+Damned+Lies%2C+and+Drug+War+Statistics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1314901900,"description":"Lies, Damned Lies, and Drug War Statistics: A Critical Analysis of Claims Made by the Office of National Drug Control Policy\n\nUncovers how the Office of National Drug Control Policy uses and misuses statistical evidence. \nFrom the Back Cover\nThis book critically analyzes claims made by the Office of National Drug Control Policy (ONDCP), the White House agency of accountability in the nation's drug war. Specifically, the book examines six editions of the annual National Drug Control Strategy between 2000 and 2005 to determine if ONDCP accurately and honestly presents information or intentionally distorts evidence to justify continuing the war on drugs.\n\nMatthew B. Robinson and Renee G. Scherlen uncover the many ways in which ONDCP manipulates statistics and visually presents that information to the public. Their analysis demonstrates a drug war that consistently fails to reduce drug use, drug fatalities or illnesses associated with drug use; fails to provide treatment for drug dependent users; and drives up the prices of drugs. They conclude with policy recommendations for reforming ONDCP's use of statistics, as well as how the nation fights the war on drugs.\n\n\n&quot;The authors have performed a valuable service to our democracy with their meticulous analysis of the White House ONDCP public statements and reports. They have pulled the sheet off what appears to be an official policy of deception using clever and sometimes clumsy attempts at statistical manipulation. This document, at last, gives us a map of the truth.&quot; -- Mike Gray, author of Drug Crazy: How We Got into This Mess and How We Can Get Out\n&quot;Robinson and Scherlen make a valuable contribution to documenting how ONDCP fails to live up to basic standards of accountability and consistency.&quot; -- Ethan Nadelmann, Executive Director, Drug Policy Alliance \n\n\nPaperback: 288 pages \nPublisher: State University of New York Press (January 25, 2007) \nLanguage: English \n \n ","torrent":{"xt":"urn:btih:28d3a9eaac27d9211adb3eaceb1b089712a894d4","amp;dn":"Lies%2C+Damned+Lies%2C+and+Drug+War+Statistics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28d3a9eaac27d9211adb3eaceb1b089712a894d4","infoHashBuffer":{"type":"Buffer","data":[40,211,169,234,172,39,217,33,26,219,62,172,235,27,8,151,18,168,148,212]},"announce":[],"urlList":[]}}