{"title":"Voyager - V  320k    mp3     ak2014","uid":10582763,"size":133094630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:290239c1794e59fd5caf4193950ac876f3b596d9&amp;dn=Voyager+-+V++320k++++mp3+++++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"analogkid6103","files":15,"time":1405709071,"description":"Voyager - V  320k    mp3     ak2014 What we got...&quot;Voyager&quot; is a progressive metal band from Perth, Western Australia. The band has released five full length albums, two singles, six video clips and has been active since 1999. Their 5th full length studio album, &quot;V&quot;, has been released on June 3, 2014.[2] The band is signed to Sensory Records (a subsidiary of The Laser's Edge) and has previously been signed to Dutch label DVS Records and German label Dockyard 1 Records.\n\n\n\nHistory\nFormation and Element V (1999-2003)\n\nVoyager are a progressive metal band from Perth, Western Australia. Formed in 1999 at the University of Western Australia by Daniel &quot;toothgap&quot; Estrin, a German-born musician who was studying law at the time, Mark Baker, a physics PhD student and Adam Lovkis, an arts student, the band saw a few lineup changes before recording the album &quot;Element V&quot; in 2003 with Aidan Barton at Sovereign Studios, Willetton, Western Australia. The lineup for Element V consisted of Daniel &quot;toothgap&quot; Estrin (keyboards, vocals), Mark De Vattimo (guitar), Jennah Graieg (bass), Geoff Callaghan (drums) and Emanuel Rudnicki (guitar), who briefly played in true metal band Black Steel in 2002. The album Element V was picked up by Dutch label DVs Records and released in Europe in 2004.[3] Japanese label Woodbell/Experience licenced the album for Japanese distribution in the same year and released it with a bonus track &quot;Now and Forever&quot;.[4] Voyager's popularity increased rapidly following the European release of Element V and the band secured its first major support, opening for Steve Vai in Perth in July 2004. After the release of Element V, Melissa Fiocco replaced Jennah on bass. Following a performance at Melbourne's Corner Hotel in late 2005 as part of a Screaming Symphony radio benefit concert, both Emanuel and Geoff were replaced by Simone Dow and Mark Boeijen respectively. Boeijen is best known for his drumming for Perth extreme metal bands Samain and Vesper's Descent.","torrent":{"xt":"urn:btih:290239c1794e59fd5caf4193950ac876f3b596d9","amp;dn":"Voyager+-+V++320k++++mp3+++++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"290239c1794e59fd5caf4193950ac876f3b596d9","infoHashBuffer":{"type":"Buffer","data":[41,2,57,193,121,78,89,253,92,175,65,147,149,10,200,118,243,181,150,217]},"announce":[],"urlList":[]}}