{"title":"The Virtues of Our Vices: A Modest Defense of Bad Habits","uid":8342793,"size":3247158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2961882dfff59d61a28c3228b41ed5558502096e&amp;dn=The+Virtues+of+Our+Vices%3A+A+Modest+Defense+of+Bad+Habits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1365128129,"description":"The Virtues of Our Vices: A Modest Defense of Gossip, Rudeness, and Other Bad Habits\n\nPDF\n\nAre there times when it's right to be rude? Can we distinguish between good and bad gossip? Am I a snob if I think that NPR listeners are likely to be better informed than devotees of Fox News? Does sick humor do anyone any good? Can I think your beliefs are absurd but still respect you?\n In The Virtues of Our Vices, philosopher Emrys Westacott takes a fresh look at important everyday ethical questions--and comes up with surprising answers. He makes a compelling argument that some of our most common vices--rudeness, gossip, snobbery, tasteless humor, and disrespect for others' beliefs--often have hidden virtues or serve unappreciated but valuable purposes. For instance, there are times when rudeness may be necessary to help someone with a problem or to convey an important message. Gossip can foster intimacy between friends and curb abuses of power. And dubious humor can alleviate existential anxieties.\n Engaging, funny, and philosophically sophisticated, The Virtues of Our Vices challenges us to rethink conventional wisdom when it comes to everyday moral behavior.\n\n2011","torrent":{"xt":"urn:btih:2961882dfff59d61a28c3228b41ed5558502096e","amp;dn":"The+Virtues+of+Our+Vices%3A+A+Modest+Defense+of+Bad+Habits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2961882dfff59d61a28c3228b41ed5558502096e","infoHashBuffer":{"type":"Buffer","data":[41,97,136,45,255,245,157,97,162,140,50,40,180,30,213,85,133,2,9,110]},"announce":[],"urlList":[]}}