{"title":"Sexually Broken--Ana Foxxx trapped in a brutal Bondage Device An","uid":8219592,"size":1086060746,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:29c6b48feee43c1a63f2265fb62afc08daf50407&amp;dn=Sexually+Broken--Ana+Foxxx+trapped+in+a+brutal+Bondage+Device+An&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"merzedes","files":-1,"time":1362441196,"description":"Ana Foxxx trapped in a brutal Bondage Device, machine fucked and deep throated to massive orgasms | Ana Foxxx | Matt Williams\n\nMarch 4, 2013 \n\n \nMP4 only.\n    \n \nWelcome back Ana Foxx to the pages of Sexually Broken, the fastest growing Bondage and Rough Sex site in the world. Today we learn that Ana is as flexible and tough as she is sexy and beautiful. A killer combination in this business. \n\nAna is locked hard into a back bending custom made metal bondage device. One of the world's most powerful Fucking Machines has her deeply impaled. Her head is at perfect skull fucking height and her hard huge nipples are begging for abuse. \n\nWe turn the machine on and it begins it's tireless job of bringing our helpless slut to the first of many brutal orgasms. Suction cups are applied to Ana's huge nipples to make them even larger. We plan on tying them off later so we need them engorged. As Ana's mouth opens to moan in orgasmic bliss we jam the hard cock down her throat. Now it is a fight for air, and the cock will always win that fight.\n\nAna's struggles to multi-task as orgasm after orgasms is fucked out of her helpless body. The cock is fucking her face deep and hard. The deep throat spit is now covering our pretty girls face. Her eyes vacant, Ana is deep in subspace, sucking and cumming over and over. Each orgasm growing stronger and more brutal. With her head upside down the cock slides all the way into her throat. You can see it snake all the way down from the outside lump that moves, as we skull fuck her into next week.\n\nWe oil up her perfect skin and step back, turning up the fucking machine and listening to her wail as the machine rips another orgasm out of our nubian beauty. We bind her nipples with harsh bailing twine, then pull it back to the pillar and watch. The Machine never tires, Ana can't stop cumming. Perfect symbiosis... \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_04afoxxx2/SexuallyBroken-Ana-Foxxx-Matt-Williams-Ana-Foxxx-trapped-in-a-brutal-Bondage-Device-machine-fucked-and-deep-throated-to-massive-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_04afoxxx2/SexuallyBroken-Ana-Foxxx-Matt-Williams-Ana-Foxxx-trapped-in-a-brutal-Bondage-Device-machine-fucked-and-deep-throated-to-massive-orgasms.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:29c6b48feee43c1a63f2265fb62afc08daf50407","amp;dn":"Sexually+Broken--Ana+Foxxx+trapped+in+a+brutal+Bondage+Device+An","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c6b48feee43c1a63f2265fb62afc08daf50407","infoHashBuffer":{"type":"Buffer","data":[41,198,180,143,238,228,60,26,99,242,38,95,182,42,252,8,218,245,4,7]},"announce":[],"urlList":[]}}