{"title":"New.Girl.S03E04.HDTV.x264-LOL","uid":9022191,"size":110770447,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29cd78d7850a346e49e6e7d4357e828ac9d06cdf&amp;dn=New.Girl.S03E04.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Thhaque","files":2,"time":1381290772,"description":"New Girl\n\nGenre: Comedy\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: Elizabeth Meriwether\nCast: Zooey Deschanel, Jake M. Johnson, Max Greenfield, Hannah Simone, Lamorne Morris\n\n.: Plot :.\nNew Girl is a single camera comedy that follows Jess Day (Zooey Deschanel), an off-the-wall and adorable girl who just got out of a bad relationship. She moves in with 3 single guys and although she's awkward, she's with her personality. She is not used to being around boys and the three men don't make it easy for her at first. Nick (Jake Johnson), one of the roommates, is the most grounded. He had a plan for his life, but became a bartender instead. He can read people. Schmidt (Max Greenfield) prides himself as a modern-day Casanova. He sees Jess as a chance to get to know the female mind. Coach (Damon Wayans, Jr.) is a former high school athlete that makes a living as a Personal Trainer. He feels at his best when he is at the gym.\n\nWhen Jess's best friend Cece (Hannah Simone), a cynical model who became beautiful after her adolescent years, comes over, she gives the advice that Jess needs and gets her back on her feet again. The five friends realize that they need one another more than they thought and form a nice balance of friends. Created by Liz Meriwether (Freaks and Geeks), New Girl offers a fresh new comedy that takes a look into the relationships and breakups that we deal with on a daily basis and how to deal with them.","torrent":{"xt":"urn:btih:29cd78d7850a346e49e6e7d4357e828ac9d06cdf","amp;dn":"New.Girl.S03E04.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29cd78d7850a346e49e6e7d4357e828ac9d06cdf","infoHashBuffer":{"type":"Buffer","data":[41,205,120,215,133,10,52,110,73,230,231,212,53,126,130,138,201,208,108,223]},"announce":[],"urlList":[]}}