{"title":"Pearl Mountain Picture Collage Maker Pro v4.0.1 with Key [TorDig","uid":9169632,"size":107046067,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2a57b2c5c470d722733a730ffd75ac36179889c9&amp;dn=Pearl+Mountain+Picture+Collage+Maker+Pro+v4.0.1+with+Key+%5BTorDig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"TorDigger","files":11,"time":1384047760,"description":"Picture Collage Maker 4\n\nMake collages in minutes with just a few mouse clicks\n\nPicture Collage Maker, a simple-to-use photo collage generator that turns ordinary photos and pictures into stunning keepsakes to share with family and friends. With just a few clicks, you can create collages, scrapbooks, posters, invitations, calendars, and greeting cards. Unlike photography software that takes days to master, this powerful collage generator lets both seasoned collagers and new hobbyists become productive in minutes.\n\nPicture Collage Maker is a powerful and easy-to-use program for creating photo collages and digital scrapbooks from your digital photos to share with friends and family.\n\n-150+ gorgeous templates for many occasions help you create photo collages, scrapbooks, posters, invitations, calendars, and greeting cards, etc.\n-Edit and personalize photo collage with tons of professional effects: clipart, frames , mask and more.\n-Print directly, save as image file, set as wallpaper, and share via email.\n\nKey Features - Making a Photo Collage Has Never Been So Simple!:\n\nVarious professional templates to choose\nWith 150+ various templates provided to make scrapbook, digital collages, greeting cards, posters, photo album for any occasion, like Birthday, Easter, Christmas, Thanksgiving, Wedding, etc.\n\nDecorate photo collage with embellishments\nYou can further personalize your creation by adding clip-art, text, calendar, background. It allows you to resize, rotate and position all the elements to make collage crafting intuitive and fun.\n\nCreate personalized collage using your photos\nSimply drag and drop your photos onto collage. It comes with a large collection of beautiful picture frames and masks that you can add to any of your photos.\n\nExport and share photo collage\nYou can save your collage as an image file, set as your desktop wallpaper, share through Email, or print it out instantly to share with your friends and family.\n\nSystem Requirements:\n\nMicrosoft Windows 2000, XP, 2003, VISTA, Windows7, Windows8\n\nHomepage: http://www.picturecollagesoftware.com/\n\nInstallation Instructions: \n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:2a57b2c5c470d722733a730ffd75ac36179889c9","amp;dn":"Pearl+Mountain+Picture+Collage+Maker+Pro+v4.0.1+with+Key+%5BTorDig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a57b2c5c470d722733a730ffd75ac36179889c9","infoHashBuffer":{"type":"Buffer","data":[42,87,178,197,196,112,215,34,115,58,115,15,253,117,172,54,23,152,137,201]},"announce":[],"urlList":[]}}