{"title":"(PSX-PSP) Vagrant Story converted properly (Kingdom-games by Klo","uid":4865056,"size":121800324,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:2a5e977927920a87ea543aeeada90490de3447c2&amp;dn=%28PSX-PSP%29+Vagrant+Story+converted+properly+%28Kingdom-games+by+Klo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1240456635,"description":"VAGRANT STORY:\n\nAdventure into a world of unparalleled depth and danger with SquareSoft's VAGRANT STORY. In this sweeping dungeon-crawling epic you play as Ashley Riot, a young assassin and spy for the organization known as Riskbreakers. Your goal is to unravel a deep and twisted plot and come to terms with the recent death of your wife and child. If this sounds a bit too cerebral never fear. Your path to recapturing your sense of humanity hinges on the destruction of countless vicious monsters and the exploration of dark and dangerous dungeons. VAGRANT STORY is awash in gorgeous scenery and features designs from Yasumi Matsuno and Akihiko Yoshida, the acclaimed artists and creators behind FINAL FANTASY TACTICS. With an innovative and intuitive combat system, compelling and involving role-playing action, cinematic in-game cutscenes, beautifully varied environments, and much more VAGRANT STORY will keep you glued to your PlayStation for hours of hack 'n' slash questing.\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn ","torrent":{"xt":"urn:btih:2a5e977927920a87ea543aeeada90490de3447c2","amp;dn":"%28PSX-PSP%29+Vagrant+Story+converted+properly+%28Kingdom-games+by+Klo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a5e977927920a87ea543aeeada90490de3447c2","infoHashBuffer":{"type":"Buffer","data":[42,94,151,121,39,146,10,135,234,84,58,238,173,169,4,144,222,52,71,194]},"announce":[],"urlList":[]}}