{"title":"The Keeper of Lost Causes by Jussi Adler-Olsen (Department Q 01)","uid":7715879,"size":1378539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a81c055e9ef6eb0edb8766f79b31891dce2b791&amp;dn=The+Keeper+of+Lost+Causes+by+Jussi+Adler-Olsen+%28Department+Q+01%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"azizex666","files":-1,"time":1349931377,"description":"                            ** Recommended Read **\nJussi Adler-Olsen, author of The Absent One, is Denmark's premier crime writer. His books routinely top the bestseller lists in northern Europe, and he's won just about every Nordic crime-writing award, including the prestigious Glass Key Award-also won by Henning Mankell, Stieg Larsson, and Jo Nesbo. Now, Dutton is thrilled to introduce him to America.\n\nThe Keeper of Lost Causes, the first installment of Adler- Olsen's Department Q series, features the deeply flawed chief detective Carl MÃ˜rck, who used to be a good homicide detective-one of Copenhagen's best. Then a bullet almost took his life. Two of his colleagues weren't so lucky, and Carl, who didn't draw his weapon, blames himself.\n\nSo a promotion is the last thing Carl expects.\n\nBut it all becomes clear when he sees his new office in the basement. Carl's been selected to run Department Q, a new special investigations division that turns out to be a department of one. With a stack of Copenhagen's coldest cases to keep him company, Carl's been put out to pasture. So he's as surprised as anyone when a case actually captures his interest. A missing politician vanished without a trace five years earlier. The world assumes she's dead. His colleagues snicker about the time he's wasting. But Carl may have the last laugh, and redeem himself in the process.\n\nBecause she isn't dead . . . yet.\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n             **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                     &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:2a81c055e9ef6eb0edb8766f79b31891dce2b791","amp;dn":"The+Keeper+of+Lost+Causes+by+Jussi+Adler-Olsen+%28Department+Q+01%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a81c055e9ef6eb0edb8766f79b31891dce2b791","infoHashBuffer":{"type":"Buffer","data":[42,129,192,85,233,239,110,176,237,184,118,111,121,179,24,145,220,226,183,145]},"announce":[],"urlList":[]}}