{"title":"BBC - Jimi Hendrix The Uncut Story, Complete, DivX","uid":5545154,"size":2346948490,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b2cd0cd387d88caf372cb4fb3e777b62e57e7c7&amp;dn=BBC+-+Jimi+Hendrix+The+Uncut+Story%2C+Complete%2C+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MartinBLCK","files":-1,"time":1273357947,"description":"BBC - Jimi Hendrix The Uncut Story (2004), Complete, DivX, MvGroup\n--------------------------------------------------------------\n\nWith the blessings of Jimi's biological family and many of his closest\nfriends, Passport brings the life of Jimi Hendrix to light as never\nbefore. From his upbringing in Seattle to his final days in London, JIMI\nHENDRIX: THE UNCUT STORY goes beyond all previously released\ndocumentaries to explore the complete life-story behind the legendary\nartist.\n\nEpisode 1: 1942-1961\nThe first part of this three-episode series takes us through Jimi's life\nin Seattle, Washington where he spent two-thirds of his twenty-seven\nyears. Through the recollection of his closest friends and family, we\nenter into the inner world of Jimi's childhood upbringing. This is where\nwe come to know the people and events that would shape his love for\nmusic and define the extraordinary man he would become.\n\nEpisode 2: 1961 - 1967\nAfter Jimi's stint in the army, we join him as a sideman on the Chitlin'\nCircuit playing behind some of the greatest names in R&amp;B. After\nfollowing Jimi to New York, we head off to the UK where Jimi Hendrix\nbecame the toast of swinging London virtually overnight. Hear directly\nfrom the British rock stars and scenesters who witnessed Jimi's musical\ncoup d'ÃƒÂ©tat firsthand. Then follow the Jimi Hendrix Experience on their\nway to becoming the hottest rock trio on the world stage.\n\nEpisode 3: 1967 - 1970\nPart three highlights the culmination of Jimi's musical career. It was\nthe peak of the counter-culture era and the world was changing at an\nincredible pace. Jimi's music and lifestyle were no exception. Here is\nwhere we follow Jimi to the height of his creative powers, both in the\nstudio and on the road?only to watch it all come crashing down upon him.\nThrough exclusive interviews, we get the facts behind Jimi's demise and\nexamine the events surrounding his controversial death. But more than\nthat - we come to know the spiritual message behind Jimi's work and\ncelebrate the final stage of his life in music.\n\n-------------\n\nMore stuff here:                                                         &lt;a href=&quot;\nhttp://thepiratebay.se/user/MartinBLCK/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MartinBLCK/&lt;/a&gt;","torrent":{"xt":"urn:btih:2b2cd0cd387d88caf372cb4fb3e777b62e57e7c7","amp;dn":"BBC+-+Jimi+Hendrix+The+Uncut+Story%2C+Complete%2C+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b2cd0cd387d88caf372cb4fb3e777b62e57e7c7","infoHashBuffer":{"type":"Buffer","data":[43,44,208,205,56,125,136,202,243,114,203,79,179,231,119,182,46,87,231,199]},"announce":[],"urlList":[]}}