{"title":"Say Anything - ...Is A Real Boy (2005) [FLAC] vinyl","uid":9163510,"size":649721320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2baededdd7f6a51e8d47e8b8e7cd322aabc282a3&amp;dn=Say+Anything+-+...Is+A+Real+Boy+%282005%29+%5BFLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"politux","files":-1,"time":1383920016,"description":"\n  Say Anything - ...Is A Real Boy (2005) [FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Alternative, Punk, Indie\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Belt\n  02 Woe\n  03 The Writhing South\n  04 Alive with the Glory of Love\n  05 Yellow Cat (Slash) Red Cat\n  06 The Futile\n  07 Spidersong\n  08 An Orgy of Critics\n  09 Every Man Has a Molly\n  10 Slowly, Through a Vector\n  11 Chia-Like, I Shall Grow\n  12 I Want to Know Your Plans  \n  13 Admit It!!!\n  14 Wow, I Can Get Sexual Too\n  15 Little Girls\n  16 Most Beautiful Plague\n  17 It's a Metaphor Fool\n  18 Total Revenge\n  19 Metal Now\n  20 I Will Never Write an Obligatory Song...\n  21 Walk Through Hell\n\n  Lineage (Not my rip)\n\n  Audio Technica AT-LP60 &gt;\n  Stock Cartridge &gt;\n  Adobe Audition 3.0 &gt;\n  Amplified &gt;\n  Encoded to FLAC (Compression level 8)\n\n  Review\n\n  Despite some of the hype surrounding its release, Say Anything's self-described rock opera ...Is a Real Boy still caught many in the punk scene off-guard, seemingly coming out of nowhere with its theatrical tone and critical, perceptive lyrical makeup. At the helm of the album is the self-conscious 20-something singer/songwriter Max Bemis, who ultimately is Say Anything: he wrote and plays pretty much everything but percussion on the record. The songs were originally written as part of a play, complete with a cast of characters, full story, and spoken interludes. A rise-and-fall plot of sorts, the story line was to be: a band is mediocre until its idealistic frontman (who also suffers from alienation and anxiety in a world of hypocrisy) becomes cursed to spew his innermost thoughts in the form of honest songs that alter the band into wildly popular stars before their own hypocrisy leads to their undoing. \n\n  And though the proposed story line didn't completely transfer to the album, it's almost too easy to see parallels between the real band and the made-up one, envisioning Bemis (with his own history of anxiety, depression, and paranoia) as the actual hyper-aware lead character. Sure, one could look at this album as self-indulgent, overzealous, and egocentric, but when the songs are as catchy, cutting, and enjoyable as these, it really doesn't matter. The compelling rock of &quot;Belt&quot; starts things off with its thuggish army of background singers, leading into the self-conscious, wry realms of &quot;Woe&quot; (choice lyrics include: &quot;she took pity on me, horizontally, but most likely because of my band&quot;). Urgent drumbeats and harmonizing vocals open the singalong &quot;Alive with the Glory of Love,&quot; a song that is so catchy, one almost forgets the dark, almost Holocaust-like nature of the lyrics (a sample line reads &quot;when our city...falls to the axis, they'll search the buildings, collect gold fillings, wallets and rings...you'd look finer with each day in hiding&quot;). Musically, the songs are about as full of life as you'll likely find on any indie/punk release in the early 2000s, and Bemis' great lyrics only add to them. \n\n  Criticisms on popular culture appear alongside self-deprecating, introspective, and sarcastic lines of love and fear. In &quot;Every Man Has a Molly,&quot; Bemis implores kids to spend a lot of money on band merchandise after his girlfriend breaks up with him for writing about her in songs (&quot;because for you I won't ever have rough sex with Molly Connolly again&quot;). At one point, he tells the industry to &quot;go choke on your irony&quot; (&quot;The Futile&quot;), and frustrations with today's scene come to a sharp peak in the confrontational and biting &quot;Admit It!!!,&quot; where an empowered Bemis raises two impassioned middle fingers to the elitist crowds that may reject him and his music. Considering the new-school genre of punk that Say Anything is associated with -- and the audience the album is geared toward -- the record is quite ironic. After all, aren't some of the kids eating this music up the same ones with the elitist, condescending personas Bemis was reacting against in the first place? Either way, ...Is a Real Boy comes off as an impressively well-done, multifaceted effort that deserves multiple spins and makes Say Anything truly a band to watch.","torrent":{"xt":"urn:btih:2baededdd7f6a51e8d47e8b8e7cd322aabc282a3","amp;dn":"Say+Anything+-+...Is+A+Real+Boy+%282005%29+%5BFLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2baededdd7f6a51e8d47e8b8e7cd322aabc282a3","infoHashBuffer":{"type":"Buffer","data":[43,174,222,221,215,246,165,30,141,71,232,184,231,205,50,42,171,194,130,163]},"announce":[],"urlList":[]}}