{"title":"Qualitative Data Analysis","uid":6573044,"size":7789422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bb0e5744163c0bee48f9e21a6f7bba67a66ddf9&amp;dn=Qualitative+Data+Analysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"_F1_","files":-1,"time":1312055979,"description":"BY REQUEST: 'nyasangosi'\n\nnyasangosi at 2011-07-30 18:25 CET:\nI loved this and I was wondering if you could help me with the following, at you convenience. \n\n1. Methods for Development Work and Research, by Britha Mikkelsen. Sage, New Delhi, 2005.\n2. Cognitive Interviewing: A Tool for Improving Questionnaire Design, by Gordon B Willis. Sage, USA, 2004. \n3. Statistics without Tears: A Primer for Non-Mathematicians, by Derek Rowntree, Penguin, London, 2003. \n4. Statistics Unplugged, by Sally Caldwell. Wadsworth, USA, 2006. \n5.Qualitative Data Analysis, by Matthew B Miles and A Michael Huberman, Sage, USA, 1994. &lt;&lt;=========\n6. The Craft of Research, by WC Booth, JM Williams, and GG Colomb. University of Chicago Press, 2003.\nOr anything to do with research, M&amp;E and international development. Thanks in advance.\n\n===================================================================================\nQualitative Data Analysis: An Expanded Sourcebook By Matthew B. Miles, Michael Huberman\nPublisher: S a g e Publications; 2nd edition 1994 | 352 Pages | ISBN: 0803955405 , 0803946538 | PDF | 7.42 MB\n\n\nThe latest edition of this best-selling textbook by Miles and Huberman not only is considerably expanded in content, but is now available in paperback. Bringing the art of qualitative analysis up-to-date, this edition adds hundreds of new techniques, ideas and references developed in the past decade. The increase in the use of computers in qualitative analysis is also reflected in this volume. There is an extensive appendix on criteria to choose from among the currently available analysis packages. Through examples from a host of social science and professional disciplines, Qualitative Data Analysis remains the most comprehensive and complete treatment of this topic currently available to scholars and applied researchers. ","torrent":{"xt":"urn:btih:2bb0e5744163c0bee48f9e21a6f7bba67a66ddf9","amp;dn":"Qualitative+Data+Analysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bb0e5744163c0bee48f9e21a6f7bba67a66ddf9","infoHashBuffer":{"type":"Buffer","data":[43,176,229,116,65,99,192,190,228,143,158,33,166,247,187,166,122,102,221,249]},"announce":[],"urlList":[]}}