{"title":"HEALING FOODS: Practical Guide to the Health Benefits and Medici","uid":8232751,"size":850603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2be98476444948f1691519010f50a1d6c62d10ef&amp;dn=HEALING+FOODS%3A+Practical+Guide+to+the+Health+Benefits+and+Medici&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DaRule762","files":-1,"time":1362766042,"description":"Take Charge of Your Health! Improve your health and well-being with healing foods!\n\nHEALING FOODS is a practical guide to the medicinal properties and health benefits of power packed foods. This useful guide will help you better appreciate that nutrition, health, and wellness are intricately inter-linked. Vibrant, nutritionally dense foods possess great healing potential. The foods covered in this book are powerful enough to put you in a better mood, help you lower your cholesterol, and reduce your risk of heart disease and cancer. A healthy diet incorporating a variety of the foods included in this guide will help you prevent and fight disease, as well as maintain your weight, feel younger and live longer.\n\nThis book begins by briefly explaining the connection between foods and your health. It offers you some suggestions for potent foods that will lead you to better overall health. Part two of this book focuses on exploring more deeply the health benefits and medicinal uses of particular foods. The last section of this book is organized by health conditions and is intended to serve as a cross reference to the information provided earlier sections.\n\nIt is my hope that the information in this book will help you learn how food can truly be a delicious medicine and how you can eat not just for sustenance, but pleasure and improved health as well.","torrent":{"xt":"urn:btih:2be98476444948f1691519010f50a1d6c62d10ef","amp;dn":"HEALING+FOODS%3A+Practical+Guide+to+the+Health+Benefits+and+Medici","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be98476444948f1691519010f50a1d6c62d10ef","infoHashBuffer":{"type":"Buffer","data":[43,233,132,118,68,73,72,241,105,21,25,1,15,80,161,214,198,45,16,239]},"announce":[],"urlList":[]}}