{"title":"Metal Slug Anthology+game save [wii] [ntsc] [scrubbed]","uid":6347062,"size":1499375970,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:2c15ec44d753a06be79cba46808ca8f5dec8ca13&amp;dn=Metal+Slug+Anthology%2Bgame+save+%5Bwii%5D+%5Bntsc%5D+%5Bscrubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"flat480","files":-1,"time":1303872922,"description":"One of the most successful, and fun to play side-scrolling arcade games in history, the Metal Slug series is celebrating its 10th year anniversary with the release of the Metal Slug Anthology. With the Metal Slug Anthology, you will enjoy seven arcade-perfect conversions, including the all-new Metal Slug 6.\n\n\n\nTake home all of the Metal Slug goodness you've enjoyed at the arcade all these years.\n\n\n\nGame History\nIn 1996 an arcade legend was born with the release of Metal Slug: Super Vehicle 001. The military-style themes, and a side-scrolling platform mixed with a wacky sense of humor and hilarious cartoon style, proved extremely popular to a decidedly wide audience. Based on this success, seven more Metal Slug sequels would be developed and released.\n\nTen years later, The Metal Slug game play and popularity are still going strong. To celebrate, the creators of the Metal Slug Anthology stopped at nothing to provide a 2-D, side-scrolling compilation for the Wii that is perfectly compatible with all the great game play possibilities that the Wii has to offer.\n\nStoryline and Gameplay\nEach included game in the Metal Slug Anthology offers game play and game objectives centered around a futuristic battle between two military groups known as the Regular army, and the Rebellion. In 2026, the Rebellion army launches an assault that pushes the Regular army forces to the brink of destruction. With superior numbers of troops and weapons, the Rebels overwhelmed the Regular army in all aspects.\n\nSeeing their disadvantage to carry out direct attacks against the Rebellion, the Regular army then decided to carry out numerous special operations and create certain vehicles to accompany their commandos. As a direct result of this new plan, a newly designed tank code named &quot;Metal Slug&quot; was put into production.\n\nUnfortunately, the Rebellion captured many of the newly produced Metal Slug tanks, and starting using them against the Regular army. With their government and military in shambles, the Regular army gathered its scattered troops and launched a desperate counter attack; recapture the stolen vehicles and use them to destroy the opposition. If the vehicles can't be captured, destroy them.\n\nYour job is to help the Regular army defeat the Rebellion by using a myriad of different male and female characters, vehicles (including various animals and tanks), and weapons.\n\nThe Subsequent releases of Metal Slug titles (all included in the Anthology), continued to incorporate different antagonists, with more high-tech means and methods employed to attack the Regular army. Experience all the action and storylines with Metal Slug Anthology.\nProduct Description\nMetal Slug Anthology is the definitive collection of the intense shooter series. It includes all six of the classic games, all on one disc -- with ammunition and firepower than ever before. You've got an incredible arsenal waiting for you, from destructive pistols &amp; combat vehicles to a stockpile of grenades. Players' enemy-killing capabilities are upped to off more evil-doers in this 10th anniversary edition of an arcade classic. Includes Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4 and Metal Slug 5. \n\n\n              enjoy  please seed!!!!\n\n**************** this game is confirmed working *****************                 \n\nworks on ntsc 4.1u \nusb loader gx 2.1 ios 249 R(17) \ndisk channel (darkcorp v1.1)\n\n\nfor game save to work you must play the game to creat a game save file.\n\nthen delete the game save from the wii \n\nput the game save data on the sd card you have to place it in a folder structure on your SD card like so: \\private\\wii\\title\\GAME\\data.bin (replacing GAME with it's corresponding game code)\n\n\n\nOnce you have the file in place on your SD card, you can then put the SD card in to your Wii and go to your saved game(s) on your SD card (Wii Options &gt; Data Management &gt; Save Data &gt; Wii &gt; SD card tab), select the saved game that you want and select Copy\n\n\nif it wount let u copy it over get priiloader and in the system menu hacks select remove no copy flag, then you can copy it, the copy buttin will still be grey, but click it and it will copy over anyways \n","torrent":{"xt":"urn:btih:2c15ec44d753a06be79cba46808ca8f5dec8ca13","amp;dn":"Metal+Slug+Anthology%2Bgame+save+%5Bwii%5D+%5Bntsc%5D+%5Bscrubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c15ec44d753a06be79cba46808ca8f5dec8ca13","infoHashBuffer":{"type":"Buffer","data":[44,21,236,68,215,83,160,107,231,156,186,70,128,140,168,245,222,200,202,19]},"announce":[],"urlList":[]}}