{"title":"The Food Intolerance Bible: A Nutritionist's Plan to Beat Food","uid":8665401,"size":1043132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c55052d4af20da6f7035fb40e215cbb432b460a&amp;dn=The+Food+Intolerance+Bible%3A+A+Nutritionist%27s+Plan+to+Beat+Food&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373398388,"description":"Antony J. Haynes, Antoinette Savill, &quot;The Food Intolerance Bible: A Nutritionist's Plan to Beat Food Cravings, Fatigue, Mood Swings, Bloating, Headaches, IBS and Deal with Food Allergies&quot;\nISBN: 1573243590 | 2008 | EPUB\n\nFood intolerance occurs when the digestive system cannot break down a certain food or group of foods. Nearly everyone has an intolerance to some food. Food intolerances can range from fairly mild bloating and energy dips after eating to cramping or nausea, skin problems, or mood swings. Antony J. Haynes, a top nutritionist, has devised a unique nutritional plan to help readers identify and avoid food intolerances and allergies, which affect nearly all Americans. By following seven simple steps, anyone can isolate and eliminate problem foods and completely reverse our symptoms. Antoinette Savill, an award-winning special-diets cooking writer, has created over 70 delicious recipes that make staying on the plan easy. This book helps you to: Identify your culprit foods, eliminate trigger foods without cravings, know which lab tests work and why, and take the right nutritional supplements for your needs.\n","torrent":{"xt":"urn:btih:2c55052d4af20da6f7035fb40e215cbb432b460a","amp;dn":"The+Food+Intolerance+Bible%3A+A+Nutritionist%27s+Plan+to+Beat+Food","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c55052d4af20da6f7035fb40e215cbb432b460a","infoHashBuffer":{"type":"Buffer","data":[44,85,5,45,74,242,13,166,247,3,95,180,14,33,92,187,67,43,70,10]},"announce":[],"urlList":[]}}