{"title":"Nino Rota - Romeo &amp; Juliet (1968) Original Soundtrack Recording","uid":5126661,"size":267191110,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2cb072e7dbbb4981adf75e161b5b71f533b4ec72&amp;dn=Nino+Rota+-+Romeo+%26+Juliet+%281968%29+Original+Soundtrack+Recording&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TheBlackPirate","files":-1,"time":1255677705,"description":"Franco Zeffirelli's\n          Romeo &amp; Juliet\n\n  Original Soundtrack Recording\n     Composed and Conducted\n          by Nino Rora\n\n1. Prologue and Fanfare for The Prince (1:48)\n2. Romeo (4:05)\n3. Juliet (1:34)\n4. The Feast at the House of Capulet (2:07)\n5. Their First Meeting (2:51)\n6. What is a Youth (2:26)\n7. What Light through yonder Window breaks? (2:56)\n8. Parting is such sweet Sorrow (2:40)\n9. But this I pray... consent to marry us today (3:07)\n10.Romeo and Juliet are wed (1:44)\n11.The Death of Mercutio and Tybalt (1:05)\n12.Nightis Candles are burnt out (4:29)\n13.Adieu (Farewell Love Scene) (1:52)\n14.The Likeness of Death (3:41)\n15.The Ride from Mantua (2:56)\n16.Death... Hath sucked the Honey of thy Breath (1:49)\n17.Love Theme from Romeo and Juliet (in Capuletis Tomb) (3:05)\n18.O Happy Dagger! (The Death of Juliet) (4:13)\n19.Epilogue (7:42)\n\n\n\nI think the music for this film speaks for itself, as one of Rota's best and most romantic scores for film. In fact, over the years I've come to almost consider this score the best score ever composed for a film (except that it apparently wasn't originally composed for a film, more on that later), every dramatic moment is so perfectly captured in the music.\n\nHowever, over the years it has been unfairly treated on record and CD, beginning with the original Capitol 'spoken album' release which relegates the music to second class status to the words of Shakespeare. Many have found this release incredibly frustrating and it's understandable why. They bought it for the music, not the play. Capitol Records did go on to release it as a limited edition LP set, including the full 'play', as well as a score only extra LP. Despite having a score only release, it remained obscure. Capitol even repeated the mistake of releasing the 'spoken album' version again on CD frustrating the old generation a second time along with an entirely new generation. What score gets given this treatment in this day and age?\n\nOn the other hand, I think I understand the 'spoken word' original release. Before Romeo &amp; Juliet, Rota collaborated with Zeffirelli for The Taming of the Shrew, Zeffirelli's first film. It's a beautiful score, as well... at times I've almost preferred it to Romeo &amp; Juliet. Prior to this, they also had an association in a couple of Old Vic Theatre Shakespeare productions that went back to 1960 with Romeo &amp; Juliet, presumably the basic origins of the music later used in the film. I know of two other projects: Much Ado About Nothing (for Zeffirelli) and A Midsummer Night's Dream (for Joan Kemp-Welch; which I've never heard). Much Ado About Nothing was just a case of Rota re-cycling his film music (mainly Purple Noon/Plein Soleil and some of Il Bidone), and was released through RCA as a 3xLP 'spoken album' release. It seems like Capitol was just doing what was standard for Shakespeare theatre plays with their release of the Romeo &amp; Juliet film soundtrack.\n\nDuring the '90s, a few companies picked up the score only album and released it for a short time on CD. The last of these releases is the ideal one: on Silva Screen released in 1998 with a bonus and beautiful 7-8 minute Epilogue track, gorgeous sound, and is simply perfect in every sense; shortly after its release, it went out of print and confusingly was replaced by a re-recording of the 'complete score' (really, just the score as it appeared in film and I believe has a few minutes shorter running time than the prior Silva Screen release, although it includes the Moresca and Did My Heart Love Til' Now omitted from the other) on the same label.\n\nFor almost the last decade, the only one in print has been the re-recording. On the re-recording, it's very beautiful, it's very, very closely observed to be as close to the original as they could make it (with some deliberate but unnoticeable liberties taken), but it's not the same. It's not perfection as the original Rota conducted version was, in performance or atmosphere. There are obtrusive moments in the performance that repeatedly mar the experience for me. The song 'What is a Youth' is superfluous on both releases, but unbearable on the re-recording.\n\nConductor Riccardo Muti was a student of Rota's and heads the Rota archives. He has gone on to produce 3 major label CDs devoted to the composer and he is extremely proficient and colourful with his performances. It'd be nice if in the absence of the original soundtrack, he got around to recording suites of all of the Rota scores for Shakespeare plays, but perhaps that's just a dream that one day we'd get a recording worthy of the music.","torrent":{"xt":"urn:btih:2cb072e7dbbb4981adf75e161b5b71f533b4ec72","amp;dn":"Nino+Rota+-+Romeo+%26+Juliet+%281968%29+Original+Soundtrack+Recording","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cb072e7dbbb4981adf75e161b5b71f533b4ec72","infoHashBuffer":{"type":"Buffer","data":[44,176,114,231,219,187,73,129,173,247,94,22,27,91,113,245,51,180,236,114]},"announce":[],"urlList":[]}}