{"title":"Lexar Image Rescue 3","uid":4204477,"size":2749794,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2cbba59d2d96f820bf3de4d46cdcfc10227b5a2b&amp;dn=Lexar+Image+Rescue+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"z247","files":3,"time":1211674412,"description":"Lexar Image Rescue 3\n\n\nAnother program bundled with my Lexar Professional UDMA CF card. Similar to Corel Paint Shop Pro X which was uploaded by me several hours ago it is a full version of the program but it does not need any serial numbers, activations, etc. Simple, intuitive, efficient proggie. Awarded with American Photo Editor&amp;#039;s Choice 2007 award.\n\n\nProduct Highlights\n\n    * Recovers photo, video, and audio files from any brand or type of memory card, using any card reader\n    * Recovers popular file formats, including JPEG, TIFF, RAW, MP4, AVI, and more\n    * Redesigned interface and simple recovery process\n    * Live online chat link to Lexar support engineers\n    * Includes card reformatting, secure deletion, and overall card health check features\n   \n\n\t\n\n\nReliable Image Recovery for All Memory Cards\n\nLexar offers award-winning image recovery software that provides easy, reliable recovery of your valuable photos, and has been trusted by professional photographers since its introduction.\n\nLexar Image Rescue 3 software is simple, intuitive image recovery software that can recover lost or deleted files from any type or brand of memory card, using any card reader-giving you peace of mind that your valuable images and files are not lost. And Lexar Image Rescue 3 software not only provides image recovery, but now restores video and audio files as well. Image Rescue 3 will be available for free download with purchase of any new 2007 Lexar Professional or Platinum II line CompactFlash or Secure Digital memory card.\n\nUltimate Functionality\n\nSimple, Trusted Image Recovery. If you&amp;#039;ve ever accidentally deleted an image, experienced a card corruption, or had camera batteries fail while saving a picture, you know the results can be devastating. Trusted by professional photographers, Lexar Image Rescue software provides reliable image recovery of most popular file types, including JPEG, TIFF, and RAW formats. The software can recover image files from any type of memory card, using any reader-helping you save your valuable photos.\n\nAward-Winning Innovation, Now with an Easy-to-Use Interface. With a redesigned interface that includes a simple, step-by-step recovery process and a live online support chat link, Image Rescue 3 software offers the same award-winning innovation as previous versions, but now with more easy-to-use features. And as in previous versions, the software can also reformat the card, securely delete images, and report on the overall condition of the card, so you can always ensure it&amp;#039;s in perfect working order.\n\nComplete Your Digital Camera Solution. Whether you&amp;#039;re a professional photographer capturing important moments for clients or a casual digital camera user shooting family snapshots, image recovery software is critical for restoring your lost or deleted images. The perfect complement to any Lexar memory card, Image Rescue 3 software provides peace of mind that your valuable photo, video, and audio files can be recovered.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:2cbba59d2d96f820bf3de4d46cdcfc10227b5a2b","amp;dn":"Lexar+Image+Rescue+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cbba59d2d96f820bf3de4d46cdcfc10227b5a2b","infoHashBuffer":{"type":"Buffer","data":[44,187,165,157,45,150,248,32,191,61,228,212,108,220,252,16,34,123,90,43]},"announce":[],"urlList":[]}}