{"title":"[Taboo Heat] I Love My Daddy XXX WEBRip (NEW 2015)","uid":11839978,"size":845329593,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2cc605de6cb4732604c59bfef6e9a5189097a465&amp;dn=%5BTaboo+Heat%5D+I+Love+My+Daddy+XXX+WEBRip+%28NEW+2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"HighCode","files":3,"time":1429844440,"description":"[Taboo Heat] I Love My Daddy XXX WEBRip (NEW 2015) [.mp4]\n\nDillion and her dad have a backyard camping trip planned just the two of them, But because of the rain the back yard camping trip has turned into a living room sleepover. Dad takes his sleeping pill, kisses his daughter good night, and falls asleep. But Dillion can't sleep. Throwing open her sleeping bag Dillion checks to see if her dad is asleep and begins to masturbate. She pulls down her panties and pulls up her shirt rubbing herself. Her eyes light with a devious look and she pulls her father's hand to her pussy. Dillion sits next to her dad and gathers the courage to talk to him. &quot;I'm in love with you dad&quot; she tells him and explains through his confusion that he is the love of her life. &quot;I only want to be with you&quot; She rubs his crotch, needing to feel him inside her again. &quot;I love you daddy&quot; she says sucking his cock into her mouth. Cory is going out to the pool and asks her husband and daughter if they want to join her. As soon as Cory leaves Dillion says &quot;I want you to fuck me&quot;. Dad tells her that mom is right outside the window. &quot;All she has to do is look in&quot; he says, but Dillion only smiles and hikes up her skirt. Cory has taken a sleeping pill for the night and dad lays awake thinking. Dillion slowly opens the door and walks into her father's bedroom dressed in her underwear. &quot;Fuck me daddy, it will help you sleep&quot; she says as she strips off her underwear and tosses one leg over her mom's unconscious body. She starts masturbating for him enticing him to fuck her on top of Cory.\n\nSCREENSHOTS: &lt;a href=&quot;\nhttp://imgclover.com/image/De&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/De&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/DA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/DA&lt;/a&gt;","torrent":{"xt":"urn:btih:2cc605de6cb4732604c59bfef6e9a5189097a465","amp;dn":"%5BTaboo+Heat%5D+I+Love+My+Daddy+XXX+WEBRip+%28NEW+2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cc605de6cb4732604c59bfef6e9a5189097a465","infoHashBuffer":{"type":"Buffer","data":[44,198,5,222,108,180,115,38,4,197,155,254,246,233,165,24,144,151,164,101]},"announce":[],"urlList":[]}}