{"title":"Amira's Bellydance 101 DVD Rip RESEED","uid":5002270,"size":732792879,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2ce0a5d402ff846f041192f28b9d1c823a4a89db&amp;dn=Amira%5C%27s+Bellydance+101+DVD+Rip+RESEED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"youssef0eddoumali","files":2,"time":1247577717,"description":"Amira's Bellydance 101\n\nDVD Rip\n\nRESEED, have not included the performance clip with this (I've long since deleted), and I will get around to the full DVD sometime...apologies for the 1:1 ratio...back when I was a baby encoder.\n\nI have to say this is one of two beginner DVDs which I consider to be the best on the market (the other is Jenna's basics) and would highly recommend this to anyone starting out in bellydance.\n\nPlease don't confuse this Amira with Amira Mor, they are two different people! Amira Mor's dancing/instructional DVDs I find quite bad, but this Amira (of Las Vegas) is a brilliant dancer.\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nRadiate your feminine beauty! This DVD is a perfect gift for a woman in any age, size, and shape. Bellydance has become a revolutionary exercise form which is gentle on joints, low-impact but very effective way to loose weight and tone the body along with creating a better self-image and boosting the self-esteem. Discover Fitness and Fun Through Belly Dance!\n\nNo matter your age, size or shape, let Middle Eastern Dance change the way you see yourself.\n\nThe Amira Belly Dance 101 DVD is perfect for total beginners or more seasoned dancers looking for a review of technique. You'll learn the basic bellydance moves and then integrate them into combinations, safely and joyfully discovering your own dance.\n\nWith this motivating &amp; exceptionally high quality instructional video, you will:\n\n- Learn to love and move your body with grace &amp; confidence, nurture yourself with safe &amp; gentle warm-ups &amp; stretches,\n\n- Practice 60 minutes of step-by-step instruction with Amira, and dance to energizing, tightly synchronized rhythms from well known global recording artists.\n\n- You'll learn over 30 isolated body movements, each visually demonstrated and verbally described, with on-screen visual aids.\n\n- Clearly see all movements from multiple viewing angles, including full-body &amp; up-close views. Then perform fluid combinations of the moves you have learned. Bonus live performance included!\n\nFeaturing the beautiful music of widely acclaimed global recording artists Phil Thornton and Hossam Ramzy, this DVD has already earned widespread accolades for Amira's clear and supportive teaching style, her attention to solid technique, as well as for its exceptional production quality.\n\nWith its success in the U.K., in cooperation with the publishing house of New World Music Ltd., Amira's Bellydance Music Compilation CD was released in 2006, available on Amira's website.\n\n[img]http://img249.imageshack.us/img249/2932/tc3a1nc.jpg[/img]\n[img]http://img249.imageshack.us/img249/6739/vlcsnap872982.jpg[/img]\n[img]http://img219.imageshack.us/img219/2451/vlcsnap873048.jpg[/img]\n[img]http://img219.imageshack.us/img219/9787/vlcsnap873102.jpg[/img]\n[img]http://img89.imageshack.us/img89/2118/vlcsnap873154.jpg[/img]\n[img]http://img339.imageshack.us/img339/9117/vlcsnap873196.jpg[/img]\n[img]http://img89.imageshack.us/img89/1568/vlcsnap873235.jpg[/img] &lt;a href=&quot;\nhttp://img219.imageshack.us/img219/5010/vlcsnap873307.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img219.imageshack.us/img219/5010/vlcsnap873307.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2ce0a5d402ff846f041192f28b9d1c823a4a89db","amp;dn":"Amira%5C%27s+Bellydance+101+DVD+Rip+RESEED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce0a5d402ff846f041192f28b9d1c823a4a89db","infoHashBuffer":{"type":"Buffer","data":[44,224,165,212,2,255,132,111,4,17,146,242,139,157,28,130,58,74,137,219]},"announce":[],"urlList":[]}}