{"title":"The Stench of Honolulu - A Tropical Adventure - Jack Handey","uid":12015642,"size":1048647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d4084db5f9953aacd0febb290cdce998cf14e51&amp;dn=The+Stench+of+Honolulu+-+A+Tropical+Adventure+-+Jack+Handey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":4,"time":1434301257,"description":"The legendary Deep Thoughts and New Yorker humorist Jack Handey is back with his very first novel-a hilarious, absurd, far-flung adventure tale.\n\nTHE STENCH OF HONOLOLU\n\nAre you a fan of books in which famous tourist destinations are repurposed as unlivable hellholes for no particular reason? Read on!\n\nJack Handey's exotic tale is full of laugh-out-loud twists and unforgettable characters whose names escape me right now. A reliably unreliable narrator and his friend, who is some other guy, need to get out of town. They have a taste for adventure, so they pay a visit to a relic of bygone days-a travel agent-and discover an old treasure map. She might have been a witch, by the way. Our heroes soon embark on a quest for the Golden Monkey, which takes them into the mysterious and stinky foreign land of Honolulu. There, they meet untold dangers, confront strange natives, kill and eat Turtle People, kill some other things and people, eat another thing, and discover the ruins of ancient civilizations.\n\nAs our narrator says, &quot;The ruins were impressive. But like so many civilizations, they forgot the rule that might have saved them: Don't let vines grow all over you.&quot;","torrent":{"xt":"urn:btih:2d4084db5f9953aacd0febb290cdce998cf14e51","amp;dn":"The+Stench+of+Honolulu+-+A+Tropical+Adventure+-+Jack+Handey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4084db5f9953aacd0febb290cdce998cf14e51","infoHashBuffer":{"type":"Buffer","data":[45,64,132,219,95,153,83,170,205,15,235,178,144,205,206,153,140,241,78,81]},"announce":[],"urlList":[]}}