{"title":"Star Trek Enterprise - Stagione 2 - DVD Rip ITA-Eng [CR-Bt]","uid":5981624,"size":13049626277,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d4de58f4f50ff7001010d35cd6f83b81a8dd831&amp;dn=Star+Trek+Enterprise+-+Stagione+2+-+DVD+Rip+ITA-Eng+%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":null,"files":29,"time":1290605062,"description":"Star Trek: Enterprise ÃƒÂ¨ la quinta serie televisiva ambientata nell'universo fantascientifico di Star Trek (la sesta, considerando anche la serie animata).\n\nLe vicende di Enterprise sono ambientate circa un secolo prima di quelle della serie classica, nel momento in cui l'umanitÃƒÂ  comincia ad esplorare lo spazio.\n\nL'astronave al centro della serie ÃƒÂ¨ infatti l'Enterprise NX-01, la prima nave terrestre ad essere costruita al fine di esplorare lo spazio profondo. Questo ÃƒÂ¨ reso possibile dal miglioramento del motore a curvatura, fino a raggiungere velocitÃƒÂ  di curvatura (warp) 5. Il capitano designato per guidare questa nave ÃƒÂ¨ Jonathan Archer, figlio di uno dei principali progettisti del suo motore.\n\nUno degli elementi che contraddistingue le trame ÃƒÂ¨ il rapporto conflittuale con i vulcaniani: questi, dopo aver compiuto il primo contatto con i terrestri, si oppongono costantemente a molti dei tentativi degli umani di affacciarsi nello spazio profondo, ritenendoli impulsivi ed inesperti, e quindi inadatti ad essere introdotti nel &quot;consesso interstellare&quot; (come, ad esempio, affermerÃƒÂ  esplicitamente l'ambasciatrice V'Lar nell'episodio La caduta di un eroe). Per questo motivo i vulcaniani, non essendo riusciti a fermare il varo dell'Enterprise, vi impongono come primo ufficiale T'Pol. Il suo rapporto costantemente problematico e conflittuale con il capitano Archer costituisce uno dei temi di fondo della serie. Un altro spunto fondamentale ÃƒÂ¨ la mancanza della Prima direttiva, che non ÃƒÂ¨ ancora stata promulgata, il che lascia piÃƒÂ¹ spazio ad esplorazioni e contatti con civiltÃƒÂ  aliene anche poco progredite.\n","torrent":{"xt":"urn:btih:2d4de58f4f50ff7001010d35cd6f83b81a8dd831","amp;dn":"Star+Trek+Enterprise+-+Stagione+2+-+DVD+Rip+ITA-Eng+%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4de58f4f50ff7001010d35cd6f83b81a8dd831","infoHashBuffer":{"type":"Buffer","data":[45,77,229,143,79,80,255,112,1,1,13,53,205,111,131,184,26,141,216,49]},"announce":[],"urlList":[]}}