{"title":"Johnny Depp A Biography (Greenwood Biographies)(pdf){Zzzzz}","uid":11404078,"size":1108159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d7f543eb6df53929800a9cf84cf9be447396da7&amp;dn=Johnny+Depp+A+Biography+%28Greenwood+Biographies%29%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415455320,"description":"From the sweet but asocial adolescent in Edward Scissorhands to Captain Jack Sparrow in the Pirates of the Caribbean franchise, Johnny Depp has brought to life some of the most challenging, quirky and compelling characters in Hollywood history. Often considered the quintessential outsider, Depp has fascinated his fans for more than two decades. This biographical study invites fans and critics alike to take a close look at the person behind the movie star, his body of work as an actor, and the unique set of heroes and anti-heroes he has personified throughout his career.\n\nPublisher: Greenwood Press (30 November 2007)\nLanguage: English\nISBN-10: 0313343004\nISBN-13: 978-0313343001\n\nMost Helpful Customer Review\n\na serious study 21 January 2008\nBy W Boudville -\nA little strange that, given the global popularity of Johnny Depp in several successful movies, no one has already reviewed this book. It's not what you might first think; ie. a quickie expose of Depp, interspliced with salacious or outrageous tidbits. Instead, it is a serious and scholarly biography. Not sensationalistic at all. I deliberately say scholarly, because it is extensively footnoted, as befits an academic output.\n\nThe authors analyse Depp's movies and what has been published in various sources about his life. His roles are thoughtfully critiqued. We see his development and maturation as an actor. Playing quite varied roles. The book is of course incomplete, because hopefully Depp has many decades ahead of him, to further make his mark","torrent":{"xt":"urn:btih:2d7f543eb6df53929800a9cf84cf9be447396da7","amp;dn":"Johnny+Depp+A+Biography+%28Greenwood+Biographies%29%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d7f543eb6df53929800a9cf84cf9be447396da7","infoHashBuffer":{"type":"Buffer","data":[45,127,84,62,182,223,83,146,152,0,169,207,132,207,155,228,71,57,109,167]},"announce":[],"urlList":[]}}