{"title":"Intelligent Cities - Enabling Tools and Technology (gnv64)","uid":12021495,"size":36906213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d8529cbb55e7d938bcbd51bc6ccaba59c1364bd&amp;dn=Intelligent+Cities+-+Enabling+Tools+and+Technology+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":4,"time":1434448965,"description":"Intelligent Cities - Enabling Tools and Technology\nby Pethuru Raj and Anupama C. Raman\nAuerbach Publications | June 2015 | ISBN: 1482299976 | True PDF | 519 pages | 34.7 mb\n\nThe book begins by examining the rise of the cloud as the fundamental technology for establishing and sustaining smart cities and enterprises. Explaining the principal technologies and platform solutions for implementing intelligent cities, the book details the role of various technologies, standards, protocols, and tools in establishing flexible homes and the buildings of the future.\n\n-  Examines IT platforms and tools from various product vendors\n-  Considers service-oriented architecture and event-driven architecture for smart city applications\n-  Explains how to leverage big data analytics for smart city enhancement and improved decision making\n-  Includes case studies of intelligent cities, smart homes, buildings, transports, healthcare systems, and airports \n\nThe authors explore the convergence of cloud computing and enterprise architecture and present valuable information on next-generation cloud computing. They also cover the various architectural types, including enterprise-scale integration, security, management, and governance.\nThe book concludes by explaining the various security requirements of intelligent cities as well as the threats and vulnerabilities of the various components that form the basis of the intelligent city framework, including cloud, big data, Internet of Things, and mobile technologies.\n\nAbout the Authors\nPethuru Raj PhD has been working as a cloud infrastructure architect in the IBM Global Cloud Center of Excellence, IBM India Bangalore. Previously he worked as TOGAF-certified enterprise architecture consultant in Wipro Consulting Services Division, Bangalore. He also had a fruitful stint as a lead architect in the corporate research division of Robert Bosch, India. He has gained thirteen years of IT industry experience.\nDr. Raj finished the CSIR-sponsored PhD degree in Anna University, Chennai, and continued the UGC-sponsored postdoctoral research in the department of Computer Science and Automation, Indian Institute of Science, Bangalore until 1999. Thereafter, he was granted a couple of international research fellowships (JSPS and JST) to work as a research scientist for three years in two leading Japanese universities. \nHe has contributed book chapters for a number of high-quality technology books edited by internationally acclaimed professors and professionals. \nAnupama Raman is currently working as Content Lead for Smart Cities Brand of IBM and she is a part of Software group, Industry Solutions of IBM India. Prior to this, she was working with EMC Data Storage. She is a certified Storage Area Networking expert and is also a certified Data Center Architect. She is also certified in Cloud infrastructure and Services Management. Apart from these technical certifications, in the field of writing. She is a certified Information mapping professional and in the field of project management, she is a certified Scrum master. She holds an M.Tech degree in Computer Science and Engineering and is currently pursuing an MBA in IT Management. She has presented and published over twenty research papers in various national and international conferences and she has also written numerous book chapters with various national and international publishers.\n\nCONTENTS\nForeword xix\nPreface xxiii\nAcknowledgments xxvii\nChapter 1 Envisioning Intelligent Cities 1 \nChapter 2 Mobile Technologies and Apppplications for Intelligent Cities 41\nChapter 3 The Role and Relevance of Software-Defined Cloud Infrastructures 79\nChapter 4 Big Data Analytics for Real-Time City Insights 129\nChapter 5 The Internet of Things for Connected and Cognitive Cities 177\nChapter 6 Social Media Analytics for People Empowerment 235\nChapter 7 Intelligent Cities: Strategy-Making and Governance 265\nChapter 8 Smart Homes and Buildings 297\nChapter 9 Smart Energy, Utility, and Transport 341\nChapter 10 Intelligent Airports 379\nChapter 11 Next-Generation Healthcare Systems 411\nChapter 12 Security Management of Intelligent Cities 427\n &lt;a href=&quot;\nhttp://s8.postimg.org/8zlt64b9h/Intelligent_Cities_Enabling_Tools_and_Technolo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s8.postimg.org/8zlt64b9h/Intelligent_Cities_Enabling_Tools_and_Technolo.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2d8529cbb55e7d938bcbd51bc6ccaba59c1364bd","amp;dn":"Intelligent+Cities+-+Enabling+Tools+and+Technology+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8529cbb55e7d938bcbd51bc6ccaba59c1364bd","infoHashBuffer":{"type":"Buffer","data":[45,133,41,203,181,94,125,147,139,203,213,27,198,204,171,165,156,19,100,189]},"announce":[],"urlList":[]}}