{"title":"Saturn and melancholy - studies in the history of natural philos","uid":11406327,"size":88200821,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e82dce9a9e9429ae12a960ff31c8df6498d8893&amp;dn=Saturn+and+melancholy+-+studies+in+the+history+of+natural+philos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1415481809,"description":"Pdf / English / 1979 / 530 pages / 84 MB\n\nThe long history of this book, where some of the results of half a century of research has made it a classic compulsory for anyone to address the issues covered in it, or is interested in methodological assumption underlying it. This is in fact the typical text the method of work of the Warburg Institute: the same topic chosen, the saturnine and melancholy temperament was particularly suited to Warburg, who dedicated crucial pages. Founded as inter-interpretation of the incision dureriana Melencolia, the work was expanded to include a survey of the whole tradition of philosophical, medical, astrological, literary or artistic masterpiece that requires Durer. The apparent specificity of the investigation conceals an intention therefore universal. It is clear, in fact, that what the authors are interested in is the formation of the modern conception of human genius, who - from the Pseudo-Aristotle in Ficino - has traditionally been considered a melancholy. The network of historical research and iconology captures a huge number of facts","torrent":{"xt":"urn:btih:2e82dce9a9e9429ae12a960ff31c8df6498d8893","amp;dn":"Saturn+and+melancholy+-+studies+in+the+history+of+natural+philos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e82dce9a9e9429ae12a960ff31c8df6498d8893","infoHashBuffer":{"type":"Buffer","data":[46,130,220,233,169,233,66,154,225,42,150,15,243,28,141,246,73,141,136,147]},"announce":[],"urlList":[]}}