{"title":"The New Mutants v1 01-63 + Ex (1983-1988|Minutemen-Syl3ntBob+)","uid":9853966,"size":2684917226,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2f38beddb98bef46415f25f950ada8ba2b136a66&amp;dn=The+New+Mutants+v1+01-63+%2B+Ex+%281983-1988%7CMinutemen-Syl3ntBob%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1396197504,"description":"For more information on this series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/New_Mutants&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/New_Mutants&lt;/a&gt;\n\nArising out of his remarkable X-Men run, writer Chris Claremont and artist Bob McLeod combined to create a new, multi-national and diverse band of young mutants in need of Charles Xavier's help and guidance. Many of these characters grew into valued and powerful team members on various X-Teams, and throughout the 80's they had plenty of interesting and crazy adventures on their own and with the X-Men (and soon X-Factor) as well. Promotional info from the collected edition - &quot;Cannonball. Sunspot. Moonstar. Karma. Rahne. Teenagers, thrown together by the one thing they had in common -- the X-Factor in their genes that made them different, made them mutants. Relive the adventures of the team that will come to be known as X-Force... if they survive.&quot;\n\nThis torrent collects all the new HQ scans done by Minutemen-Syl3ntBob as of April 1, 2014. Whenever possible, I have opted for the hybrid/noads versions instead of the c2c versions (my preference is without ads). The first issue of the run is the digital copy by Cypher-Empire. I have also included the first 3 Annuals (the first one being digital, by Minutemen-Syl3ntPhD) and the Marvel Graphic Novel - New Mutants, which launches the series and introduces all the new members of the group one by one. That should be read first, and the copy is the excellent 2048px HD version also by MM-SB. Thanks to all the scanner groups for their hard work; please seed and enjoy! :-)","torrent":{"xt":"urn:btih:2f38beddb98bef46415f25f950ada8ba2b136a66","amp;dn":"The+New+Mutants+v1+01-63+%2B+Ex+%281983-1988%7CMinutemen-Syl3ntBob%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f38beddb98bef46415f25f950ada8ba2b136a66","infoHashBuffer":{"type":"Buffer","data":[47,56,190,221,185,139,239,70,65,95,37,249,80,173,168,186,43,19,106,102]},"announce":[],"urlList":[]}}