{"title":"SM Stirling - Emberverse","uid":8844343,"size":5760963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f5ee284f4fb0edc231f3071f54bef6e645df05d&amp;dn=SM+Stirling+-+Emberverse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Agricola","files":-1,"time":1377336734,"description":"Emberverse\n\nAuthor - S.M. Stirling\n\nFormat - epub\n\nRequested\n\n\nEmberverse, or Change World, is a series of post-apocalyptic alternate history novels written by S. M. Stirling. The novels depict the events following The Change, which caused electricity, guns, explosives, internal combustion engines, and steam power to stop working, closely paralleling the initial impetus of Steve Boyetts 1983 novel Ariel and the BBC series The Changes. Most of the action in the series takes place in the Willamette Valley of Oregon in the United States.\nThe series primarily focuses on how the characters survive the loss of 600 years of technological progress. The original trilogy, Dies the Fire, concerns the conflicts between a Portland-based neo-feudal dictatorship and the free communities of the Willamette Valley, primarily the Wiccan Clan Mackenzie and the Bearkillers. The later series, The Change, now scheduled to be completed in 2013 after seven novels, focuses on the now-adult children of the original trilogys major characters.\n\n01 Dies the Fire - S. M. Stirling\n02 The Protector's War - S. M. Stirling\n03 A Meeting at Corvallis - S. M. Stirling\n04 The Sunrise Lands - S. M. Stirling\n05 The Scourge of God - S. M. Stirling\n06 The Sword of the Lady - S. M. Stirling\n07 The High King of Montival - S. M. Stirling\n08 The Tears of the Sun - S. M. Stirling\n09 The Lord of Mountains - S. M. Stirling","torrent":{"xt":"urn:btih:2f5ee284f4fb0edc231f3071f54bef6e645df05d","amp;dn":"SM+Stirling+-+Emberverse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f5ee284f4fb0edc231f3071f54bef6e645df05d","infoHashBuffer":{"type":"Buffer","data":[47,94,226,132,244,251,14,220,35,31,48,113,245,75,239,110,100,93,240,93]},"announce":[],"urlList":[]}}