{"title":"Kavanagh QC Full Season 1 John Thaw (of Inspector Morse fame)","uid":7028776,"size":3823690999,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f9732aa94b9745cdc9bb2072ce83afecdd476c9&amp;dn=Kavanagh+QC+Full+Season+1+John+Thaw+%28of+Inspector+Morse+fame%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"moviesbyrizzo","files":-1,"time":1329159058,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0108826&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0108826&lt;/a&gt;\n\nAll posted episodes thus far are a consistent 1hr 15minutes (approx)\nthe first episode however is 1hr 140minutes and this accounts for the different\nfile size - the bitrates are a consistent number however \n720 X 480 video, fully 1350k bitrate 192k audio\nConverted from DVD using DivX author 1.5\n\nWe got excellent quality on Seasons 4 and 5 on all episodes - they came from a DVD \nset from a better quality provider &quot;Carlton International&quot; under licence from\nGranada Television Volume 3 was almost as nice except one episode (blood money)\nwas only passable quality - as it came from an old DVD in only fair condition\n\nAs for volume One, this comes from yet another set of discs - this time from a \nCanadian outfit and they fail to impress by comparison to the others we found\nI'm hate to have to say.\n\nIn any event don't miss out on the volumes we previously posted for you - and \ndo help seed if you are able.\n\nKavanagh QC stars the great Mr. John Thaw of Inspector Morse fame equally\nHe s a man of real Irish spirit - French natured even - with the best Germanic\nintellect to boot. Probably most a home in Australia I would venture to add\n\n\nThis is a look at the workings of the British legal system of justice\nin criminal cases - even with an opportunity to see black judges at work\namidst such high standards as these (seasons four and five). And black staff\nand prisoners too in various episodes cross the seasons\n\nThis is an important series for those that want a better examination of\nhow the Irish spirited folk (John Thaw in this series equally) are doing\nwith their experiment of racial integration and multiculturalism that is \ninevitable from the effort such as it is.\n\nI personally find it difficult viewing at times and cannot think other than\nthat John Thaw must have quite a knack for &quot;holding his nose&quot; at the farce\nthat unfolds in what are seeming inane interactions at times that cross \ncultural boundaries of understanding as the minds involved are undoubtedly\ndifferently formed on the matters at a level that goes beyond simple\nadjustment\n\nThen I have to wonder if the man has been better off for his experiment\n- more attuned to something we are missing - more happy with his family\nconnections around him in celebration of the Irish spirit equally. Does\nhe feel more of a Christian, despite its effect on others. Perhaps he is\nonly just asleep at the wheel. Then again perhaps his seeming complacent\ncomes from having yet to awake since he started on this course to see what\nothers cannot fail to see - he is involved in a destructive course of action\nthat could yet be devastating for Europe if he is allowed to lead on these\nissues I daresay. He needs to regain perspective he left behind on the\ncontinent perhaps.\n\nSir John Thaw sadly passed away from cancer at a relatively young age\nMany thousands sent letters and cards to him during his final days in hospital\n\nHe is missed by his fans, may he rest in peace\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\nComplete Season 1\n\nNothing But the Truth \nHeartland \nA Family Affair \nThe Sweetest Thing \n\n\n","torrent":{"xt":"urn:btih:2f9732aa94b9745cdc9bb2072ce83afecdd476c9","amp;dn":"Kavanagh+QC+Full+Season+1+John+Thaw+%28of+Inspector+Morse+fame%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f9732aa94b9745cdc9bb2072ce83afecdd476c9","infoHashBuffer":{"type":"Buffer","data":[47,151,50,170,148,185,116,92,220,155,178,7,44,232,58,254,205,212,118,201]},"announce":[],"urlList":[]}}