{"title":"Dog Dogs - Ellioth Erwitt (Photography Art Ebook).pdf","uid":10134206,"size":78512919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3098582887ee46fef8ee575ace926cec62207f04&amp;dn=Dog+Dogs+-+Ellioth+Erwitt+%28Photography+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1399933081,"description":"512 pag / pdf / English / 75 MB / 1998\n\nNearly every one of the 500 black-and-white pictures in this book is a miraculous blend of composition and content, placing photographer Elliott Erwitt right up there with the other postwar, 20th-century masters of moment and meaning. Erwitt writes in his introduction, &quot;This is not a book of dog pictures but of dogs in pictures.&quot; It is the photograph that counts, above and beyond its subject, for the photographer of genius. But Erwitt is bound to be called a sentimentalist because he photographs dogs, whom we, in our species-centric way, tend to think of as, well, animals. If Erwitt proves anything, however, it is that our close relationship with these furry fellow travelers is due to mutual resemblance. There is a Native American myth that when the world was created, a great fissure began to split the earth. Humans were caught on one side of the chasm, animals on the other. The dog, however, seeing the gap widen, leaped across to the human side, where he has been ever since. This book captures the pleasures of our loyal, dependent friends, as well as their sorrows and disappointment when they are forced to adapt to human callousness, neglect, or even love. Erwitt sees the dignity of the ankle-high Chihuahua; the anxiety of the homeless hound; the smugness of the adored dachshund, sitting on its chaise longue in the noonday sun; the patience of the pom-pommed poodle; and the gormless joy of a homely but well-loved pug. In his vast range of emotion, and in his easygoing but precise mastery of the abstract elements of composition, Elliott Erwitt has made himself the Cartier-Bresson of the canine world. --Peggy Moorman","torrent":{"xt":"urn:btih:3098582887ee46fef8ee575ace926cec62207f04","amp;dn":"Dog+Dogs+-+Ellioth+Erwitt+%28Photography+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3098582887ee46fef8ee575ace926cec62207f04","infoHashBuffer":{"type":"Buffer","data":[48,152,88,40,135,238,70,254,248,238,87,90,206,146,108,236,98,32,127,4]},"announce":[],"urlList":[]}}