{"title":"Sim Golf","uid":3429350,"size":226903217,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:312ace980c333005ecff92717ee9ecabd532f00f&amp;dn=Sim+Golf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rezovor","files":3,"time":1136748666,"description":"I know this has been uploaded before, but I wanted to seed this to those of you who are sick of waiting for the other's to get seeders.\n\n====================================\nSid Meier's SimGolf puts you in charge of your very own golf resort. You'll get to play the roles of course designer, CEO, and resident pro as your try and grow your business from a small, public pitch-and-putt to a five-star resort complete with private memberships, airstrips, and luxury hotels. To do this, you'll need to design courses that are fun and challenging and manage your resort's resources to satisfy your guests' growing needs. You'll even have a chance to test your course and golf skills when your Sims challenge you to a round.\n\nYou can create the world's most challenging and outrageous golf courses in a variety of different environments, including woodlands, desert, tropical, and Scottish links. Then you can build an entire golf resort from the ground up around your course. Hold tournaments, sell memberships, and entice the rich and famous to build homes at your resort. But make sure you manage wisely. Modify your course and resort so you can respond to the needs and interests of your Sims guests.\n\nThe skills test against your Sims is the penultimate challenge. Players can bring their existing Sims characters into the game with a user-friendly import tool or create their own Sim golfer from scratch. Customize and play your resident pro against other pros for a big cash purse you can use to upgrade your resort.\n============================\n\nINCLUDED:\n\nSelf Installing Zip (or click on setup.exe inside the zip)\nSerial Number\nNo CD Crack","torrent":{"xt":"urn:btih:312ace980c333005ecff92717ee9ecabd532f00f","amp;dn":"Sim+Golf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"312ace980c333005ecff92717ee9ecabd532f00f","infoHashBuffer":{"type":"Buffer","data":[49,42,206,152,12,51,48,5,236,255,146,113,126,233,236,171,213,50,240,15]},"announce":[],"urlList":[]}}