{"title":"The Office US S09E16 HDTV x264-LOL mp4","uid":8145436,"size":326134131,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:315a5d4bb693709ba7a6041ebdd77be1987141f3&amp;dn=The+Office+US+S09E16+HDTV+x264-LOL+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":1,"time":1360906699,"description":"The Office US S09E16 HDTV x264-LOL mp4\n\nGenre: Comedy, Drama\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: Ken Kwapis\nCast: Rainn Wilson, John Krasinski, Jenna Fischer, B.J. Novak, Leslie David Baker, Brian Baumgartner, Angela Kinsey, Phyllis Smith\n\n.: Plot :.\nA mockumentary about the modern workplace, The Office explores the everyday lives of the people who run the Scranton branch of the Dunder Mifflin paper supply company. As they struggle to compete with big chain stores and modern technology, the Dunder Mifflin staff is in denial about everything - from the possibility of downsizing to their own insignificance. Still, the Scranton branch has enough heart and small-town charm to stay in business, at least for today.\n\nProudly leading the team is Regional Manager Michael Scott: the pompous, awkward, clueless boss who has an inappropriate comment for every situation. He may be deluded into thinking he's the coolest dude in the office, but his enthusiasm is undeniable. His receptionist, Pam Beesly, is the repressed but friendly gal who spends her time either covering for Michael's ineptitude, or joking around with Jim Halpert, the quick-witted sales rep. The target of their humor is usually Dwight Schrute, the goofy and gullible sales rep who also serves as Michael's right-hand man. Working alongside them is Ryan Howard, the brilliant but immoral young business graduate who tries to bring Dunder Mifflin into the 21st century, despite Michael's attempts to do things the old-fashioned way.\n\nThe rest of the office staff is equally colorful and full of personality, and their every word and thought is captured on film by a documentary crew. Through everyday events and a series of short interviews, the brutal truth of the American workplace is revealed.\n","torrent":{"xt":"urn:btih:315a5d4bb693709ba7a6041ebdd77be1987141f3","amp;dn":"The+Office+US+S09E16+HDTV+x264-LOL+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"315a5d4bb693709ba7a6041ebdd77be1987141f3","infoHashBuffer":{"type":"Buffer","data":[49,90,93,75,182,147,112,155,167,166,4,30,189,215,123,225,152,113,65,243]},"announce":[],"urlList":[]}}