{"title":"Peter Hook, The Hacienda: How Not to Run a Club [Epub]","uid":12206388,"size":986213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3161f2c2269b96201fd5bc75a57404ab5ba940c2&amp;dn=Peter+Hook%2C+The+Hacienda%3A+How+Not+to+Run+a+Club+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1438970485,"description":"Peter Hook, as co-founder of Joy Division and New Order, has been shaping the course of popular music for thirty years. He provided the propulsive bass guitar melodies of 'Love Will Tear Us Apart' and the bestselling 12-inch single ever, 'Blue Monday' among many other songs. As co-owner of Manchester's Hacienda club, Hook propelled the rise of acid house in the late 1980s, then suffered through its violent fall in the 1990s as gangs, drugs, greed and a hostile police force destroyed everything he and his friends had created. This is his memory of that era and 'it's far sadder, funnier, scarier and stranger' than anyone has imagined. As young and naive musicians, the members of New Order were thrilled when their record label Factory opened a club. Yet as their career escalated, they toured the world and had top ten hits, their royalties were being ploughed into the Hacienda and they were only being paid GBP20 per week. Peter Hook looked back at that exciting and hilarious time to write HACIENDA. All the main characters appear - Tony Wilson, Barney, Shaun Ryder - and Hook tells it like it was - a rollercoaster of success, money, confusion and true faith","torrent":{"xt":"urn:btih:3161f2c2269b96201fd5bc75a57404ab5ba940c2","amp;dn":"Peter+Hook%2C+The+Hacienda%3A+How+Not+to+Run+a+Club+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3161f2c2269b96201fd5bc75a57404ab5ba940c2","infoHashBuffer":{"type":"Buffer","data":[49,97,242,194,38,155,150,32,31,213,188,117,165,116,4,171,91,169,64,194]},"announce":[],"urlList":[]}}