{"title":"Hilary Mantel - Wolf Hall","uid":8917204,"size":990532512,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3211a574be08096c65204e5ac8374658a29cd5e6&amp;dn=Hilary+Mantel+-+Wolf+Hall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"possi","files":-1,"time":1379170435,"description":"WINNER OF THE 2009 MAN BOOKER PRIZE\nWINNER OF THE NATIONAL BOOK CRITICS CIRCLE AWARD FOR FICTION\nA NEW YORK TIMES BESTSELLER\n\nEngland in the 1520s is a heartbeat from disaster. If the king dies without a male heir, the country could be destroyed by civil war. Henry VIII wants to annul his marriage of twenty years and marry Anne Boleyn. The pope and most of Europe opposes him. Into this impasse steps Thomas Cromwell: a wholly original man, a charmer and a bully, both idealist and opportunist, astute in reading people, and implacable in his ambition. But Henry is volatile: one day tender, one day murderous. Cromwell helps him break the opposition, but what will be the price of his triumph?\n\nNo character in the canon has been writ larger than Henry VIII, but that didn't stop Hilary Mantel. She strides through centuries, past acres of novels, histories, biographies, and plays--even past Henry himself--confident in the knowledge that to recast history's most mercurial sovereign, it's not the King she needs to see, but one of the King's most mysterious agents. Enter Thomas Cromwell, a self-made man and remarkable polymath who ascends to the King's right hand. Rigorously pragmatic and forward-thinking, Cromwell has little interest in what motivates his Majesty, and although he makes way for Henry's marriage to the infamous Anne Boleyn, it's the future of a free England that he honors above all else and hopes to secure. Mantel plots with a sleight of hand, making full use of her masterful grasp on the facts without weighing down her prose. The opening cast of characters and family trees may give initial pause to some readers, but persevere: the witty, whip-smart lines volleying the action forward may convince you a short stay in the Tower of London might not be so bad... provided you could bring a copy of Wolf Hall along.","torrent":{"xt":"urn:btih:3211a574be08096c65204e5ac8374658a29cd5e6","amp;dn":"Hilary+Mantel+-+Wolf+Hall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3211a574be08096c65204e5ac8374658a29cd5e6","infoHashBuffer":{"type":"Buffer","data":[50,17,165,116,190,8,9,108,101,32,78,90,200,55,70,88,162,156,213,230]},"announce":[],"urlList":[]}}