{"title":"k19 Web com HTML CSS Java Script","uid":15544773,"size":3345163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32903fc2dbdf097c0df0087aaf6c7e974a6a9ea8&amp;dn=k19+Web+com+HTML+CSS+Java+Script&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1470958893,"description":"Durante muito tempo a idéia de desenvolvimento web ficou associada apenas à construção de\r\npáginas cuja função era simplesmente levar ao usuário um determinado conteúdo. Porém, com a\r\npopularização da internet, novas necessidades foram surgindo em diversas áreas como a do entretenimento,\r\nassim como a dos negócios. Cada vez mais jogos online foram aparecendo, redes sociais\r\nganharam forças graças à grande interatividade permitida entre os usuários, gravadoras de música\r\npassaram a vender seus títulos através de canais especializados e ferramentas de produtividade começaram\r\na rodar na tal da &quot;nuvem&quot;. Enfim, necessidades antes inexistentes surgiram numa velocidade\r\nmuito grande e muitos sites deixaram de ser simples páginas para se tornarem verdadeiras\r\naplicações.\r\nHá cerca de 15 anos era muito comum que umúnico desenvolvedor fosse o responsável por produzir\r\no cógido HTML, CSS, Javascript, PHP, SQL e de qualquer outra tecnologia que fosse necessário.\r\nEssa pessoa era chamada de webmaster. Com a evolução dos sites a figura do webmaster como era\r\nconhecida foi desaparecendo, pois a complexidade e volume de trabalho para o desenvolvimento\r\nde uma aplicação web foi ficando muito grande para apenas uma pessoa, ou para um grupo muito\r\npequeno de desenvolvedores (webmasters). Hoje a figura do webmaster ainda existe, mas seu papel\r\nmudou umpouco, pois esse profissional atuamais como umgerente que possui bomconhecimento\r\ndas diversas tecnologias empregadas nos desenvolvimento de uma aplicação web. Ele pode ou não\r\nparticipar diretamente do desenvolvimento, ou seja, pode ou não &quot;botar a mão na massa&quot;.\r\nJá que as tarefas antes de responsabilidade do webmaster foram delegadas a outros desenvolvedores,\r\nnaturalmente foram aparecendo algumas especializações que podemos separar basicamente\r\nem dois grupos: desenvolvedores front-end e back-end. Em geral os desenvolvedores front-end são\r\nresponsáveis pela interface com a qual o usuário irá interagir enquanto que os desenvolvedores backend\r\nsão responsáveis pela implantação das regras de negócio na aplicação","torrent":{"xt":"urn:btih:32903fc2dbdf097c0df0087aaf6c7e974a6a9ea8","amp;dn":"k19+Web+com+HTML+CSS+Java+Script","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32903fc2dbdf097c0df0087aaf6c7e974a6a9ea8","infoHashBuffer":{"type":"Buffer","data":[50,144,63,194,219,223,9,124,13,240,8,122,175,108,126,151,74,106,158,168]},"announce":[],"urlList":[]}}