{"title":"Total DC Comics for 4/9/2014 (darkhomr) [ALL]","uid":9943325,"size":671359682,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:32a2a14082715205cfcecabd337a984d6a249017&amp;dn=Total+DC+Comics+for+4%2F9%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dadrkhomr","files":18,"time":1397281585,"description":"This is the 6th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 8 DC Universe comics 5 non-Universe titles and 5 digital titles.  \n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\n\n\nAdventures of Superman #50 (CBR 4/9/2014)\n\nWhen Lois Lane gets Superman a mystery gift for Valentine's Day, Superman speculates with his friends about what it could be--and what he should get her in return! \n\nAstro City #11 (CBR 4/9/2014) \n\nWhen you're the Silver Adept, one of Astro City's newest and most powerful mystic heroes, your life is full of magic, battle, demons, apocalypses and more. When you're the Adept's personal assistant, though, life gets really weird. A look at the woman behind the hero. Plus: sushi. \n \nBatgirl #30 (CBR 4/9/2014) \n\nIn this issue, after a sinister game gone wrong, Batgirl confronts a supernatural legend risen from the primordial depths: The Midnight Man! \n\nBatman Eternal #1 (CBR 4/9/2014)\n\nDon't dare miss the start of the Bat-story so big it's going to take every week of the month to tell! A massive cast of Gotham City's best (and worst) examines the relationship between Batman, his allies and his city. In this debut issue, Commissioner James Gordon is caught on the wrong side of the law! \n\nCoffin Hill #7 (CBR 4/9/2014)\n\nTravel back to the 1950s to witness another fateful night in the Coffin Hill Woods - a night that young Ellie Coffin might not survive! Lost, alone and haunted by the spirits that dwell in the forest, Ellie must find her way home before sunrise or stay trapped with the ghosts of Coffin Hill. Guest artists Stephen Sadowski (FAIREST) and Mark Farmer (FABLES: WEREWOLVES OF THE HEARTLAND) join writer Caitlin Kittredge for this stand-alone story! \n\nConstantine #13 (CBR 4/9/2014)\n\nLost and confused in the face of the fallout from his actions in 'Forever Evil: Blight,' John Constantine has sold himself out to the Cold Flame and is vulnerable to attack by Spellbinder! \n\nFBP Federal Bureau Of Physics #9 (CBR 4/9/2014)\n\nAfter a beautiful moment is shattered, Rosa and Adam get to see firsthand why Nakeet is known as the strangest town north of the 48. \n\nGreen Lantern Corps #30 (CBR 4/9/2014)\n\nJohn Stewart and his team are under siege--and things are about to get way worse! It's become impossible to know who can be trusted and who's a shape-shifting Durlan spy! And you won't believe the twisted origin of the Durlan species! \n\nInjustice: Year Two #7 (CBR 4/9/2014)\n\nImprisoned by the Justice League, Sinestro tells the story of how he once ruled Korugar and notes the parallels to Superman's current situation. \n\nJustice League 3000 #5 (CBR 4/9/2014)\n\nCadmus tries to add a new member to Justice League 3000. We say 'tried to' because the last thing Firestorm wants to do is join what he considers to be a group of losers. It gets complicated. \n\nJustice League Beyond 2.0 #17 (CBR 4/9/2014)\n\nWonder Woman is back! But is she really who she seems? Don't miss the Justice League's search for answers in &quot;Justice Lords Beyond.&quot; \n\nRoyals Masters Of War #3 (of 6) (CBR 4/9/2014)\n\n1942. The Battle of Midway rages and The Royals are in its midst, fighting for control of the Pacific. Henry and Arthur find themselves cast as heroes alongside the newsreel-manufactured American super team 'The Allies.' But how long can they stomach the killing and how long can Arthur stomach the commoners? Meanwhile, members of the Japanese Royal Family create water giants to smash American destroyers in two, and whispers swirl that The Emperor Jimmu is with his fleet - a power none can defeat. \n\nScooby Doo Where Are You #44 (CBR 4/9/2014)\n\nThe gang is trying to take a nice, peaceful vacation at an island resort, but the Jabberwocky infestation at the nature preserve next door isn't making that easy! Shaggy and Scooby could be scared off by red-eyed monsters with lion-like paws, unless Velma's keen eye for clues puts an end to the mysterious beasts! \n\nSmallville: Lantern #5 (CBR 4/9/2014)\n\nClark and John face an epic foe from Oa's past, while the DEO tries to interest Oliver Queen in some tech stolen from one of their warehouses.\n\nSuperboy #30 (CBR 4/9/2014)\n\nA FOREVER EVIL aftermath issue! Superboy is returning to the world post-FOREVER EVIL, but it may not be strong enough to survive this twisted Teen of Steel and his allies from the future. His plan is simple: Wipe out all Super Heroes! \n\nSuperman Wonder Woman #7 (CBR 4/9/2014)\n\nDoomsday has awakened and the Earth and heavens tremble! And discover how Superman and Wonder Woman survived a nuclear blast! \n\nWorlds Finest #22 (CBR 4/9/2014)\n\nFollowing their team-up with Batman and Superman, Power Girl and Huntress have some difficult choices ahead. What's next for the Worlds' Finest . . . and what world will they choose? \nre getting themselves into! ","torrent":{"xt":"urn:btih:32a2a14082715205cfcecabd337a984d6a249017","amp;dn":"Total+DC+Comics+for+4%2F9%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32a2a14082715205cfcecabd337a984d6a249017","infoHashBuffer":{"type":"Buffer","data":[50,162,161,64,130,113,82,5,207,206,202,189,51,122,152,77,106,36,144,23]},"announce":[],"urlList":[]}}