{"title":"The New World Order Facts &amp; Fiction - Mark Dice","uid":11711969,"size":777090,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3369fc24fe1bd17dc094ae6ad6c1dbe76861827f&amp;dn=The+New+World+Order+Facts+%26amp%3B+Fiction+-+Mark+Dice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":2,"time":1424375203,"description":"\n\nWhat is the New World Order? Proponents say that it's an anticipated new era of global cooperation between diverse nations and cultures aimed at ushering in a utopia providing all the earth's citizens with everything they need.\n\nDetractors claim it's the systematic take-over by secret societies, quasi-government entities and corporations who are covertly organizing a global socialist all-powerful government which aims to regulate every aspect of citizens lives, rendering them a perpetual working-class while the elite leadership lives in luxury.\n\nConspiracy theory expert Mark Dice looks at the evidence, claims, and conspiracy theories as he takes you down the rabbit hole to The New World Order. \n\n\nAbout the author:\nMark Dice is a media analyst, social critic, political activist, and author who, in an entertaining and educational way, gets people to question our celebrity obsessed culture, and the role the mainstream media plays in shaping our lives. Mark frequently stirs up controversy from his commentaries, protests, and boycotts, and has repeatedly been featured in major media outlets around the world. Several of Mark's YouTube videos have went viral, earning him a mention on ABC's The View, Fox News' O'Reilly Factor, TMZ.com, and other mainstream media outlets. Mark has also been featured in (or attacked in) the New York Post's Page Six, Rolling Stone Magazine, USA Today, The New York Daily News, and in major papers in Pakistan and Iran.\n\nMark Dice appears in several documentary films including Invisible Empire, and The 9/11 Chronicles, and was featured on the History Channel's Decoded. He enjoys enlightening zombies, as he calls them, (ignorant people) about the mass media's effect on our culture, pointing out Big Brother's prying eyes, and exposing elite secret societies along with scumbag politicians and their corrupt political agendas.\n\nHe also habitually calls into several top-rated talk shows, including the Sean Hannity Show, Glenn Beck, and Michael Savage, and verbally battles with the hosts on various issues since he has never been asked to be a guest on them as of yet. Audio of some of these calls are then posted online. The term &quot;fighting the New World Order&quot; is used by Mark to describe some of his activities, and refers to his and others' resistance and opposition (The Resistance) to the overall system of political corruption, illegal wars, elite secret societies, mainstream media, Big Brother and privacy issues; as well as various economic and social issues.\n\nDice and his supporters sometimes refer to being &quot;awake&quot; or &quot;enlightened&quot; and see their knowledge of these topics as part of their own personal Resistance to the corrupt New World Order. This Resistance involves self-improvement, self-sufficiency, personal responsibility and spiritual growth. Mark Dice is the author of several books on current events, secret societies and conspiracies. He lives in San Diego, California","torrent":{"xt":"urn:btih:3369fc24fe1bd17dc094ae6ad6c1dbe76861827f","amp;dn":"The+New+World+Order+Facts+%26amp%3B+Fiction+-+Mark+Dice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3369fc24fe1bd17dc094ae6ad6c1dbe76861827f","infoHashBuffer":{"type":"Buffer","data":[51,105,252,36,254,27,209,125,192,148,174,106,214,193,219,231,104,97,130,127]},"announce":[],"urlList":[]}}