{"title":"The Franco-Prussian War: The German Conquest of France in 1870-1","uid":8584506,"size":8572959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3378a0ecf49f680a1ad0be79ff4940294fa18f7f&amp;dn=The+Franco-Prussian+War%3A+The+German+Conquest+of+France+in+1870-1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":1,"time":1371499006,"description":"The Franco-Prussian War of 1870-71 violently changed the course of European History. Alarmed by Bismarck's territorial ambitions and the Prussian army's crushing defeats of Denmark in 1864 and Austria in 1866, French Emperor Napoleon III vowed to bring Prussia to heel. Digging into many European and American archives for the first time, Geoffrey Wawro's Franco-Prussian War describes the war that followed in thrilling detail. While the armies mobilized in July 1870, the conflict appeared &quot;too close to call.&quot; Prussia and its German allies had twice as many troops as the French. But Marshal Achille Bazaine's grognards (&quot;old grumblers&quot;) were the stuff of legend, the most resourceful, battle-hardened, sharp-shooting troops in Europe, and they carried the best rifle in the world. From the political intrigues that began and ended the war to the bloody battles at Gravelotte and Sedan and the last murderous fights on the Loire and in Paris, this is the definitive history of the Franco-Prussian War. Dr. Geoffrey Wawro is Professor of Strategic Studies at the U.S. Naval War College in Newport, Rhode Island. Wawro has published two books: The Austro-Prussian War (Cambridge, 1996) and Warfare and Society in Europe, 1792-1914 (Routledge, 2000). He has published articles in The Journal of Military History, War in History, The International History Review, The Naval War College Review, American Scholar, and the European History Quarterly, and op-eds in the Los Angeles Times, New York Post, Miami Herald, Hartford Courant, and Providence Journal. Wawro has won several academic prizes including the Austrian Cultural Institute Prize and the Society for Military History Moncado Prize for Excellence in the Writing of Military History. He has lectured widely on military innovation and international security in Europe, the U.S., and Canada and is host of the History Channel program Hardcover History--a weekly book show with leading historians, pundits, critics, statesmen and journalists.\n &lt;a href=&quot;\nhttp://www.amazon.com/The-Franco-Prussian-War-Conquest-1870-1871/dp/052161743X/ref=sr_1_1?ie=UTF8&amp;qid=1371491598&amp;sr=8-1&amp;keywords=the+franco-prussian+war&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Franco-Prussian-War-Conquest-1870-1871/dp/052161743X/ref=sr_1_1?ie=UTF8&amp;qid=1371491598&amp;sr=8-1&amp;keywords=the+franco-prussian+war&lt;/a&gt;","torrent":{"xt":"urn:btih:3378a0ecf49f680a1ad0be79ff4940294fa18f7f","amp;dn":"The+Franco-Prussian+War%3A+The+German+Conquest+of+France+in+1870-1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3378a0ecf49f680a1ad0be79ff4940294fa18f7f","infoHashBuffer":{"type":"Buffer","data":[51,120,160,236,244,159,104,10,26,208,190,121,255,73,64,41,79,161,143,127]},"announce":[],"urlList":[]}}