{"title":"Folkways Anthology of American Folk Music (1997){FLAC]","uid":4697549,"size":1073446947,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33850987350c11489700ca70192646988ab3f07c&amp;dn=Folkways+Anthology+of+American+Folk+Music+%281997%29%7BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"storoa","files":103,"time":1233606233,"description":"Review\tby John Bush\n\nOriginally released in 1952 as a quasi-legal set of three double LPs and reissued several times since (with varying cover art), Anthology of American Folk Music could well be the most influential document of the '50s folk revival. Many of the recordings that appeared on it had languished in obscurity for 20 years, and it proved a revelation to a new group of folkies, from Pete Seeger to John Fahey to Bob Dylan. The man that made the Anthology possible was Harry Smith, a notoriously eccentric musicologist who compiled 84 of his favorite hillbilly, gospel, blues, and Cajun performances from the late '20s and early '30s, dividing each into one of three categories: Ballads, Social Music, and Songs. Smith sequenced the three volumes with a great amount of care, placing songs on the Ballads volume in historical order (not to be confused with chronological order) so as to create an LP that traces the folk tradition, beginning with some of the earliest Childe ballads of the British Isles and ending with several story songs of the early 20th century. The cast of artists includes pioneers in several fields, from the Carter Family and Uncle Dave Macon to Blind Lemon Jefferson, Mississippi John Hurt, and the Alabama Sacred Harp Singers. Many of the most interesting selections on the Anthology, however, are taken from artists even more obscure, such as Clarence Ashley, Bascom Lamar Lunsford, and Buell Kazee. After the Anthology had been out of print for more than a decade, Smithsonian/Folkways reissued the set in a six-disc boxed set, with the original notes of Harry Smith, as well as a separate book of new reminiscences by artists influenced by the original and a wealth of material for use in CD-ROM drives. \n\n6 disc set plus data from Vol. 3 disc 2 enhanced CD.","torrent":{"xt":"urn:btih:33850987350c11489700ca70192646988ab3f07c","amp;dn":"Folkways+Anthology+of+American+Folk+Music+%281997%29%7BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33850987350c11489700ca70192646988ab3f07c","infoHashBuffer":{"type":"Buffer","data":[51,133,9,135,53,12,17,72,151,0,202,112,25,38,70,152,138,179,240,124]},"announce":[],"urlList":[]}}