{"title":"The Mystery Man Collection  - Colin Bateman","uid":11023571,"size":826506463,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:33b5c93c3427c397acee0a96a0e0aa80821bbf49&amp;dn=The+Mystery+Man+Collection++-+Colin+Bateman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"davieboy1966","files":36,"time":1410634320,"description":"Audio Books : Mystery and Suspense : Other quality : English\nAll are from CDs and unabridged.\nRecorded at 48 kbps / 44 kHz Mono, Fhg CBR MP3 by peterg23\nAll are narrated by Stephen Armstrong.\n\n\n\n\nA unique and blackly funny mystery series from the Irish master of menace and mirth.\n\n#1. Mystery Man [2009], 9 hours 39 mins\nHe's the Man With No Name and the owner of No Alibis, a mystery bookshop in Belfast. But when a detective agency next door goes bust, the agency's clients start calling into his shop asking him to solve their cases. It's not as if there's any danger involved. It's an easy way to sell books to his gullible customers and Alison, the beautiful girl in the jewellery shop across the road, will surely be impressed. Except she's not - because she can see the bigger picture. And when they break into the shuttered shop next door on a dare, they have their answer. Suddenly they're catapulted along a murder trail which leads them from small-time publishing to modern dance to Nazi concentration camps and serial killers....\n\n#2. The Day of the Jack Russell [2009], 8 hours 27 mins\nBlack Books meets Lead Balloon meets Gavin and Stacey in this hugely entertaining follow-up to MYSTERY MAN, from acclaimed author Colin Bateman.\nThe Small Shop Keeper With No Name is back. Hired to find the vandals responsible for spraying graffiti on an aspiring insurance magnate's advertising hoarding, he soon finds himself up to his ears in intrigue and battling to solve murders which echo in the corridors of power. With MI5 getting involved and everyone on the hunt for a missing Jack Russell, can Our Man Behind the Counter stay alive as well as keep his world renowned but criminally ignored No Alibis mystery bookshop afloat?\n\n#3. Dr. Yes [2010], 9 hours 2 mins\nYou don't say no to Dr. Yes, the charismatic plastic surgeon on the fast track to fame and fortune. But when the wife of obscure and paranoid crime writer Augustine Wogan disappears shortly after entering his exclusive Belfast clinic, the Small Bookseller with No Name is persuaded to investigate. As fatherhood approaches, our intrepid hero is interested only in a quick buck and the chance to exploit a neglected writer, but he soon finds himself up to his neck in murder, make-up and madness - and face to face with the most gruesome serial killer since the last one....\n\n#4. The Prisoner of Brenda [2012], 11 hours 6 mins\nWhen notorious gangster 'Fat Sam' Mahood is murdered, the chief suspect is arrested nearby. But he seems to have suffered a breakdown. Incarcerated in a mental institution, he's known only as the Man in the White Suit. The suspect remains an enigma until Nurse Brenda calls on Mystery Man, Belfast's finest mystery bookshop owner, to bring his powers of investigation to bear. Intrigue, conspiracy, and ancient Latin curses all combine to give the Small Bookseller with No Name his most difficult case to date...\n\nOne of my very favorite mystery series. The narrator is excellent.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:33b5c93c3427c397acee0a96a0e0aa80821bbf49","amp;dn":"The+Mystery+Man+Collection++-+Colin+Bateman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33b5c93c3427c397acee0a96a0e0aa80821bbf49","infoHashBuffer":{"type":"Buffer","data":[51,181,201,60,52,39,195,151,172,238,10,150,160,224,170,128,130,27,191,73]},"announce":[],"urlList":[]}}