{"title":"UFO: End-Time Delusion - David A. Lewis","uid":10339601,"size":1524098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33d2df2e48bddd98cf0bdb5f1dc2c6f34a3860c4&amp;dn=UFO%3A+End-Time+Delusion+-+David+A.+Lewis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1402524414,"description":"Today our secularized society is so eager for quick, amazing answers. Will new hope arrive on these &quot;chariots of the gods?&quot;\nPsychics are channeling such exciting insights from alleged cosmic beings, detailing the &quot;true&quot; nature of God and alternate roads to salvation. Supermarket tabloids proclaim oddball messages from space. New Agers are captivated by the promise of alien cosmic enlightenment and higher intelligence from beyond the stars. So, what is really out there? Why are movies filled with wise aliens, Eastern mysticism, and New Age humanism such hits? Are we being set up for a new , false, extraterrestrial hope? Yet another evolutionary alternative to the only true way - Jesus Christ?\n\n\nAbout the author:\nDr. David Allen Lewis is a clergyman, author, lecturer Bible teacher, researcher, publisher, and is active in national and international circles in promoting the welfare of the Church, of Israel and the Jewish People. While his ordination is with the Assemblies of God, he is acclaimed in both Christian and Jewish circles. Lewis is the founder and president of Christians United for Israel; Springfield, Missouri, with chapters in various other states.\nDr. Lewis produced and hosted 39 television documentaries on location throughout Israel and shown on national TV in the United States. Many are produced as VHS home videos.\nDr. Lewis speaks in Churches, conferences, clergy seminars, colleges, camp meetings, district events, etc. He has taught short courses in eschatology and apocalyptic literature in both secular and theological colleges, also short term seminars and spiritual life emphasis in Bible Colleges.\n","torrent":{"xt":"urn:btih:33d2df2e48bddd98cf0bdb5f1dc2c6f34a3860c4","amp;dn":"UFO%3A+End-Time+Delusion+-+David+A.+Lewis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33d2df2e48bddd98cf0bdb5f1dc2c6f34a3860c4","infoHashBuffer":{"type":"Buffer","data":[51,210,223,46,72,189,221,152,207,11,219,95,29,194,198,243,74,56,96,196]},"announce":[],"urlList":[]}}