{"title":"Plants of the Gods: Their Sacred, Healing, and Hallucinogenic Po","uid":9962544,"size":27123413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:345febe07afa658bf7d26fbc0fea46e30aa1dc8b&amp;dn=Plants+of+the+Gods%3A+Their+Sacred%2C+Healing%2C+and+Hallucinogenic+Po&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MeGastroem","files":1,"time":1397532440,"description":" &quot;This superbly illustrated, encyclopedic volume provides a much needed, well-balanced scientific perspective on the use of hallucinogenic plants. Richard Evans Schultes, the worlds most eminent ethnobotanist, and Albert Hofmann, the former research director at Sandoz Pharmaceuticals, emphasize the need for continued education about both the potential benefits and the inherent dangers involved in the use of hallucinogens.&quot; (Shaman's Drum)\n\n&quot;Carefully researched, beautifully written, and abundantly illustrated, this book reminds us that the use of hallucinogenic plants has been a fundamental part of the human experience for millennia.&quot; (Michael R. Aldrich, Ph.D., Curator Fitz Hugh Ludlow Library)\n\n&quot;It contains an incredible amount of rigorous and fascinating information in a highly accessible, beautiful, and compelling format.&quot; (Journal of Scientific Exploration, October 2003)\n\n&quot;Richard Evans Schultes has been the nexus of almost everything interesting and supportive concerned with economic and cultural uses of plants. Plants of the Gods gives precise and illuminating portraits of the many peoples of the Earth who pay homage to and gain insights with the aid of psychedelic plants: an exquisite, thoroughly scholarly book.&quot; (Whole Earth Review)\nAbout the Author\nA specialist in the cultural use of psychoactive plants, Christian Ratsch is the author of numerous books, including Gateway to Inner Space, The Dictionary of Sacred and Magical Plants, and the forthcoming Encyclopedia of Psychoactive Plants. A resident of Germany, he is currently serving as the president of the German Society for Ethnomedicine. Richard Evans Schultes (1915-2001) was a Jeffrey Professor of Biology and Director of the Botanical Museum at Harvard University, considered by many to be the father of modern ethnobotany. Albert Hofmann (1906-2008), discoverer of LSD, was a world renowned research biochemist.","torrent":{"xt":"urn:btih:345febe07afa658bf7d26fbc0fea46e30aa1dc8b","amp;dn":"Plants+of+the+Gods%3A+Their+Sacred%2C+Healing%2C+and+Hallucinogenic+Po","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"345febe07afa658bf7d26fbc0fea46e30aa1dc8b","infoHashBuffer":{"type":"Buffer","data":[52,95,235,224,122,250,101,139,247,210,111,188,15,234,70,227,10,161,220,139]},"announce":[],"urlList":[]}}