{"title":"*53 PDF/EBOOKS EXPOSING THE TRUE HISTORY OF THE VATICAN* (+ imag","uid":7790051,"size":630066569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:348f906543a7de4d7d90e959a63af8b272d76a1d&amp;dn=%2A53+PDF%2FEBOOKS+EXPOSING+THE+TRUE+HISTORY+OF+THE+VATICAN%2A+%28%2B+imag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"WideAwake87","files":58,"time":1351997932,"description":"Does what it says on the tin ;)\n\nQuite a few of these were banned from publication until recently, some are still banned I believe. \n\n(please forgive the caps in the following:)\n\nEDUCATE YOURSELVES ON HOW THE VATICAN IS THE REAL POWER CENTER OF EVERY CONTINENT, EVERY NATIONALITY, EVERY RELIGION, EVERY MONETARY SYSTEM, EVERY GOVERNMENT, EVERY MONARCHY, EVERY SOCIETY ON EARTH:\n\n\nIT IS NOT SIMPLY THE HEAD OF THE CATHOLIC CHURCH.\n\nTHERE IS A REASON IT IS NOT SIMPLY PART OF ITALY BUT IT IS IT'S OWN STATE \n\nINDEPENDENT FROM THE REST OF THE WORLD AND WHY IT OPERATES USING IT'S OWN LAWS AND CLAIMS IMMUNITY TO ANY AND ALL LAWS OUTSIDE OF ITSELF.\n\nIT IS THE EPITOME OF CRIMINAL ACTIVITY ON THIS PLANET.\n\nIT HAS HAD CONTROL OVER EVERY MAJOR WAR, ASSASSINATION, MURDER, GENOCIDE, DISEASE, AND ECONOMIC DISASTER IN OUR HISTORY.\n\nIT'S CREATION OF THE JESUITS ARE WHAT ENABLES IT TO WREAK HAVOK ACROSS OUR PLANET.\n\nFORGET THE PRESIDENT. FORGET THE QUEEN. FORGET THE GOVERNMENT, THE VATICAN IS ABOVE THEM ALL AND HANDLES ALL BELOW THEM LIKE PUPPETS.\n\nTHEY DO NOT TRULY WORSHIP A GOD AS BEING AN ENTITY OF POWER ABOVE THEM, THEY EXPLOIT THIS BY CONNING BILLIONS INTO BELIEVING IT INSTEAD. \n\nTHE SOONER WE ALL WAKE UP AND SEE THAT WE ARE GOD COLLECTIVELY AS A UNIFIED CONSCIOUSNESS THE SOONER WE CAN STOP PLACING THE MEANING OF OUR ENTIRE LIVES IN THE HANDS OF THE VATICAN, AND TAKE RESPONSIBILITY FOR OUR OWN LIVES INSTEAD OF BEGGING AN ENTITY WE BELIEVE TO BE SEPARATE FROM OURSELVES TO SORT OUT OUR PROBLEMS FOR US. ","torrent":{"xt":"urn:btih:348f906543a7de4d7d90e959a63af8b272d76a1d","amp;dn":"%2A53+PDF%2FEBOOKS+EXPOSING+THE+TRUE+HISTORY+OF+THE+VATICAN%2A+%28%2B+imag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348f906543a7de4d7d90e959a63af8b272d76a1d","infoHashBuffer":{"type":"Buffer","data":[52,143,144,101,67,167,222,77,125,144,233,89,166,58,248,178,114,215,106,29]},"announce":[],"urlList":[]}}