{"title":"Dinesh D'Souza - What's So Great About America","uid":4281265,"size":88893448,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:34bb6402f09e023f2e3bafc35329d09ca4c4d738&amp;dn=Dinesh+D%5C%27Souza+-+What%5C%27s+So+Great+About+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"rambam1776","files":37,"time":1215436092,"description":"There is no doubt and no need to point out that there are certainly plenty of problems with America and its culture. Unfortunately, we are currently at a moment where many Americans and seemingly most non-Americans honestly believe that America is a sick and corrupt nation that is either failing or has always been a failure. Most of the charges leveled at America are patently nonsensical, but strangely nobody seems to take the time to simply refute them. I suspect that this stems from the simple human failing of overly-concentrating on the negative when most basic things are just fine, or simply functional.\n\nDinesh D?Souza?s 2003 book (read by the author) is doubly useful in the quality of his arguments but also in the fact that he is an IMMIGRANT from a NON-WHITE nation, which means that his statements cannot be simply cast off as more drivel from some right wing WASP. The reader is perfectly free to disagree with him (many have), but you cannot simply dismiss him. A leading Scholar  - You know, like with footnotes and research and stuff? ? of the current American right wing, D?Sousa offers a litany of what he thinks America is doing correctly, thank you very much, and those who would disagree are going to have to get off their fat asses and do some work to argue with him.\n\nI know that many of the people who read these comments are from all over the world, and largely European. American prestige is very low there, and many Europeans smugly believe America is flawed and pitiful. Well, take a few hours to listen to a counter-argument, and see if your opinion of the US improves any.\n\nBTW ? To any French Reader ? I hereby apologize for the international embarrassment of George W Bush. Total idiot, no argument. Now, are YOU willing to apologize for Chirac?\n\nEditorial Review from Amazon:\n\nAmazon.com\nLook again at the title of this book: it&amp;#039;s not a question, but a statement. &quot;America is the greatest, freest, and most decent society in existence,&quot; writes Dinesh D&amp;#039;Souza. &quot;American life as it is lived today [is] the best life that our world has to offer.&quot; There are those who hate it, or at least essential elements of it, from radical Islamists to the likes of Patrick Buchanan (on the right) and Jesse Jackson (on the left). But they are wrong to hate it, and D&amp;#039;Souza grapples with all of them in this engaging and compelling volume. D&amp;#039;Souza is the author of provocative books such as Illiberal Education and The End of Racism, plus the appreciative Ronald Reagan. This may be his most personal book, with parts written in the first person as the India-born D&amp;#039;Souza describes his encounter with the United States, first as an immigrant and now as a citizen. Foreign authors such as Alexis de Tocqueville and Gunnar Myrdal have offered some of the most penetrating assessments of America, and D&amp;#039;Souza clearly shares in this noble tradition. &quot;I am constantly surprised by how much I hear racism talked about and how little I actually see it,&quot; he writes. What&amp;#039;s So Great About America is also vintage D&amp;#039;Souza, full of feisty arguments and sharp humor. He is perhaps better at explaining why America&amp;#039;s critics are wrong than explaining why America&amp;#039;s celebrants are right, but he&amp;#039;s very good at both. Written in the months following the September 11 terrorist strikes, this book should find a large and receptive audience. --John Miller --This text refers to the Hardcover edition. \n\n\n","torrent":{"xt":"urn:btih:34bb6402f09e023f2e3bafc35329d09ca4c4d738","amp;dn":"Dinesh+D%5C%27Souza+-+What%5C%27s+So+Great+About+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34bb6402f09e023f2e3bafc35329d09ca4c4d738","infoHashBuffer":{"type":"Buffer","data":[52,187,100,2,240,158,2,63,46,59,175,195,83,41,208,156,164,196,215,56]},"announce":[],"urlList":[]}}