{"title":"Einstein's Gravity in a Nutshell - (Princeton Press) (PDF)","uid":9426200,"size":11355800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:351588e946c655467ed1b6a8b5247cb826b85f43&amp;dn=Einstein%27s+Gravity+in+a+Nutshell+-+%28Princeton+Press%29+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"aposhig","files":1,"time":1388700095,"description":"This unique textbook provides an accessible introduction to Einstein's general theory of relativity, a subject of breathtaking beauty and supreme importance in physics. With his trademark blend of wit and incisiveness, A. Zee guides readers from the fundamentals of Newtonian mechanics to the most exciting frontiers of research today, including de Sitter and anti-de Sitter spacetimes, Kaluza-Klein theory, and brane worlds. Unlike other books on Einstein gravity, this book emphasizes the action principle and group theory as guides in constructing physical theories. Zee treats various topics in a spiral style that is easy on beginners, and includes anecdotes from the history of physics that will appeal to students and experts alike. He takes a friendly approach to the required mathematics, yet does not shy away from more advanced mathematical topics such as differential forms. The extensive discussion of black holes includes rotating and extremal black holes and Hawking radiation. The ideal textbook for undergraduate and graduate students, Einstein Gravity in a Nutshell also provides an essential resource for professional physicists and is accessible to anyone familiar with classical mechanics and electromagnetism. It features numerous exercises as well as detailed appendices covering a multitude of topics not readily found elsewhere.\n\n- Provides an accessible introduction to Einstein's general theory of relativity\n- Guides readers from Newtonian mechanics to the frontiers of modern research\n- Emphasizes symmetry and the Einstein-Hilbert action\n- Covers topics not found in standard textbooks on Einstein gravity\n- Includes interesting historical asides\n- Features numerous exercises and detailed appendices\n- Ideal for students, physicists, and scientifically minded lay readers\n- Solutions manual (available only to teachers) \n \nNumber of Pages: 889 \n \nAll I Ask For Is A Thank You And Please To Seed!","torrent":{"xt":"urn:btih:351588e946c655467ed1b6a8b5247cb826b85f43","amp;dn":"Einstein%27s+Gravity+in+a+Nutshell+-+%28Princeton+Press%29+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"351588e946c655467ed1b6a8b5247cb826b85f43","infoHashBuffer":{"type":"Buffer","data":[53,21,136,233,70,198,85,70,126,209,182,168,181,36,124,184,38,184,95,67]},"announce":[],"urlList":[]}}