{"title":"My Autobiography [2013][Alex Ferguson][mobi/epub][INFERNO]","uid":9094355,"size":6487709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3521de5f875ffc6240de459c988d1da111745365&amp;dn=My+Autobiography+%5B2013%5D%5BAlex+Ferguson%5D%5Bmobi%2Fepub%5D%5BINFERNO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382650653,"description":"My Autobiography by Alex Ferguson\n\n\n\nFormat: mobi/epub\nLength: 516 pages\nGenre: Biography\nDate: 24 October 2013\n\nSir Alex announced his retirement as manager of Manchester United after 27 years in the role. He has gone out in a blaze of glory, with United winning the Premier League for the 13th time, and he is widely considered to be the greatest manager in the history of British football.\n\nOver the last quarter of a century there have been seismic changes at Manchester United. The only constant element has been the quality of the manager's league-winning squad and United's run of success, which included winning the Champions League for a second time in 2008. Sir Alex created a purposeful, but welcoming, and much envied culture at the club which has lasted the test of time.\n\nSir Alex saw Manchester United change from a conventional football club to what is now a major business enterprise, and he never failed to move with the times. It was directly due to his vision, energy and ability that he was able to build teams both on and off the pitch. He was a man-manager of phenomenal skill, and increasingly he had to deal with global stars. His relationship with Cristiano Ronaldo, for instance, was excellent and David Beckham has described Sir Alex as a father figure.\n\nOver the past four years, Sir Alex has been reflecting on and jotting down the highlights of his extraordinary career and in his new book he will reveal his amazing story as it unfolded, from his very early days in the tough shipyard areas of Govan.\n\nAuthor:\n\nRaised in the tough Govan district of Glasgow, where his father was a shipyard worker, Alex Ferguson started his own working life as an apprentice toolmaker. He went on to play for Queen's Park and five other professional football clubs including the idols of his boyhood, Rangers. Needless to say he was known as a hard and awkward opponent on the field as well as off it. Intelligent and quick-witted, Alex Ferguson followed his father's lead as a deeply committed socialist.\n","torrent":{"xt":"urn:btih:3521de5f875ffc6240de459c988d1da111745365","amp;dn":"My+Autobiography+%5B2013%5D%5BAlex+Ferguson%5D%5Bmobi%2Fepub%5D%5BINFERNO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3521de5f875ffc6240de459c988d1da111745365","infoHashBuffer":{"type":"Buffer","data":[53,33,222,95,135,95,252,98,64,222,69,156,152,141,29,161,17,116,83,101]},"announce":[],"urlList":[]}}