{"title":"GOM PLAYER","uid":8978994,"size":10413592,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:354ae6c9b53924769e8309f95c40b4336778ab05&amp;dn=GOM+PLAYER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Rayllz666","files":1,"time":1380511826,"description":"This software is a freeware product developed for normal users, users of approved services, and software distributors. As such it can be used freely at home, work, school, or public place in any personal, nonprofit, non-commercial capacity.\n\n* Attention:\n- This software is protected by copyright laws and software protection law, and modifying, reverse engineering, decompiling, disassembling, or otherwise making changes to the software beyond what is specifically allowed by relevant laws is strictly prohibited.\n- Using this software for any commercial purposes without the permission of the copyright owner is strictly prohibited.\n- Redistributing this software via any method other than internet transmission (CD, DVD, Floppy, etc) without the permission of the copyright holder is strictly prohibited.\n- Making any changes or alterations to the installation file before redistributing via the internet without the permission of the copyright holder is strictly prohibited.\n\n* Copyright Information\n- This software's built-in audio coder is based on FFmpeg (http://ffmpeg.sourceforge.net/) and is licensed under the LGPL license.\n- To review the LGPL license, please refer to the LGPL.TXT file located in the install directory. The modified FFmpeg source used in GOM Player can be downloaded from http://gomdevel.gomtv.com\n- All copyrights for the WMA codec included in GOM Player are owned by Microsoft Corporation.\n- This software uses the JPEG encoding routine made publicly available by the Independent JPEG Group (http://www.ijg.org).\n- This software uses the unzip library made publicly available by Gilles Vollant (http://www.winimage.com/zLibDll/unzip.html), and is licensed under the zlib/libprrg license.\n- This software uses the OGG (VORBIS) library made publicly available by Xiph.org (http://www.xiph.org/ogg/vorbis/) and is licensed under the BSD-like license.\n- The installer software was made using NSIS (http://nsis.sourceforge.net), and is licensed under the zlib./ibpng license.\n- All GOM Player copyrights are owned by Gretech Corporation (http://www.gretech.com)","torrent":{"xt":"urn:btih:354ae6c9b53924769e8309f95c40b4336778ab05","amp;dn":"GOM+PLAYER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"354ae6c9b53924769e8309f95c40b4336778ab05","infoHashBuffer":{"type":"Buffer","data":[53,74,230,201,181,57,36,118,158,131,9,249,92,64,180,51,103,120,171,5]},"announce":[],"urlList":[]}}