{"title":"Error Coding for Engineers - (Malestrom)","uid":9602483,"size":14854687,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35578598bdaf6939353416543f1e43ae98f15b1b&amp;dn=Error+Coding+for+Engineers+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1392145693,"description":"Error Coding for Engineers By A. Houghton\n2001 | 246 Pages | ISBN: 1461355893 | PDF \n\n\nError Coding for Engineers provides a useful tool for practicing engineers, students, and researchers, focusing on the applied rather than the theoretical. It describes the processes involved in coding messages in such a way that, if errors occur during transmission or storage, they are detected and, if necessary, corrected. Very little knowledge beyond a basic understanding of binary manipulation and Boolean algebra is assumed, making the subject accessible to a broad readership including non-specialists.\nThe approach is tutorial: numerous examples, illustrations, and tables are included, along with over 30 pages of hands-on exercises and solutions.\nError coding is essential in many modern engineering applications. Engineers involved in communications design, DSP-based applications, IC design, protocol design, storage solutions, and memory product design are among those who will find the book to be a valuable reference. Error Coding for Engineers is also suitable as a text for basic and advanced university courses in communications and engineering.","torrent":{"xt":"urn:btih:35578598bdaf6939353416543f1e43ae98f15b1b","amp;dn":"Error+Coding+for+Engineers+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35578598bdaf6939353416543f1e43ae98f15b1b","infoHashBuffer":{"type":"Buffer","data":[53,87,133,152,189,175,105,57,53,52,22,84,63,30,67,174,152,241,91,27]},"announce":[],"urlList":[]}}