{"title":"Alestorm-Sunset On The Golden Age(Limited Edition) MP3 ak2014","uid":10692902,"size":175800520,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:357419ab3d83cb5744f893de1d4662721ec029aa&amp;dn=Alestorm-Sunset+On+The+Golden+Age%28Limited+Edition%29+MP3+ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"analogkid6103","files":18,"time":1407142712,"description":"Alestorm-Sunset On The Golden Age(Limited Edition) MP3 ak2014 What we got...Alestorm is a heavy metal band from Perth, Scotland. Their music is characterized by a pirate theme, and as a result they have been dubbed a &quot;pirate metal&quot; band by many critics and their fanbase. They refer to their genre as &quot;True Scottish Pirate Metal&quot;.\n\nThe band formed under the name Battleheart in 2004. After releasing two demos, they were signed by Napalm Records in 2007 and renamed themselves Alestorm.Their debut album was released on 25 January 2008. The band's third album, Back Through Time, was released in June 2011, with their latest record Sunset on the Golden Age released in August of 2014.\n\nAlestorm played on the '70000 Tons of Metal' cruise in the Caribbean. Shortly after that, the band toured around the UK and Ireland on the 'Useless Drunken Bastards' tour with Claim The Throne and Darkest Era.\n\nThe band played on the Paganfest tour of North America with Turisas and Arkona in April. In October 2012, Alestorm toured North America with Epica, Insomnium, System Divide, and Destiny Potato. Alestorm dressed as characters from Batman in honor of their Halloween performance in Toronto and introduced themselves as Christian Balestorm.\n\nStarting from late September, Alestorm toured as the main support band for DragonForce. They appeared third at all shows after Cavorts and The Defiled.\n\nIn January 2013 Alestorm returned to Australia and New Zealand filming their first live DVD.&quot;Live at The End of The World&quot; was released worldwide later that year. This DVD release followed their cover of the Village People track &quot;In The Navy&quot;\n\nIn July 2013, Alestorm played at Metalcamp and at Wacken Open Air in Germany in August.\n\nThe band released their fourth record entitled &quot;Sunset on the Golden Age&quot; on August 1, 20141. \tWalk the Plank \t04:07 \t \n2. \tDrink \t03:23 \t  Show lyrics\n3. \tMagnetic North \t03:47 \t \n4. \t1741 (The Battle of Cartagena) \t07:18 \t \n5. \tMead from Hell \t03:41 \t \n6. \tSurf Squid Warfare \t03:59 \t \n7. \tQuest for Ships \t04:34 \t \n8. \tWooden Leg! \t02:45 \t \n9. \tHangover (Taio Cruz cover) \t03:41 \t \n10. \tSunset on the Golden Age \t11:26 \t \n  \t48:41 \t ","torrent":{"xt":"urn:btih:357419ab3d83cb5744f893de1d4662721ec029aa","amp;dn":"Alestorm-Sunset+On+The+Golden+Age%28Limited+Edition%29+MP3+ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"357419ab3d83cb5744f893de1d4662721ec029aa","infoHashBuffer":{"type":"Buffer","data":[53,116,25,171,61,131,203,87,68,248,147,222,29,70,98,114,30,192,41,170]},"announce":[],"urlList":[]}}