{"title":"Sherlock Holmes in Babylon and Other Tales of Mathematical","uid":8587744,"size":7424575,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:363b7abe4e3bf44e58f544de69855d4e34d3d48b&amp;dn=Sherlock+Holmes+in+Babylon+and+Other+Tales+of+Mathematical&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371570622,"description":"Marlow Anderson, Victor Katz, Robin Wilson, &quot;Sherlock Holmes in Babylon and Other Tales of Mathematical History&quot;\nISBN: 0883855461 | 2004 | PDF | 398 pages | 7 MB\n\nCovering a span of almost 4000 years, from the ancient Babylonians to the eighteenth century, this collection chronicles the enormous changes in mathematical thinking over this time, as viewed by distinguished historians of mathematics from the past and the present. Each of the four sections of the book (Ancient Mathematics, Medieval and Renaissance Mathematics, The Seventeenth Century, The Eighteenth Century) is preceded by a Foreword, in which the articles are put into historical context, and followed by an Afterword, in which they are reviewed in the light of current historical scholarship. In more than one case, two articles on the same topic are included, to show how knowledge and views about the topic changed over the years. This book will be enjoyed by anyone interested in mathematics and its history - and in particular by mathematics teachers at secondary, college, and university levels.","torrent":{"xt":"urn:btih:363b7abe4e3bf44e58f544de69855d4e34d3d48b","amp;dn":"Sherlock+Holmes+in+Babylon+and+Other+Tales+of+Mathematical","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363b7abe4e3bf44e58f544de69855d4e34d3d48b","infoHashBuffer":{"type":"Buffer","data":[54,59,122,190,78,59,244,78,88,245,68,222,105,133,93,78,52,211,212,139]},"announce":[],"urlList":[]}}