{"title":"Thich Nhat Hanh - Anger Wisdom for Cooling the Flames.zip","uid":5626062,"size":78917130,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:365fe2e48de8334abf67c656ba10affc7e11353a&amp;dn=Thich+Nhat+Hanh+-+Anger+Wisdom+for+Cooling+the+Flames.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZDaddy","files":-1,"time":1276485559,"description":"Thich Nhat Hanh: Anger (Wisdom For Cooling The Flames)\n\n4 cd's\nRunning time: 5 hours 47 minutes\nNarrator: Ken McLeod\n\nIt was under the Bodhi tree in India 2,500 years ago that the Buddha achieved \nthe insight that just three states of mind were the source of all our \nunhappiness: ignorance, obsessive desire, and anger. Each of these are equally \ndifficult, but in one instant of anger, lives can be ruined and our spiritual \ndevelopment can be destroyed. \n\nTwenty-five centuries after the Buddha's insight, medical science tells us that \nhe was right. Anger can also ruin our health. It is one of the most powerful \nemotions, and one of the most difficult to deal with. \n\nBut it can be dealt with, and it can be overcome. anger offers us a fresh \nperspective on taking care of our anger, suggesting we take care of it as we \nwould a crying baby -- touching it, talking quietly to it, probing for what's \nmaking it cry. \n\nFilled with stories, techniques, and practical advice, Anger offers a wise and \nloving way to transform anger into peace, and bring harmony and healing to all \nthe areas and relationships in our lives that have been affected by it. As the \nDalai Lama says, Thich Nhat Hahn &quot;shows us the connection between personal, \ninner peace and peace on earth.&quot;\n\n\nThich Nhat Hanh is a Vietnamese Buddhist monk, scholar, poet, and peace \nactivist. During the war in Vietnam, he worked tirelessly for reconciliation \nbetween North and South Vietnam. His lifelong efforts to generate peace moved \nMartin Luther King Jr. to nominate him for the Nobel Peace Prize in 1967. He \nlives in a small community in France where he teaches, writes, gardens, and \nworks to help refugees worldwide. Thich Nhat Hanh has conducted many mindfulness \nretreats in Europe and North America helping veterans, children, \nenvironmentalists, psychotherapists, artists and many thousands of individuals \nseeking peace in their hearts, and in their world. \n\n**** Sharing is caring, Please seed! ****","torrent":{"xt":"urn:btih:365fe2e48de8334abf67c656ba10affc7e11353a","amp;dn":"Thich+Nhat+Hanh+-+Anger+Wisdom+for+Cooling+the+Flames.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"365fe2e48de8334abf67c656ba10affc7e11353a","infoHashBuffer":{"type":"Buffer","data":[54,95,226,228,141,232,51,74,191,103,198,86,186,16,175,252,126,17,53,58]},"announce":[],"urlList":[]}}