{"title":"Lisa Renee Jones, Heating Up the Holidays 3 Story Bundle 2013 [d","uid":9122254,"size":1976247,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36667f5fe511a4e754d9fe592b63f11a9d522b4f&amp;dn=Lisa+Renee+Jones%2C+Heating+Up+the+Holidays+3+Story+Bundle+2013+%5Bd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dovah12","files":-1,"time":1383157222,"description":"Heating Up the Holidays 3-Story Bundle\n\nAuthor : Lisa Renee Jones, Serena Bell, Mary Ann Rivers\n\nisbn: 0804178402\nisbn13: 9780804178402\nformat: ebook\nPublished October 28th 2013 by Loveswept\n\n\nAs leftover turkey and stuffing give way to stockings and little black dresses, this tantalizingly sexy eBook bundle offers up holiday-themed novellas from a trio of beloved romance authors.\nLisa Renee Jones gives a dedicated reporter and a powerful businessman a chance to count their Thanksgiving blessings in &quot;Play with Me;\nMary Ann Rivers presents &quot;Snowfall&quot;, the story of a woman who confronts a life-changing event--hopefully with a special man by her side--just in time for Christmas; and in\nSerena Bell's &quot;After Midnight, an explosive New Year's kiss leaves two strangers wondering whether they'll ever see each other again.\n\nPLAY WITH ME by Lisa Renee Jones\nKali Miller has spent three years reporting fluff stories, waiting for the article that will launch her career to new heights. When she suddenly finds herself forced to take a job as an executive secretary at a Vegas casino, Kali meets the subject of what will surely be a shocking expose her boss, Damion Ward, the arrogant and undeniably sexy CEO. But after Damion invites her to help him plan a Thanksgiving charity event, Kali begins to see another side of the man. And when she surrenders to the exhilarating tension simmering between them, Kali hopes her story will have a happy ending.\n\nSNOWFALL by Mary Ann Rivers\nJenny Wright can't get enough of her erotic conversations with someone she knows only as &quot;C.&quot; Flirting online helps Jenny temporarily escape confronting the changes to her life as she slowly loses her vision. Jenny's occupational therapist, Evan Carlisle-Ford, is helping her prepare for the challenges ahead, but the forthright, trustworthy man can no longer ignore his growing attraction to his fiercely intelligent client. Now Jenny must choose between the safe, anonymous &quot;C&quot;--or the flesh-and-blood Evan, whose heated kisses can melt snow faster than it can fall.\n\nAFTER MIDNIGHT by Serena Bell\nThe clock is ticking down to midnight on New Year's Eve, and all Nora Hart and Miles Shephard can think about is kissing each other--even though they met just minutes before. Then, as fast as Miles enters Nora's life, he's gone . . . and she never even gets the name of the man she thinks might just be &quot;the one.&quot; One year later, Nora and Miles are reunited. The chemistry between them is just as strong as they remember. But Miles broke her heart once before--and this time around, Nora's not sure whether she can give love a second chance.\n================\n\nDovah","torrent":{"xt":"urn:btih:36667f5fe511a4e754d9fe592b63f11a9d522b4f","amp;dn":"Lisa+Renee+Jones%2C+Heating+Up+the+Holidays+3+Story+Bundle+2013+%5Bd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36667f5fe511a4e754d9fe592b63f11a9d522b4f","infoHashBuffer":{"type":"Buffer","data":[54,102,127,95,229,17,164,231,84,217,254,89,43,99,241,26,157,82,43,79]},"announce":[],"urlList":[]}}