{"title":"Reverend Peyton's Big Damn Band - Between The Ditches (2012) 320","uid":7861520,"size":116057588,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:373078e4728b7b26163d5a65851dc1ab632b4c2a&amp;dn=Reverend+Peyton%27s+Big+Damn+Band+-+Between+The+Ditches+%282012%29+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr_Kurtz","files":14,"time":1353944318,"description":"Reverend Peyton's Big Damn Band - Between The Ditches (2012) 320kbps\n\nJosh &quot;The Reverend&quot; Peyton was born April 12, 1981, Eagletown, Indiana. Original member and Rev's brother, Jayme, was born in 1983. Their father was a concrete man who performed odd jobs during the winter months for extra money, from plowing snow and chopping wood, to fur trapping. Rev Peyton's first introduction to music was via his father's record collection of blues-oriented rock, including Jimi Hendrix, Neil Young and Bob Dylan. At age 12, Rev Peyton's father gave him a Kay brand guitar, eventually purchasing a Gorilla amplifier once he learned to play. Shortly after, younger brother Jayme Peyton started playing the drums and, with a bass player, formed a band called &quot;Drive-Thru&quot; and played parties. A friend pointed out the blues sound of Rev Peyton's guitar playing, sending Peyton off on an exploration of the blues of BB King, Muddy Waters and B.B. King's cousin Bukka White. Further exploration led to pre-World War II &quot;country blues&quot;, and a desire to learn the finger-picking style of artists like Charlie Patton. At the time Peyton was unable to master it, instead playing more pick-oriented blues.\n \nPeyton played a party following his high school graduation, and the next morning suffered excruciating pain in his hands. Doctors told Peyton he'd never be able to hold his left hand in fretting position again. At that point, he gave up on music and spent a year working as the desk clerk in a hotel. During the period when he couldn't physically play guitar, he spent hours imagining playing guitar.\n \nEventually Peyton sought other medical advice. The Indiana Hand Center operated on his left hand removing a mass of scar tissue. While recovering from surgery, Rev Peyton met Breezy, who he later married on June 14, 2003. She introduced him to the music of Jimbo Mathus and the Squirrel Nut Zippers, and he introduced her to delta blues. When the bandages were removed, Peyton discovered a new flexibility and greater control in his fretting hand that enabled him to play in the &quot;finger&quot; style that had long eluded him.\n \nBreezy took up the washboard, and the pair started writing songs. A trip to Clarksdale, Mississippi inspired them to resume playing music, and their first gigs were at Melody Inn Tavern in Indianapolis, Indiana. The band played blues festivals, headlined two nights at actor Morgan Freeman's Ground Zero Blues Club in Clarksdale, and toured as the opening act for Mary Prankster. Eventually, a 40-hour drive from Indiana to El Centro, California to open for the Derek Trucks Band and Susan Tedeschi convinced the band to devote themselves to music and touring full-time. They received an offer from a blues record label, but discovered that they had sold more copies of their independently pressed CD &quot;The Pork'n'Beans Collection&quot; at their concerts than the label had managed to sell of any of their other artists.\n \nThe Big Damn Band has toured constantly in the United States, Canada and Europe, steadily building popularity and sales of their albums.\n \nIn June 2008, they signed with Los Angeles-based SideOneDummy Records, a label they share with Flogging Molly. They released The Whole Fam Damily on August 5, 2008 through the label, and it entered the Billboard Blues Chart at #4.\n \nIn September of 2007, drummer Jayme Peyton was unable to enter Canada to play a concert due to a &quot;youthful indiscretion&quot;. His brother and sister-in-law had to leave him at a Greyhound bus station to play the date with a substitute drummer. Jayme had to hide in the woods near the truck stop to avoid being arrested as a vagrant.\n \nThe band survived the departure of founding member Jayme Peyton in December 2009, who was replaced by Aaron 'Cuz' Persinger. The new drummer debuted at their annual homecoming show in Indianapolis at the Vogue Theatre.\n \nRev Peyton is a Kentucky Colonel.","torrent":{"xt":"urn:btih:373078e4728b7b26163d5a65851dc1ab632b4c2a","amp;dn":"Reverend+Peyton%27s+Big+Damn+Band+-+Between+The+Ditches+%282012%29+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"373078e4728b7b26163d5a65851dc1ab632b4c2a","infoHashBuffer":{"type":"Buffer","data":[55,48,120,228,114,139,123,38,22,61,90,101,133,29,193,171,99,43,76,42]},"announce":[],"urlList":[]}}