{"title":"[Dikshit]Textbook of Forensic Medicine and Toxicology.pdf","uid":10083116,"size":7400334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37fccbb05441831ff15129baf728da809fb4db52&amp;dn=%5BDikshit%5DTextbook+of+Forensic+Medicine+and+Toxicology.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vickey1992","files":1,"time":1399046207,"description":"Book Description: PeePee Publishers, 2010. Softcover. Book Condition: New. . (illustrator). 5th or later edition. . The book covers basic concepts of Forensic Medicine including Medical Jurisprudence, Forensic Pathology, Toxicology and Forensic Sciences in an easy to understand format. All the chapters are concise as well as comprehensive incorporating tables, diagrams, photographs and salient features for a better grasp of the subject. It is a reader friendly book primarily aimed for undergraduate and postgraduate students and Medical Officers posted in Health care settings and would be beneficial for Judiciary and Lawyers too. Moreover, there is inclusion of Laws and Acts wherever relevant. The book also incorporates possible questions at the end of each chapter for preparation during the examination. Contents Part I : Forensic Medicine AND Pathology : 1. Introduction and History of Forensic Medicine 2. Legal Procedures 3. Laws in Relation to Medical Practice 4. Moment of Death 5. Identification 6. Changes After Death 7. Autopsy Procedures and Exhumation 8. Crime Scene Investigation 9. Artefacts 10. Anaesthetic and Surgical Deaths 11. Sudden and Unexpected Deaths 12. Mechanical Injuries 13. Road Traffic Accidents 14. Firearm Injuries15. Regional Injuries 16. Explosion Injuries 17. Fall from Height 18. Dysbarism and Barotrauma 19. Thermal Injuries 20. Mass Disaster 21. Trauma and Disease 22. Medicolegal Aspects of Injuries 23. Torture and Custodial Deaths 24. Asphyxial Deaths 25. Infanticide 26. Impotence and Sterility 27. Virginity, Pregnancy, Delivery and Legitimacy 28. Abortion 29. Assisted Reproduction Techniques and Cloning 30. Medicolegal Aspects of AIDS 31. Sexual Offences 32. Forensic Serology and Trace Evidence 33. Dna Fingerprinting 34. Forensic Psychiatry 35. Starvation Deaths Part II : FORENSIC Toxicology : 36. General Toxicology 37. Corrosive Poisons 38. Metallic Poisons 39. Irritant Poisons 40. Neurotic Poisons 41. CNS Depressants 42. Spinal Poisons 43. Cardiac Poisons 44. Drug Abuse 45. Asphyxiants 46. Biological and Chemical Warfare Agents 47. Agrochemical Poisons 48. Organic Solvents 49. Miscellaneous Poisons 50. Food Poisoning Brief Index of Various Poisonings Printed Pages: 642\n\nCopyright to the respective owners.If you like this book then please buy it.\nSharing is caring,Seed this torrent so others could enjoy it too.\nAny requests/suggestions can be made in the comments section or via email to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4c2139242d21212d28623b2d3d2d3e622d2e2e2d3f0c20253a29622f2321&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nThanks","torrent":{"xt":"urn:btih:37fccbb05441831ff15129baf728da809fb4db52","amp;dn":"%5BDikshit%5DTextbook+of+Forensic+Medicine+and+Toxicology.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37fccbb05441831ff15129baf728da809fb4db52","infoHashBuffer":{"type":"Buffer","data":[55,252,203,176,84,65,131,31,241,81,41,186,247,40,218,128,159,180,219,82]},"announce":[],"urlList":[]}}