{"title":"The Mysterious Origins of Man (UFO TV Special Edition)","uid":4788001,"size":3148814336,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38108eb2003f0c59ead7247c16409516c09fdaba&amp;dn=The+Mysterious+Origins+of+Man+%28UFO+TV+Special+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"quest4truth","files":-1,"time":1237621428,"description":"&quot;This unique documentary questions commonly-held beliefs about man's evolution. In the video, a group of modern-day scientists presents new evidence about the origins of man they say most members of the academic community have ignored. Among their findings: human artifacts and bones discovered in rock strata millions of years older than the theory of evolution can account for.&quot;\n\n\nExcellent documentary!\n\n3 DVD SET - including bonus interviews and non-broadcast material\n\n\nIn February of 1996, NBC broadcast the controversial one-hour special, The Mysterious Origins of Man.* In this program, many alternative views of man's origins were presented, revealing that there are still many unanswered questions. The reaction of the scientific community was extreme and continues to this day.\n\t\nHosted by Charleton Heston\n\n\nIn the one hour Companion to The Mysterious Origins of Man, the experts speak in greater depth, un-restrained by the limitations of network television. This program presents shocking evidence that challenges many of our accepted theories.\n\nThe third program in the Mysterious Origins of Man series is Jurassic Art. Two bizarre collections of art which show men with dinosaurs. An investigation of the controversial Ica Stones and the Acambaro Figurines: are these the greatest archaeological finds of our time, or the greatest hoaxes in history?\n\n*Created by the producers of NBC's Emmy Award winning &quot;THE MYSTERY OF THE SPHINX&quot;.\n\n\n\n&quot;This is an amazing eye opener! I always felt Modern Archeology was rock solid, but now I can see how data &amp; cover-ups really are going on in Archeology! Here's some back round info on the show. On February 25, 1996 NBC aired a one-hour prime-time special, The Mysterious Origins of Man, hosted by Charlton Heston. Controversy exploded in the academic community following this telecast. Much of the material for the program was taken from the book Forbidden Archeology, featuring interviews with co-authors Michael Cremo and Richard Thompson on the show.&quot;\n","torrent":{"xt":"urn:btih:38108eb2003f0c59ead7247c16409516c09fdaba","amp;dn":"The+Mysterious+Origins+of+Man+%28UFO+TV+Special+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38108eb2003f0c59ead7247c16409516c09fdaba","infoHashBuffer":{"type":"Buffer","data":[56,16,142,178,0,63,12,89,234,215,36,124,22,64,149,22,192,159,218,186]},"announce":[],"urlList":[]}}