{"title":"The Book of War: 25 Centuries of Great War Writing","uid":9047082,"size":636023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:381f3af110e5d1dcddf3e9bba2d690146ee33143&amp;dn=The+Book+of+War%3A+25+Centuries+of+Great+War+Writing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1381779606,"description":"The Book of War: 25 Centuries of Great War Writing\nby John Keegan\n\nDESCRIPTION:\nTwenty-five centuries of warfare through the eyes of those who witnessed and fought it, in a unique collection from &quot;the best military historian of the world&quot; (Tom Clancy)\n\nFrom his landmark The Face of Battle through his bestselling The Second World War, John Keegan's acclaimed books of military history are marked by what The New York Times has called his &quot;novelist's eye and cultural anthropologist's sensitivity.&quot; Now, in this trail-blazing volume, Keegan marshals a formidable host of war writings, from Thucydides' classic account of ancient Greek phalanx warfare (c. 5th century B.C.) to blow-by-blow descriptions of ground-fighting against Iraqi troops in Kuwait from the Gulf War of 1990.\n\nBeginning with the heroic era of the Greek, Keegan advances through the ages, presenting the face of war in its various guises over the course of more than 2,000 years. Among more than sixty substantial selections, Julius Caesar records the Roman invasion of Britain; Wellington sketches the Battle of Waterloo; Hemingway brings home the horror of World War I; Orwell pays homage to Catalonia in the Spanish Civil War; America's &quot;G.I. journalist&quot; covers the Normandy landing; and many more. A fascinating introduction on military literature and military historiography, and head notes to every piece offer new perspectives written with &quot;the eloquence we have come to expect of John Keegan&quot; (Washington Post Book World). The Book of War is a holiday gift to delight military enthusiasts, history buffs, and all lovers of great writing.\n\nAmazon.com title link:\n","torrent":{"xt":"urn:btih:381f3af110e5d1dcddf3e9bba2d690146ee33143","amp;dn":"The+Book+of+War%3A+25+Centuries+of+Great+War+Writing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"381f3af110e5d1dcddf3e9bba2d690146ee33143","infoHashBuffer":{"type":"Buffer","data":[56,31,58,241,16,229,209,220,221,243,233,187,162,214,144,20,110,227,49,67]},"announce":[],"urlList":[]}}