{"title":"Ayn Rand - Atlas Shrugged - unabridged","uid":6350395,"size":718902804,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3826b62b0f920907b215a94d6bcfd909626c4329&amp;dn=Ayn+Rand+-+Atlas+Shrugged+-+unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"WentloogWhix","files":1,"time":1303980583,"description":"Atlas Shrugged is a novel by Ayn Rand, first published in 1957 in the United States. Rand's fourth and last novel, it was also her longest, and the one she considered to be her magnum opus in the realm of fiction writing.\n\nThe book explores a dystopian United States where leading innovators, ranging from industrialists to artists, refuse to be exploited by society. The protagonist, Dagny Taggart, sees society collapse around her as the government increasingly asserts control over all industry (including Taggart Transcontinental, the once mighty transcontinental railroad for which she serves as the Vice President of Operations), while society's most productive citizens, led by the mysterious John Galt, progressively disappear. Galt describes the strike as &quot;stopping the motor of the world&quot; by withdrawing the &quot;minds&quot; that drive society's growth and productivity. In their efforts, these people &quot;of the mind&quot; hope to demonstrate that a world in which the individual is not free to create is doomed, that civilization cannot exist where people are slaves to society and government, and that the destruction of the profit motive leads to the collapse of society.\n\n*Please be very patient with this download.*\n\n","torrent":{"xt":"urn:btih:3826b62b0f920907b215a94d6bcfd909626c4329","amp;dn":"Ayn+Rand+-+Atlas+Shrugged+-+unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3826b62b0f920907b215a94d6bcfd909626c4329","infoHashBuffer":{"type":"Buffer","data":[56,38,182,43,15,146,9,7,178,21,169,77,107,207,217,9,98,108,67,41]},"announce":[],"urlList":[]}}