{"title":"Todd Shipley - Investigating Internet Crimes [2013][A]","uid":10396938,"size":33902793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3888ff7893b7370c53eed40e57a2f40ba6eab208&amp;dn=Todd+Shipley+-+Investigating+Internet+Crimes+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Anette14","files":-1,"time":1403277265,"description":"Description\nProduct Details\nBook Title: Investigating Internet Crimes: An Introduction to Solving Crimes in Cyberspace\nBook Author: Todd Shipley, Art Bowker , Nick Selby\nPaperback: 352 pages\nPublisher: Syngress; 1 edition (December 6, 2013)\nLanguage: English\nISBN-10: 0124078176\nISBN-13: 978-0124078178\n\n===================================================================================\nBook Description\nPublication Date: December 6, 2013 | ISBN-10: 0124078176 | ISBN-13: 978-0124078178 | Edition: 1\nWritten by experts on the frontlines, Investigating Internet Crimes provides seasoned and new investigators with the background and tools they need to investigate crime occurring in the online world. This invaluable guide provides step-by-step instructions for investigating Internet crimes, including locating, interpreting, understanding, collecting, and documenting online electronic evidence to benefit investigations.\nCybercrime is the fastest growing area of crime as more criminals seek to exploit the speed, convenience and anonymity that the Internet provides to commit a diverse range of criminal activities. Today's online crime includes attacks against computer data and systems, identity theft, distribution of child pornography, penetration of online financial services, using social networks to commit crimes, and the deployment of viruses, botnets, and email scams such as phishing. Symantec's 2012 Norton Cybercrime Report stated that the world spent an estimated $110 billion to combat cybercrime, an average of nearly $200 per victim.\nLaw enforcement agencies and corporate security officers around the world with the responsibility for enforcing, investigating and prosecuting cybercrime are overwhelmed, not only by the sheer number of crimes being committed but by a lack of adequate training material. This book provides that fundamental knowledge, including how to properly collect and document online evidence, trace IP addresses, and work undercover.\nProvides step-by-step instructions on how to investigate crimes online\nCovers how new software tools can assist in online investigations\nDiscusses how to track down, interpret, and understand online electronic evidence to benefit investigations\nDetails guidelines for collecting and documenting online evidence that can be presented in court.\n\n===================================================================================\nReview\n&quot;Written by experts on the front lines, [it] provides seasoned and new investigators with the background and tools they need to investigate crime occurring in the online world. This invaluable guide provides step-by-step instructions for investigating Internet crimes, including locating, interpreting, understanding, collecting, and documenting online electronic evidence to benefit investigations.&quot;--CorrectionsOne.com, February 11, 2014\n\n===================================================================================\nFrom the Back Cover\n&quot;Cyber-crime, internet fraud, online predators...we think they're being addressed until we become the victims. Today's law enforcement is ill-prepared to address against national security, let alone against our law-abiding citizens. Todd Shipley and Art Bowker are able to communicate what law enforcement responders need to know before they get the call - the information in this book must become a mandatory reference for law enforcement agencies everywhere.&quot;Jim Deal, United States Secret Service (Ret.) and original Supervisor of the San Francisco USSS Electronic Crimes Task Force\n\n&quot;At last..... Informed, pragmatic guidance from two highly experienced professionals who have actually spent time on the front line, not just the classroom. This book is relevant for practitioners working in both law enforcement and within business - every aspiring cyber investigator should have a copy.&quot; Neal Ysart, Director First August Ltd, Information and Corporate Risk Services\n\n===================================================================================\nAbout the Author\nTodd G. Shipley is a retired Detective Sergeant with over 30 years of law enforcement and civilian experience performing and teaching Internet and digital forensic investigations, speaking internationally, has authored books and articles in the field and holds the Patent for Online Evidence Collection.\nArt Bowker (@Computerpo) has over 28 years experience in law enforcement and corrections. His first book, The Cybercrime Handbook for Community Corrections: Managing Risk in the 21st Century, describes the process of supervising cyber-offenders. Bowker cowrote his second book, Investigating Internet Crimes, 1st Edition: An Introduction to Solving Crimes in Cyberspace, with Todd Shipley. His second book provides step-by-step instructions for investigating Internet crimes, including locating, interpreting, understanding, collecting, and documenting online electronic evidence to benefit investigations. Besides his two books he has written numerous law enforcement and corrections articles published by Perspectives, an American Probation and Parole Association (APPA) publication , Federal Probation, and the FBI Law Enforcement Bulletin. On January 14, 2013, Bowker was awarded the APPA Sam Houston State University Award, for work in promoting awareness and knowledge of cybercrime and tools to combat such crimes in the field of community corrections. On November 22, 2013, he was recognized by the Federal Probation and Pretrial Officers Association (FPPOA) with their top honor, the Richard F. Doyle Award, for having made the most significant achievement in, or contribution to, the Federal Probation &amp; Pretrial Services System or the broader field of corrections. Additionally, Bowker received the Thomas E. Gahl, Line Officer of the Year Award (Great Lakes Region Award), which is named in honor of the only U.S. Probation Officer killed in the line of duty. Both awards centered on his contributions and efforts in managing cybercrime risk.\n===================================================================================","torrent":{"xt":"urn:btih:3888ff7893b7370c53eed40e57a2f40ba6eab208","amp;dn":"Todd+Shipley+-+Investigating+Internet+Crimes+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3888ff7893b7370c53eed40e57a2f40ba6eab208","infoHashBuffer":{"type":"Buffer","data":[56,136,255,120,147,183,55,12,83,238,212,14,87,162,244,11,166,234,178,8]},"announce":[],"urlList":[]}}