{"title":"Magnifica 70 S01 - WebRip - Hardcoded Eng Subs - Sno","uid":15183386,"size":5291551762,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:38b34838da89b422e4c611e07aaacca19d48a145&amp;dn=Magnifica+70+S01+-+WebRip+-+Hardcoded+Eng+Subs+-+Sno&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Snowhiter","files":15,"time":1467475455,"description":"Magnifica 70 S01 - WebRip - Hardcoded Eng Subs - Sno\r\n\r\nA film censor with a boring and conventional life falls in love with the actress playing the lead in an erotic film that he must ban in this flamboyant and stylish Brazilian drama set in 1970\r\n\r\n1/13. Married film censor Vicente falls for actress Dora, the star of a Magnifica erotic film, and offers to help producer Manolo get the movie into cinemas. But Dora's secretly plotting to rob the company.\r\n\r\n2/13. Dora and her brother Dario's first attempt to rob the production company fails. Vicente tells Manolo about his idea for a new film, based on the occasion when he rejected his sister-in-law's advances.\r\n\r\n3/13. Dora tries to talk Dario out of the robbery. Suspicious of Vicente working late, his wife Isabel follows him to the red light district. Magnifica's resident director is fired and Vicente replaces him.\r\n\r\n4/13. Helena, Dora's ex-partner-in-crime, turns up at a casting shoot to demand a role in the new film in return for her silence. A shocked Isabel finds the script for Vicente's movie among his possessions.\r\n\r\n5/13. Isabel confronts Vicente about the film script and checks in to a controversial clinic. Shooting on Vicente's movie begins, but his inexperience and insecurity as a director make everyone impatient.\r\n\r\n6/13. Larsen, Magnifica's owner, demands that a kiss between Helena and Dora should be added to the film, but Vicente refuses to direct the scene. Helena tells Dario she thinks Dora and Vicente are in love.\r\n\r\n7/13. Dora confesses to Vicente that her marriage to Manolo is fake and she is a criminal working as an insider to steal the film's profits. A murder takes place at Magnifica and the police are brought in.\r\n\r\n8/13. Isabel turns to fellow patient Carlos but he chooses to reject her. When Larsen tells Manolo what his hatchet man has found out about Vicente, Manolo confronts Dora, but there's an unexpected outcome.\r\n\r\n9/13. Isabel unburdens herself to her mother and hears the truth about her sister Angela. Larsen orders Manolo to doctor the accounts because he is planning to steal from the backers and close the company.\r\n\r\n10/13. Manolo informs Dora about Larsen's devious plans. Vicente wants to ban the film in order to prevent the robbery and save Dora's life. Isabel tells her father she wants nothing more to do with him.\r\n\r\n11/13. Isabel tells Vicente that her father was abusing Angela, and her mother finds a roll of film in the general's safe. Dora and Manolo decide to fight for Magnifica. The film is launched at a big party.\r\n\r\n12/13. Manolo, Dora and the backers turn on Larsen and demand that he hand over Magnifica to them, but Larsen is armed and a fight ensues. Isabel considers switching her father's heart pills for vitamins.\r\n\r\n13/13. The general gets a nasty surprise at his birthday party when the fake film is screened. One by one, the backers pull out of Magnifica Films. Must Vicente, Dora and Manolo go their separate ways?\r\n\r\n \r\nVideo 852 x 480 / 29.97 fps / 950 kbps (Approx) / Mp4\r\n\r\nAudio 128 kbps AAC\r\n\r\nDuration 0:51 (Approx)\r\n\r\nSeed to the Max - muchas gracias . . .\r\n\r\nSno\r\n \nhttp://www.imdb.com/title/tt4725820\r\n\r\nBrazil, Drama, Magnifica 70, Portugese, Sno, Thriller, Hardcoded, S01 \r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nI seed all of my torrents to a ratio of 150:1 - after that its your responsibility to keep them alive. Please seed . . .\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nRipped / Encoded / Uploaded by Snowhiter\r\n\r\n-----------------------------------------------------------------------------------------------------\r\n\r\nAny Bitcoin Donations - no matter how small Welcome here : 164BRZMwZZHmBHS7WLU2s4ZB3geRZZuV3b","torrent":{"xt":"urn:btih:38b34838da89b422e4c611e07aaacca19d48a145","amp;dn":"Magnifica+70+S01+-+WebRip+-+Hardcoded+Eng+Subs+-+Sno","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38b34838da89b422e4c611e07aaacca19d48a145","infoHashBuffer":{"type":"Buffer","data":[56,179,72,56,218,137,180,34,228,198,17,224,122,170,204,161,157,72,161,69]},"announce":[],"urlList":[]}}