{"title":"Grateful Dead - Two From The Vault [The Vault Box] (2007) FLAC B","uid":10147826,"size":926214921,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:38d0c39d01eb67144fd9e847e0dfca1f09b3265f&amp;dn=Grateful+Dead+-+Two+From+The+Vault+%5BThe+Vault+Box%5D+%282007%29+FLAC+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Beolab1700","files":22,"time":1400028364,"description":"[center]\n\n[size=5]Grateful Dead - Two From The Vault [The Vault Box] (2007) FLAC Beolab1700[/size]\n\n[IMG]http://i.imgur.com/zCf37Uf.jpg[/IMG]\n\n---------------------------------------------------------------------\n              Grateful Dead - Two From The Vault\n---------------------------------------------------------------------\n\nArtist...............: Grateful Dead\nAlbum................: Two From The Vault \nGenre................: Rock\nSource...............: CD\nYear.................: 2007\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 57 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nInformation..........: CD IMAGE - LOG - CUE - SCANS\n\nPosted by............: Beolab1700 on 13/05/2014\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\nTwo From The Vault (Expanded) 3cd\n8/23-24/68, Shrine Auditorium, Los Angeles\ncd1:\n1. Good Morning, Little School Girl\n2. Dark Star\n3. Saint Stephen\n4. The Eleven\n5. Death Don't Have No Mercy\ncd2:\n1. Cryptical Envelopment &gt;\nQuadlibet For Tender Feet &gt;\nThe Faster We Go, The Rounder We Get\n2. New Potato Caboose\n3. Turn On Your Lovelight\n4. Morning Dew\ncd3:\n1. Alligator\n2. Caution (Do Not Stop On Tracks)\n3. Feedback\n\n---------------------------------------------------------------------\n\nThe six CDs -- seven, if you count the separate, limited-edition bonus disc -- housed within the Vault Box (2007) include a trio of otherwise available From the Vault volumes. Each installment houses a (more or less) complete concert, presented in its entirety from very high fidelity multi-track sources. Interestingly, while the first and second sets were issued in fairly rapid succession in the early '90s, it took over a decade-and-a-half before Three from the Vault surfaced. The lapse had much to do with the inauguration of the Dick's Picks series, as it had been readied for market as early as 1994 by the Dead's collaborator and audio engineer Dan Healy. Interestingly, Healy was also fired the same year. Coincidence? Healy's keen ear and stringency for quality-control ultimately benefits the listener as the contents uniformly relay the Grateful Dead's respective strengths within the distinct phases of a seven-year span (1968 -- 1975). One from the Vault (1991) hails from August 13, 1975 at the venerable Bay Area based Great American Music Hall. The concert marked only the third live Grateful Dead appearance in nearly a year. The show also provided lucky attendees and the North American radio audience, who caught a rebroadcast via the Metromedia Radio Network, material from their soon-to-be-unleashed masterpiece Blues for Allah (1975). The lineup of Jerry Garcia (lead guitar/vocals), Phil Lesh (bass/vocals), Bob Weir (guitar/vocals), Bill Kreutzmann (percussion), Mickey Hart (percussion/crickets), Keith Godchaux (keyboards), and Donna Jean Godchaux (vocals) unveil the whole album, albeit out of sequence. Among the outstanding highlights are Weir's beatific instrumental &quot;Sage and Spirit,&quot; the opening power-trio of &quot;Help on the Way&quot;/&quot;Slipknot!&quot;/&quot;Franklin's Tower&quot; and &quot;King Solomon's Marbles&quot; (aka &quot;Stronger Than Dirt&quot;). Plus, they dust off &quot;Eyes of the World,&quot; a lilting &quot;It Must Have Been the Roses,&quot; and a thoroughly groovy &quot;Goin' Down the Road Feeling Bad.&quot; Two from the Vault (1992) steps back to August 24, 1968 where we find the Ron &quot;Pigpen&quot; McKernan (vocals/keyboards) co-led version of the Grateful Dead. As fate would have it, the concert was one of the preeminent rock &amp; roll gigs to be documented on new-fangled multi-track recording machines -- most of which had never been road tested before. The end result yielded a recording that sounded as good twenty years after the fact as it did to those who were there to experience it. Not to be missed are the psychedelic and exploratory &quot;Dark Star, &quot;the half-hour plus &quot;That's It for the Other One&quot;/&quot;New Potato Caboose&quot; and a rousing &quot;(Walk Me out in The) Morning Dew&quot; finale that is literally cut short mid-song thanks to the strict enforcement of a curfew. Three from the Vault (2007) is dedicated to the second evening of a mid-February 1971 run at the Capitol Theater in Port Chester, NY. Debuted during the opening nights were a number of songs that would remain in the Grateful Dead's repertoire for the rest of their collective careers. Captured here are the very first &quot;Bird Song&quot; and &quot;Deal,&quot; as well as embryonic outings of &quot;Bertha,&quot; &quot;Playing in the Band,&quot; &quot;Greatest Story Ever Told,&quot;&quot;Loser,&quot; and &quot;Wharf Rat&quot; -- each of which had been premiered one night earlier. As historically significant as these additions certainly are, it is the McKernan excursions on &quot;Hurts Me Too,&quot; the long and sinuous &quot;Smokestack Lightnin',&quot; and a soulful spin of &quot;Easy Wind&quot; that should be considered in the Must Hear category for all Deadheads. Noteworthy too is that the February 19 show would be marked by the absence of Mickey Hart, who left the night before and would not return to action until 1975. Purchasers of the Vault Box via the Grateful Dead's online store were treated to a bonus CD containing a smoldering suite with &quot;Alligator&quot;/&quot;Caution (Do Not Stop on Tracks)&quot; and &quot;Feedback&quot; from August 23, 1968 at the Shrine Auditorium. These extra songs likewise augment the expanded edition of Two from the Vault issued in 2007. (allmusic)\n\n---------------------------------------------------------------------\n[/center]","torrent":{"xt":"urn:btih:38d0c39d01eb67144fd9e847e0dfca1f09b3265f","amp;dn":"Grateful+Dead+-+Two+From+The+Vault+%5BThe+Vault+Box%5D+%282007%29+FLAC+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d0c39d01eb67144fd9e847e0dfca1f09b3265f","infoHashBuffer":{"type":"Buffer","data":[56,208,195,157,1,235,103,20,79,217,232,71,224,223,202,31,9,179,38,95]},"announce":[],"urlList":[]}}