{"title":"China - 3000 Years of Art and Literature (Art Ebook).pdf","uid":9584948,"size":109774940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:392f99668f7e4c95f922cc6aa09a4d55ccc786b8&amp;dn=China+-+3000+Years+of+Art+and+Literature+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STBGD","files":-1,"time":1391814595,"description":"China: 3000 Years of Art and Literature by Jason Steuber\nEnglish | 2008 | HQ PDF + OCR | ISBN: 1599620308 | 202 pages | 104 Mb\n\nA window into a world of extraordinary beauty and mystery, China: A Celebration in Art and Literature reveals the glorious 5,000-year-old history of this ancient and fascination culture. In 240 pages and more than 100 full-color images, this volume traces China through its tales and stories, plays and poetry, paintings and objects--from ancient divinations incised on bovine scapula to modern &quot;people's literature&quot; spawned from revolution; from Tang dynasty silk scrolls depicting sublime mountain valleys to government-commissioned propoganda posters. China incorporates text and images that are chornologically ordered in each of its eight thematic chapters:\n\nBirth &amp; Life\nNature &amp; Environment\nLove &amp; Family\nMind &amp; Memory\nFood &amp; Drink\nWar &amp; Politics\nReligion &amp; Spirituality\nDeath &amp; Afterlife\n\nAmong the literary selections included are the famous Book of Songs, the epic Dream of Red Towers, the complex dramatic masterpiece The Romance of the Western Chamber, and works from Confucious, Laozi, Du Fu, and Su Shi.\n\nMore than 100 works of art from the ancient to the contemporary, by artists including Gu Kaizhi, Wang Hui, Lam Qua, and Li Keran. The majority of the images will be from top Asian art collections in the US: The Metropolitan Museum of Art, The Boston Museum of Fine Art, and the Nelson-Atkins Museum of Art, in Kansas City, The De Young in San Francisco with the rest coming from Europe (the British Museum) and China.\n\nThe unique pairings of art and literature in China will enrapture as they reveal--this anthology will inevitably grip all who enter it, be they sophisticated appreciators or eager novices of China.","torrent":{"xt":"urn:btih:392f99668f7e4c95f922cc6aa09a4d55ccc786b8","amp;dn":"China+-+3000+Years+of+Art+and+Literature+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"392f99668f7e4c95f922cc6aa09a4d55ccc786b8","infoHashBuffer":{"type":"Buffer","data":[57,47,153,102,143,126,76,149,249,34,204,106,160,154,77,85,204,199,134,184]},"announce":[],"urlList":[]}}