{"title":"Burl Ives &amp;lrm;- The Wayfaring Stranger (1954) MP3@320","uid":9668387,"size":128158413,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:393b7cbcc6970c6a93643a142c1b6c289a6de99b&amp;dn=Burl+Ives+%26lrm%3B-+The+Wayfaring+Stranger+%281954%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AaronVincent","files":23,"time":1393421311,"description":"The Wayfaring Stranger was the name of the CBS radio program on which Burl Ives first achieved lasting fame in broadcast circles and the name of Ives' autobiography as well, so it was also a natural for his Columbia Records debut. Ives' definitive Columbia album, The Wayfaring Stranger was also one of the bright spots in the very early folk revival of the mid-'50s, serving (every bit as much as the work of the Weavers) as the unofficial songbook for a generation of would-be folksingers who followed. Indeed, while the Weavers subsequently achieved much greater recognition and respect, their work up to this point in 1955 was decidedly more pop oriented, thanks to the presence of Gordon Jenkins' arrangements and accompaniments. In contrast, Ives' presentation on The Wayfaring Stranger was more basic and authentic, consisting of only his voice and acoustic guitar for all but one of the 26 songs. His singing is suited to the wide variety of material here, including folk ballads (&quot;Darlin' Cory,&quot; &quot;I Know Where I'm Going&quot;), western songs (&quot;Cowboy's Lament,&quot; better known as &quot;The Streets of Laredo&quot;), and tall tales (&quot;The Divil and the Farmer&quot;), among numerous other categories. Along with the work of the Easy Riders, this album has been one of the more undeservedly overlooked contributions that Columbia Records made to the folk boom that followed -- listening to this record, it's clear that more than a couple of young folkies picked up a song or two or three from Ives.","torrent":{"xt":"urn:btih:393b7cbcc6970c6a93643a142c1b6c289a6de99b","amp;dn":"Burl+Ives+%26lrm%3B-+The+Wayfaring+Stranger+%281954%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"393b7cbcc6970c6a93643a142c1b6c289a6de99b","infoHashBuffer":{"type":"Buffer","data":[57,59,124,188,198,151,12,106,147,100,58,20,44,27,108,40,154,109,233,155]},"announce":[],"urlList":[]}}