{"title":"Thomas Szasz - 1994 - Cruel Compassion Psychiatric Control Of So","uid":8077072,"size":13482004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:396e8d92567be5b80163b307df2f51e770c1cf87&amp;dn=Thomas+Szasz+-+1994+-+Cruel+Compassion+Psychiatric+Control+Of+So&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anomalous","files":1,"time":1359403566,"description":"In this work, Szasz challenges the notion that the aim of involuntary psychiatric treatment is for the patient's benefit.\n\nFrom the Preface:\n\nWe can influence others in two radically different ways-with the\nsword or the pen, the stick or the carrot. Coercion is the threat or use of\nforce to compel the other's submission. If it is legally authorized, we\ncall it &quot;law enforcement&quot;; if it is not, we call it &quot;crime.&quot; Shunning coer-\ncion, we can employ verbal, sexual, financial, and other enticements to\nsecure the other's cooperation. We call these modes of influence by a\nvariety of names, such as advertising, persuasion, psychotherapy, treat-\nment, brainwashing, seduction, payment for services, and so forth.\nWe assume that people influence others to improve their own lives.\nThe self-interest of the person who coerces is manifest: He compels the\nother to do his bidding. The self-interest of the person who eschews co-\nercion is more subtle: Albeit the merchant's business is to satisfy his\ncustomers' needs, his basic motivation, as Adam Smith acknowledged,\nis still self-interest.\nNevertheless, people often claim that they are coercing the other to\nsatisfy his needs. Parents, priests, politicians, and psychiatrists typically\nX PREFACE\nassume this paternalistic posture vis-a-vis their beneficiaries., As\nthe term implies, the prototype of avowedly altruistic domination-\ncoercion is the relationship between parent and young child. Acknowl-\nedging that parents must sometimes use force to control and protect\ntheir children, and that the use of such force is therefore morally justi-\nfied, does not compel us to beIieve that parents act this way solely in\nthe best interest of their children. In the first place, they might be satis-\nfying their own needs (as well). Or the interests of parent and child\nmay be so intertwined that the distinction is irrelevant. Indeed, ideally\nthe child's dependence on his parents, and the parents' attachment to\nhim, mesh so well that their interests largely coincide. If the child suf-\nfers, the parents suffer by proxy. However, if the child misbehaves, he\nmay enjoy his rebellion, whereas the parents are likely to be angered\nand embarrassed by it. Thus, what appears to be the parents' altruistic\nbehavior must, in part, be based on self-intere~t.~\n","torrent":{"xt":"urn:btih:396e8d92567be5b80163b307df2f51e770c1cf87","amp;dn":"Thomas+Szasz+-+1994+-+Cruel+Compassion+Psychiatric+Control+Of+So","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396e8d92567be5b80163b307df2f51e770c1cf87","infoHashBuffer":{"type":"Buffer","data":[57,110,141,146,86,123,229,184,1,99,179,7,223,47,81,231,112,193,207,135]},"announce":[],"urlList":[]}}