{"title":"Big Momma's House 2(2006)DVDRip.AC3(ENG)-DROCK","uid":6125072,"size":733855744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:39773b001518962da68c2a31b20dfd0094b1cf69&amp;dn=Big+Momma%5C%27s+House+2%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"drock232","files":-1,"time":1295906758,"description":"An FBI agent finds himself crossing the gender line again in the name of national security in this sequel to the comedy hit Big Momma's House. Tom Fuller (Mark Moses) is a computer whiz who is under investigation by the FBI, who suspect he may be the man behind a dangerous piece of underground software that would allow terrorists and criminals to access secured intelligence files online. The Bureau is looking for a way to get inside Fuller's home to find out what he's doing when a golden opportunity presents itself -- Fuller and his wife, Leah (Emily Procter), are in the market for a nanny to help look after their three children. The FBI sends in Malcolm Turner (Martin Lawrence), who will once again impersonate feisty septuagenarian Hattie Mae Pierce, better known as &quot;Big Momma.&quot; Big Momma gets the job, but while trying to dig up the truth about Fuller's possible criminal connections, Malcolm also finds himself developing a close relationship with the suspect's wife and kids. Malcolm also finds himself offering unlikely romantic advice to his new partner, Kevin (Zachary Levi), and developing a new appreciation of the day-to-day travails of his wife, Sherrie (Nia Long).\n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:39773b001518962da68c2a31b20dfd0094b1cf69","amp;dn":"Big+Momma%5C%27s+House+2%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39773b001518962da68c2a31b20dfd0094b1cf69","infoHashBuffer":{"type":"Buffer","data":[57,119,59,0,21,24,150,45,166,140,42,49,178,13,253,0,148,177,207,105]},"announce":[],"urlList":[]}}