{"title":"Joseph Frank - Essays in Russian Literature and Culture (2010)","uid":8502526,"size":856076,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39ab08bf91011865c2c643afa25c4c8ba944f846&amp;dn=Joseph+Frank+-+Essays+in+Russian+Literature+and+Culture+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1369334721,"description":"Joseph Frank - Between Religion and Rationality: Essays in Russian Literature and Culture (Princeton University Press, 2010).\n\nISBN: 9780691142562 | 312 pages | PDF\n\n\nIn this book, acclaimed Dostoevsky biographer Joseph Frank explores some of the most important aspects of nineteenth and twentieth century Russian culture, literature, and history. Delving into the distinctions of the Russian novel as well as the conflicts between the religious peasant world and the educated Russian elite, Between Religion and Rationality displays the cogent reflections of one of the most distinguished and versatile critics in the field.\n\nFrank's essays provide a discriminating look at four of Dostoevsky's most famous novels, discuss the debate between J. M. Coetzee and Mario Vargas Llosa on the issue of Dostoevsky and evil, and confront Dostoevsky's anti-Semitism. The collection also examines such topics as Orlando Figes's sweeping survey of the history of Russian culture, the life of Pushkin, and Oblomov's influence on Samuel Beckett.\n\nInvestigating the omnipresent religious theme that runs throughout Russian culture, even in the anti-religious Chekhov, Frank argues that no other major European literature was as much preoccupied as the Russian with the tensions between religion and rationality. Between Religion and Rationality highlights this unique quality of Russian literature and culture, offering insights for general readers and experts alike.\n\n\nReviews\n\n&quot;While the work will undoubtedly appeal to general readers, specialists will also find it valuable, particularly in the context of their teaching. Frank is able to masterfully distill large and complex themes into a few central points in a few pages, making his short essays a crucial resource for teachers short on time to prepare classes.&quot; -- Kate Holland, Russian Review\n\n&quot;This reconsideration of Dostoevsky's anti-Semitism illustrates Frank's chief qualities: profoundly knowledgeable, humanistic in his concerns, sympathetic to all sides, and, after all these decades of engagement, able to stand back and reflect about the large picture. If much of what he explores in these pages will be familiar to Slavists, his thoughtful commentary and sharp insights impart genuine pleasure and make this a book to enjoy.&quot; -- Barry P. Scherr, Slavic and East European Journal\n\n&quot;An unsurpassed master of making history familiar and close by vividly and scrupulously representing people swept up by the ideas of their age, Frank's new book is yet another testament to his standing reputation as one of the very best literary biographers of our time and one of the finest biographers of all times.&quot; -- Clio\n","torrent":{"xt":"urn:btih:39ab08bf91011865c2c643afa25c4c8ba944f846","amp;dn":"Joseph+Frank+-+Essays+in+Russian+Literature+and+Culture+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ab08bf91011865c2c643afa25c4c8ba944f846","infoHashBuffer":{"type":"Buffer","data":[57,171,8,191,145,1,24,101,194,198,67,175,162,92,76,139,169,68,248,70]},"announce":[],"urlList":[]}}