{"title":"Tame Impala - Lonerism [24 bit FLAC] vinyl","uid":8181968,"size":1051640049,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3a763253ac9dc8ec0257cf5baa5348a75affb3d3&amp;dn=Tame+Impala+-+Lonerism+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"24.96","files":-1,"time":1361641632,"description":"  Tame Impala - Lonerism (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Duration: 51:47\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,700 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  JVC QL-F4\n  Piezo YM-308IIE\n  TC-760LC Phono Preamp\n  Auzentech X-Fi Forte Sound Card\n  Auzentech Audio Creation Console: 24/96 Recording Line-In\n  Sony Sound Forge: Remove DC Bias, Normalize, Split Tracks\n  Click Repair: DeClick 10 on most tracks\n  Flac Level 6 and Tagged with Picard\n\n  01. Be Above It\n  02. Endors Toi\n  03. Apocalypse Dreams\n  04. Mind Mischief\n  05. Music to Walk Home By\n  06. Why Won't They Talk to Me?\n  07. Feels Like We Only Go Backwards\n  08. Keep on Lying\n  09. Elephant\n  10. She Just Won't Believe Me\n  11. Nothing That Has Happened So Far Has Been Anything We Could Control\n  12. Sun's Coming Up\n\n  There's a better than decent chance that, no matter where you are, Perth, Australia is pretty far away, a fact that pretty much makes Tame Impala mastermind Kevin Parker an isolated pop genius' isolated pop genius. Working mostly by himself, Parker mines this solitude with brilliant results on Tame Impala's sophomore effort, Lonerism. Diving headfirst into the realm of pop music, the way Parker uses keyboards to explore more traditional melodies makes the album feel like the McCartney to Innerspeaker's Lennon, blending the familiar with the far out to craft a Revolver-esque psych-pop experience. This shift from the guitar-heavy sound of the debut to a more synthed-out approach gives the album a more expansive feeling, allowing Parker to explore new textures through layer after layer of melody. As with Innerspeaker, sonic architect Dave Fridmann handles the mixing, and though he wasn't involved in the recording process, Lonerism definitely shares the producer's knack for using the space as an instrument in and of itself. This layering of not just sounds, but environments, creates a serene and lonely patchwork of sound, texture, and atmosphere that's a pleasure to explore, offering something different with every journey into its swirling haze of classic pop melody and modern, more experimental, construction. Most importantly, the partnership allows Fridmann to help shape Tame Impala's wild, starry-eyed ambition into something enveloping and accessible, a trick he's performed for the Flaming Lips and Mercury Rev again and again. This combination gives Lonerism the best of both worlds, allowing it the creative freedom to emerge as one of the most impressive albums of the home-recording era while still feeling superbly refined.","torrent":{"xt":"urn:btih:3a763253ac9dc8ec0257cf5baa5348a75affb3d3","amp;dn":"Tame+Impala+-+Lonerism+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a763253ac9dc8ec0257cf5baa5348a75affb3d3","infoHashBuffer":{"type":"Buffer","data":[58,118,50,83,172,157,200,236,2,87,207,91,170,83,72,167,90,255,179,211]},"announce":[],"urlList":[]}}