{"title":"The Student Cookbook: Great Grub for the Hungry (2009)epub","uid":10705403,"size":11106519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ade4fd9cba7528e83a4b793b2e00e7e66507c61&amp;dn=The+Student+Cookbook%3A+Great+Grub+for+the+Hungry+%282009%29epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1407281189,"description":"The Student Cookbook: Great Grub for the Hungry and the Broke\n\n\nThe Student Cookbook will get you through your studies and become more valuable to you than any textbook. You won't need lots of kitchen gadgets, hours in front of the stove or a loan to make these recipes - they are all easy and cheap and designed to satisfy. Start with the basics: which essentials to stock up on so that you always have the foundation of a simple meal; tips on key equipment to buy; simple rules of food hygiene; and, no-fuss tips for throwing together ingredients no matter how little is lurking in your kitchen. When you're having a late-night dissertation crisis and you turn to the refrigerator for salvation, The Student Cookbook will come to the rescue with quick, stress-free Snacks &amp; Bites. Chapters on Easy Meals and Vegetarian Meals include everything you could possibly want in your repertoire: macaroni cheese, panini, stir-fries, spaghetti bolognese, fajitas and lots more. Master the recipes in food to impress and you're sure to win friends. Finally, when there's no chocolate in the house and you need to satisfy a sweet craving, turn to Just Desserts and indulge in plum crumble, apple cake and brownies.","torrent":{"xt":"urn:btih:3ade4fd9cba7528e83a4b793b2e00e7e66507c61","amp;dn":"The+Student+Cookbook%3A+Great+Grub+for+the+Hungry+%282009%29epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ade4fd9cba7528e83a4b793b2e00e7e66507c61","infoHashBuffer":{"type":"Buffer","data":[58,222,79,217,203,167,82,142,131,164,183,147,178,224,14,126,102,80,124,97]},"announce":[],"urlList":[]}}