{"title":"Ingo Swann - Human Super Sensitivities and the Future","uid":4446439,"size":733642047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b54b4aa145a97fe29bb47d6bb585c5bb1685c8e&amp;dn=Ingo+Swann+-+Human+Super+Sensitivities+and+the+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"geogaddi00","files":191,"time":1224063540,"description":"Ingo Swann - Human Super Sensitivities and the Future\n&lt; 2006 &amp;#039;International Remote Viewing Association&amp;#039; Conference, Keynote Address &gt;\n\n( http://www.irva.org/ ) \n\n[img]http://www.rvconference.org/images/RVC-IRVAlogoSm.jpg[/img]\n\nDuration: 01:13:40\nBit rate: 64kbps mp3\nDimensions: 320 x 240 XviD \nSize: 297mb\n\n\n------------------------------------------------------------\n\n\nCertain surprising mainstream scientific discoveries during the last twenty years are forcing shifts in dismissive attitudes toward the parapsychological and other forms of exceptional human experiencing.  These discoveries - including the discovery of dark matter interpenetrating dark energy, of subtle and exotic energies, of multiple dimensions, and, most suggestively, of empathic-telepathic cells in the brain that function to &quot;mind-read&quot; or detect motives and intentions of others - all appear to be based on processes that are not rooted in physical matter.  While information about these discoveries can be found on the Internet, few have used them to project future developments.\n\nSince 1970, Ingo Swann has worked with nearly forty cutting-edge researchers in the fields of parapsychology, psychoenergetics, and super sensitivity perception.  He is best known for his long-term association with Dr. H.E. Puthoff at Stanford Research Institute between 1972 and 1988 in the field of remote viewing, work sponsored by intelligence and military agencies.  Swann&amp;#039;s work carries two consistent hallmarks: high degrees of both statistical and qualitative success, and signifigant theoretical contributions in the area of super sensitivity knowledge that proved amenable to research and development.  Discussions of his work concerning the human species can be found in his extensive website at: http://biomindsuperpowers.com/ \n\n[img]http://www.biomindsuperpowers.com/Images/superpowers3.jpg[/img]\n\n\n------------------------------------------------------------\n\n** This torrent also includes the infamous sci-fi book by Ingo Swann called &quot;Penetration: The Question of Extraterrestrial and Human Telepathy&quot; in pdf format.  Other multimedia related to remote viewing is also included, such as: a 1992 phone conversation with Ed Dames discussing R.V. and the UFO cover-up, Roswell crash etc; several SRI remote viewing documents; Conscious Media video interview with Russell Targ; an interview with Col. John Alexander regarding R.V.; a rare 1996 interview with Jacques Vallee about covert projects involving mind control, as well as a 16min clip of Jacques Vallee discussing his early involvement with SRI and remote viewing from his recent C2C interview; Rupert Sheldrake interview discussing &quot;morphic resonance&quot; which can help explain R.V.; 1 mp3 interviews with Stephen Schwartz concerning R.V. and earth changes; and a torrent file for Major Ed Dames&amp;#039; Remote Viewing Courses, for those interested in learning this incredible skill. **\n\n------------------------------------------------------------\n\n\n** Reference materials for Ingo Swann&amp;#039;s 2006 lecture are also included in this torrent **\n\nThe following is a small list of the revolutionary researchers and paradigm-shifting discoveries, and their announcements in mainstream publications, that are talked about in detail by Ingo Swann:\n\n\n\n- Sir Roger Penrose - http://www.dhushara.com/book/quantcos/penrose/penr.htm\n\n[img]http://www.mth.kcl.ac.uk/~llandau/Homepage/Math/penrose.gif[/img]\n\n(from Wikipedia)\n\nSir Roger Penrose, OM, FRS (born 8 August 1931) is an English mathematical physicist and Emeritus Rouse Ball Professor of Mathematics at the Mathematical Institute, University of Oxford and Emeritus Fellow of Wadham College.  \n\nPenrose has written controversial books on the connection between fundamental physics and human consciousness. In The Emperor&amp;#039;s New Mind (1989), he argues that known laws of physics are inadequate to explain the phenomenon of human consciousness. Penrose hints at the characteristics this new physics may have and specifies the requirements for a bridge between classical and quantum mechanics (what he terms correct quantum gravity, CQG). He claims that the present computer is unable to have intelligence because it is a deterministic system that for the most part simply executes algorithms, as a billiard table where billiard balls act as message carriers and their interactions act as logical decisions. He argues against the viewpoint that the rational processes of the human mind are completely algorithmic and can thus be duplicated by a sufficiently complex computer -- this is in contrast to views, e.g., Biological Naturalism, that human behavior but not consciousness might be simulated. This is based on claims that human consciousness transcends formal logic systems because things such as the insolubility of the halting problem and GÃƒÂ¶del&amp;#039;s incompleteness theorem restrict an algorithmically based logic from traits such as mathematical insight. These claims were originally made by the philosopher John Lucas of Merton College, Oxford.\n\nIn 1994, Penrose followed up The Emperor&amp;#039;s New Mind with Shadows of the Mind and in 1997 with The Large, the Small and the Human Mind, further updating and expanding his theories. Penrose&amp;#039;s views on the human thought process are not widely accepted in scientific circles. According to Marvin Minsky, because people can construe false ideas to be factual, the process of thinking is not limited to formal logic. Furthermore, he says that AI programs can also conclude that false statements are true, so error is not unique to humans.\n\nPenrose and Stuart Hameroff have constructed a theory in which human consciousness is the result of quantum gravity effects in microtubules, which they dubbed Orch-OR (orchestrated object reduction). But Max Tegmark, in a paper in Physical Review E, calculated that the time scale of neuron firing and excitations in microtubules is slower than the decoherence time by a factor of at least 10,000,000,000. The reception of the paper is summed up by this statement in his support: &quot;Physicists outside the fray, such as IBM&amp;#039;s John Smolin, say the calculations confirm what they had suspected all along. &amp;#039;We&amp;#039;re not working with a brain that&amp;#039;s near absolute zero. It&amp;#039;s reasonably unlikely that the brain evolved quantum behavior&amp;#039;, he says.&quot; The Tegmark paper has been widely cited by critics of the Penrose-Hameroff proposal. It has been claimed by Hameroff to be based on a number of incorrect assumptions (see linked paper below from Hameroff, Hagan and Tuszynski), but Tegmark in turn has argued that the critique is invalid (see rejoinder link below). In particular, Hameroff points out the peculiarity that Tegmark&amp;#039;s formula for the decoherence time includes a factor of sqrt{T} in the numerator, meaning that higher temperatures would lead to longer decoherence times. Tegmark&amp;#039;s rejoinder keeps the factor of sqrt{T} for the decoherence time.\n\n\n\n- Dr. Michael Persinger - http://www.shaktitechnology.com\n\n[img]http://web.ionsys.com/~remedy/Persinger,%20Michael_files/image001.jpg[/img]\n\nDr. Michael A. Persinger (born June 26, 1945), a cognitive neuroscience researcher and university professor, has worked since 1971 at Laurentian University, Canada.\n\nPersinger focuses much of his work on the commonalities that exist between the sciences, and aims to integrate fundamental concepts of various branches of science. He organized the Behavioral Neuroscience Program at Laurentian University, which became one of the first to integrate chemistry, biology and psychology.\n\nBecause of the interdisciplinary nature of much of his work, Persinger insists on publishing his techniques and results within the public forum (the scientific literature). Except for $10,000 given to him in 1983 by a researcher from the U.S. Navy who had an interest in magnetic fields and brain activity, his private practice has supported all of his work. Laurentian University supplies only space and infrastructure. Recently, Persinger has received grants from a Canadian SIDS foundation.\n\nDuring the 1980s Persinger stimulated people&amp;#039;s temporal lobes artificially with a weak magnetic field to see if he could induce a religious state (see God helmet). He found that the field could produce the sensation of &quot;an ethereal presence in the room&quot;.\n\nSusan Blackmore, a former academic psychologist and parapsychology researcher: &quot;When I went to Persinger&amp;#039;s lab and underwent his procedures I had the most extraordinary experiences I&amp;#039;ve ever had.&quot; &quot;I&amp;#039;ll be surprised if it turns out to be a placebo effect.&quot;\n\nPersinger wins TVO&amp;#039;s 2007 Big Ideas&amp;#039; Best Lecturer Competition Sponsored by TD Bank with $10,000 prize to Laurentian University - Lecture titled &quot;Psychotropic Drugs&quot; (mp3 of winning lecture included in this torrent) Stream the video here: http://www.tvo.org/cgi-bin/WebObjects/Microsite/?video8493\n\n\n\n- Scientific American magazine, April 2004 issue: &quot;Has Science Missed Half the Brain? Neglected Cells Hold Keys to Thought and Learning&quot; - http://www.sciam.com/sciammag/?contents=2004-04\n\n[img]http://www.sciam.com/media/cover/cover_2004-04.jpg[/img]\n\nThe Other Half of the Brain\nMounting evidence suggests that glial cells, overlooked for half a century, may be nearly as critical to thinking and learning as neurons are \nBy R. Douglas Fields \n\nThe recent book Driving Mr. Albert tells the true story of pathologist Thomas Harvey, who performed the autopsy of Albert Einstein in 1955. After finishing his task, Harvey irreverently took Einstein&amp;#039;s brain home, where he kept it floating in a plastic container for the next 40 years. From time to time Harvey doled out small brain slices to scientists and pseudoscientists around the world who probed the tissue for clues to Einstein&amp;#039;s genius. But when Harvey reached his 80s, he placed what was left of the brain in the trunk of his Buick Skylark and embarked on a road trip across the country to return it to Einstein&amp;#039;s granddaughter.\n\n-- &gt; Want to read the full article?  Download this torrent! \n\n\n\n- Lawrence M. Krauss - http://www.phys.cwru.edu/~krauss/krauss.html\n\n[img]http://www.case.edu/news/2005/7-05/krauss.jpg[/img]\n\nLawrence M. Krauss (born May 27, 1954) is Professor of Physics, Professor of Astronomy, and former Chair of the Physics Department at Case Western Reserve University. He is the author of several bestselling books, including The Physics of Star Trek and Quintessence: The Mystery of the Missing Mass of the Universe.\n\nKrauss is one of the only living scientists that Scientific American has referred to as a &amp;#039;public intellectual&amp;#039;, and is the only physicist ever to have been awarded the highest awards of all three major US Physics Societies: the American Physical Society, the American Association of Physics Teachers, and the American Institute of Physics.\n\nQuintessence (physics)\nFrom Wikipedia, the free encyclopedia\n\nIn physics, quintessence is a hypothetical form of dark energy postulated as an explanation of observations of an accelerating universe. Quintessence is a scalar field which has an equation of state (relating its pressure pq and density ?q) of pq = w?q, where w is less than -1/3. Quintessence is dynamic, and generally has a density and equation of state that varies through time and space. By contrast, a cosmological constant is static, with a fixed energy density and w = -1.\n\nMany models of quintessence have a tracker behavior, which partly solves the cosmological constant problem. In these models, the quintessence field has a density which closely tracks (but is less than) the radiation density until matter-radiation equality, which triggers quintessence to start having characteristics similar to dark energy, eventually dominating the universe. This naturally sets the low scale of the dark energy.\n\nSome special cases of quintessence are phantom energy, in which w &lt; -1, and k-essence (short for kinetic quintessence) which has a non-standard form of kinetic energy.\n\nThe name comes from the Classical elements of the ancient Greeks, where a pure &quot;fifth element,&quot; the aether, was thought to fill the Universe beyond Earth.\n\nQuintessence: The Mystery of the Missing Mass of the Universe (book description from Amazon.com)\n\nThe classic book on the Dark Matter problem, updated after ten years to include the significant new theories of the 1990s.\n \nWill the universe continue to expand forever, reverse its expansion and begin to contract, or reach a delicately poised state where it simply persists forever? The answer depends on the amount and properties of matter in the universe, and that has given rise to one of the great paradoxes of modern cosmology: there is too little visible matter to account for the behavior we can see. Over ninety percent of the universe consists of &quot;missing mass&quot; or &quot;dark matter&quot; - what Lawrence Krauss, in his classic book, termed &quot;the fifth essence.&quot; \n\nIn this new edition of The Fifth Essence, retitled Quintessence after the now widely accepted term for dark matter, Krauss shows how the dark matter problem is now connected with two of the hottest areas in recent cosmology: the fate of the universe and the &quot;cosmological constant.&quot; With a new introduction, epilogue, and chapter updates, Krauss updates his classic for 1999 and shares one of the most stunning discoveries of recent years: an anti-gravity force that explains recent observations of a permanently expanding universe. \n\n\n\n- Scientific American magazine, August 2003 issue: &quot;Are You a Hologram? Quantum Physics Says the Entire Universe Might Be&quot; - http://www.sciam.com/sciammag/?contents=2003-08\n\n[img]http://www.sciam.com/sciammag/?contents=2003-08[/img]\n\nInformation in the Holographic Universe\nTheoretical results about black holes suggest that the universe could be like a gigantic hologram \nBy Jacob D. Bekenstein \n\nAsk anybody what the physical world is made of, and you are likely to be told &quot;matter and energy.&quot; \n\nYet if we have learned anything from engineering, biology and physics, information is just as crucial an ingredient. The robot at the automobile factory is supplied with metal and plastic but can make nothing useful without copious instructions telling it which part to weld to what and so on. A ribosome in a cell in your body is supplied with amino acid building blocks and is powered by energy released by the conversion of ATP to ADP, but it can synthesize no proteins without the information brought to it from the DNA in the cell&amp;#039;s nucleus.\n\n-- &gt; Want to read the full article?  Download this torrent!\n\n\n\n- New York Times - January 10th 2006 - &quot;Cells That Read Minds&quot;\n\n[img]http://graphics8.nytimes.com/images/2006/01/09/science/10mirr.slide2.jpg[/img]\n\nBy SANDRA BLAKESLEE\nPublished: January 10, 2006\n\nOn a hot summer day 15 years ago in Parma, Italy, a monkey sat in a special laboratory chair waiting for researchers to return from lunch. Thin wires had been implanted in the region of its brain involved in planning and carrying out movements.\n\nEvery time the monkey grasped and moved an object, some cells in that brain region would fire, and a monitor would register a sound: brrrrrip, brrrrrip, brrrrrip. \n\nA graduate student entered the lab with an ice cream cone in his hand. The monkey stared at him. Then, something amazing happened: when the student raised the cone to his lips, the monitor sounded - brrrrrip, brrrrrip, brrrrrip - even though the monkey had not moved but had simply observed the student grasping the cone and moving it to his mouth.\n\nThe researchers, led by Giacomo Rizzolatti, a neuroscientist at the University of Parma, had earlier noticed the same strange phenomenon with peanuts. The same brain cells fired when the monkey watched humans or other monkeys bring peanuts to their mouths as when the monkey itself brought a peanut to its mouth. \n\nLater, the scientists found cells that fired when the monkey broke open a peanut or heard someone break a peanut. The same thing happened with bananas, raisins and all kinds of other objects.\n\n&quot;It took us several years to believe what we were seeing,&quot; Dr. Rizzolatti said in a recent interview. The monkey brain contains a special class of cells, called mirror neurons, that fire when the animal sees or hears an action and when the animal carries out the same action on its own. \n\nBut if the findings, published in 1996, surprised most scientists, recent research has left them flabbergasted. Humans, it turns out, have mirror neurons that are far smarter, more flexible and more highly evolved than any of those found in monkeys, a fact that scientists say reflects the evolution of humans&amp;#039; sophisticated social abilities. \n\nThe human brain has multiple mirror neuron systems that specialize in carrying out and understanding not just the actions of others but their intentions, the social meaning of their behavior and their emotions.\n\n&quot;We are exquisitely social creatures,&quot; Dr. Rizzolatti said. &quot;Our survival depends on understanding the actions, intentions and emotions of others.&quot;\n\nHe continued, &quot;Mirror neurons allow us to grasp the minds of others not through conceptual reasoning but through direct simulation. By feeling, not by thinking.&quot; \n\nThe discovery is shaking up numerous scientific disciplines, shifting the understanding of culture, empathy, philosophy, language, imitation, autism and psychotherapy.\n\n-- &gt; Want to read the full article?  Download this torrent!\n\n------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:3b54b4aa145a97fe29bb47d6bb585c5bb1685c8e","amp;dn":"Ingo+Swann+-+Human+Super+Sensitivities+and+the+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b54b4aa145a97fe29bb47d6bb585c5bb1685c8e","infoHashBuffer":{"type":"Buffer","data":[59,84,180,170,20,90,151,254,41,187,71,214,187,88,92,91,177,104,92,142]},"announce":[],"urlList":[]}}