{"title":"Spirit of the West - Greatest Hits (2 CD) 2008 [FLAC] - Kitlope","uid":5037020,"size":1056414998,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3b67643384143a57bf74867c36786860cacbbf3f&amp;dn=Spirit+of+the+West+-+Greatest+Hits+%282+CD%29+2008+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Kitlope","files":39,"time":1249168683,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 3B67643384143A57BF74867C36786860CACBBF3F\nFile Size: 1.007 Gb\nYear: 2008\nLabel: Rhino\nCatalog #: R2 950041\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\n\nSpirit of the West are a Canadian folk rock band, who were popular on the Canadian folk music scene in the 1980s before evolving a blend of hard rock, Britpop, and Celtic folk influences which made them one of Canada's most successful alternative rock acts in the 1990s.\n\n\nThe band began in 1983 as a Vancouver-based folk trio called Evesdropper, consisting of John Mann, Geoffrey Kelly and J. Knutson. They soon changed their name to Spirit of the West, and independently released a self-titled album in 1984 before signing to Stony Plain Records, a roots music label based in Edmonton, Alberta.\n\nStony Plain released Tripping Up the Stairs in 1986. Following that album, Knutson left the band and was replaced by Hugh McMillan.\n\n1988's Labour Day was the band's first major success, spawning the popular single &quot;Political&quot; and making the band a major name on the folk festival circuit. After that album's tour, McMillan took a temporary hiatus from the band. He was replaced by Daniel Lapp and Linda McRae, but returned before the band's next album was recorded. When McMillan returned, Lapp left the band but McRae stayed on. (As a result, Lapp never actually appeared on a Spirit of the West recording. He pursued a solo career, however, releasing a number of albums of experimental jazz/folk/electronic fusion.)\n\nOn the strength of &quot;Political&quot;, Warner Bros. Records signed the band, and Stony Plain released a compilation, Old Material 1984-1986 in 1989. In 1990, the band's major label debut, Save This House was released. The album track &quot;Home for a Rest&quot;, which is still considered a classic frosh week anthem at universities across Canada as well as a popular tune at wedding dances, was not officially released as a single, but remains the band's most famous song.\n\nFollowing Save This House, the band toured England with The Wonder Stuff, and decided to bring in a drummer and experiment with a more rock-oriented sound. Vince Ditrich was brought in, and the band's 1991 album, Go Figure, was the result.\n\nAlthough the album retained many of the band's folk influences, it was more hard rock than any of the band's previous efforts, and this proved controversial among the band's fans. The album included a rock rendition of &quot;Political&quot;, and at one show in London, Ontario, the audience presented the band with a petition demanding that they play the original version of that song. Despite the controversies, however, it became the band's mainstream commercial breakthrough, and won them many new fans in the alternative rock scene.\n\nMacRae also appeared on The Wonder Stuff's album Never Loved Elvis, and all of the members of both bands recorded a cover of the country standard &quot;Will the Circle Be Unbroken&quot; as a B-side for the Wonder Stuff's &quot;Welcome to the Cheap Seats&quot; single.\n\nIn 1993, the band released their most successful album, Faithlift, and scored their biggest hit single, &quot;And if Venice is Sinking&quot;. 1995's Two Headed, in turn, garnered significant airplay for the single &quot;Tell Me What I Think&quot;. However, the album was not as successful on the charts, or as critically hailed, as its predecessor.\n\nIn 1996, the band performed two shows with the Vancouver Symphony Orchestra. The band included some of their hits in these shows, but also included an album's worth of songs written specifically for the occasion, and the new songs were released as Open Heart Symphony that year. (Some of the hits performed at those shows are available on the compilation Hit Parade.) Also in 1996, McRae left the band amicably to pursue a solo career, performing her last show on New Year's Eve of that year. She released a solo country album in 1997, and then formed the alternative country band Cheerful Lonesome.\n\nThe remaining members recorded 1997's Weights and Measures as a four-piece, working with members of The Wonder Stuff, Capercaillie, Fairport Convention and Jethro Tull to round out the studio effort, and added Tobin Frank for their concert tour. However, with the music industry's emphasis having shifted by this time toward more mainstream pop-oriented performers, Warner Bros. put little effort into promoting the album, and dropped the band from their roster after the tour.\n\nAfter Weights &amp; Measures the band took a hiatus from recording and broad-scale national touring, although they continued to perform selected live dates on the summer folk festival circuit and in major concert markets such as Vancouver and Toronto. During the hiatus, Mann, Ditrich and Kelly all released solo albums, Mann pursued acting roles, McMillan worked as a session musician and producer for The Town Pants, and Kelly and Frank recorded with The Paperboys.\n\nThe band's first new album in seven years, Star Trails, was released on July 6, 2004 on MapleMusic Recordings.\n\nIn 2008, the band released a 25th anniversary compilation, Spirituality 1983-2008: The Consummate Compendium, on Rhino Records. The two-CD set includes 32 remastered tracks from throughout the band's career, including two new songs, &quot;Winter's Now the Enemy&quot; and &quot;Another Happy New Year&quot;. Their official 25th anniversary concert, held at Vancouver's Commodore Ballroom on March 14, 2008, was recorded and broadcast by CBC Radio 2.[1] Concurrently with the release of Spirituality, Rhino also released remastered editions of Faithlift and Open Heart Symphony.\n\nIn 2009, Spirit of the West opened for Great Big Sea on the &quot;Fortune's Favour&quot; tour, finishing in Victoria, British Columbia on March 26.\n\n\n\n\n\nThe Consummate Compendium 2008\n\n\nSpirituality 1983-2008: The Consummate Compendium is a greatest hits album by Spirit of the West, released by Rhino Records on July 15, 2008.\n\nThe album was compiled as a 25th anniversary retrospective of the band's career, and features 32 tracks over two discs. The tracks include two new songs, &quot;Another Happy New Year&quot; and &quot;Winter's Now the Enemy&quot;, as well as an unreleased demo version of the band's song &quot;Kiss &amp; Tell&quot;. The album also includes the band's rendition of Donovan's &quot;Sunshine Superman&quot;, which was released on the 1992 Donovan tribute album Island of Circles but has never previously appeared on any of the band's own albums.\n\nThe CD is packaged in a book-style digipak which includes rare photos, set lists, handwritten lyrics and other items from the group's archives.\n\nConcurrently with the album's release, Rhino also reissued two of the band's most successful albums, Faithlift and Open Heart Symphony.\n\n\n\n\nTracks: \n\n\n\nDisc One\n\n1.\t&quot;Doin' Quite Alright&quot; \n2.\t&quot;Homelands&quot; \n3.\t&quot;The Crawl&quot; \n4.\t&quot;Political&quot; \n5.\t&quot;Take It from the Source&quot; \n6.\t&quot;Puttin' Up with the Joneses&quot; \n7.\t&quot;The Old Sod&quot; \n8.\t&quot;Not Just a Train&quot; \n9.\t&quot;Save This House&quot; \n10.\t&quot;Home for a Rest&quot; \n11.\t&quot;Goodbye Grace&quot; \n12.\t&quot;Pulling Lame&quot; \n13.\t&quot;D for Democracy (Scour the House)&quot; \n14.\t&quot;Big Head&quot; \n15.\t&quot;Far Too Canadian&quot; \n16.\t&quot;Kiss &amp; Tell&quot; (demo) \n\n\n\n\nDisc Two\n\n1.\t&quot;And if Venice Is Sinking&quot; \n2.\t&quot;Sadness Grows&quot; \n3.\t&quot;Bone of Contention&quot; \n4.\t&quot;Death on the Beach&quot; \n5.\t&quot;Is This Where I Come In?&quot; \n6.\t&quot;Unplugged&quot; \n7.\t&quot;Wishing Line&quot; \n8.\t&quot;Our Ambassador&quot; \n9.\t&quot;Rites of Man&quot; \n10.\t&quot;Heavenly Angel&quot; \n11.\t&quot;Canadian Skye&quot; \n12.\t&quot;Waiting for Martin&quot; \n13.\t&quot;July&quot; \n14.\t&quot;Sunshine Superman&quot; \n15.\t&quot;Winter's Now the Enemy&quot; \n16.\t&quot;Another Happy New Year&quot; \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:3b67643384143a57bf74867c36786860cacbbf3f","amp;dn":"Spirit+of+the+West+-+Greatest+Hits+%282+CD%29+2008+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b67643384143a57bf74867c36786860cacbbf3f","infoHashBuffer":{"type":"Buffer","data":[59,103,100,51,132,20,58,87,191,116,134,124,54,120,104,96,202,203,191,63]},"announce":[],"urlList":[]}}