{"title":"Modern Dance: Techniques and Teaching","uid":6581734,"size":14527826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b767c39453cfc017871cda1d79e947c15f524bb&amp;dn=Modern+Dance%3A+Techniques+and+Teaching&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"_F1_","files":-1,"time":1312441607,"description":"Modern Dance: Techniques and Teaching By Gertrude Shurr, Rachael D. Yocum\n191 Pages\nISBN: 0871271095 , 0871272695\n\n\nAlthough three decades have passed since MODERN DANCE: Techniques and Teaching was first published, and dance as a creative and performing art has changed with the artists of the day, the basic dance techniques used in training a dancer are constant. They have not changed. Dance students must learn to flex and extend the feet, bend and straighten the knees, develop leg extensions and stretches, jump, skip, run, leap, fall, and variations of the same. These same techniques must be practiced throughout every dancer's life.\n\nThis book is primarily concerned with basic dance techniques. These fundamentals can be taught in as many different approaches as there are teachers to teach, but they must be part of the dance training. The explanations and teaching cues are as valid today as when first introduced. The book's format allows for the creativity of the teacher in planning lessons from the variety of techniques presented. These techniques are described in their most simplified forms, with some variations to allow for the advancement of the skill of the student.\n\nThroughout these many years, the dance material presented in this book has proved its worth. With the help of this text, thousands of dancers have been introduced to modern dance in professional studies, as well as in high school and college dance programs.","torrent":{"xt":"urn:btih:3b767c39453cfc017871cda1d79e947c15f524bb","amp;dn":"Modern+Dance%3A+Techniques+and+Teaching","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b767c39453cfc017871cda1d79e947c15f524bb","infoHashBuffer":{"type":"Buffer","data":[59,118,124,57,69,60,252,1,120,113,205,161,215,158,148,124,21,245,36,187]},"announce":[],"urlList":[]}}