{"title":"The Alpha's Touch Boxed Set by Tawny Taylor et al","uid":9257204,"size":4624950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b917f402e138a23e0f66d524480352c3d69381b&amp;dn=The+Alpha%27s+Touch+Boxed+Set+by+Tawny+Taylor+et+al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"420weedman","files":7,"time":1385572848,"description":"Claim Me - Tawny Taylor (NYT/USAT). With a dead body in her club, Sophie turns to Burke Langton and Miko Dvorak, plunging all three into a world of evil and ecstasy.\n\nOne Night of Danger - Clara Bayard (NYT/USAT). Battling a dark past, Carly's only chance out is to trust her safety and happiness to a man she barely knows - Sam, a sexy cop who can't resist her curves but has secrets of his own.\n\nCurves for Her Billionaire Doms - Christa Wick (NYT/USAT). The three top executives at Whitsun Energy are intent on sharing Casey in their bed, forever. With Whitsun on the verge of a revolutionary breakthrough, their enemies want her dead.\n\nHis Golden Cuffs: Sacrifice - Flora Dare - After Anya's father implicates her in his crimes, her only hope is the self-made billionaire, Leo - who wants her family name for his business and her body and submission for himself.\n\nTaming The Alpha - Adriana Hunter (NYT/USAT). As alpha, Jax must find a mate, but his pack will never accept Nikki, the woman he wants. Maybe it's her curves -- or the stripper pole. With a killer stalking the club's dancers, will Jax follow pack law or his heart?\n\nClaimed by the Marine - Dez Burke (USAT). Dumped right before her wedding, Anna's friends hatch a plot. Enter Hawk, a hard bodied Marine who knows how to make her feel desirable. Will she ignore the warning signs or let the euphoria of Hawk's attention sweep her away?\n\nBig Girl Backstage Pass - Aubrey Rose (NYT/USAT). Sparks fly when Shannon scores a backstage pass and meets guitarist Julian. But can Julian put aside the fear that she just wants him for his fame, or will his Rock &amp; Roll world pull them apart?\n\nHot Prairie Pursuit - A.T. Mitchell. Almost murdered in Misty's field by a smuggler, Declan Schuster is more than rugged good looks. The hard-bodied, cowboy-turned-bounty-hunter is just the man to bring out Misty's submissive side and complete her. But loving him comes with a price.\n\nOwned - Amy Aday (USAT). When Selena gets stranded during a blizzard, she's grateful when her hot professor comes along. The\nbegin down a twisted path of forbidden carnal pleasures. And she learns that he has secrets, a side of him that she doesn't know if she can trust.\n\nHis Need, Her Desire - Malia Mallory. Tabitha didn't come to Hawaii to be spanked, but that's the cost of being saved from drowning by Marcus and the start of an affair so intense they must decide - is this a holiday fling or the real thing?\n\nThe Billionaires' Club - Terry Towers (NYT/USAT). A struggling journalist undercover at an exclusive BDSM club, Lexie's senses are shattered by one of America's most eligible bachelors. After her night with the sexy Dom, will she stop the press or betray her lover?\n\nThe Dutch Smuggler's Captive - Angelina Spears (NYT/USAT). When her friend disappears on their trip to the Caribbean, newly minted geologist Jessica must team up with Ryker, a dangerous and mysterious smuggler with an agenda of his own.\n\nBurn - Dawn Steele (NYT/USAT). Artist by day, hustler by night, Devon rescues the mysterious Abby when she appears on his doorstep with burn marks on her hands. As Abby is swept up in Devon's world of rich, cruel clients, a tragedy strikes that neither of them could have foreseen.\n\nTempting Fate - Aspen Hayes. Heir to an dynasty, Alex Stone gets what he wants. Until his father hires curvy Nora to challenge Alex in the boardroom and the ensuing battle ignites a fire that can only be satisfied","torrent":{"xt":"urn:btih:3b917f402e138a23e0f66d524480352c3d69381b","amp;dn":"The+Alpha%27s+Touch+Boxed+Set+by+Tawny+Taylor+et+al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b917f402e138a23e0f66d524480352c3d69381b","infoHashBuffer":{"type":"Buffer","data":[59,145,127,64,46,19,138,35,224,246,109,82,68,128,53,44,61,105,56,27]},"announce":[],"urlList":[]}}