{"title":"Darkness.Within.2.The.Dark.Lineage-SKIDROW","uid":5598723,"size":1468452745,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3beaf7c0c832531d8e21d11bb05d8ce06e53245d&amp;dn=Darkness.Within.2.The.Dark.Lineage-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"thenoobish","files":-1,"time":1275170497,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nDarkness Within 2: The Dark Lineage / Iceberg Interactive\n\nRELEASE DATE : 29-05-2010              PROTECTION : Nothing\nGAME TYPE    : Adventure               DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nDarkness Within is a series of adventure games inspired by\nfamous horror writer H.P. Lovecraft. In The Dark Lineage,\nthe second installment of the Darkness Within series, players\nagain take the role of police detective Howard Loreid, who\nsuffered from the paranormal happenings around him in the\nfirst volume In Pursuit of Loath Nolder. Now, Howard\ndiscovers that his own horrible past is connected with the\nmadness that is about to swallow him. This second volume will\nsee the Darkness Within saga come to its conclusion.\n\nThe Dark Lineage will take you to places where the things of\nthe past still live, and all the memories that should be\nlong-forgotten are still remembered; including a drowsy,\ndepressive town called Arkhamend, a Victorian mansion that\nhides a lot of horrible secrets, a dilapidated building inside\nnotorious, snow-clad woods and dim underground buildings and\ntunnels. The Dark Lineage is even more frightening and\nstronger than the previous installment so prepare yourself for\nthe descending darkness, this time it will be ultimate.\n\nA new and more advanced game engine: With the new and more\nadvanced version of the original game engine of Darkness\nWithin, you can move anywhere you want, light up your way with\nlight sources that cast real-time soft shadows and\nrealistically lift up, push, pull or throw objects with the\npower of NVIDIA PhysX engine.\n\nBuilt-in Hint System with 3 Difficulty Levels: Players can\nchoose to play in Standard, Detective or Senior Detective\nmodes.\n\nDynamic Puzzles and Features: Traditional adventure game\npuzzles are complimented by deciphering dreams, underlining\nexcerpts in documents to garner critical clues and interacting\nphysically with the environment.\n\nEnhanced Gameplay Experience: The proprietary fully 3D\nreal-time game engine enables compelling special effects,\nstunning visuals, and dynamic lighting and shading, in a first\nperson game environment.\n\nEerie Gameplay Atmosphere: An immersive experience is created\nby a fascinating Lovecraftian story, chilling real-time\ncutscenes, and haunting music.\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:3beaf7c0c832531d8e21d11bb05d8ce06e53245d","amp;dn":"Darkness.Within.2.The.Dark.Lineage-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3beaf7c0c832531d8e21d11bb05d8ce06e53245d","infoHashBuffer":{"type":"Buffer","data":[59,234,247,192,200,50,83,29,142,33,209,27,176,93,140,224,110,83,36,93]},"announce":[],"urlList":[]}}