{"title":"The Book of Deer - Library of Illuminated Celtic Manuscripts (Ar","uid":9808185,"size":25005329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c15db13a0343024e3fe652675e3544d91a863ff&amp;dn=The+Book+of+Deer+-+Library+of+Illuminated+Celtic+Manuscripts+%28Ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1395485156,"description":"The Book of Deer (Library of Celtic Illuminated Manuscripts)\nConstable and Company Ltd | 1994 | ISBN: 0094732108 | English | 80 pages | PDF | 24.4 MB\n\n\nThe original Book of Deer described as &quot;one of the principal antiquities of Scotland&quot; is a ninth century Celtic/Pictish Gospel illuminated manuscript, preserved in the Library of Cambridge University UK. It was copied and illustrated by unknown monks in the Celtic monastery of Deer near Aberdeen. The illustrations have a childlike quality, and such colour as remains is washes mainly now in pastel colours. Strangely for what was intended to be an important ceremonial book there are obvious errors in the Knotwork borders. The text is in rather bad Latin with later Scottish Gaelic additions. It differs markedly from the later Book of Kells which still has sophisticated, extremely detailed initials, illustrations, and title pages still in vibrant colour. It also differs clearly from its intricate and elaborate Pagan predecessors such as the Gundestrup Cauldron.\nThis book has three photographic plates, the front cover plate and its reverse, mirror imaged, showing the poor preservation and obvious fading of the original. It also has modern line drawn accurate representations of all the drawings, illustrations, and initials, by Roy Ellsworth, from it namesake. These contain much more detail than the equivalent photographic plates due to fading of the original from the original probably black inks to dark and sometimes light brown. These modern illustrations show the colour washes as crosshatched shading. They show almost lost details, hopefully, in the same line strength as the original had in the ninth century.\nThe illustrations from the Book of Kells appear reproduced in numerous places from one of my T Shirts, to embroidery, WWW sites and numerous other places. This would be impossible from either the photographs or the accurate line drawings. This book therefore also contains simplified, and slightly corrected, drawings of the illustrations to demonstrate construction methods. &quot;To allow an exploration of one's own colour arrangements&quot;.\nThe colourful history of the book from a description of the foundation of the monastery at Deer, to its rediscovery in the library of Cambridge University, including its association with the historical Scottish King MacBeth, is by the noted Celtic scholar Peter Berresford Ellis. He also gives detailed descriptions of all the illustrations comparing them with both earlier, and later Celtic treasures. He is of the opinion that the rather strange depiction of legs and feet, of the apostles might be an echo of the squatting position in which Celtic Gods are often portrayed.","torrent":{"xt":"urn:btih:3c15db13a0343024e3fe652675e3544d91a863ff","amp;dn":"The+Book+of+Deer+-+Library+of+Illuminated+Celtic+Manuscripts+%28Ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c15db13a0343024e3fe652675e3544d91a863ff","infoHashBuffer":{"type":"Buffer","data":[60,21,219,19,160,52,48,36,227,254,101,38,117,227,84,77,145,168,99,255]},"announce":[],"urlList":[]}}