{"title":"Simon Blackburn - Think","uid":9014022,"size":727985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c22cf3264b417a3488f539a0bd7ac66286ca4c2&amp;dn=Simon+Blackburn+-+Think&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"epub_888","files":-1,"time":1381162076,"description":"Think: A Compelling Introduction to Philosophy\n\nHere at last is a coherent, unintimidating introduction to the challenging and fascinating landscape of Western philosophy. Written expressly for &quot;anyone who believes there are big questions out there, but does not know how to\napproach them,&quot; Think provides a sound framework for exploring the most basic themes of philosophy, and for understanding how major philosophers have tackled the questions that have pressed themselves most forcefully on human consciousness.\n\nSimon Blackburn, author of the best-selling Oxford Dictionary of Philosophy, begins by making a convincing case for the relevance of philosophy and goes on to give the reader a sense of how the great historical figures such as Plato, Hume, Kant, Descartes, and others have approached its central themes. In a lively and accessible style, Blackburn\napproaches the nature of human reflection and how we think, or can think, about knowledge, fate, ethics, identity, God, reason, and truth. Each chapter explains a major issue, and gives the reader a self-contained guide through the problems that the philosophers have studied. Because the text approaches these issues from the gound up, the untrained reader will emerge from its pages able to explore other philosophies with greater pleasure and understanding and be able to think--philosophically--for him or herself.\n\nPhilosophy is often dismissed as a purely academic discipline with no relation to the &quot;real&quot; world non-philosophers are compelled to inhabit. Think dispels this myth and offers a springboard for all those who want to learn how the basic techniques of thinking shape our virtually every aspect of our existence.","torrent":{"xt":"urn:btih:3c22cf3264b417a3488f539a0bd7ac66286ca4c2","amp;dn":"Simon+Blackburn+-+Think","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c22cf3264b417a3488f539a0bd7ac66286ca4c2","infoHashBuffer":{"type":"Buffer","data":[60,34,207,50,100,180,23,163,72,143,83,154,11,215,172,102,40,108,164,194]},"announce":[],"urlList":[]}}