{"title":"Smart Power - Climate Change, the Smart Grid, and the Future of ","uid":6155527,"size":1680997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c5abc7dee85440e6a7ee74bd076d8ccda6fb6e6&amp;dn=Smart+Power+-+Climate+Change%2C+the+Smart+Grid%2C+and+the+Future+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1297022523,"description":"Smart Power: Climate Change, the Smart Grid, and the Future of Electric Utilities\nIsland Press 1st edition (April 5, 2010) | ISBN: 1597267066 | 344 pages | PDF\n\nA new national policy on climate change is under debate in the United States and is likely to result in a cap on greenhouse gas emissions for utilities. This and other developments will prompt utilities to undergo the largest changes in their history. Smart Power examines the many facets of this unprecedented transformation.\n \nThis enlightening book begins with a look back on the deregulatory efforts of the 1990s and their gradual replacement by concerns over climate change, promoting new technologies, and developing stable prices and supplies. In thorough but non-technical terms it explains the revolutionary changes that the Smart Grid is bringing to utility operations. It also examines the options for low-carbon emissions along with the real-world challenges the industry and its regulators must face as the industry retools and finances its new sources and systems.\n \nThroughout the book, Peter Fox-Penner provides insights into the policy choices and regulatory reform needed to face these challenges. He not only weighs the costs and benefits of every option, but presents interviews with informed experts, including economists, utility CEOs, and engineers. He gives a brief history of the development of the current utility business model and examines possible new business models that are focused on energy efficiency.\n \nSmart Power explains every aspect of the coming energy revolution for utilities in lively prose that will captivate even the most techno-phobic readers.\n \nBiographies\n\nPeter Fox-Penner is a consulting executive and an internationally recognized authority on energy and electric power industry issues. Dr. Fox-Penner is a principal and chairman emeritus of The Brattle Group, a leading international economic consulting firm.\n\n \nTable Of Contents\n\nchapter one: The First Electric Revolution\nchapter two: Deregulation, Past and Prologue\nPART I: The Smart Grid and Electricity Sales\nchapter three: The New Paradigm\nchapter four: Smart Electric Pricing\nchapter five: The Regulatory Mountain\nchapter six: The (Highly Uncertain) Future of Sales\nPART II: Supply Side Challenges\nchapter seven: The Aluminum Sky\nchapter eight: The Great Power Shift\nchapter nine: Billion Dollar Bets\nPART III: Business Models for the New Utility Industry\nchapter ten: Energy Efficiency: The Buck Stops Where?\nchapter eleven: Two and a Half Business Models\nchapter twelve: The Smart Integrator\nchapter thirteen: The Energy Services Utility\nConclusion\nTechnical Appendix A\nTechnical Appendix B\nTechnical Appendix C\nNotes\nBibliography\nAbbreviations\nAcknowledgments\nIndex","torrent":{"xt":"urn:btih:3c5abc7dee85440e6a7ee74bd076d8ccda6fb6e6","amp;dn":"Smart+Power+-+Climate+Change%2C+the+Smart+Grid%2C+and+the+Future+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5abc7dee85440e6a7ee74bd076d8ccda6fb6e6","infoHashBuffer":{"type":"Buffer","data":[60,90,188,125,238,133,68,14,106,126,231,75,208,118,216,204,218,111,182,230]},"announce":[],"urlList":[]}}