{"title":"Power Rangers Wild Force (Legacy Collection and Beyond)","uid":11742914,"size":15334303954,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3c61743b9d188e98344778c977523329267cdd54&amp;dn=Power+Rangers+Wild+Force+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"CeraKesh","files":41,"time":1425870569,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/6/67/PRWFpromo.jpg/revision/latest?cb=20130622165702[/img]\nPower Rangers Wild Force (often abbreviated as &quot;PRWF&quot;) was the tenth incarnation of the Power Rangers series, based strongly on the Super Sentai series Hyakujuu Sentai Gaoranger (100 Beasts Squadron Growl Ranger).\n\nWild Force, like Time Force, is very faithful to its Sentai counterpart, with nearly the exact same plot. It's also the first season to have the exact same morphing sequence as its Sentai counterpart.\n\nPower Rangers Wild Force takes place in 2002, continuing the tradition of having the incarnation taking place the year it was released. The first part of the series was originally broadcast on the Fox Kids children's television block, but was later moved to the ABC Kids children's television block in mid-season following the buyout of the Power Rangers franchise by Disney.\n\nWild Force celebrated 10 years of Power Rangers, while Gaoranger celebrated 25 years of Super Sentai.\n\nThe series follows the adventure of Cole Evans, who had been staying with a tribe for many years, as he tries to find his destiny in the fictitious town of Turtle Cove. He encounters the Animarium, a place that many believed to be a fairy tale. He joins four others who had a common path to become the new leader of the Wild Force Power Rangers","torrent":{"xt":"urn:btih:3c61743b9d188e98344778c977523329267cdd54","amp;dn":"Power+Rangers+Wild+Force+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c61743b9d188e98344778c977523329267cdd54","infoHashBuffer":{"type":"Buffer","data":[60,97,116,59,157,24,142,152,52,71,120,201,119,82,51,41,38,124,221,84]},"announce":[],"urlList":[]}}