{"title":"Werckmeister Harmoniak 2000 DVDRip Sonata Premiere","uid":14653715,"size":1552212246,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3dc3832f383cbd704e07f8e45f5260d40cf59f9d&amp;dn=Werckmeister+Harmoniak+2000+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"kleen2","files":3,"time":1463677393,"description":"Béla Tarr follows up on his seven-hour epic Satantango, considered by some critics as one of the finest films of the 1990s, with this elegant, haunting work about the cycles of violence that have dogged Eastern European history. Janos (Lars Rudolph) is a wide-eyed innocent who works as an occasional postal worker and as a caretaker for Mr. Ezster (Peter Fitz). An outsider and a visionary, he marvels at the miracles of creation, from the planets rotating in the heavens to the sundry animals on earth. One day, a circus featuring jars full of medical anomalies and a massive dead whale entombed in a corrugated metal trailer visits Jancos' economically depressed village. Another more sinister attraction is a shadowy figure dubbed &quot;The Prince,&quot; whose nihilist rants incite the town's disaffected to riot. Not long afterwards, Mrs. Ezster (Hanna Schygulla) cajoles her estranged husband to join a citizen's action group against the circus, threatening to move back into his house if he doesn't play along. Tension in the town builds until, after one of The Prince's hate-filled speeches, throngs of angry men with blunt instruments ransack and brutalize a men's hospital ward. When the dust clears, lives are irrevocably changed. This film was screened at the 2000 Toronto Film Festival.\r\n\r\n\r\nLanguage: Hungarian\r\n\r\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:3dc3832f383cbd704e07f8e45f5260d40cf59f9d","amp;dn":"Werckmeister+Harmoniak+2000+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dc3832f383cbd704e07f8e45f5260d40cf59f9d","infoHashBuffer":{"type":"Buffer","data":[61,195,131,47,56,60,189,112,78,7,248,228,95,82,96,212,12,245,159,157]},"announce":[],"urlList":[]}}