{"title":"All-New X-Men HC (v1 - v4 + G.o.t.G. - Trial of Jean Grey) (2013","uid":10844717,"size":1098691878,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3dd6c1b4f03898afb74e8cf0413533efbce1ab47&amp;dn=All-New+X-Men+HC+%28v1+-+v4+%2B+G.o.t.G.+-+Trial+of+Jean+Grey%29+%282013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"nemesis43","files":5,"time":1408762876,"description":"All-New X-Men HC (v1 - v4 + G.o.t.G. - Trial of Jean Grey) (2013 - 2014) (Digital) (Empire)\n\nAll-New X-Men\n\nv1 - Hardcover collecting All-New X-Men #1-5\n\nv2 - Hardcover collecting All-New X-Men #6-10.\n\nv3 - Hardcover and trade paperback collecting All-New X-Men #11-15.\n\nYesterday's X-Men continue to adjust to a present day that's simultaneously more awe-inspiring and more disturbing than any future the young heroes had ever imagined for themselves. And things get even more dangerous when the villainous duo Mystique and Sabretooth target our young time-travelers - starting with Cyclops! Plus: How will Earth's Mightiest Heroes react to the time-swept X-Men? Find out when the Avengers visit the Jean Grey School! But they're not the only ones to do so, as the outlaw Uncanny X-Men drop by for a recruiting session. Who will join the adult Cyclops and his revolutionary crew? The answer will shock you! All this - and the original five X-Men get new costumes! Acclaimed writer Brian Michael Bendis further defines the future - and the past - of the X-Men! Collecting ALL-NEW X-MEN #6-10.\n\nv4 - Hardcover collecting All-New X-Men #18-21, X-Men: Gold and material from A+X #18\n\nThe X-Men are shaken to the core by the fallout from BATTLE OF THE ATOM! Kitty Pryde is particularly affected, and her faith in Wolverine's Jean Grey School is eroded. With her students gone, what is Kitty to do? Meanwhile, X-23 is back, joining the All-New X-Men and... kissing Cyclops?! What does this mean to Jean Grey? When Jean and X-23 are forced to team up against a mysterious force, she'd better figure it out fast! Plus: it's the 50th Anniversary of the X-Men, ring it in with some of the greatest creators to ever work on the X-Men! Collecting ALL-NEW X-MEN #18-21, X-MEN GOLD #1 and material from A+X #18.\n\n\nAll-New X-Men &amp; Guardians of the Galaxy\n\nAll-New X-Men / Guardians of the Galaxy v1 - Hardcover collecting Guardians of the Galaxy #11-13 and All-New X-Men #22-24.\n\nThe arrival of the original X-Men in the present sent shockwaves through the Marvel Universe, but we've only seen the effects on Earth - until now! When an alien race discovers that Jean Grey - host of the destructive Phoenix Force - is back on Earth, they decide to hold her accountable for the heinous acts of Dark Phoenix! Now, it's up to the spacefaring Guardians of the Galaxy to help the All-New X-Men save Jean from twisted intergalactic justice! A surprise ally from one character's past comes to help, but is that enough against the most powerful army in the Universe? You won't want to miss the first encounter between two of the biggest franchises in the Marvel universe! Collecting GUARDIANS OF THE GALAXY (2013) #11-13 and ALL-NEW X-MEN #22-24.\n\n","torrent":{"xt":"urn:btih:3dd6c1b4f03898afb74e8cf0413533efbce1ab47","amp;dn":"All-New+X-Men+HC+%28v1+-+v4+%2B+G.o.t.G.+-+Trial+of+Jean+Grey%29+%282013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd6c1b4f03898afb74e8cf0413533efbce1ab47","infoHashBuffer":{"type":"Buffer","data":[61,214,193,180,240,56,152,175,183,78,140,240,65,53,51,239,188,225,171,71]},"announce":[],"urlList":[]}}