{"title":"American Dad! - Season 02 -Crisp","uid":5930482,"size":3466871381,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3dffa8ae808e9124dbf856b1a537431c260b072b&amp;dn=American+Dad%21+-+Season+02+-Crisp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"crispy1989","files":20,"time":1288759774,"description":"American Dad! - Season 02\n\nSeries: American Dad!\nDVD release: May 15, 2007\nNetwork: Fox\nNo. of episodes: 19\nSource: DVD\nVideo format: .avi\nAudio format: MPEG Layer-3\nBit rate: 133kbps\nWidth: 512\nHeight: 384\n\n---------------------------------\n\nS02E01 - Camp Refoogee\nStan tries to get Steve to attend summer camp; the only one available that he can find, however, turns out to be a refugee camp in Africa. Meanwhile, Roger and Francine role play as a husband and wife, though they can not come up with a mutual backstory.\n\nS02E02 - The American Dad After School Special\nStan freaks out when he discovers that Steve's new girlfriend (a Goth named Debbie) is fat, but when Hayley, Klaus, and Francine point out that Stan is just as chubby as Debbie, Stan takes the news to heart and goes on a crash diet...which turns him anorexic.\n\nS02E03 - Failure Is Not a Factory-Installed Option\nStan loses his confidence when a car salesman gets the best of him in a negotiation, and plots his revenge. Meanwhile, Roger and Steve set up a makeshift drive-in to try to get to first base with popular schoolgirls, and the saga of Roger's golden, jewel-encrusted turd continues.\n\nS02E04 - Lincoln Lover\nStan gets passed up to speak at the Republican National Convention and is desperate to speak at anything Republican. When he creates a play based on Abraham Lincoln and his close male friend, a local chapter of the Log Cabin Republicans choose Stan to be their speaker (which unnerves Stan when he learns that the Log Cabin Republicans are known for having male homosexuals as their members).\n\nS02E05 - Dungeons and Wagons\nAfter discovering Francine is looking for some excitement in their marriage, Stan gets in the driver's seat and becomes involved in drag racing to spice things up. Meanwhile, Hayley breaks up with her boyfriend Jeff, who joins Steve's world of online gaming.\n\nS02E06 - Iced, Iced Babies\nAfter Steve begins taking his relationship with his girlfriend to a new level, Francine develops empty nest syndrome and tries to convince Stan to have another baby. Meanwhile, Roger becomes a college professor and Hayley finds a new crush in her classmate Ethan.\n\nS02E07 - Of Ice and Men\nIn the distant future, Klaus (now an elderly human male with a grandson) tells the story of how Francine discovered Stan's passion for figure skating and how Steve and his friends fought over a Russian mail-order bride.\n\nS02E08 - Irregarding Steve\nWhen Roger helps Steve see how stupid Stan is, they run away to New York to become successful. Meanwhile, the rest of the family is certain that the two have just run away to the tree house, which is promptly destroyed during a lightning storm, which is home to three squirrels re-enacting scenes from What's Eating Gilbert Grape.\n\nS02E09 - The Best Christmas Story Never Told\nWith Stan's Christmas spirit at an all-time low (thanks to special interest groups trying to make the holiday season more politically correct), the Ghost of Christmas Past visits him and tries to show him the true meaning of Christmas. However, Stan is convinced that Christmas can be saved by killing Jane Fonda.\n\nS02E10 - Bush Comes to Dinner\nWhile researching a paper about George Washington Carver in celebration of Black History Month, Steve uncovers a conspiracy thats been going on since the Civil War and strives to expose it to the public. Meanwhile, Roger stalls during a game of Jenga with Hayley.\n\nS02E11 - American Dream Factory\nStan turns entrepreneur and opens a teddy-bear factory when he feels he's slowing down at work. But when he discovers that quick profit equals hard work, he resorts to using illegal aliens for cheap labor. Meanwhile, Roger begins to take over Steve's rock band.\n\nS02E12 - A.T. the Abusive Terrestrial\nWhen Roger is rejected by Steve, he heads out in search of a new human companion. But when his new friend starts to abuse Roger, Steve and Hayley plot to get Roger out of the bad relationship. Meanwhile, Stan and Francine team up to save the Mr. Pibb factory after news hits that Mr. Pibb is going to be discontinued.\n\nS02E13 - Black Mystery Month\nWhile researching a paper about George Washington Carver in celebration of Black History Month, Steve uncovers a conspiracy thats been going on since the Civil War and strives to expose it to the public. Meanwhile, Roger stalls during a game of Jenga with Hayley.\n\nS02E14 - An Apocalypse to Remember\nA misunderstanding at the CIA leads Stan to believe it's the end of the world. Even after he realizes his error, he keeps his family convinced they are the last people on Earth so they can respect him. Meanwhile, Roger gets married so he can buy a new blender.\n\nS02E15 - Four Little Words\nStan goes to great lengths to never, ever end up in a situation ending with Francine telling him, &quot;I told you so.&quot; She lets him hook his boss Bullock up with her friend, but when Bullock accidentally kills the woman, Stan frames Francine so that she'll stop asking questions.\n\nS02E16 - When a Stan Loves a Woman\nStan feels his marriage is on shaky ground after discovering Francine's secret sex garden, so Francine insists on a divorce in order to rekindle their romance, and so that Stan can experience life as a bachelor again. Meanwhile, Steve becomes addicted to an energy drink.\n\nS02E17 - I Can't Stan You\nStan brings some special CIA equipment home to eavesdrop on neighbors, discovering what they really think about him. To get back at them, he has the entire neighborhood evicted. Meanwhile Roger convinces Steve to join him in scamming store owners out of money.\n\nS02E18 - The Magnificent Steven\nStan recounts his story of how he set out on a quest to make Steve a man, which gets him prosecuted for slaughtering contaminated cattle. Meanwhile, Roger starts a cat fight between Francine and Hayley after he unintentionally gives one a little more attention.\n\nS02E19 - Joint Custody\nRoger and Stan turn into bounty hunters and chase Jeff, who is wanted for smuggling marijuana across the country. But when the truth is revealed, Stan offers some fatherly advice. Meanwhile, Steve becomes convinced that he has been cursed with a psychic gift.\n\n---------------------------------\n\nPlease seed, comment and enjoy!\n\nBrought to you by Crisp","torrent":{"xt":"urn:btih:3dffa8ae808e9124dbf856b1a537431c260b072b","amp;dn":"American+Dad%21+-+Season+02+-Crisp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dffa8ae808e9124dbf856b1a537431c260b072b","infoHashBuffer":{"type":"Buffer","data":[61,255,168,174,128,142,145,36,219,248,86,177,165,55,67,28,38,11,7,43]},"announce":[],"urlList":[]}}