{"title":"Two Door Cinema Club - Beacon [FLAC]","uid":8183258,"size":820026238,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3e1c32345e42bfb897b19e2cd59ff43fc6d0cf74&amp;dn=Two+Door+Cinema+Club+-+Beacon+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"24.96","files":-1,"time":1361672942,"description":"  Two Door Cinema Club - Beacon (2012) [FLAC]\n\n  Released: 2012\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,8000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  TT: Thorens TD 115\n  Cartridge: AT440MLa\n  Phono Preamp: Cambridge Audio 551p\n  Soundcard: Xonar DS\n  Software: Audacity @ 24/96, No post-processing\n  Condition: NM\n\n  01. Next Year (4:11)\n  02. Handshake (3:31)\n  03. Wake Up (3:45)\n  04. Sun (3:07)\n  05. Someday (3:43)\n  06. Sleep Alone (3:56)\n  07. The World Is Watching (With Valentina) (3:36)\n  08. Settle (3:52)\n  09. Spring (3:24)\n  10. Pyramid (3:09)\n  11. Beacon (3:24)\n\n  Two Door Cinema Club returned with Beacon after a couple of years touring in support of their debut album, Tourist History. While that set of songs was already pretty sleek thanks to the production skills of Eliot James, the band opted to polish things further with the help of Jacknife Lee, who has worked with R.E.M., U2, Snow Patrol, and plenty of other epic-sounding artists. With Lee's assistance, the band made Beacon a more sophisticated-sounding set of songs: witness the clever chord changes and harmonies on &quot;Next Year,&quot; the more prominent electronics on &quot;Wake Up,&quot; the intriguing percussion on &quot;Pyramid,&quot; and the big brass swells on &quot;Sun,&quot; which make the song a knowing nod to the band's '80s influences. However, this polish comes at a price, and much of the nervy, scrappy energy that made Tourist History so appealing is missing from Beacon. Songs such as &quot;Handshake&quot; are never less than pleasant examples of the band's bright, bouncy dance-rock, but they're not particularly distinctive; on the other hand, attempts to rock harder like &quot;Someday&quot; aren't entirely successful either -- the guitars don't just sound heavy, they sound weighed down, and the gulf between them and Alex Trimble's soothing vocals is nearly as big as the disconnect between the music and Beacon's borderline-saucy album cover. Two Door Cinema Club fare better when they stick closer to their wheelhouse of charming electro-guitar pop, which they do on the bittersweet &quot;Sleep Alone&quot; and the pretty title track. There's nothing overtly bad about Beacon; it shows that Two Door Cinema Club still have a remarkable knack for winsome melodies and harmonies set to kinetic beats. It just doesn't have the spark that Tourist History had, even if it's a more accomplished album overall.","torrent":{"xt":"urn:btih:3e1c32345e42bfb897b19e2cd59ff43fc6d0cf74","amp;dn":"Two+Door+Cinema+Club+-+Beacon+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1c32345e42bfb897b19e2cd59ff43fc6d0cf74","infoHashBuffer":{"type":"Buffer","data":[62,28,50,52,94,66,191,184,151,177,158,44,213,159,244,63,198,208,207,116]},"announce":[],"urlList":[]}}