{"title":"The Joy Of The Guitar Riff - BBC Doc.","uid":10825258,"size":4358982234,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3e3cd338457128ea3ac1fb6cce991cd7cabd9d10&amp;dn=The+Joy+Of+The+Guitar+Riff+-+BBC+Doc.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"winiwini","files":16,"time":1408575308,"description":"The Joy of the Guitar Riff\n\nDuration: 1 hour \n\n\nThe guitar riff is the DNA of rock 'n' roll, a double helix of repetitive simplicity and fiendish complexity on \nwhich its history has been built. From Chuck Berry through to the White Stripes, this documentary traces the \nebb and flow of the guitar riff over the last 60 years of popular music. With riffs and stories from an all-star \ncast including Brian May, Dave Davies, Hank Marvin, Joan Jett, Nile Rodgers, Tony Iommi, Robert Fripp, Johnny Marr, \nNancy Wilson, Kevin Shields, Ryan Jarman, Tom Morello and many more. Narrated by Lauren Laverne.\n\n\nGreat Guitar Riffs at the BBC\n\nCompilation of BBC performances featuring some of the best axe men and women in rock 'n' roll, from Hendrix to the Kinks, \nCream to AC/DC, the Smiths to Rage Against the Machine and Radiohead to Foo Fighters. Whether \nit's the Shadows playing FBI on Crackerjack, Jeff Beck with the Yardbirds, the Jimi Hendrix Experience, \nCream's Sunshine of Your Love from their final gig, Pixies on the Late Show, AC/DC on Top of the Pops or \nFools Gold from the Stone Roses, this compilation is a celebration of rock 'n' roll guitar complete with \nriffs, fingerstylin', wah-wah pedals and Marshall amps.\n\n\nGuitar Heroes at the BBC\n\n\nA celebration of Seventies-era axe-men, acoustic virtuosos and thumping riff merchants, in a \ncompilation of guitar-heavy performances from the BBC TV archives.\n\nGuitar gods including Jimi Hendrix, Pete Townshend, Peter Green and Johnny Winter are joined by, \namong others, flamenco maestro Manitas De Plata, bottleneck bluesman Ry Cooder and straight-up rockers \nAC/DC and Thin Lizzy.\n\nEverything from Fleetwood Mac's ambient masterpiece Albatross to hits like the Jam's In The City and \nFree's Alright Now feature along with lesser-known gems like Maid in Heaven by Be Bop Deluxe and Nils \nLofgren's Keith Don't Go.\n\nThe tracks were recorded in the heyday of BBC shows such as The Old Grey Whistle Test, \nTop of the Pops and Rock Goes to College.","torrent":{"xt":"urn:btih:3e3cd338457128ea3ac1fb6cce991cd7cabd9d10","amp;dn":"The+Joy+Of+The+Guitar+Riff+-+BBC+Doc.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e3cd338457128ea3ac1fb6cce991cd7cabd9d10","infoHashBuffer":{"type":"Buffer","data":[62,60,211,56,69,113,40,234,58,193,251,108,206,153,28,215,202,189,157,16]},"announce":[],"urlList":[]}}