{"title":"Dirty.DANCING.2.2004.DVDRIP.SPANISH.XVID.","uid":5027057,"size":734081024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e865e5ee2c36e47efdd80510a1b808b49a4fb89&amp;dn=Dirty.DANCING.2.2004.DVDRIP.SPANISH.XVID.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nahla","files":1,"time":1248741766,"description":"DirecciÃƒÂ³n: Guy Ferland.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2004.\nDuraciÃƒÂ³n: 86 min.\nInterpretaciÃƒÂ³n: Diego Luna (Javier SuÃƒÂ¡rez), Romola Garai (Katey Miller), Sela Ward (Jeannie Miller), John Slattery (Bert Miller), Jonathan Jackson (James Phelps), January Jones (Eve), Mika Boorem (Susie Miller), RenÃƒÂ© Lavan (Carlos SuÃƒÂ¡rez), Mya Harrison (Lola MartÃƒÂ­nez), Polly Cusumano (Polly).\nGuiÃƒÂ³n: Boaz Yakin y Victoria Arch; basado en un argumento de Kate Gunzinger y Peter Sagal.\nProducciÃƒÂ³n: Lawrence Bender y Sarah Green.\nMÃƒÂºsica: Heitor Pereira.\nFotografÃƒÂ­a: Anthony Richmond.\nMontaje: Scott Richter y Luis Colina.\nDiseÃƒÂ±o de producciÃƒÂ³n: Hugo Luczyc-Wyhowski.\nDirecciÃƒÂ³n artÃƒÂ­stica: Teresa Carriker-Thayer.\nVestuario: Isis Mussenden.\nEstreno en USA: 27 Febrero 2004.\nEstreno en espaÃƒÂ±a: 16 Julio 2004.\n\nSINOPSIS\n\nLa Habana: noviembre de 1958. Katey Miller (Romola Garai), una joven de 18 aÃƒÂ±os, con una curiosidad innata y algunas nociones de espa-ÃƒÂ±ol, comienza una nueva vida en la exuberante capital de Cuba, donde ha sido destinado su padre para ocupar un puesto ejecutivo en Ford. Katey es empollona e introvertida y sus padres esperan que se una al privilegiado grupo de adolescentes estadounidenses que son los vecinos de los Miller en el exclusivo hotel Oceana. Pero comienza a hacer buenas mi-gas con el orgulloso y decidido Javier (Diego Luna), un camarero que resulta ser un brillante bailarÃƒÂ­n. Dispuesta a aprender los es-pectaculares y sensuales movimientos que Javier parece llevar en la sangre, Katey le convence para que sea su pareja en el presti-gioso concurso de baile que se celebra en el espectacular night-club/casino, The Palace. De repente, esta joven empollona empie-za a engaÃƒÂ±ar a sus padres y pasa el dÃƒÂ­a y la noche descubriendo una Cuba totalmente diferente de la mano de Javier. Se encuentran en el sensual nightclub La Rosa Negra, al que sÃƒÂ³lo acuden los cu-banos y donde el baile es aÃƒÂºn mÃƒÂ¡s caliente que la temperatura ex-terior. Algunos dÃƒÂ­as, practican sobre la arena de una playa perdida, acoplando sus cuerpos en una sensual armonÃƒÂ­a que refleja la pa-siÃƒÂ³n que estÃƒÂ¡ naciendo entre ellos. Cuando llega la gran noche del concurso, Katey y Javier estÃƒÂ¡n listos para saltar a la pista de baile, ignorando que en el club de campo, y en las calles de La Habana estÃƒÂ¡ a punto de estallar la violencia revolucionaria.","torrent":{"xt":"urn:btih:3e865e5ee2c36e47efdd80510a1b808b49a4fb89","amp;dn":"Dirty.DANCING.2.2004.DVDRIP.SPANISH.XVID.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e865e5ee2c36e47efdd80510a1b808b49a4fb89","infoHashBuffer":{"type":"Buffer","data":[62,134,94,94,226,195,110,71,239,221,128,81,10,27,128,139,73,164,251,137]},"announce":[],"urlList":[]}}