{"title":"Zack Parsons - Liminal States","uid":15276576,"size":689961691,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ed97fe5fd2c16e6f9fe519fc5228c7ee122d967&amp;dn=Zack+Parsons+-+Liminal+States&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":1,"time":1468305895,"description":"Deep water rises.\r\nAbandon your spire.\r\nIt is coming.\r\n\r\nIt is 1874 and Gideon Long is dying. Wandering the savage desert of the New Mexico Territory, he craves a last drink before he bleeds out. On the brink of madness, he discovers a place best left forgotten and makes an insidious bargain: escape his fate and incur a debt too great for one man. His country will pay the price over the twisting course of more than a century and Gideon will learn there are worse things to bargain with than the devil.\r\n\r\n\r\nLiminal States is the debut novel from SomethingAwful editor Zack Parsons, and it's extraordinary. It begins as a grim, relentless western novel that describes a doomed love triangle between a simple lawman, the twisted scion of an land-baron, and a woman who has married one but thinks she might belong with the other. After a botched train robbery and an epic battle, Gideon (the rich man's son) finds himself gutshot in the desert, led by a mysterious spirit animal to a mystical pool that dissolves him and then reincarnates him, young and whole and vital and immortal. Gideon goes back for the woman he loves, only to discover that she has died in childbirth, and, enraged, he kidnaps the lawman who was her husband and throws him into the pool, too. And now they are both immortal. Every time they die, they are reborn in the pool, over and over, locked in orbit around each other like twin suns being drawn into a destructive nova. This first third of the novel is dark and bloody and remorseless, a story of revenge and tragedy that doesn't let up, until... \r\n\r\nRead by James Patrick Cronin\r\nFormat: M4B","torrent":{"xt":"urn:btih:3ed97fe5fd2c16e6f9fe519fc5228c7ee122d967","amp;dn":"Zack+Parsons+-+Liminal+States","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed97fe5fd2c16e6f9fe519fc5228c7ee122d967","infoHashBuffer":{"type":"Buffer","data":[62,217,127,229,253,44,22,230,249,254,81,159,197,34,140,126,225,34,217,103]},"announce":[],"urlList":[]}}