{"title":"Bamboo in Winter (Christian Movie)","uid":4453632,"size":425555278,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f197b2614beddc3b8c4eb18680c14bf7f681b62&amp;dn=Bamboo+in+Winter+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"IndianChristian","files":4,"time":1224374514,"description":"Bamboo in Winter (Christian Movie)\n\nA genuine Christian movie. \n\nShe was just back from the university. With memories of Tiananmen Square still fresh in her mind, she now faced a new kind of revolution. A revolution of the soul. The Preacher has come to the village, bringing the Bible&amp;#039;s life-changing message. As she listens, she is edged closer to an eternal decision. But in this atheistic communist society, the consequences of such a decision can be devastating. Based on actual events now happening to the suffering house church in China, this thrilling 58-minute drama will move viewers into a new sense of the power of faith in the face of oppression. This film has a penetrating message and is a well crafted drama that shows the true cost of following Christ. \n\nThis is a scripture based movie with solid doctrine and presents factual and accurate information On Christians in China. It deals with how the Chinese Communist Party deals with Christians in China.  \n\nThe acting is excellent. I would recommend this movie to any Christian, From: well rooted in ihe faith to the babies in the faith, to even the luke warm majority that think they&amp;#039;re saved. This movie will cause you to examine yourself (2 Cor 13:5) And start to hopefully &amp;#039;Make every effort to walk the Narrow Path.&amp;#039; \n\nDVD Release Date: June 1, 1991 \nLanguage: English\nSubtitles: English (To enable subtitles, please rename the subtitle file correctly)\nRun Time: 58 minutes \nMy Rating: 10/10\nQuality: 8/10\n\nIf financially possible, please buy the CD/DVD to keep Christian films in business ......\n\nPlease seed for as long as possible. Let others also come to know that there is Salvation only in the name of Jesus Christ.\n\nUploaded by Indian Christian","torrent":{"xt":"urn:btih:3f197b2614beddc3b8c4eb18680c14bf7f681b62","amp;dn":"Bamboo+in+Winter+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f197b2614beddc3b8c4eb18680c14bf7f681b62","infoHashBuffer":{"type":"Buffer","data":[63,25,123,38,20,190,221,195,184,196,235,24,104,12,20,191,127,104,27,98]},"announce":[],"urlList":[]}}