{"title":"The Beatles - Introducing...The Beatles [320k MP3]","uid":7739353,"size":135267470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f69d44e7dea62c3f5ced987acccb055f10338cd&amp;dn=The+Beatles+-+Introducing...The+Beatles+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"smbdownload","files":-1,"time":1350586172,"description":"Introducing... The Beatles is the first Beatles album released in the United States. Originally scheduled for a July 1963 release, the LP came out on 10 January 1964, on Vee-Jay Records, ten days before Capitol's Meet The Beatles!. It was the subject of much legal wrangling, but ultimately, Vee-Jay were permitted to sell the album until late 1964, by which time it had sold more than 1.3 million copies. In order to circumvent the restraining order, Vee-Jay quickly reconfigured Introducing... The Beatles. It removed &quot;Love Me Do&quot; and &quot;P.S. I Love You&quot; and replaced them with the previously deleted &quot;Ask Me Why&quot; and &quot;Please Please Me&quot;, though some pressings of the album did not alter the track list. The new versions were prepared in late January and began appearing in stores approximately 10 February 1964. \n\nBecause of the initial restraining order, version two of Introducing... The Beatles did not enter the Billboard album charts until three weeks after Meet The Beatles!. Once it did, it quickly rose to the number two spot, where it stayed for nine straight weeks.  It also peaked at number two in Cash Box, and it got to number one in Record World magazine. \n\nEven with the replacement of the two Beechwood Music songs, Vee-Jay and Capitol battled in court throughout the early part of 1964. Injunctions against Vee-Jay's album were issued, lifted and restored more than once.  Because the album was often pressed quickly between restraining orders, there are almost two dozen different label variations, including mono and stereo copies, manufactured at numerous pressing plants.  Finally, on 9 April 1964, the two labels settled. Vee-Jay was granted a license giving it the right to issue the 16 Beatles' songs it controlled, in any way it saw fit, until 15 October 1964. At that time, its licence expired, and all rights would revert to Capitol.\n\nTrack Listing [320k MP3]\n\n\n01. \t&quot;I Saw Her Standing There&quot; \t \n02. \t&quot;Misery&quot;   \t \n03. \t&quot;Anna (Go to Him)&quot; (Arthur Alexander) \t \n04. \t&quot;Chains&quot; (Gerry Goffin, Carole King) \t \n05. \t&quot;Boys&quot; (Luther Dixon, Wes Farrell) \t \n06. \t&quot;Love Me Do&quot; (&quot;Ask Me Why&quot; on version two) \n07. \t&quot;P.S. I Love You&quot; (&quot;Please Please Me&quot; on version two) \t \n08. \t&quot;Baby It's You&quot; (Burt Bacharach, Mack David, Barney Williams) \t \n09. \t&quot;Do You Want to Know a Secret&quot;   \t \n10. \t&quot;A Taste of Honey&quot; (Ric Marlow, Bobby Scott) \t \n11. \t&quot;There's a Place&quot;   \t \n12. \t&quot;Twist and Shout&quot; (Phil Medley, Bert Russell)","torrent":{"xt":"urn:btih:3f69d44e7dea62c3f5ced987acccb055f10338cd","amp;dn":"The+Beatles+-+Introducing...The+Beatles+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f69d44e7dea62c3f5ced987acccb055f10338cd","infoHashBuffer":{"type":"Buffer","data":[63,105,212,78,125,234,98,195,245,206,217,135,172,204,176,85,241,3,56,205]},"announce":[],"urlList":[]}}