{"title":"Peg + Cat (PBS Kids) Season 1, Episodes 16-21","uid":10645690,"size":1369793113,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3fd98a9b8fa5d204ff58c8bb7891caa2b9fd1fed&amp;dn=Peg+%2B+Cat+%28PBS+Kids%29+Season+1%2C+Episodes+16-21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"NantoVision","files":-1,"time":1406540752,"description":"Peg + Cat is an American animated children's television series created by Billy Aronson and Jennifer Oxley and produced by The Fred Rogers Company and 9 Story Entertainment. It debuted on most PBS stations on October 7, 2013. \n\nThe animated preschool series follows the spirited Peg and her sidekick Cat as they embark on adventures and learn foundational math concepts and skills. Co-creators Billy Aronson (Rent, Postcards from Buster) and Jennifer Oxley (Little Bill, The Wonder Pets!) have teamed with The Fred Rogers Company to bring young viewers a new way to experience math through Peg and CatÎ“Ã‡Ã–s relatable, and often hilarious, adventures. Each episode features two humorous stories in which Peg and Cat encounter problems that require them to use math and problem solving skills in order to move forward. \n\nPEG + CAT stories are at once engaging, appealing, accessible and age-appropriate. As Peg solves a seemingly insurmountable problem, she has to think through what went wrong and how she can get back on track. Life skills such as cooperation are also important parts of the series, as Peg and her friends have to work together to solve problems; and since Peg might not get it right the first time, viewers also see value of learning from mistakes and  experimentation. Music is also used as a teaching tool throughout the math series; each episode features an original song.\n\nThese were encoded by me, from my digital recordings off my local PBS station. This includes all of the episodes that have aired from April-July 2014. \n\n\nIf you enjoy this torrent, be sure to leave me a comment! And please continue to seed after your download completes, so that others can enjoy this great kids educational show. I'll keep recording new episodes as they air, and if people keep seeding I will continue to post more episodes as they are shown on PBS Kids. There are four new episodes scheduled to air in late August, so hopefully I will post a torrent of those soon after they are shown.","torrent":{"xt":"urn:btih:3fd98a9b8fa5d204ff58c8bb7891caa2b9fd1fed","amp;dn":"Peg+%2B+Cat+%28PBS+Kids%29+Season+1%2C+Episodes+16-21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fd98a9b8fa5d204ff58c8bb7891caa2b9fd1fed","infoHashBuffer":{"type":"Buffer","data":[63,217,138,155,143,165,210,4,255,88,200,187,120,145,202,162,185,253,31,237]},"announce":[],"urlList":[]}}