{"title":"The.Taff-The.River.That.Made.Wales--BBC-2016-w.subs-720p","uid":13638657,"size":1559643940,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:40a1802faf0885c8a32dc2540e7e4e227fc262f4&amp;dn=The.Taff-The.River.That.Made.Wales--BBC-2016-w.subs-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"uggauga","files":6,"time":1456107294,"description":"\nThe Taff: The River That Made Wales\r\n\r\nWriter and fisherman Will Millard recounts how the River Taff went from being so polluted by heavy industry that no fish could live there, to one of the best salmon and trout rivers in Wales.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b0701s43\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nThe Taff: The River That Made Wales Episode 1 of 3\r\nWriter and fisherman Will Millard tells the extraordinary story of how the River Taff came back from the dead. This river, once so polluted by heavy industry that no fish could live there, has now become one of the best salmon and trout rivers in Wales. Will travels from the source high in the stunning Brecon Beacons National Park to Merthyr Tydfil where he discovers that the town's ironworks were once vital to the British Empire. Along the way he trains with a mountain rescue team facing a unique set of challenges, meets a group of conservationists working to protect a magical, hidden valley and fishes for wild brown trout in the most unlikely location.\r\n\r\nThe Taff: The River That Made Wales Episode 2 of 3\r\nWriter and fisherman Will Millard travels the length of the wild River Taff in south Wales, from its source high in the stunning Brecon Beacons to the Bristol Channel. In the opening episode, he explores how the coal industry changed this beautiful landscape and its people forever.\r\nThe river once ran black with coal dust, but is now one of the finest trout and salmon rivers in Wales. Will meets the members of the Lewis Merthyr Colliery Brass Band and fishes for grayling with a former miner who is now a champion fly-fisherman. He visits one of Britain's biggest open-cast coal mines and sees how this spectacular landscape is being reclaimed after centuries of mining.\r\n\r\nThe Taff: The River That Made Wales Episode 3 of 3\r\nWriter and fisherman Will Millard reaches the end of his journey down the River Taff in South Wales. This beautiful wild river, once neglected and polluted, has now come back to life. Will goes wild swimming with a group of eccentrics trying to change the image of this forgotten river. He meets retired Somali sailors drawn to Cardiff in the city's glory days as a thriving port and tells the story of how the industrial docks have been transformed. Finally, he sets out to catch the king of fish, migratory salmon returning to the river where they were born","torrent":{"xt":"urn:btih:40a1802faf0885c8a32dc2540e7e4e227fc262f4","amp;dn":"The.Taff-The.River.That.Made.Wales--BBC-2016-w.subs-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a1802faf0885c8a32dc2540e7e4e227fc262f4","infoHashBuffer":{"type":"Buffer","data":[64,161,128,47,175,8,133,200,163,45,194,84,14,126,78,34,127,194,98,244]},"announce":[],"urlList":[]}}