{"title":"Alexis Grace - How I Fucked My Brother Taboo Diaries ","uid":12337897,"size":399634432,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:40c7b2f3f78a95c0a0d8ffd051d2ea1ac4d781a3&amp;dn=Alexis+Grace+-+How+I+Fucked+My+Brother+Taboo+Diaries+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"TKTh3K1ng","files":1,"time":1441265088,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8yr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8yr&lt;/a&gt;\n\nHow I fucked my brother\n\nTo Get The Family Fortune\n\n\n\nDear Diary\n\nA few years back my gold digging mom married this rich guy and adopted his son. Mom did good at getting some of his money but not the entire fortune and for some reason I was never put in the will. Recently he wound up in the hospital and when his rich prick of a son found out he rubbed his fortune in my face. It upset me so bad I devised a plan to get the entire fortune for myself and it worked out great.\n\nThat night my step-brother did a bit too much celebrating so I snuck in his room and tied him to the bed. When he realized what was going on he tried to protest so I gagged him with a pair of my pantyhose and told him what was coming. I pulled down his pants and sucked his cock for a bit then climbed on top and started riding it. The taboo of screwing my step-brother turned me on immensely and made me cum several times. My step-brother tried to resist giving me what I wanted, his hot load in my pussy, but the loser couldn't hold out long enough.After he shot his load in me I blackmailed him into silence with threats of calling the cops, stupid bastard believed me too.\n\nDear Diary\n\nThe next night I crept into my brothers room and tied him down again. I taunted him for being such a loser and teased him with my big tits. This time when I pulled down his shorts he was already kind of hard so the taboo must have turned him on too. I sucked his cock til it was rock hard then slid it in my dripping wet pussy. I rode his cock slowly and teased him even more so he would give me another massive load. I turned around and rode his cock hard so he could watch my hot ass bouncing and soon he blew another load in my pussy.\n\nDear Diary\n\nToday was my most fertile day so I have a really good feeling about my plan. This time after I tied my brother down he seemed to be really enjoying the thought of his sister because he was rock hard. I couldn't help myself and had to suck his cock which really got me going. Within minutes I had to get his cock in my wet pussy. His cock felt much harder than it ever had before and soon he was blowing another huge load in my pussy. He came soo much it even leaked back out a bit. I'm sure tonight did the trick.\n\nDear Diary\n\nMy plan worked perfectly it seems since I'm 7 months pregnant and with a DNA test I was able to take my brother for every penny his dad left him. Who's laughing now loser?","torrent":{"xt":"urn:btih:40c7b2f3f78a95c0a0d8ffd051d2ea1ac4d781a3","amp;dn":"Alexis+Grace+-+How+I+Fucked+My+Brother+Taboo+Diaries+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40c7b2f3f78a95c0a0d8ffd051d2ea1ac4d781a3","infoHashBuffer":{"type":"Buffer","data":[64,199,178,243,247,138,149,192,160,216,255,208,81,210,234,26,196,215,129,163]},"announce":[],"urlList":[]}}