{"title":"Gay - Dangerous (1983) [Bijou]","uid":8805144,"size":895841966,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:40d12cb334ca9a5c8283484d1c8ea4e71f27b9d1&amp;dn=Gay+-+Dangerous+%281983%29+%5BBijou%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"urboboho","files":-1,"time":1376268468,"description":"Synopsis\n\nTearooms queens can now rejoice, as this classic early Falcon Studio film (released here by Bijou) is one of the sleaziest &quot;anonymous sex&quot; flicks ever. Sex in public footage, too.\n\n3 Reasons To Buy This Film\n\n* The bathroom stall self-suck is awesome.\n* Directed by Steve Scott, it's one of his &quot;essentials.&quot;\n* Sleazy sleazy sleazy... and yummy yummy yummy.\n\nReview\n\nIn what has become one of the most notorious &quot;gloryhole&quot; flicks ever, director Steve Scott's &quot;Dangerous&quot; is one to keep. The set-up is simple, as a young hunk finds himself drawn to the world of tricking in public - that is, he wants to suck it in public through an anonymous hole in the bathroom stall. I'm sure plenty of you can relate.\n\nThere are some plot developments (involving a couple) that are inconsequential, cuz this one's all about the sex. And the sex here is amazing. Deep-throatings through glory holes in the loo, dildo play, a self-suck-off in a stall that must be seen to gag on (that is, seen to believe) and a jack-off session in full view of the public that made my crotch swell.\n\nMostly blowjobs with a few anal bumpings tossed in (sans rubbers, of course), this thick-n-gooey cum-drenched classic is one to own... and could act as an instruction manual for &quot;How to Be a Tearoom Queen 101&quot;. If you don't know what a tearoom, is ask your &quot;uncle.&quot;\n","torrent":{"xt":"urn:btih:40d12cb334ca9a5c8283484d1c8ea4e71f27b9d1","amp;dn":"Gay+-+Dangerous+%281983%29+%5BBijou%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d12cb334ca9a5c8283484d1c8ea4e71f27b9d1","infoHashBuffer":{"type":"Buffer","data":[64,209,44,179,52,202,154,92,130,131,72,77,28,142,164,231,31,39,185,209]},"announce":[],"urlList":[]}}