{"title":"Peter Brooks - Body Work. Objects of Desire in Modern Narrative ","uid":10143247,"size":17910696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41581330803c7891eb1dbea1888ebd86e7844ba3&amp;dn=Peter+Brooks+-+Body+Work.+Objects+of+Desire+in+Modern+Narrative+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1400027558,"description":"Description\nProduct Details\nBook Title: Body Work: Objects of Desire in Modern Narrative\t\nBook Author: Peter Brooks\nHardcover: 342 pages\nPublisher: Harvard University Press (April 26, 1993)\nLanguage: English\nISBN-10: 0674077245\nISBN-13: 978-0674077249\n\n===================================================================================\nBook Description\nPublication Date: April 26, 1993 | ISBN-10: 0674077245 | ISBN-13: 978-0674077249\nThe desire to know the body is a powerful dynamic of storytelling in all its forms. Peter Brooks argues that modern narrative is intent on uncovering the body in order to expose a truth that must be written in the flesh. In a book that ranges widely through literature and painting, Brooks shows how the imagination strives to bring the body into language and to write stories on the body.\nFrom Rousseau, Balzac, Mary Shelley, and Flaubert, to George Eliot, Zola, Henry James, and Marguerite Duras, from Manet and Gauguin to Mapplethorpe, writers and artists have returned in fascination to the body, the inescapable other of the spirit. Brooks's deep understanding of psychoanalysis informs his demonstration of how the &quot;epistemophilic urge&quot;--the desire to know-guides fictional plots and our reading of them.\nIt is the sexual body that furnishes the building blocks of symbolization, eventually of language itself-which then takes us away from the body. Yet mind and language need to recover the body, as an other realm that is primary to their very definition. Brooks shows how and why the female body has become the field upon which the aspirations, anxieties, and contradictions of a whole society are played out. And he suggests how writers and artists have found in the woman's body the dynamic principle of their storytelling, its motor force.\nThis major book entertains and teaches: Brooks presumes no special knowledge on the part of his readers. His account proceeds chronologically from Rousseau in the eighteenth century forward to contemporary artists and writers. Body Work gives us a set of analytical tools and ideas-primarily from psychoanalysis, narrative and film studies, and feminist theory-that enable us to read modern narrative afresh.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nBrooks (humanities, Yale) focuses mainly on the novel in the 18th and 19th centuries; his interest is the body, primarily the female body as the object of the male gaze and cultural predispositions. Reading Rousseau, Balzac, Flaubert, Zola, Mary Shelley, George Eliot, Henry James, and Marguerite Duras with sensitivity, and always alert to elements that subvert expectations, he places their work in a broad cultural context that includes the nude in painting and in the thought of Freud, Lacan, and Georges Bataille. Especially interesting are his discussions of 19th-century salon nudes and the work of Courbet, Manet, and Gauguin. Curiously, Brooks's remarks on the body in contemporary advertising and the work of Mapplethorpe have less impact, as does his conclusion that &quot;making the body signify--making it the protagonist of stories and the scene of stories--has not ended and will not end.&quot; For informed readers and specialists.\n- Richard Kuczkowski, Dominican Coll., Blauvelt, N.Y.\nCopyright 1993 Reed Business Information, Inc.\n\n===================================================================================\nReview\nA fascinating and most thought-provoking book. (Juliet Mitchell)\n\n===================================================================================\nAbout the Author\nPeter Brooks is Tripp Professor of Humanities at Yale University.\n===================================================================================","torrent":{"xt":"urn:btih:41581330803c7891eb1dbea1888ebd86e7844ba3","amp;dn":"Peter+Brooks+-+Body+Work.+Objects+of+Desire+in+Modern+Narrative+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41581330803c7891eb1dbea1888ebd86e7844ba3","infoHashBuffer":{"type":"Buffer","data":[65,88,19,48,128,60,120,145,235,29,190,161,136,142,189,134,231,132,75,163]},"announce":[],"urlList":[]}}