{"title":"Execution The Discipline of Getting Things Done Bossidy Charan","uid":4834085,"size":478138113,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:419ed3e8d6c132bcb8c6ae4aecfed45f97f36321&amp;dn=Execution+The+Discipline+of+Getting+Things+Done+Bossidy+Charan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"italianPlumber","files":117,"time":1239242729,"description":"EXECUTION: The Discipline of Getting Things Done\nby Larry Bossidy and Ram Charan\n\nRead by Larry Bossidy, Ram Charan, and John Bedford Lloyd\n\n\nAmazon.com review:\nDisciplines like strategy, leadership development, and innovation are the sexier aspects of being at the helm of a successful business; actually getting things done never seems quite as glamorous. But as Larry Bossidy and Ram Charan demonstrate in Execution, the ultimate difference between a company and its competitor is, in fact, the ability to execute.\n\nExecution is &quot;the missing link between aspirations and results,&quot; and as such, making it happen is the business leader's most important job. While failure in today's business environment is often attributed to other causes, Bossidy and Charan argue that the biggest obstacle to success is the absence of execution. They point out that without execution, breakthrough thinking on managing change breaks down, and they emphasize the fact that execution is a discipline to learn, not merely the tactical side of business. Supporting this with stories of the &quot;execution difference&quot; being won (EDS) and lost (Xerox and Lucent), the authors describe the building blocks--leaders with the right behaviors, a culture that rewards execution, and a reliable system for having the right people in the right jobs--that need to be in place to manage the three core business processes of people, strategy, and operations. Both Bossidy, CEO of Honeywell International, Inc., and Charan, advisor to corporate executives and author of such books as What the CEO Wants You to Know and Boards That Work, present experience-tested insight into how the smooth linking of these three processes can differentiate one company from the rest. Developing the discipline of execution isn't made out to be simple, nor is this book a quick, easy read. Bossidy and Charan do, however, offer good advice on a neglected topic, making Execution a smart business leader's guide to enacting success rather than permitting demise. --S. Ketchum","torrent":{"xt":"urn:btih:419ed3e8d6c132bcb8c6ae4aecfed45f97f36321","amp;dn":"Execution+The+Discipline+of+Getting+Things+Done+Bossidy+Charan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"419ed3e8d6c132bcb8c6ae4aecfed45f97f36321","infoHashBuffer":{"type":"Buffer","data":[65,158,211,232,214,193,50,188,184,198,174,74,236,254,212,95,151,243,99,33]},"announce":[],"urlList":[]}}