{"title":"Tiny.Brains-SKIDROW","uid":9380660,"size":1152665401,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:41ebd29a1d3d9cadd2e31f9d642b982ad378a7e9&amp;dn=Tiny.Brains-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1387708795,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nTiny Brains (c) 505 Games\n\n22-12-2013......Release Date - Protection.................Steam\nAction.............Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\n&quot;Tiny Brains&quot; is a cooperative action puzzler that follows four\nsuper-powered lab animals in their attempt to escape a mad scientist's\nexperiments. In this joyously chaotic multiplayer game, the four &quot;Tiny\nBrains&quot; must combine their unique physics-based powers to navigate\nthrough a trick-ridden maze. All of the puzzles in &quot;Tiny Brains&quot; can be\nsolved multiple ways depending on how groups combine their powers. The\ngame has competitive and challenging fast paced communicative play\nalong with simple controls so players of any level can jump right in.\n\nFeatures:\n\nCooperative Gaming: Tiny Brains requires players to collaborate and\nput their heads together to overcome physics-based obstacles. With\neach player controlling a different superpower  Create, Force,\nVortex and Teleport  the Tiny Brains must work as a team to move\nforward and escape the scientists deadly labyrinth of mazes.\n\nPlay It Your Way: All of the puzzles in Tiny Brains can be solved\nmultiple ways depending on how groups combine their powers. The co-op\nlevel design creates dynamic, emergent gameplay, whether advancing\nthrough the campaign mode, beating time-based challenges, or competing\nin endless levels.\n\nWhimsical World: To escape the mad scientists lair, players explore a\ncolorful world of Popsicle stick-like ice pops, duct tape, tiny cages\nand Rube Goldberg machines. The zany art style gives rise to a slew of\nslightly mutated, yet oddly cute, playable characters.\n\nHardcore to Casual: Tiny Brains eggs on hardcore gamers with\ncompetitive leaderboards and fast-paced communicative play, challenging\nthem to combine their powers as efficiently as possible. At the same\ntime, the game has simple controls and physics-based mechanics that\nmake it easy for casual and less-experienced gamers to jump right in.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nUse Launcher.exe, included with the cracked content, for setting the\nlanguage of your choice.\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:41ebd29a1d3d9cadd2e31f9d642b982ad378a7e9","amp;dn":"Tiny.Brains-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41ebd29a1d3d9cadd2e31f9d642b982ad378a7e9","infoHashBuffer":{"type":"Buffer","data":[65,235,210,154,29,61,156,173,210,227,31,157,100,43,152,42,211,120,167,233]},"announce":[],"urlList":[]}}