{"title":"The Oxford Book of Victorian Ghost Stories - Michael Cox","uid":9373186,"size":525939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41f93c1621075db50eb192f1663a6d57b3f5dc1f&amp;dn=The+Oxford+Book+of+Victorian+Ghost+Stories+-+Michael+Cox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387567659,"description":"The Victorians excelled at telling ghost stories. In an age of rapid scientific progress, the idea of a vindictive past able to reach out and violate the present held a special potential for terror. Throughout the nineteenth century, fictional ghost stories developed in parallel with the more general Victorian fascination with death and what lay beyond it. Though they were as much a part of the cultural and literary fabric of the age as imperial confidence, the best of the stories still retain their original power to surprise and unsettle. In Victorian Ghost Stories, the editors map out the development of the ghost story from 1850 to the early years of the twentieth century and demonstrate the importance of this form of short fiction in Victorian popular culture. As well as reprinting stories by supernatural specialists such as J. S. Le Fanu and M. R. James, this selection emphasizes the key role played by women writers-including Elizabeth Gaskell, Rhoda Broughton, and Charlotte Riddell-and offers one or two genuine rarities. Other writers represented include Charles Dickens, Henry James, Wilkie Collins, Sir Arthur Conan Doyle, and R. L. Stevenson. There is also a fascinating Introduction and a chronological list of ghost story collections from 1850 to 1910.","torrent":{"xt":"urn:btih:41f93c1621075db50eb192f1663a6d57b3f5dc1f","amp;dn":"The+Oxford+Book+of+Victorian+Ghost+Stories+-+Michael+Cox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f93c1621075db50eb192f1663a6d57b3f5dc1f","infoHashBuffer":{"type":"Buffer","data":[65,249,60,22,33,7,93,181,14,177,146,241,102,58,109,87,179,245,220,31]},"announce":[],"urlList":[]}}