{"title":"Ott - Skylon 2008 (FLAC)","uid":4082099,"size":457172351,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4294f21cf5bde38398a953ed35970750da0bfa12&amp;dn=Ott+-+Skylon+2008+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MUSIKKA","files":6,"time":1205610808,"description":"OTT has done it again!\n\nE N J O Y\n\n\nAfter 5 years of hiding in the west-country since his last album, musical oddity Ott gives...\n\n...Twisted Records his second solo offering under the name &amp;#039;Skylon&amp;#039;. In the last 5 years, the improvements in software and hardware have given maestro&amp;#039;s like Ott even more scope to toy with and more quality in the results. A fresh bag of tricks you might say! You can expect unique modern electro-acoustic dubs with generous spatterings of indigenous sounds from around the world ladled into the mix. But that&amp;#039;s not all, there are a few tracks straying beautifully into different genres whilst maintaining the laid back but up beat dub vibe that we know and love.\n\nAdd that to the usual mind-blowing production, arrangement, song writing skills and jaw-dropping effects combos and you&amp;#039;ve got a sonic feast emanating from your speakers. His use of melody is perfectly balanced between too much and too little, creating a saturated but not overwhelming wall of emotive sound. We&amp;#039;ve said it before and we&amp;#039;ll say it again, the man is a genius.\n\nOtt is no stranger to the studio, he has produced, arranged and recorded for world famous artists including Sinead O&amp;#039;Connor, The Orb, and Brian Eno. Working in a wide range of the best studios in the UK from Butterfly Studios, Sarm East and West, Real World, and Ridge Farm to Foel in Wales. He has been interviewed in the producers/engineers bible Sound on Sound for his studio wits and wisdoms. Highly regarded by music moguls such as Greg Hunter, Simon Posford, Martin &amp;#039;Youth&amp;#039; Glover and many more, this second album from him will merely reinforce his status as a leader in art of modern music.\n\nHis debut album Blumenkraft was a huge success and spawned a massive following amongst listeners and producers alike. Skylon will undoubtedly gather more fans worldwide\n\nStyle: Psytrance\n\n\n1. From Trunch To Stromness\n  \n \n2. The Queen Of All Everything\n  \n \n3. Rogue Bagel\n  \n \n4. Daisies And Rubies\n  \n \n5. Signals From Bob\n  \n \n6. 382 Seaside\n  \n \n7. Rolfcopter\n  \n \n8. A Shower Of Sparks\n\n ","torrent":{"xt":"urn:btih:4294f21cf5bde38398a953ed35970750da0bfa12","amp;dn":"Ott+-+Skylon+2008+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4294f21cf5bde38398a953ed35970750da0bfa12","infoHashBuffer":{"type":"Buffer","data":[66,148,242,28,245,189,227,131,152,169,83,237,53,151,7,80,218,11,250,18]},"announce":[],"urlList":[]}}