{"title":"The Physicist &amp; The Philosopher - Jimena Canales","uid":12015644,"size":2888647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42a09ce1c2ab7b200d07f4165f22845b6e599f24&amp;dn=The+Physicist+%26amp%3B+The+Philosopher+-+Jimena+Canales&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434301322,"description":"On April 6, 1922, in Paris, Albert Einstein and Henri Bergson publicly debated the nature of time. Einstein considered Bergson's theory of time to be a soft, psychological notion, irreconcilable with the quantitative realities of physics. Bergson, who gained fame as a philosopher by arguing that time should not be understood exclusively through the lens of science, criticized Einstein's theory of time for being a metaphysics grafted on to science, one that ignored the intuitive aspects of time. The Physicist and the Philosopher tells the remarkable story of how this explosive debate transformed our understanding of time and drove a rift between science and the humanities that persists today.\n\nJimena Canales introduces readers to the revolutionary ideas of Einstein and Bergson, describes how they dramatically collided in Paris, and traces how this clash of worldviews reverberated across the twentieth century. She shows how it provoked responses from figures such as Bertrand Russell and Martin Heidegger, and carried repercussions for American pragmatism, logical positivism, phenomenology, and quantum mechanics. Canales explains how the new technologies of the period--such as wristwatches, radio, and film--helped to shape people's conceptions of time and further polarized the public debate. She also discusses how Bergson and Einstein, toward the end of their lives, each reflected on his rival's legacy--Bergson during the Nazi occupation of Paris and Einstein in the context of the first hydrogen bomb explosion.\n\nThe Physicist and the Philosopher reveals how scientific truth was placed on trial in a divided century marked by a new sense of time","torrent":{"xt":"urn:btih:42a09ce1c2ab7b200d07f4165f22845b6e599f24","amp;dn":"The+Physicist+%26amp%3B+The+Philosopher+-+Jimena+Canales","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a09ce1c2ab7b200d07f4165f22845b6e599f24","infoHashBuffer":{"type":"Buffer","data":[66,160,156,225,194,171,123,32,13,7,244,22,95,34,132,91,110,89,159,36]},"announce":[],"urlList":[]}}