{"title":"Apress - PHP for Absolute Beginners (2009)","uid":5178847,"size":10052683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:430b132491d659347e3ec3bd8f390daad1a77e99&amp;dn=Apress+-+PHP+for+Absolute+Beginners+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"paul26r","files":1,"time":1259121989,"description":"Product Description\n\nGet started in web development using PHP. Even if you've never programmed before, author Jason Lengstorf introduces you to PHP by building a PHP-based blogging site while covering all the good coding practices and skills that you'll need when you start your own projects.\nCreate web content with version 5.3 of PHP\nLearn good coding practices from the very beginning\nLearn how systems like WordPress work\n\nJason Lengstorf takes a practical approach to teaching you how to build a content management system. You'll dive into writing web applications and be guided by the author's supportive explanations, rather than learning elements of the PHP language and viewing examples after.\n\nPHP for Absolute Beginners starts slowly and covers everything you need to know about beginning web development using PHP. Even the most inexperienced web developer will find this book accessible.\nWhat you'll learn\nInstall Apache, MySQL, and PHP\nNavigate the PHP language\nLearn the basics of writing clean code\nTalk to a database\nMake a PHP site more secure\nCreate a complete blogging site\n\nWho is this book for?\n\nPHP for Absolute Beginners is written for the complete novice; no previous coding knowledge is assumed, and all concepts are explained to ensure maximum understanding.\n\nHowever, later chapters in the book may appeal to intermediate programmers looking to improve their abilities in the area of developing content management systems or those interested in making the move from procedural code to the more modular object-oriented approach.\n\n\nAbout the Author\n\nJason Lengstorf is a software designer and developer based in Missoula, MT. As the owner of Ennui Design, he specializes in creating custom web applications, ranging from simple informational web sites to full-fledged content management systems. When not glued to his keyboard, he's likely standing in line for coffee, shopping for cowboy shirts, or pretending to know something about wine.\nProduct Details\nPaperback: 400 pages\nPublisher: Apress (September 25, 2009)\nLanguage: English\nISBN-10: 1430224738\nISBN-13: 978-1430224730","torrent":{"xt":"urn:btih:430b132491d659347e3ec3bd8f390daad1a77e99","amp;dn":"Apress+-+PHP+for+Absolute+Beginners+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430b132491d659347e3ec3bd8f390daad1a77e99","infoHashBuffer":{"type":"Buffer","data":[67,11,19,36,145,214,89,52,126,62,195,189,143,57,13,170,209,167,126,153]},"announce":[],"urlList":[]}}