{"title":"Namco X Capcom [NTSC-J] (English Patched), Ps2","uid":5057754,"size":1131607772,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:43144fa3d3a13672be320f4b5f3c6ee887ec18d1&amp;dn=Namco+X+Capcom+%5BNTSC-J%5D+%28English+Patched%29%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Big_dude","files":-1,"time":1250514283,"description":"Namco X Capcom (In English) for the Ps2             Original Rel. 05/26/2005       \n\n      \nFormat:        DVD5 NTSC-J (Eng. Patched)\nLang:          English\nDiscs:         1\nImage:         MDS/ISO\nGenre:         RPG\nOrigin:        Japan-Import\nRequirements:  Modded/Chipped Ps2, or Swap Magic Disc Method.\n\n\nCompressed with WinRar, game was tested and works. \n\n(Took a couple trys but plays fine).\n\nTry 7zip its free google it, if don't have WinRar.\n\n\nRelease Notes: Namco X Capcom is a great &amp; unique RPG PS2 Import Game...But it's \n               hard to play it if you don't understand the Japanese language. So  \n               thankfully the good boys known as TransGen created an english patch\n               so the rest of use could finally enjoy this game. The game has  \n               already been pre-patched with 'Namco X Capcom Patch Final Version A \n               Beta'. Most of the bugs have been worked out on this one, if you \n               discover any report them to transgen.890m.com.  \n\nIn the beginning anime cutscene I got some pauses but their were minor could be just from me I don't know, it seemed it was the disc loading but this is just a small thing the video anime and the main game is fine. You may not encounter any cutscene problems at all though.\n\n(You could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n       &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n       &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n      &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with \n\nESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nSet in the year 20XX, a space-time distortion dubbed &quot;Yurigi&quot; has been appearing throughout the world. Join Reiji and Shaomu, members of the Shinra organization as they attempt to solve the mysteries of the Yurigi distortions and the paths it creates into the alternate Namco and Capcom worlds.\n\nGameplay is traditional SRPG fare. A squad of units is placed on an isometric battlefield where they battle against an AI-controlled squad of units. The quirk here lies in the battles that take place when units attack each other. At this point, the game switches to a 2D-side view reminiscent of classic fighting games. Here, using menu commands and fighting-game style button inputs, battles take place between the two units. Special moves and combos unique to each character are available and are often showcased with hand-drawn artwork of the characters.\n\n\nGame Pics included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim Or use Tayio Yuden DVD+R or DVD-R Media.\n\nUsing any other media might not work at all.\n\nIf using DVD+R then booktype to DVD-ROM.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:43144fa3d3a13672be320f4b5f3c6ee887ec18d1","amp;dn":"Namco+X+Capcom+%5BNTSC-J%5D+%28English+Patched%29%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43144fa3d3a13672be320f4b5f3c6ee887ec18d1","infoHashBuffer":{"type":"Buffer","data":[67,20,79,163,211,161,54,114,190,50,15,75,95,60,110,232,135,236,24,209]},"announce":[],"urlList":[]}}