{"title":"Jia Zhangke - The World (2004)","uid":3786746,"size":736386225,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4373d13c00098d8aee4a344c5ee04e9c42fd15a6&amp;dn=Jia+Zhangke+-+The+World+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clownmonkey","files":4,"time":1188282999,"description":"Like Jia Zhangke&amp;#039;s previous features Xiao Wu, Platform, and Unknown Pleasures, his latest, The World, is populated by young people on the far side of Mao&amp;#039;s &quot;cultural revolution,&quot; now so accustomed to Western materialism that they rarely notice its effects. Most of the characters in The World work at Beijing&amp;#039;s EPCOT-like World Park, surrounded by replicas of the Great Pyramids and the Golden Gate Bridge. Off work, they live in virtual squalor, crammed into apartments in the industrial quarter, where they wash out their uniforms in dank public bathrooms. When a jet roars overhead, one remarks that she &quot;doesn&amp;#039;t know anybody who&amp;#039;s ever been on a plane,&quot; and when one of the park&amp;#039;s dancers gets married, her colleagues raise an ironic toast to &quot;world peace, women&amp;#039;s rights, and faces without freckles.&quot;\n\nJia spends much of The World on an irony-hunt. Long a devotee of extended takes at medium distances, he has the World Park&amp;#039;s miniature landmarks and artificial environments to work with. At one point, a guard shows off the park&amp;#039;s mini-Manhattan to a visiting relative, saying, &quot;The Twin Towers were bombed on Sept. 11, but we still have them.&quot; Later, after a dancer notes that it hasn&amp;#039;t snowed all winter, she takes the stage to a shower of phony white powder. Jia enhances his poly-global fantasy with animated interludes and dance sequences that run the gamut from traditional pageantry to sexy grinding.\n\nBut the setpieces and visual grace notes don&amp;#039;t support a compelling story. The World&amp;#039;s dull weave of frustrated romances and worker exploitation is far too obvious, and Jia can only relieve the tedium so many times with lines like &quot;There&amp;#039;s the London Bridge I was telling you about.&quot; He doesn&amp;#039;t do nearly enough with the multicultural atmosphere of modern Beijing, or the different ethnic roles of the World Park. So one man wears an earring &quot;just like on TV,&quot; and one group of women has a Titanic poster on their wall... so what?\n\nThe truer social comments in The World are subtler, like Jia&amp;#039;s depiction of a designer knockoff sweatshop cluttered with decidedly non-Asian mannequins and fashion-magazine layouts, and like the scene where a tourist admires how much the World Park&amp;#039;s Eiffel Tower &quot;looks like the real one,&quot; before admitting that he&amp;#039;s never been to Paris. That&amp;#039;s one condition of modern life that Jia gets exactly right: the way that so many people assume they know a culture because they&amp;#039;ve seen the pictures.\n- Noel Murray, The Onion AV Club &lt;a href=&quot;\nhttp://www.avclub.com/content/node/73&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avclub.com/content/node/73&lt;/a&gt;\n\nFor a less enervated comment, read Jonathan Rosenbaum&amp;#039;s review of &quot;The World,&quot; which he called the best movie of 2005.  &lt;a href=&quot;\nhttp://www.chicagoreader.com/movies/archives/2005/0705/050729.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.chicagoreader.com/movies/archives/2005/0705/050729.html&lt;/a&gt;\n\n--- File Information ---\nFile Size (in bytes): 736,321,536\n\n--- Container Information ---\nBase Type (e.g &quot;AVI&quot;): AVI(.AVI)\nSubtype (e.g &quot;OpenDML&quot;): OpenDML (AVI v2.0),\nInterleave (in ms): 42\nPreload (in ms): 504\nAudio alignment(&quot;split across interleaves&quot;): Aligned\nTotal System Bitrate (kbps): 0\nBytes Missing (if any): 0\nNumber of Audio Streams: 1\n\n--- Video Information ---\nVideo Codec Type(e.g. &quot;DIV3&quot;): xvid\nDuration (hh:mm:ss): 02:19:47\nFrame Count: 201081\nFrame Width (pixels): 608\nFrame Height (pixels): 272\nDisplay Aspect Ratio (&quot;DAR&quot;): 2.235\nFrames Per Second: 29.97\nVideo Bitrate (kbps): 645\nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;): MPEG-4\nB-VOP (&quot;B-VOP&quot; or &quot;&quot;): B-VOP\n\n--- Audio Information ---\nAudio Codec (e.g. &quot;AC3&quot;): 0x0055(MP3, ISO) MPEG-1 Layer 3\nAudio Sample Rate (Hz): 48000\nAudio Bitrate(kbps): 107\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;): VBR\nAudio Channel Count (e.g. &quot;2&quot; for stereo): 2\n\n*********************************** FREAKYFLICKS***********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039; ","torrent":{"xt":"urn:btih:4373d13c00098d8aee4a344c5ee04e9c42fd15a6","amp;dn":"Jia+Zhangke+-+The+World+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4373d13c00098d8aee4a344c5ee04e9c42fd15a6","infoHashBuffer":{"type":"Buffer","data":[67,115,209,60,0,9,141,138,238,74,52,76,94,224,78,156,66,253,21,166]},"announce":[],"urlList":[]}}