{"title":"Educator.com - AP Physics C with Professor Jishi","uid":9537501,"size":10338769418,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4425c8d0e4f3166603d6e6a4b96add3c2dc65e77&amp;dn=Educator.com+-+AP+Physics+C+with+Professor+Jishi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"indiaman","files":71,"time":1390958144,"description":"Physics is often considered the most fundamental of all the natural sciences and its theories attempt to explain the behavior of the smallest building blocks of matter, the universe, and everything in between. Understanding how the universe works may sound overwhelming, but AP Physics is only hard if you do not have the right guidance. AP Physics C is Calculus based and Dr. Jishi makes sure students fully understand the more complicated mathematics with a multitude of clearly explained examples. High school students planning to ace the Advanced Placement exam are not the only ones who will find this course easy to understand and extremely helpful. College students studying physics will also benefit from this course, since the lessons offer detailed explanations and plenty of comprehensive extra examples. Professor Jishi earned his Ph.D from the Massachusetts Institute of Technology, published over 60+ papers in peer-reviewed journals, and has been teaching for over 20 years. Dr. Radi Jishi continues helping students master Electricity and Magnetism with his AP Physics C course. Building on previous concepts, Professor Jishi guides you through complex physics problems and prepares you for the Calculus based physics of the Advanced Placement test. \n\n\nMechanics - total length, 48:11\nElectricity and Magnetism - total length, 41:08","torrent":{"xt":"urn:btih:4425c8d0e4f3166603d6e6a4b96add3c2dc65e77","amp;dn":"Educator.com+-+AP+Physics+C+with+Professor+Jishi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4425c8d0e4f3166603d6e6a4b96add3c2dc65e77","infoHashBuffer":{"type":"Buffer","data":[68,37,200,208,228,243,22,102,3,214,230,164,185,106,221,60,45,198,94,119]},"announce":[],"urlList":[]}}