{"title":"InfiniteSkills Learning iOS Programming","uid":8708854,"size":1443285827,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:444a03cf17614d3976d59708fc6a6aa64574b7e2&amp;dn=InfiniteSkills+Learning+iOS+Programming&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"EliteBeast","files":-1,"time":1374191643,"description":"Duration 8 hours mp4\n\nIn this iOS Programming video based training course expert developer and trainer Bob McCune teaches you how to build iOS apps using the iOS SDK from Apple. iOS is the standard SDK (software development kit) for iPad, iPhone and iPad devices. Using the SDK, Bob walks you through creating a fully functional app, and applying the tools and techniques available to you.\n\nYou start by accessing, downloading and setting up the SDK from Apple. Next, you will explore and setup Xcode to build your App. You will cover essential Objective-C topics, such as classes, methods, building objects, and coding conventions. Jumping right into development, you will work with strings, controllers, manage application data, create views and other UI elements, and work with iCloud. You will learn how to create a universal project, and create specific interfaces for each device.\n\nBy the completion of this software training course for iOS Programming, you will be familiar with the tools and techniques available to you to create iOS applications for iPad, iPhone and iPod. Working files are included to allow you to work alongside the author as he teaches you how to use the iOS SDK in this video tutorial.\n\n98 videos + project files","torrent":{"xt":"urn:btih:444a03cf17614d3976d59708fc6a6aa64574b7e2","amp;dn":"InfiniteSkills+Learning+iOS+Programming","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"444a03cf17614d3976d59708fc6a6aa64574b7e2","infoHashBuffer":{"type":"Buffer","data":[68,74,3,207,23,97,77,57,118,213,151,8,252,106,106,166,69,116,183,226]},"announce":[],"urlList":[]}}