{"title":"The Upperfloor--tUF-38486 Ashley Adams and John Strong Med Pics","uid":12270343,"size":429048890,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:44a7286a9f29df1a9dad8bab31ea8540b5658fa7&amp;dn=The+Upperfloor--tUF-38486+Ashley+Adams+and+John+Strong+Med+Pics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"merzedes","files":90,"time":1440287104,"description":"Fresh 19 Year Old Tied Tight and Made to Serve Orgy\n\nAug 21, 2015 - Performers: John Strong  and  Ashley Adams \n\n\nMed MP4 + Pics.\n\n\nAshley Adams is everything The Upper Floor could hope for in a trainee slave: big bouncy natural tits, sexual hunger, a willingness to learn, and a perfect ass. However, this little slut cannot learn the rules to save her own hide! \n\nThe first scene she is has her fresh young pussy lashed to the sybian vibrator and is grilled by some of our sadistic female guests on the rules. The Steward is roundly humiliated as trainee Adams tries to get out her predicament by bouncing her juicy tits and sucking cock, but it's not enough and she is made to have screaming punishment orgasms and has her sensitive nipples tormented with electricity and clamps with the hope that the pain will help her remember. \n\nWhen the party moves to the lounge the guests show us the meaning of orgy, covering the furniture with a wild BDSM sex free for all. In the midst of all this sex, Ashley is put in her first suspension ever and handed over to two of our finest slaves from the first days of TUF: Nerine and Iona. These women stalk Ashley like cats of prey, beating her tender flesh and teasing her trapped pussy with a vibrator. In the end, Ashley fails once again to remember the rules and is hit many times with the cattle prod while she writhes in the air and begs for mercy. \n\nIt's time to break out the big guns, and our guest of honor John Strong is called in to feed Ashley some positive reinforcement in the form of a hard fucking in the stocks while The Steward applies some painful clamps and a few instructions of how to remember the rules. This mix seems to do the trick, and Ashley finally can recite the rules and follow them while having her 19 year old pussy mercilessly fucked. \n\nAfter so much embarrassment for the House, The Steward puts Ashley in a strict cowgirl and burns her sweet young thighs out as she sweats and works for every orgasm. If there is a perfect vision of desperation to please, it is the visage of this young lady by the end of the day: Sweating, eyes wide, slutty mouth open, tits bouncing, and pussy full of cock, begging to cum. Well Done Ashley!\n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/38486-John-Strong-Ashley-Adams.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/38486-John-Strong-Ashley-Adams.html&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n18 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers :-)","torrent":{"xt":"urn:btih:44a7286a9f29df1a9dad8bab31ea8540b5658fa7","amp;dn":"The+Upperfloor--tUF-38486+Ashley+Adams+and+John+Strong+Med+Pics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a7286a9f29df1a9dad8bab31ea8540b5658fa7","infoHashBuffer":{"type":"Buffer","data":[68,167,40,106,159,41,223,26,157,173,139,171,49,234,133,64,181,101,143,167]},"announce":[],"urlList":[]}}