{"title":"Petrus Romanus - Tom Horn","uid":10333127,"size":7475026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44df0637d5d096a7779bc9e1c5936857c9608a29&amp;dn=Petrus+Romanus+-+Tom+Horn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":2,"time":1402436028,"description":"For more than 800 years scholars have pointed to the dark augury having to do with &quot;the last Pope.&quot; The prophecy, taken from St. Malachy's &quot;Prophecy of the Popes,&quot; is among a list of verses predicting each of the Roman Catholic popes from Pope Celestine II to the final pope, &quot;Peter the Roman,&quot; whose reign would end in the destruction of Rome.\n\nFirst published in 1595, the prophecies were attributed to St. Malachy by a Benedictine historian named Arnold de Wyon, who recorded them in his book, Lignum Vitf. Tradition holds that Malachy had been called to Rome by Pope Innocent II, and while there, he experienced the vision of the future popes, including the last one, which he wrote down in a series of cryptic phrases. According to the prophecy, the next pope (following Benedict XVI) is to be the final pontiff, Petrus Romanus or Peter the Roman.\n\nThe idea by some Catholics that the next pope on St. Malachy's list heralds the beginning of &quot;great apostasy&quot; followed by &quot;great tribulation&quot; sets the stage for the imminent unfolding of apocalyptic events, something many non-Catholics would agree with. This would give rise to a false prophet, who according to the book of Revelation leads the world's religious communities into embracing a political leader known as Antichrist. In recent history, several Catholic priests--some deceased now--have been surprisingly outspoken on what they have seen as this inevitable danger rising from within the ranks of Catholicism as a result of secret satanic &quot;Illuminati-Masonic&quot; influences.\n\nThese priests claim secret knowledge of an multinational power elite and occult hierarchy operating behind supranatural and global political machinations. Among this secret society are sinister false Catholic infiltrators who understand that, as the Roman Catholic Church represents one-sixth of the world's population and over half of all Christians, it is indispensable for controlling future global elements in matters of church and state and the fulfillment of a diabolical plan they call &quot;Alta Vendita,&quot; which is set to assume control of the papacy and to help the False Prophet deceive the world's faithful (including Catholics) into worshipping Antichrist. As stated by Dr. Michael Lake on the front cover, Catholic and evangelical scholars have dreaded this moment for centuries. Unfortunately, as readers will learn, time for avoiding Peter the Roman just ran out.\n\n\nAbout the author:\nTom Horn is an internationally recognized lecturer, radio host and best selling author of several books including his newest books, Petrus Romanus: The Final Pope Is Here, Forbidden Gates and Apollyon Rising 2012. He is a well-known columnist whose articles have been referred to by writers of the L. A. Times Syndicate, MSNBC, Christianity Today, New Man Magazine, World Net Daily, News Max, White House Correspondents and dozens of newsmagazines and press agencies around the globe. He has been interviewed by US Congressmen and Senators on his findings as well as featured repeatedly in major media including top-ten talk shows, America's Morning News for The Washington Times, The 700 Club, The Harvest Show, Coast to Coast AM, Prophecy in the News, and the Southwest Radio Church to name a few. Thomas received the highest degree honorary doctorate bestowed in 2007 from legendary professor Dr. I.D.E. Thomas for his research into ancient history, and has been endorsed by such national leaders as Dr. James Kennedy.","torrent":{"xt":"urn:btih:44df0637d5d096a7779bc9e1c5936857c9608a29","amp;dn":"Petrus+Romanus+-+Tom+Horn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44df0637d5d096a7779bc9e1c5936857c9608a29","infoHashBuffer":{"type":"Buffer","data":[68,223,6,55,213,208,150,167,119,155,201,225,197,147,104,87,201,96,138,41]},"announce":[],"urlList":[]}}