{"title":"DreamScape V.2.5 for 3ds Max 2013","uid":8636418,"size":36620122,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:44fe0a87b3ac3393fe33e67c36f4c8dcfd13193e&amp;dn=DreamScape+V.2.5+for+3ds+Max+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"samar2an","files":-1,"time":1372762879,"description":"DreamScape v.2.5 for 3D Studio Max 2013 Win 64\n\n\nDreamScape is sophisticated set of 3DS MAX plug-ins for creating and rendering realistic landscapes, seascapes, skies, clouds, outdoor lighting and more. In contrast to other terrain creation tools for 3DS MAX, DreamScape Terra uses new rendering technologies that occupy much less of your computers memory (RAM) making it possible to render large detailed terrains on even a modest system. An intuitive and friendly user interface will allow you to easily tweak terrain properties, interactively paint elevation, and even to apply erosion effects. We have created an API for those who would like to create custom filters for terrain processing and modification. DreamScape's Terra also allows importing standard DEM, SDTS and Terragen files. The possibilities are unlimited.\n\nDreamScape's Sea Material is here to help you render very realistic sea surfaces including reflections, refractions, bump mapping, foam and underwater scenery. Sea Material is applied to the SeaSurface object that is powered by advanced FOV-based mesh creation algorithms. By using this method it is possible to render huge seascapes that are 'RAM friendly' as well. SeaSurface can create realistic water patterns and motion based on the oceanographic studies and observations. If you need powerful and affordable tool for creating &quot;&quot;real world&quot;&quot; environments, DreamScape is the right choice.\n\n\nDreamScape package includes several plug-in types:\n* DreamScape atmospherics (Daylight, Sky, 2D/3D Clouds, Rainbow)\n* DreamScape SubSurface atmospherics (realistic underwater scenery)\n* SunLight (raytrace shadows, area shadows)\n* Terra object ('virtual polygon' rendering - low memory and fast, easy SDK for terrain filters, MAX Script support) + advanced terra editor\n* Terrain material and texmap (apply different materials and texmaps based on elevation and/or slope)\n* SeaSurface object (optimized mesh, advanced waves generator, foam generator, support for DS Daemons)\n* Sea Material (reflect, refract, glittering)\n* Composite texmap\n* Noise texmap (many noise types with advanced control inside one texmap)\n* Dynamics Daemon for dynamics simulation, including wakes, reflected/refracted waves, automatic foam creation and more.\n\n\nHome: http://www.afterworks.com/DreamScape/Overview.asp","torrent":{"xt":"urn:btih:44fe0a87b3ac3393fe33e67c36f4c8dcfd13193e","amp;dn":"DreamScape+V.2.5+for+3ds+Max+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44fe0a87b3ac3393fe33e67c36f4c8dcfd13193e","infoHashBuffer":{"type":"Buffer","data":[68,254,10,135,179,172,51,147,254,51,230,124,54,244,200,220,253,19,25,62]},"announce":[],"urlList":[]}}