{"title":"World War II Winter and Mountain Warfare Tactics (Osprey Elite 1","uid":8759869,"size":10766498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45c1fcdc18dd9efe59e5853ab157991c0688d5aa&amp;dn=World+War+II+Winter+and+Mountain+Warfare+Tactics+%28Osprey+Elite+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1375224430,"description":"Although prolonged warfare in subzero temperatures and/or at high altitude had occurred from time to time before 1900, the twentieth century saw an unprecedented emphasis on fighting in all terrains, seasons and weather conditions. Such conditions made even basic survival difficult as subzero temperatures caused weapons to jam, engines to seize up and soldiers to suffer frostbite, snow blindness and hypothermia; even the hardiest, best-equipped troops found defending their positions very difficult, let alone conducting offensive operations. The conditions often favoured small groups of mobile, lightly armed soldiers, rather than the armoured forces or air power that dominated other combat environments.\n\nSome European armies developed small numbers of specialist alpine troops before and during World War I, but these proved to be insufficient as nearly all the major combatants of World War II found themselves fighting for extended periods in extremely hostile cold-weather and/or alpine environments. Some, like the German forces invading the USSR in 1941, were - apart from a few specialist formations - poorly equipped and trained for the unique difficulties imposed by such conditions, and were initially forced to improvise. Others, such as the Finns in the Winter War of 1939-40, outclassed their Soviet opponents with their mobility (many soldiers were already competent skiers at the outbreak of war), marksmanship, bold initiative and decisive leadership.","torrent":{"xt":"urn:btih:45c1fcdc18dd9efe59e5853ab157991c0688d5aa","amp;dn":"World+War+II+Winter+and+Mountain+Warfare+Tactics+%28Osprey+Elite+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45c1fcdc18dd9efe59e5853ab157991c0688d5aa","infoHashBuffer":{"type":"Buffer","data":[69,193,252,220,24,221,158,254,89,229,133,58,177,87,153,28,6,136,213,170]},"announce":[],"urlList":[]}}