{"title":"Danny Brown - Old (2013) [FLAC]","uid":9023535,"size":411273952,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:45dcb8897e13f63a364e898571b43ecd2c27107f&amp;dn=Danny+Brown+-+Old+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1381319960,"description":"\n  Danny Brown - Old (2013) [FLAC]\n\n  Genre: Hip-Hop\n  Style: Alternative Rap\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Side A (Old)\n  02 The Return (Feat. Freddie Gibbs)\n  03 25 Bucks (Feat. Purity Ring)\n  04 Wonderbread\n  05 Gremlins\n  06 Dope Fiend Rental (Feat. ScHoolboy Q)\n  07 Torture\n  08 Lonely\n  09 Clean Up\n  10 Red 2 Go\n  11 Side B (Dope Song)\n  12 Dubstep (Feat. Scrufizzer)\n  13 Dip\n  14 Smokin &amp; Drinkin\n  15 Break It (Go)\n  16 Handstand\n  17 Way Up Here (Feat. Ab-Soul)\n  18 Kush Coma (Feat. A$AP Rocky &amp; Zelooperz)\n  19 Float On (Feat. Charli XCX)\n\n  Dubbed the Hybrid as soon as he came onto the scene, Detroit rapper Danny Brown offered manic and mighty hype tracks (with his patented and chirpy &quot;high voice&quot;) along with deeper, more meaningful tales of the hood (delivered in his &quot;low voice&quot;). That nickname also became the title of a 2010 street release, but it would have been better saved for this, as Old hits the golden ratio of Brown's bonkers and brilliance. Dividing the release in golden age vinyl style, &quot;Side A (Old)&quot; kicks things off with the throwback rhyme &quot;Got my young, light skin rollin' up the trees/Wearin' jackets in the house, it's the Michigan way&quot; as the MTV regular and Scion A/V-sponsored star is transported back to his early days for an album's side worth of tracks. Freddie Gibbs fits perfectly on &quot;The Return,&quot; which plays up Brown's concept of a throwback album, while the thoroughly modern production and guest appearance of Purity Ring messes with time as Brown gets posted on the corner with old friends and old enemies. \n\n  With the over-the-top and infectious &quot;Wonderbread&quot; hitting full hype, &quot;Lonely&quot; doing the Kid Cudi thing with weed offering spacemen relief, &quot;Gremlins&quot; connecting the dots between old Detroit and Earl Sweatshirt's Doris, plus the great &quot;Torture&quot; finding producer Oh No modernizing the Diplomats sound for Brown's enjoyment, &quot;side one&quot; already equals an excellent LP, and the futuristic, post-XXX-minded &quot;side two&quot; does not disappoint. Great things happen as &quot;Dubstep&quot; borrows the genre's name and then attacks it with wit and glitch, &quot;Dip&quot; displays why he's the wit-lovers rapper with one drop of &quot;Like Lieutenant Dan, I'm rollin',&quot; then an album-ending trilogy brings Ab-Soul, A$AP Rocky, and Charli XCX aboard for a series of cuts that are more than the sum of their parts. The album's title -- which flows perfectly after his 2012 single &quot;Grown Up&quot; -- is referenced on the Charli XCX track when &quot;Float On&quot; finds Brown wondering how hip-hop will see his work once he's old, but with other lines like &quot;Music in my heart, but my thoughts wouldn't listen&quot; and &quot;I'm tormented with the things I've seen with these eyes,&quot; he need not fret. Luckily, he does, and while Old often seems like a hip-hop kaleidoscope exploding across the speakers, it's also crafted and paced, split down the middle like a great LP with a sure start and a freeing finish. If XXX was the come-up and the &quot;Grown Up&quot; single was the breakthrough, this is the masterpiece.","torrent":{"xt":"urn:btih:45dcb8897e13f63a364e898571b43ecd2c27107f","amp;dn":"Danny+Brown+-+Old+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45dcb8897e13f63a364e898571b43ecd2c27107f","infoHashBuffer":{"type":"Buffer","data":[69,220,184,137,126,19,246,58,54,78,137,133,113,180,62,205,44,39,16,127]},"announce":[],"urlList":[]}}