{"title":"(PSX-PSP) Need for Speed 1-3 converted properly (Kingdom-games b","uid":4711722,"size":1250393071,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:461419035c79bc9066ad20a8225d69db5f5be07d&amp;dn=%28PSX-PSP%29+Need+for+Speed+1-3+converted+properly+%28Kingdom-games+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":4,"time":1234049500,"description":"NEED FOR SPEED:\n\nRace the world's most exciting supercars, each modeled after its real-life counterpart on six challenging, scenic tracks. Pick your race: Time Trials, Head-To-Head, Single Race or Tournament.\n\nNEED FOR SPEED 2:\n\nNEED FOR SPEED 2, the second game in the series, puts a new twist on racing, as it includes high-performance cars and open-road racing. When you factor in some beautifully rendered scenery, you've got yourself a top-notch racing game. As with the first NEED FOR SPEED, you can choose from a variety of high-performance machines, including the Dodge Viper, Lamborghini, Ferrari, Porsche, Corvette, Mazda RX7, Toyota Supra Turbo, and Acura NSX. There are six unique tracks to choose from, with three of them offering open road racing. The game also features split-screen two-player racing that lets you and a friend go at it. As far as the tracks go, there are six to choose from, three being open road.\n\nNEED FOR SPEED 3 - HOT PURSUIT:\n\nNEED FOR SPEED 3 offers five different modes including Single Race, Tournament, Knockout, Practice, and Hot Pursuit. Hot Pursuit is one of the more fun modes you're likely to see in a racing game, as it gives you the chance to go on the lam and lead the cops on a wild goose chase. Pay attention, though, because the police have some tricks up their sleeves, namely tire spikes and roadblocks. Tournament is the deepest mode, as it lets you enter a series of racing tours in order to prove your dominance. There are eight cars and eight tracks in the game, although not all of them are available from the get-go. But you can unlock the new cars and tracks by performing well with the initial cars and tracks. Some of the well-known cars you can expect to drive are Ferrari, Lamborghini, and Chevrolet.\n\n\nAll 3 tested and working properly on CFW 5.00 m33-4 combined with the 500 popsloader pack on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:461419035c79bc9066ad20a8225d69db5f5be07d","amp;dn":"%28PSX-PSP%29+Need+for+Speed+1-3+converted+properly+%28Kingdom-games+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461419035c79bc9066ad20a8225d69db5f5be07d","infoHashBuffer":{"type":"Buffer","data":[70,20,25,3,92,121,188,144,102,173,32,168,34,93,105,219,95,91,224,125]},"announce":[],"urlList":[]}}