{"title":"William Blum - Killing Hope - US Military and CIA Interventions","uid":15432450,"size":3675142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4659d0506015293607c85c70ecc4afba81aed62e&amp;dn=William+Blum+-+Killing+Hope+-+US+Military+and+CIA+Interventions+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469736647,"description":"https://extraimago.com/images/2016/07/28/e40c41a04ee810e6fd6b85c5273b096f-d.jpg\r\n\r\nWilliam Blum - Killing Hope - US Military and CIA Interventions Since World War II 2003\r\n\r\nIs the United States a force for democracy? In this classic and unique volume that answers this question, William Blum serves up a forensic overview of U.S. foreign policy spanning sixty years. Remarks from the previous edition: &quot;Far and away the best book on the topic.&quot;—Noam Chomsky &quot;A valuable reference for anyone interested in the conduct of U.S. foreign policy.&quot;— Choice &quot;I enjoyed it immensely.&quot;—Gore Vidal &quot;The single most useful summary of CIA history.&quot;—John Stockwell &quot;Each chapter I read makes me more and more angry.&quot;—Helen Caldicott &quot;A very useful piece of work, daunting in scope, important.&quot;—Thomas Powers, author and Pulitzer Prize--winning journalist &quot;A very valuable book. The research and organization are extremely impressive.&quot;—A.J. Langguth, author and former New York Times bureau chief For those who want the details on our most famous -actions (Chile, Cuba, Vietnam, to name a few), and for those who want to learn about our lesser-known efforts (France, China, Bolivia, Brazil, for example), this book provides a window on what our foreign policy goals really are. William Blum is the author of Rogue State: A Guide to the World’s Only Superpower","torrent":{"xt":"urn:btih:4659d0506015293607c85c70ecc4afba81aed62e","amp;dn":"William+Blum+-+Killing+Hope+-+US+Military+and+CIA+Interventions+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4659d0506015293607c85c70ecc4afba81aed62e","infoHashBuffer":{"type":"Buffer","data":[70,89,208,80,96,21,41,54,7,200,92,112,236,196,175,186,129,174,214,46]},"announce":[],"urlList":[]}}