{"title":"AFRICA - Kenya &amp; Tanzania Witchcraft &amp; Ritual Music","uid":4388910,"size":114433512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:473429f524335e508bdb92f8cad191da84f0b5d0&amp;dn=AFRICA+-+Kenya+%26+Tanzania+Witchcraft+%26+Ritual+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starinar","files":20,"time":1221065867,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nKenya &amp; Tanzania Witchcraft &amp; Ritual Music\n\nDavid Fanshawe traveled to Kenya and Tanzania to record indigenous music.  \nWitchcraft &amp; Ritual Music is the culmination of his work.  This CD \nconsists of sixteen tracks.  All but one is recorded in Kenya. \n\nThe recordings are amazingly crisp and clear given the year they were \nrecorded and the fact that these recordings were made in local settings \nand not in a recording studio.  I feel the recordings were very successful. \nDavid managed to capture the music authentically.  In his liner notes \nhe says, &quot;...I have tried to capture the spirit of a musical heritage \nnow nearly extinct. The music on this album comes from a part of East \nAfrica whose musical traditions remain largely unknown to the rest of \nthe world.  Particularly fascinating is the manner in which music and \nmedicine are combined in the indigenous practice of witchcraft; music \ntakes on the power of medicine, and medicine becomes associated with \nthe healing sound ofdrums, interwoven with beautiful threads of melody.&quot;\n\n\nThe tracks are music from various healing ceremonies, initiation rites, \nweddings, funerals, and folk music.  Many of these traditions have gone \nby the wayside as western culture has crept in.\n\nThe first song is Ngoma ra mrongo performed by members of the Taita tribe.  \nYou can hear in the background a chorus of people singing. In the \nforeground is a woman shouting and at the end of this clip you hear a \nwhistle along with drums and rattles.  Listen...\n\nOne track is actually two songs.  The Tuken Moral Songs are performed \nby two of the few traditonal singer left in Kenya.  In this song you \ncan heard their voices and a single instrument, the kibugantit.\n\nMany of these songs were performed with local, indigenous, instruments \nwith the occasional western one creeping in.  You can hear whistles in \nsome of the tracks.\n\nOne instrument is a chepkombis which is a bowl or pot with a skin stretched \nover it.  A stick is placed on top of it vertically.  The musician rubs \nhis/her hands up and down the stick to prdouce some very eery sounds.\n\nOther instruments are kayamba (rattles), ankle-bells, flutes, cow bells, \nuta (1-stringed harp), kibugantit (a 6-stringed harp), nyatiti \n(an 8-stringed harp), lukuji (a mouth harp), bung'o horn, and of course drums.\n\nMy only criticism about this CD is the title.  There is only one track recorded \nin Tanzania.  The CD title is Kenya &amp; Tanzania which leads one to believe that \nroughly half the tracks are recorded in Kenya and the other half in Tanzania.  \nThis CD should have been titled Kenya: Witchcraft &amp; Ritual Music leaving off \nthe one track recorded in Tanzania.","torrent":{"xt":"urn:btih:473429f524335e508bdb92f8cad191da84f0b5d0","amp;dn":"AFRICA+-+Kenya+%26+Tanzania+Witchcraft+%26+Ritual+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"473429f524335e508bdb92f8cad191da84f0b5d0","infoHashBuffer":{"type":"Buffer","data":[71,52,41,245,36,51,94,80,139,219,146,248,202,209,145,218,132,240,181,208]},"announce":[],"urlList":[]}}