{"title":"Britain.At.The.Bookies.s01e01.ENG.SUBS.WEBRIP.[MPup]","uid":12151065,"size":652836642,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4765d719fe81adbfa9d4d3d74308e915f3330f6f&amp;dn=Britain.At.The.Bookies.s01e01.ENG.SUBS.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1437636431,"description":"Britain.At.The.Bookies.s01e01.ENG.SUBS.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nDocumentary examining the winners and losers in Britain's gambling revolution. In Huddersfield, there's a turf war playing out as 11 betting shops operate in the town centre.\n\n[img]http://extraimago.com/images/2015/07/23/655b815a61b32267f40da4248887dc09.png[/img]\n\n[img]http://extraimago.com/images/2015/07/23/da6f51e674f65c21b71750e51f68dcff.jpg[/img]\n\nOn Huddersfield High Street, there's a turf war playing out. Eleven betting shops are crowded into the town centre, all competing for business. Tony runs one of the most established shops in town, the Kirkgate branch of Coral, and has been asked to try to turn around the fortunes of another branch just up the road, Cherrytree. This branch has a reputation for disruptive and often violent customers and is failing to hit its profit targets. In the battle of the high street, Tony needs to do all he can to ensure both Coral branches survive and beat the opposition.\n\nAt Coral HQ, novelty betting specialist Gary is working out the odds for the new series of Strictly Come Dancing, while the marketing team devise a scheme designed to entice people into opening online betting accounts. It's effectively a Â£250,000 giveaway, but if it results in 10,000 new customers in the fiercely fought over new online market it could be a gamble worth taking.\n\nSelf-confessed compulsive gambler Stuart trawls all the shops in Huddersfield, trying his luck on the fixed odds betting terminals. It's left him with nothing, and we see the consequences of his addiction and his life on benefits.\n\nManager Tony has to balance the problems that customers like Stuart have with his need to drum up trade in his shops. He doesn't gamble himself but doesn't see any problems with that: 'I am sure there are lots of vegetarians who are butchers', he says. Will Tony's methods save Cherrytree? Will any of the bookies in Huddersfield be forced to close? And how will Stuart deal with an addiction that could leave him penniless?","torrent":{"xt":"urn:btih:4765d719fe81adbfa9d4d3d74308e915f3330f6f","amp;dn":"Britain.At.The.Bookies.s01e01.ENG.SUBS.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4765d719fe81adbfa9d4d3d74308e915f3330f6f","infoHashBuffer":{"type":"Buffer","data":[71,101,215,25,254,129,173,191,169,212,211,215,67,8,233,21,243,51,15,111]},"announce":[],"urlList":[]}}