{"title":"Pather Panchali-BD.Rip-720p-x264.AC3.Esubs-DDR","uid":12979966,"size":4700167360,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:47c478174599f0f2c5004ff1c3317de830499cd0&amp;dn=Pather+Panchali-BD.Rip-720p-x264.AC3.Esubs-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"SaM","files":1,"time":1450022157,"description":"DDR Presents\r\n\r\n\r\nCriterion Collection - The Apu Trilogy - I\r\n\r\nPATHER PANCHALI (The Song of the Little Road) (1955)\r\n(A film by Satyajit Ray)\r\n\r\nBengali - Blu-Ray Rip - 720p - 960x720 - (4:3)- 4.38 GB - x.264.AC3.Esubs - 2 Hrs:05 Min\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/XLL\r\n\r\n\r\nSynopsis:\r\nHarihar (Kanu Bannerjee), his wife Sarbajaya (Karuna Bannerjee) and their daughter Durga (Runki Bannerjee) are members of a poverty stricken village household. They are soon joined by the aged Indir Thakrun (Chunibala Debi). Hharihar can barely manage with his income. In this milieu Sarbajaya gives birth to a son Apu (Subir Bannerjee). They are desperately poor and yet there is joy and spontaneity in the lives of the two young people. Harihar goes in search of a better job and in the meanwhile Sarbajaya is hard put to make ends meet. Then while Harihar is away, disaster strikes. On a stormy night, Durga, racked by fever, breathes her last. Overnight Apu becomes an adult - his carefree days are over. When Harihar returns he is devastated. The family decide to leave the village and begin a new life elsewhere.\r\n\r\nComments:\r\nThere is no point in commenting on one of the greatest films the world of cinema has ever seen. Let me instead talk about the restoration by Criterion! Consider this. A full 40% of the film has been restored from the original celluloid which had been completely burnt in a fire. The final product is wondrous. I must have watched Pather Panchali at leas 50 times before. Yet when I watched this film, I could only marvel at the detail that I never knew existed. Each expression of Sarbajaya (Karuna Bandyopadhyay) was now visible; The Kash flowers now come to life; Harihar's (Kanu Bandyopadhyay) anguish on realising Durga is no more is etched in every line. See the stills that we have uploaded!\r\n\r\nAfter seeing these restored films I realise that Ray was a much greater artiste than I had ever imagined!\r\n\r\nUploader's Notes:\r\nAs promised, the 720p version of the BD rip of Pather Panchali. Apart from the smaller size, I have slightly educed the amount of grain and it brings out the images a little more sharply without impacting the image quality. The sound is AC3 (mono. The extra compresssion has enabled a higher bitrate for the video. The sample is the famous scene in which Apu and Durga have gone to watch a train pass by.\r\n\r\nAparajito and Apur Sansar will follow..\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt0048473/\r\n \nhttp://extraimago.com/image/XL9 \nhttp://extraimago.com/image/XL3 \nhttp://extraimago.com/image/XLb \nhttp://extraimago.com/image/XLh \nhttp://extraimago.com/image/XLd \nhttp://extraimago.com/image/XLI \nhttp://extraimago.com/image/XLl \nhttp://extraimago.com/image/XLi \nhttp://extraimago.com/image/XLm \nhttp://extraimago.com/image/XLQ","torrent":{"xt":"urn:btih:47c478174599f0f2c5004ff1c3317de830499cd0","amp;dn":"Pather+Panchali-BD.Rip-720p-x264.AC3.Esubs-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c478174599f0f2c5004ff1c3317de830499cd0","infoHashBuffer":{"type":"Buffer","data":[71,196,120,23,69,153,240,242,197,0,79,241,195,49,125,232,48,73,156,208]},"announce":[],"urlList":[]}}