{"title":"Clannad 01-24 English Dubbed","uid":5513448,"size":3816205683,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:47c653f6619cc781a8f6ee84d3433c1f2f1ef05a&amp;dn=Clannad+01-24+English+Dubbed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"thenextday","files":25,"time":1272158207,"description":"--Clannad--\n\nType: Anime\n\nPlot: Tomoya Okazaki is a third year high school student resentful of his life. His mother passed away from a car accident when he was younger, causing his father to resort to alcohol and gambling. This results in fights between the two until Tomoya's shoulder is injured in a fight. Since then, Tomoya has had distant relationships with his father, causing him to become a delinquent over time. While on a walk to school, he meets a strange girl named Nagisa Furukawa who is a year older, but is repeating due to illness. Due to this, she is often alone as most of her friends have moved on. The two begin hanging out and slowly, as time goes by, Tomoya finds his life shifting in a new direction.\n\nGenre: comedy, drama, psychological, romance, supernatural\n___\n\n\nThis torrent contains all 24 episodes of Clannad in the english dubbed format.\n\nAt the time this torrent was released all 24 episodes had not been officially released. Some people found the unreleased episodes through URL manipulation and released them online. I gathered all of the episodes I could find and put them here into this torrent.\n\nNote about the quality: They are webrips taken directly from TheAnimeNetwork's website. The DVD boxset has been released, expect to see a high quality release posted soon (not by me!).\n\nBuy the DVD boxset so the 2nd season gets dubbed! It was released on June 15th: http://www.rightstuf.com/1-800-338-6827/catalogmgr/dIccelKDresJnYBWYN/browse/item/87167/4/0/0\n\nThanks and please seed.","torrent":{"xt":"urn:btih:47c653f6619cc781a8f6ee84d3433c1f2f1ef05a","amp;dn":"Clannad+01-24+English+Dubbed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c653f6619cc781a8f6ee84d3433c1f2f1ef05a","infoHashBuffer":{"type":"Buffer","data":[71,198,83,246,97,156,199,129,168,246,238,132,211,67,60,31,47,30,240,90]},"announce":[],"urlList":[]}}