{"title":"Reba McEntire - Turn On The Radio (2nafish)","uid":5887757,"size":142725124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4832e284dfdfcaf5a6a1c8c31a166b879977e6cb&amp;dn=Reba+McEntire+-+Turn+On+The+Radio+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1287121476,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Turn On the Radio&quot; is the title of a song recorded by American country music singer Reba McEntire to serve as the lead single for her upcoming 34th career album, All the Women I Am, which is set to be released on November 9, 2010. It was released to country radio on July 7, 2010, and debuted at #54 on the U.S. Billboard Hot Country Songs chart for the week of July 24, 2010. It was released as a digital download in the U.S. on August 3, 2010.\n\nFilming began on July 27, 2010 in Nashville, Tennessee, but due to a storm it did not finish until July 28, 2010. The music video, which was directed by Randee St. Nicholas, premiered on CMT and GAC on August 18, 2010.\n\n&quot;Turn On the Radio&quot; debuted at #54 on the Billboard Hot Country Songs chart for the week of July 24, 2010. The single is McEntire's eighty-first Top 40 single as a lead artist on the country charts.\n\nAll The Women I Am is the twenty-sixth studio album by American country music singer Reba McEntire. The album is set to be released November 9, 2010 through the Valory Music Group, a division of Big Machine Records. Its first single is &quot;Turn On the Radio&quot;, which was released in July. McEntire produced the album with Dann Huff.\n\nThe title of the album relates to the many roles that McEntire plays in her life. Asked once in an interview for a ranking, McEntire responded, &quot;Mother first, wife second, and the rest just follow.&quot; The album will feature a cover of American pop and R&amp;B singer BeyoncÃƒÂ© Knowles's 2008 single &quot;If I Were a Boy&quot;. McEntire's version became a viral video when she first performed the song on CMT's Unplugged earlier in 2010.\n\nReba Nell McEntire (born March 28, 1955) is an American country music artist. She began her career in the music industry singing with her siblings on local radio shows and rodeos. As a solo act, she was invited to perform at a rodeo in Oklahoma City, which caught the attention of country artist Red Steagall. He brought her to Nashville, Tennessee, where she eventually signed a contract with Mercury Records in 1975. She released her first solo album in 1977 and released five additional studio albums under the label until 1983.\n\nSigning with MCA Nashville Records, McEntire took creative control over her second MCA album, My Kind of Country (1984), which had a more traditional country sound and produced two number one singles: &quot;How Blue&quot; and &quot;Somebody Should Leave&quot;. The album brought her breakthrough success, bringing her a series of successful albums and number one singles in the 1980s and 1990s. McEntire has since released 25 studio albums, acquired 34 #1 singles, and 28 albums have been certified Gold, Platinum or Multi-Platinum in sales by the Recording Industry Association of America. Her album For My Broken Heart broke ground for female artists in country music, as it was the first album recorded by a female in country music to be certified double-platinum (selling two million copies) by the RIAA.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4832e284dfdfcaf5a6a1c8c31a166b879977e6cb","amp;dn":"Reba+McEntire+-+Turn+On+The+Radio+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4832e284dfdfcaf5a6a1c8c31a166b879977e6cb","infoHashBuffer":{"type":"Buffer","data":[72,50,226,132,223,223,202,245,166,161,200,195,26,22,107,135,153,119,230,203]},"announce":[],"urlList":[]}}