{"title":"Vaccine Nation","uid":5117971,"size":300760223,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:48e9e1b307f96a5ae7fb6f1ee64aaf67139c3f82&amp;dn=Vaccine+Nation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Colors`of`the`Wind","files":2,"time":1255170604,"description":"Those who work in health care are being strongly urged by the federal government to get immunized once the swine flu vaccine is available. The state of New York is taking it one step further by making vaccination a requirement.\n\nHealth care professionals do have an obligation to protect their patients, but at what cost? For one health care worker the new state directive intended to stop the spread of H1N1 goes too far.\n\nJust a word like pandemic is enough to scare anyone in the health care field. For registered nurse Deborah Gerhardt, there are words even scarier.\n\n&quot;Whenever you hear mandatory required, you start to get a little bit anxious,&quot; says Gerhardt.\n\nShe's been a nurse for 15 years and has never had a flu shot.\n\n&quot;I feel that everyone should have a choice,&quot; says Gerhardt.\n\nShe recently learned she doesnt have a choice.\n\n&quot;It was just one day we were told you will receive the flu injection,&quot; says Gerhardt.\n\nThe New York State Department of Health is ordering tens of thousands of health workers be immunized against seasonal and swine flu.\n\n&quot;As a parent, as a doctor, as a public health professional please get your vaccine,&quot; New York State Commissioner of Health Dr. Richard Daines asked during a news conference last week.\n\nThe commissioner says refusal to be immunized against H1N1 could increase the spread of the virus and stress and already overwhelmed medical system. He says when a vaccine is approved, there's no reason to believe it won't be safe.\n\n&quot;It goes through that same system and the testing so I'll have every confidence the Food and Drug Administration and the Centers for Disease Control put in it,&quot; says Daines.\n\nAfter her own research, Gerhardt isn't as confident in a potential vaccine.\n\n&quot;It's left a lot of questions for me,&quot; she says.\n\nQuestions that have left her with one final decision.\n\n&quot;I so strongly don't want a vaccine that I'm not comfortable having injected into my body,&quot; says Gerhardt. &quot;If I refuse I can' work in nursing.&quot;\n\nIt's a choice she wishes she didn't have to make.\n\n&quot;This is just so surreal right now,&quot; says Gerhardt. &quot;I don't know what I will do.&quot;\n\nGerhardt says she's never had the flu and practices simple preventative measures like hand washing and simple sanitation techniques. She believes that's even more effective.\n\nShe realizes she could lose her job for speaking out, but says it's important since she knows others in the health care field have the same concerns.","torrent":{"xt":"urn:btih:48e9e1b307f96a5ae7fb6f1ee64aaf67139c3f82","amp;dn":"Vaccine+Nation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e9e1b307f96a5ae7fb6f1ee64aaf67139c3f82","infoHashBuffer":{"type":"Buffer","data":[72,233,225,179,7,249,106,90,231,251,111,30,230,74,175,103,19,156,63,130]},"announce":[],"urlList":[]}}