{"title":"B.B. King feat. Tracy Chapman - The Thrill Is Gone (2nafish)","uid":5643557,"size":125231108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4928aa457b44a131c76451ddc46be398a33eefb2&amp;dn=B.B.+King+feat.+Tracy+Chapman+-+The+Thrill+Is+Gone+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1277166590,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;The Thrill Is Gone&quot; is a blues song written by Rick Darnell and Roy Hawkins in 1951 and popularized by B.B. King in 1970.\n\nThe song was first recorded by Roy Hawkins, its co-author, and became a minor hit for the musician. B.B. King recorded his version of the song in June 1969 for his album Completely Well, released the same year. The song's polished production and use of strings marked a departure from both the original song and King's previous material. When released as a single in December of 1969, the song became the biggest hit of King's career (#3 R&amp;B / #15 Pop) and his signature song. B. B. King's recording earned him a Grammy Award for Best Male R&amp;B Vocal Performance and a Grammy Hall of Fame award in 1998. King's version of the song was also placed at number 183 on Rolling Stone magazine's list of the 500 greatest songs ever. Memorable live versions of the song were included on King's albums Live in Cook County Jail (1971), Bobby Bland and B.B. King Together Again...Live  (1976), and Live at San Quentin (1991).\n\nRiley B. King (born September 16, 1925), known by the stage name B.B. King, is an American blues guitarist  and singer-songwriter acclaimed for his expressive singing and guitar playing.\n\nRolling Stone magazine ranked him at #3 on its list of the &quot;100 greatest guitarists of all time.&quot; According to Edward M. Komara, King &quot;introduced a sophisticated style of soloing based on fluid string bending and shimmering vibrato that would influence virtually every electric blues guitarist that followed.&quot;\n\nIn 1991, B.B. King's Blues Club opened on Beale Street in Memphis, and in 1994, a second club was launched at Universal City Walk in Los Angeles. A third club in New York City's Times Square opened in June 2000. Two further clubs opened at Foxwoods Casino in Connecticut  in January 2002 and another in Nashville in 2003. A club in West Palm Beach opened in the fall of 2009 and an additional one, based in the Mirage Hotel, Las Vegas, is due to open in the winter of 2009.\n\nDeuces Wild is an album by B. B. King, released on November 4, 1997.\n\nTracy Chapman (born March 30, 1964) is a singer-songwriter, best known for her singles &quot;Fast Car&quot;, &quot;Talkin' 'bout a Revolution&quot;, &quot;Baby Can I Hold You&quot;, &quot;Give Me One Reason&quot;, &quot;The Promise&quot; and &quot;Telling Stories&quot;. She is a multi-platinum and four-time Grammy Award-winning artist.\n\nDuet song:\n\n    * &quot;The Thrill Is Gone&quot; with BB King from his album Deuces Wild\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4928aa457b44a131c76451ddc46be398a33eefb2","amp;dn":"B.B.+King+feat.+Tracy+Chapman+-+The+Thrill+Is+Gone+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4928aa457b44a131c76451ddc46be398a33eefb2","infoHashBuffer":{"type":"Buffer","data":[73,40,170,69,123,68,161,49,199,100,81,221,196,107,227,152,163,62,239,178]},"announce":[],"urlList":[]}}