{"title":"Daniel Clowes - Eightball (Restored)","uid":7800363,"size":684156835,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:493f4bfb753b7f787c402df75c3e73f5d8162183&amp;dn=Daniel+Clowes+-+Eightball+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1352267588,"description":"Issues 1-23 of 'Eightball'\nFantagraphics Books, 1989-2004\nWritten and Illustrated by Daniel Clowes\n\n1 Oct - 89 Like a Velvet Glove Cast in Iron, Devil Doll, The Laffin' Spittin' Man, Young Dan Pussey, What is the Most Important Invention of the Twentieth Century? \n\t\n2 Feb - 90 Like a Velvet Glove Cast in Iron, The Truth, I Hate You Deeply (Lloyd Llewellyn, What Do You Think George Washington's Voice Sounded Like? \n\t\n3 Jun- 90 Like a Velvet Glove Cast in Iron, The Stroll, The Young Manhood of Dan Pussey, What Can Robots Do? \n\t\n4 Oct - 90 Like a Velvet Glove Cast in Iron, I Love You Tenderly (Lloyd Llewellyn), The Future, Dan Pussey's Masturbation Fantasy, Sexual Frustration, What Do You Do for a Cold? \t\n\n5 Feb - 91 Like a Velvet Glove Cast in Iron, Just Another Day, Playful Obsession, Paranoid \n\t\n6 Jun - 91 Like a Velvet Glove Cast in Iron, The Dr. Infinity Story (Dan Pussey), Marooned \n\t\n7 Nov - 91 Like a Velvet Glove Cast in Iron, Art School Confidential, Chicago \n\t\n8 Mar - 92 Like a Velvet Glove Cast in Iron, Ugly Girls, Grist for the Mill, Dan Pussey Presents Komic Kollector's Korner, Nature Boy, Give it Up, My Suicide, Dialogues from Duplex Planet\n\n9 Sep - 92 Like a Velvet Glove Cast in Iron, Dan Pussey, Zubrick and Pogeybait, Eightball\n\t\n10 Feb - 93 Like a Velvet Glove Cast in Iron (conclusion), Young Dan Pussey, Zubrick's Pal Pogeybait, A Message To The People Of The Future\n \t\n11 Jun - 93 Velvet Glove, Ghost World, The Party, The Fairy Frog, The Happy Fisherman, Why I Hate Christians, Ectomorph\n\n12 Nov - 93 Ghost World, Hippypants and Peace Bear, The Origin of Dan Pussey, Glue Destiny \t\n\n13 Apr - 94 Ghost World, Buddy Bradley in 'Who Would You Rather Fuck: Ginger or Mary Ann?', Blue Italian Shit, Cool Your Jets, Anomalies and Curiosities of Medicine (The Buddy Bradley story is based on characters by Peter Bagge.)\n\n14 Ghost World, The Goldmommy, On Sports, The Death of Dan Pussey, The Sensual Santa \t\n\n15 Apr - 95 Ghost World, Caricature, Feldman\n\n16 Nov - 95 Ghost World, Squirrel Girl and Candy Pants, Like a Weed, Joe, MCMLXVI, Immortal Invisible\n\t\n17 Aug - 96 Ghost World, Gynecology \t\n18 Mar - 97 Ghost World, Black Nylon, Latch-Key Kid, Modern Cartoonist\n\n19 May - 98 David Boring, Act I \t\n20 Feb - 99 David Boring, Act 2 \t\n21 Feb - 00 David Boring, Act 3 \t\n22 Oct - 01 Ice Haven \t\n23 Jun - 04 Death Ray\n\n\n'Twentieth Century Eightball'\nFantagraphics Books, 2002, 103 pages\n\nMost of the contents previously appeared in the earlier, out-of-print collections Lout Rampage! and Orgy Bound, but the book also includes eight new stories.\n\nContents: Little Enid, Title Story, Art School Confidential, Cool Your Jets, Ectomorph, The Truth, Ink Studs, The Stroll, Devil Doll?, Needledick the Bugfucker, Feldman, I Hate You Deeply, Zubrick and Pogeybait, Frankie and Johnnie, Marooned on a Desert Island with the People from the Subway, Just Another Day, Hippypants and Peace Bear, Zubrick, Chicago, Why I Hate Christians, Pogeybait, On Sports, Sexual Frustration, The Operator, A Message to the People of the Future, The Happy Fisherman, Give it Up!, Grist for the Mill, Ugly Girls, Curtain of Sanity, Playful Obsession, Squirrel Girl and Candypants, Paranoid, I Love You Tenderly, The Party, The Sensual Santa, My Suicide, Eightball, Man-Child, Wallace Wood, Tits, Tom Pudd, Grip Glutz and Shamrock Squid, You, About the Author","torrent":{"xt":"urn:btih:493f4bfb753b7f787c402df75c3e73f5d8162183","amp;dn":"Daniel+Clowes+-+Eightball+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"493f4bfb753b7f787c402df75c3e73f5d8162183","infoHashBuffer":{"type":"Buffer","data":[73,63,75,251,117,59,127,120,124,64,45,247,92,62,115,245,216,22,33,131]},"announce":[],"urlList":[]}}