{"title":"The Anthony Cumia Show 2015-09-16 Matt Iseman Ari Shaffir MP4","uid":12440854,"size":332972654,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:498737aa0f60cb810241f35c5d6964695000a884&amp;dn=The+Anthony+Cumia+Show+2015-09-16+Matt+Iseman+Ari+Shaffir+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"mothergoose58","files":2,"time":1442534412,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\n\nAfter 1 year of complete broadcasting freedom the Anthony Cumia Network is proud to launch their new studio in New York City! Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuests: Matt Iseman, Ari Shaffir\n\nEpisode 230: We start this Wednesday's TACS show with Stinky talking about &quot;Shroomfest&quot;, the upcoming GOP debate, and the Zype launch party. We watch a Hillary sex assault ad, a Chelsea book signing clip, and Matt Damon interrupting a reporter. Ant takes a bunch of calls about &quot;migrants&quot; / Germany &amp; Stuttering John, and Matt Iseman joins the show. Ant and Matt discuss &quot;The Prestige&quot;, watching '70's commercials on YouTube, and Brian Regan. Next they talk about comedian Steve Rannazzisi's 9/11 lies, Matt's Ant impressions, and Ari Shaffir finally arrives! Ari explains how he goes offline and lets his controversies cool off, and what exactly went down with his friend Steve Rannazzisi's deceptions, and the homeless returning to NYC. We watch a foot fetish video, discuss craiglist encounters, drugs, Shroomfest, Ant on Mescaline at Van Halen, a caller gives some foot fetish details, and Dane Cook &amp; Miley Cyrus are an item?! Watch a video about a woman thrown off a plane, talk &quot;drunk driving&quot; licenses, Ant's horrific divorce, Max Koch Soprano's impressions, and &quot;Concho Pete&quot;. \n\n\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:498737aa0f60cb810241f35c5d6964695000a884","amp;dn":"The+Anthony+Cumia+Show+2015-09-16+Matt+Iseman+Ari+Shaffir+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"498737aa0f60cb810241f35c5d6964695000a884","infoHashBuffer":{"type":"Buffer","data":[73,135,55,170,15,96,203,129,2,65,243,92,93,105,100,105,80,0,168,132]},"announce":[],"urlList":[]}}