{"title":"Darwin's Nightmare by Hubert Sauper","uid":4441271,"size":755137636,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a0181b09881d11ec03099f71310d467e83b2030&amp;dn=Darwin%5C%27s+Nightmare+by+Hubert+Sauper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"FreedomLover","files":1,"time":1223828197,"description":"This shocking film by Hubert Sauper is a film which every human being on this planet should watch. It will shock you to your very core. The camera simply observes people living in a small town near Lake Victoria in Tanzania going about their daily business. It shows the ugly face of rabid capitalism and the depravity resulting from the poverty and ignorance which it breeds. It is time the world woke up to the fact that we are all inter-dependent and that exploitation will, in the end, destroy the perpetrator himself as exemplified by the current meltdown of the Western financial system. The world needs to reassess its values before the planet rids itself of homo sapiens through global warming, pathogens, and desertification, that is, if we don't destroy ourselves first through war and strife. It is time to adopt the European model of social capitalism which supports a free market economy constrained by social (read caring) regulation. The American model is predatory and destructive based on greed and ignorance and has finally shown itself to be utterly obsolete.","torrent":{"xt":"urn:btih:4a0181b09881d11ec03099f71310d467e83b2030","amp;dn":"Darwin%5C%27s+Nightmare+by+Hubert+Sauper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a0181b09881d11ec03099f71310d467e83b2030","infoHashBuffer":{"type":"Buffer","data":[74,1,129,176,152,129,209,30,192,48,153,247,19,16,212,103,232,59,32,48]},"announce":[],"urlList":[]}}