{"title":"Pozitia Copilului aka Child s Pose 2013 DVDRip Sonata Premiere","uid":9139225,"size":746596972,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a4de08fc48d931fbd6862e14ed2ab4248ea957d&amp;dn=Pozitia+Copilului+aka+Child+s+Pose+2013+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"klinho","files":3,"time":1383475392,"description":"Winner of the Golden Bear at the Berlinale, Child's Pose is a riveting drama that centres on a mother's twisted affection for her son, and the repercussions of her actions when his well-being is placed in jeopardy. 60-year-old Cornelia (the phenomenal Luminita Gheorghiu) leads a life of privilege, social power and abundant wealth in contemporary Bucharest, but life is not perfect. More than anything in the world, she longs for her 34-year-old son Barbu (Bogdan Dumitrache) to reciprocate her affections. But the pair barely speak, something the domineering Cornelia blames on Barbu's live-in girlfriend. When Barbu is involved in a tragic car accident and runs down a child on a highway, Cornelia is thrust back into his life. Seeing her chance to regain control, she commences a frighteningly well-orchestrated campaign to save her son from prison. But Barbu, boiling with anger yet hopelessly emasculated and infantilised, refuses to play along. Propelled by Gheorghui's towering, tour-de-force performance and a razor-sharp attention to class and generational resentments, Netzer's engrossing film lays bare the moral bankruptcy of upper-class Romanian society and its institutions in expert fashion. Disquieting but also compassionate, this examination of guilt and the crippling effects of loss makes for a fascinating, unforgettable cinema experience.\n\n\nLanguage: Romanian\n\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:4a4de08fc48d931fbd6862e14ed2ab4248ea957d","amp;dn":"Pozitia+Copilului+aka+Child+s+Pose+2013+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4de08fc48d931fbd6862e14ed2ab4248ea957d","infoHashBuffer":{"type":"Buffer","data":[74,77,224,143,196,141,147,31,189,104,98,225,78,210,171,66,72,234,149,125]},"announce":[],"urlList":[]}}