{"title":"True.Blood.S07E05.HDTV.XviD-AFG","uid":10603189,"size":492976082,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ad78feb8a5da55c3f8695dabe754bfa36d1e452&amp;dn=True.Blood.S07E05.HDTV.XviD-AFG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":2,"time":1405951059,"description":"[b]True Blood\n\n[IMG]http://i.imgur.com/acHQbsI.jpg[/IMG]\n\nDirector: Michael Lehmann, Scott Winant \nWriting: Alan Ball, Alexander Woo, Brian Buckner\nCast: Anna Paquin, Stephen Moyer, Sam Trammell, Ryan Kwanten, Rutina Wesley, Carrie Preston and more.\nGenre: Drama, Horror, Thriller\nYear: 2014\nCountry: USA\nRuntime: 42 min\n\n.: Plot :.\nThe series follows Sookie Stackhouse, a barmaid living in Louisiana who can read people's minds, and how her life is turned upside down when the Vampire Bill, walks into her place of employment two years after vampires 'came out of the coffin' on national television.\nVampires not only exist, but the entire world knows about them. Since a Japanese scientist's invention of synthetic blood, vampires have progressed from legendary monsters to fellow citizens overnight. And while humans have been safely removed from the menu, many people remain apprehensive about vampires living amongst them in Louisiana. In the southern town of Bon Temps, a local barmaid named Sookie Stackhouse (Anna Paquin) understands what it's like to be an outcast. Cursed with the ability to listen in on people's thoughts, she's also open-minded about the integration of vampires. She is especially intrigued by Bill Compton(Stephen Moyer), a handsome 173-year-old living up the road. But as Sookie is drawn into a series of mysteries surrounding Bill's arrival in Bon Temps, that tolerance will be put to the test. Other town residents include Sookie's best friend Tara (Rutina Wesley), her slow-witted older brother Jason (Ryan Kwanten) and her shape-shifting boss Sam (Sam Trammell). Six Feet Under's creator Alan Ball created this sexy horror show based on the novels by Charlaine Harris.[/b]","torrent":{"xt":"urn:btih:4ad78feb8a5da55c3f8695dabe754bfa36d1e452","amp;dn":"True.Blood.S07E05.HDTV.XviD-AFG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ad78feb8a5da55c3f8695dabe754bfa36d1e452","infoHashBuffer":{"type":"Buffer","data":[74,215,143,235,138,93,165,92,63,134,149,218,190,117,75,250,54,209,228,82]},"announce":[],"urlList":[]}}