{"title":"Louis Althusser - Philosophical Works (9 books)","uid":13676295,"size":72956416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b82d240d7bb803049203c6da7027f6ae63a0679&amp;dn=Louis+Althusser+-+Philosophical+Works+%289+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"workerbee","files":21,"time":1456417290,"description":"\nLOUIS ALTHUSSER (1918-1990) was an Algerian-born French philosopher who has been called &quot;the most prominent and innovative Marxist thinker of the postwar period in France.&quot;  He was a longtime member, and sometimes a strong critic, of the French Communist Party.  His arguments and thesis were set against the threats that he saw attacking the theoretical foundations of Marxism.  These included both the influence of empiricism on Marxist theory, and humanist and reformist socialist orientations which manifested as divisions in the European communist parties, as well as the problem of the &quot;cult of personality&quot; and of ideology.\r\n\r\nAlthusser is commonly referred to as a structural Marxist, although his relationship to other schools of French structuralism is not a simple affiliation and he was critical of many aspects of structuralism.  He is remembered as the scourge of humanist Marxism who was famously pilloried by E. P. Thompson in his polemic &quot;The Poverty of Theory&quot; as &quot;Geschichtenscheissenschlopff -- unhistorical shit.&quot;\r\n\r\nAlthusser's work continues to inform the research programs of literary studies, political philosophy, history, economics, and sociology.  His philosophy as a whole is undergoing a critical reevaluation by scholars who have benefited from the anthologization of hard-to-find and previously unpublished texts and who have begun to engage with the great mass of writings that remain in his archives.  His concepts are also being increasingly employed by philosophers, political theorists, and activists who have returned to Marx and to Marxian analyses in order to explain and to envision alternatives to our present socio-economic conjuncture.\r\n \r\n\r\nThe following books are in PDF and/or ePUB format as indicated:\r\n\r\n* FOR MARX (Verso, 2005).  Translated by Ben Brewster. -- PDF\r\n\r\n* THE FUTURE LASTS FOREVER: A Memoir (New Press, 1993).  Edited by Olivier Corpet and Yann Moulier Boutang.  Translated by Richard Veasey. -- PDF\r\n\r\n* THE HUMANIST CONTROVERSY &amp; OTHER WRITINGS (1966-67) (Verso, 2003).  Edited by François Matheron; translated with an Introduction by G. M. Goshgarian. -- PDF\r\n\r\n* LENIN AND PHILOSOPHY &amp; OTHER ESSAYS (Monthly Review, 1971).  Translated by Ben Brewster. -- PDF\r\n\r\n* MACHIAVELLI AND US (Verso, 1999).  Edited by François Matheron; translated with an Introduction by Gregory Elliott. -- PDF\r\n\r\n* ON THE REPRODUCTION OF CAPITALISM: Ideology and Ideological State Apparatuses (Verso, 2014).  Translated by G. M. Goshgarian. -- PDF + ePUB\r\n\r\n* PHILOSOPHY OF THE ENCOUNTER: LATER WRITINGS, 1978-87 (Verso, 2006).  Edited by François Matheron and Oliver Corpet; translated with an Introduction by G. M. Goshgarian. -- PDF\r\n\r\n* THE SPECTRE OF HEGEL: EARLY WRITINGS (Verso, 1997 / 2014).  Edited with an Introduction by François Matheron; translated by G. M. Goshgarian. -- PDF + ePUB\r\n\r\n* WRITINGS ON PSYCHOANALYSIS: Freud and Lacan (Columbia UP, 1996).  Edited by Olivier Corpet and François Matheron.  Translated by Jeffrey Mehlman. -- ePUB\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\n&gt;&gt; CONTACT ME\r\nYou can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                   \nhttps://pirates-forum.org/User-workerbee  \r\n\r\n&gt;&gt; PLEASE HELP TO SEED!\r\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:4b82d240d7bb803049203c6da7027f6ae63a0679","amp;dn":"Louis+Althusser+-+Philosophical+Works+%289+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b82d240d7bb803049203c6da7027f6ae63a0679","infoHashBuffer":{"type":"Buffer","data":[75,130,210,64,215,187,128,48,73,32,60,109,167,2,127,106,230,58,6,121]},"announce":[],"urlList":[]}}