{"title":"The Goon (001 - 044 + Mini-Series, One-Shots &amp; Extras) (2003","uid":10423013,"size":1280887710,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4c5678cf61a7cd481efc4651ad9eeca8a08416d2&amp;dn=The+Goon+%28001+-+044+%2B+Mini-Series%2C+One-Shots+%26amp%3B+Extras%29+%282003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nemesis43","files":64,"time":1403665854,"description":"The Goon (001 - 044 + Mini-Series, One-Shots &amp; Extras) (2003 - 2013) \n\n\nThe Goon is a parentless child with his Aunt Kizzie being his only parental figure, taking him into her life of being a part of the freak show and taking him to the circus where he worked hard but felt loved for once. The famous criminal mobster Labrazio hid in the circus where The Goon worked while on the run from the police, resulting in an old-fashioned shoot-out, with The Goon being the only survivor. Labrazio having gunned down his aunt, and prompted to call her a &quot;Stupid Broad&quot; for getting gunned down in the crossfire. The Goon turns into a raged child with him taking a rock and smashing Labrazio's skull in to a severe point. With Labrazio dead, The Goon then took Labrazio's famed black book, with the names of every single person who owed Labrazio either a favor or money. The Goon took the book and set off upon looking for each person named in Labrazio's book, collecting the favour or money that was owed, with The Goon announcing he was Labrazio's right hand man. The Goon now lives a life of fighting creatures of magical and demonic origin, with his trusted sidekick Frank who is the polar opposite of The Goon, with Frankie being loud &amp; argumentative and The Goon being a gentle giant. When not fighting various creatures, the two spend most of their time getting drunk in Norton's Pub.","torrent":{"xt":"urn:btih:4c5678cf61a7cd481efc4651ad9eeca8a08416d2","amp;dn":"The+Goon+%28001+-+044+%2B+Mini-Series%2C+One-Shots+%26amp%3B+Extras%29+%282003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5678cf61a7cd481efc4651ad9eeca8a08416d2","infoHashBuffer":{"type":"Buffer","data":[76,86,120,207,97,167,205,72,30,252,70,81,173,158,236,168,160,132,22,210]},"announce":[],"urlList":[]}}