{"title":"Handel - Alcina - Les Arts Florissants, William Christie","uid":4504786,"size":837173882,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c7a0e3230f9ab0dfcdcac32ee4003bef5e9bfe9&amp;dn=Handel+-+Alcina+-+Les+Arts+Florissants%2C+William+Christie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"glennscr","files":76,"time":1226548723,"description":"Handel - Alcina\n\nGeorge Frideric Handel: Alcina (opera), HWV 34\n\nLes Arts Florissants, William Christie (Conductor),\nRenee Fleming\nSusan Graham\nNatalie Dessay\nKathleen Kuhlmann\nTimothy Robinson\nLaurent Naouri\nJuanita Lascarro &lt;a href=&quot;\nhttp://www.amazon.com/Handel-Kuhlmann-Robinson-Lascarro-Florissants/dp/B00004NK26/ref=sr_1_2?ie=UTF8&amp;s=music&amp;qid=1226543621&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Handel-Kuhlmann-Robinson-Lascarro-Florissants/dp/B00004NK26/ref=sr_1_2?ie=UTF8&amp;s=music&amp;qid=1226543621&amp;sr=8-2&lt;/a&gt;\n\nAmazon.com's Best of 2000\nQuote:\nWith her portrayal of Handel's sorceress Alcina, RenÃƒÆ’Ã‚Â©e Fleming scores yet another triumph--and so do her colleagues Susan Graham and Natalie Dessay. One moment seems to top the next as Handel offers aria after aria loaded with exquisite melody. For all of its absurdities of plot, this baroque opera comes deliciously alive in the wise, stylish hands of conductor William Christie. --Thomas May\n\n\nAmazon.com\nQuote:\nHere it is: one of the year's most hotly anticipated opera recordings, made during an acclaimed live production in June 1999 at the Paris Opera, which more than lives up to the promise. Handel's operas--the center of his creative life before oratorios became the focus--have spent far too long in limbo awaiting rediscovery, which slowly started happening in the late '60s with works such as Giulio Cesare. But whether Handelian opera is still a novelty or you're already a rabid convert, this emotionally resonant, crisply played, superbly cast interpretation under William Christie and Les Arts Florissants is likely to shake up some of your ideas about the composer. On the surface, Alcina's Ariosto-based story about a sorceress whose spell is finally broken seems like the typically absurd fare of baroque opera. But as the story of misaligned loves unfolds in an incredible succession of some 28 arias, it's clear that these performers are reaching for deeper profundities present in Handel's music, so that Alcina really becomes a story of transformation in the fullest sense. And while Handel may have written for singers trained in ego but myopic to the larger artistic picture, the dream cast of divas gathered here seem to constantly be plumbing emotional truths--and how wonderfully they work as an ensemble, even through the pile-up of arias that is the score's substance. Just one example: consider how RenÃƒÆ’Ã‚Â©e Fleming makes Alcina's huge Act II aria &quot;Ah! mio cor&quot; a central epiphany and turning point of the opera. It defies belief that this is Susan Graham's first baroque opera, so rich is her variety of invention and deep her musicality as Ruggiero, the one to break free of Alcina's spell, while the spun-silk soprano of Natalie Dessay adds yet another color to the multitude of female voices that dominate here. Les Arts Florissants (taking an A pitch value of 415, for the record) play with constantly ravishing engagement, immediately apparent from the trill-happy overture. You don't want to miss this one. --Thomas May\n","torrent":{"xt":"urn:btih:4c7a0e3230f9ab0dfcdcac32ee4003bef5e9bfe9","amp;dn":"Handel+-+Alcina+-+Les+Arts+Florissants%2C+William+Christie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c7a0e3230f9ab0dfcdcac32ee4003bef5e9bfe9","infoHashBuffer":{"type":"Buffer","data":[76,122,14,50,48,249,171,13,252,220,172,50,238,64,3,190,245,233,191,233]},"announce":[],"urlList":[]}}