{"title":"Microsoft Office 2011 Update - English only Verison 14.3.2","uid":8283865,"size":116735199,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4cf957da76316be3fa2d952cdd1d2c76e0ca7cc8&amp;dn=Microsoft+Office+2011+Update+-+English+only+Verison+14.3.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"polisdavid","files":-1,"time":1363900034,"description":"Note : You can get this from &lt;a href=&quot; http://www.microsoft.com/mac/downloads&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.microsoft.com/mac/downloads&lt;/a&gt;  as a free update\n\nÂ \nOfficial Web Site: &lt;a href=&quot; http://support.microsoft.com/kb/2817452&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://support.microsoft.com/kb/2817452&lt;/a&gt;\n\nMicrosoft Office 2011 helps you create professional documents and presentations. And since Office for Mac 2011 is compatible with Office for Windows, you can work on documents with virtually anyone, anywhere.\n\nUpdate Details:\n\nMicrosoft has released security bulletin MS13-026. This security bulletin contains all the relevant information about the security update for Microsoft Office for Mac 2011. To view the complete security bulletin, go to the following Microsoft website:  &lt;a href=&quot;\nhttp://technet.microsoft.com/security/bulletin/MS13-026.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://technet.microsoft.com/security/bulletin/MS13-026.&lt;/a&gt; In addition to the application improvements mentioned in this article, Office for Mac 2011 is now available as a subscription offering.\n\nThis security update provides the latest fixes for Office for Mac 2011. These include the following:\n\nWhats New:\n\n* Contacts that were created in x500 format did not work in Outlook for Mac.\n\n* Fixes an issue in which messages that were addressed to contacts that were created in x500 format and sent in Mac Outlook were not deliverable.\n\n* BCC recipient was missing on Gmail IMAP draft message in Outlook for Mac.\n\n* Fixes an issue in which BCC recipients were not saved when you saved a draft message on an IMAP server.\n\n* Some contractions were marked as spelling errors in Outlook for Mac.\n\n* Fixes an issue in which letters before the single quotation mark in contractions were marked as misspelled.\n\n* Shared folders could not open other mailboxes that used Kerberos protocol in Outlook for Mac.\n\n* Fixes an issue in which shared folders could not be opened for accounts that used Kerberos authentication.\n\n* Coordinated Universal Time was not included when you created a calendar event in Outlook for Mac.\n\n* Adds Coordinated Universal Time (UTC+0 without a DST offset) to the list of available time zones when you create a calendar event.\n\n* Offline Address Book (OAB) was not updated correctly.\nFixes an issue in which OAB was not updated correctly for certain Office 365 users.\n\n* When the &quot;Save As&quot; dialog box was displayed, VBA code that was running did not wait for user's action (Save/Cancel) before the code advanced to the next line of the VBA code.\n\n* Fixes an issue that occurred when you ran a Macro that contained &quot;Applications.Dialogs(xlDialogSaveAs).Show.&quot; Now, the macro aligns with Windows VBA behavior in this particular scenario.\n\n* Scrolling when Track Changes default settings are enabled in larger documents crashed Word for Mac.\n\n* Stability is improved when scrolling through documents that have Track Changes bubbles.\n\n* Transitions had graphic issues during slide shows in PowerPoint for Mac.\n\n* Fixes an issue in which artifacts may have appeared during slide show transitions (This issue affects users who have NVIDIA video cards that are running Mac OS X Mountain Lion).\n\nSystem Requirements:\n\n Intel Mac, OS X.5.8\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:4cf957da76316be3fa2d952cdd1d2c76e0ca7cc8","amp;dn":"Microsoft+Office+2011+Update+-+English+only+Verison+14.3.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cf957da76316be3fa2d952cdd1d2c76e0ca7cc8","infoHashBuffer":{"type":"Buffer","data":[76,249,87,218,118,49,107,227,250,45,149,44,221,29,44,118,224,202,124,200]},"announce":[],"urlList":[]}}