{"title":"Breaking Bad Season 1 Swesub - Complete-JiMiC","uid":4249862,"size":2571652429,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d506b07d2613805ef35d965eaa8d078431cdab1&amp;dn=Breaking+Bad+Season+1+Swesub+-+Complete-JiMiC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"kuhfukh","files":198,"time":1213960102,"description":"Breaking Bad Season 1 Swesub - Complete-JiMiC\n\n7 Episodes with swedish subtitles\n\n\n\nThe age of Bryan Cranston has returned. Once universally lauded for his work in Malcolm In The Middle, there had yet to be a good vehicle for this man&amp;#039;s particular talents. He has that rare gift of generating sympathy and manic-energy at the same time.\n\nFor those that would be content to label this show a Weeds knock-off, bear in mind that Breaking Bad is a new kind of monster. It touches on the very same themes, &quot;living realistically as a middle class in the United States&quot; which often makes us resort to extremes to survive. Like the mother and daughter team that robbed that bank. But the weed selling antics of Showtime&amp;#039;s hit show is really nothing like &quot;Bad.&quot; The Pilot was about as perfect a Pilot as I&amp;#039;ve ever seen, and much of it rests on Bryan Cranston&amp;#039;s shoulders.\n\nCranston plays Cheimstry teacher Walter White. He has a loving wife, a child with Cerebal Palsy and another is on the way. He also happens to be dying from an inoperable lung cancer situation, which happened although he &quot;never smoked.&quot; His finances in disarray, the once great student of science turns to crime to solve his problems.\n\nHe cooks Crystal Meth with a good for nothing ex-student. From the antics of the first episode, the show is leading towards a dark place, but a place of truth. This is a no nonsense black comedy.","torrent":{"xt":"urn:btih:4d506b07d2613805ef35d965eaa8d078431cdab1","amp;dn":"Breaking+Bad+Season+1+Swesub+-+Complete-JiMiC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d506b07d2613805ef35d965eaa8d078431cdab1","infoHashBuffer":{"type":"Buffer","data":[77,80,107,7,210,97,56,5,239,53,217,101,234,168,208,120,67,28,218,177]},"announce":[],"urlList":[]}}