{"title":"Railworks TS2014 Just Trains Chengdu to Suining High Speed Route","uid":10141470,"size":218201882,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4da54da8018f315278f1cf9609bddf916ebb2d52&amp;dn=Railworks+TS2014+Just+Trains+Chengdu+to+Suining+High+Speed+Route&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tpb_4_ever","files":-1,"time":1400004605,"description":"The Chengdu to Suining route is a modern dedicated high speed passenger route in Southwest China. Created for Train Simulator 2014, it is based on the real route with enhancements. The route is 146km in length, and trains on the route are capable of running at 350 km/h. The fastest train takes only 33 minutes to finish the journey.\n\nThe route is equipped with the CTCS-3 (China Train Control System) signalling system so that both 350 km/h and 250 km/h capable trains can run on it.\n\nSupplied with the route is the CRH1A EMU (Electro Motive Unit) that is designed for commuter use stopping at the stations along the route. This unit is capable of running at 250 km/h (155 mph) but in normal service runs at 220 km/h (137 mph). The CRH1E includes the CTCS-3 Cab signalling system.\n\nSix Standard scenarios and one Free Roam scenario are included to allow you to fly at high speed on the ground and enjoy the beautiful scenery of the Sichuan Basin area.\n\nImportant! You will require the following assets for the route to display correctly:\n- European Loco &amp; Asset Pack\n- US Loco &amp; Asset Pack\n\n\n\nPlease support the developers and buy some of their content if you can afford it.\n\n\nPlease use the email address or the facebook fanpage for requests, questions and also if you want to share an addon with the community which we will post on your behalf.\n\nIf you would like to contribute, please read the Readme.pdf.\n\n\n\n\nA Team tpb_4_ever upload.","torrent":{"xt":"urn:btih:4da54da8018f315278f1cf9609bddf916ebb2d52","amp;dn":"Railworks+TS2014+Just+Trains+Chengdu+to+Suining+High+Speed+Route","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da54da8018f315278f1cf9609bddf916ebb2d52","infoHashBuffer":{"type":"Buffer","data":[77,165,77,168,1,143,49,82,120,241,207,150,9,189,223,145,110,187,45,82]},"announce":[],"urlList":[]}}