{"title":"Mr. Tony Bennett - The Duets Vols I &amp; II 320k (musicfromrizz","uid":6694901,"size":313065756,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4eac4c518481b35eb6ef24f7007506333b7e64e0&amp;dn=Mr.+Tony+Bennett+-+The+Duets+Vols+I+%26amp%3B+II+320k+%28musicfromrizz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"musicfromrizzo","files":-1,"time":1316739853,"description":"Enjoy this great performer along with his &quot;musical number&quot; duet guests!\n\nMichael Rizzo Chessman\nmusicfromrizzo\n\n\nTony Bennett - The Duets Vols I &amp; II 320k (musicfromrizzo)\n\n\nTony Bennett - Duets I (An American Classic - 2006) \n\nTony Bennett - Are You Havin' Any Fun (Duet with Elvis Costello)\nTony Bennett - Because Of You (Duet with K.D. Lang)\nTony Bennett - Cold, Cold Heart (Duet with Tim McGraw)\nTony Bennett - For Once In My Life (Duet with Stevie Wonder)\nTony Bennett - How Do You Keep The Music Playing (Duet with George Michael)\nTony Bennett - I Left My My Heart In San Francisco\nTony Bennett - I Wanna Be Around (Duet with Bono)\nTony Bennett - If I Ruled The World (Duet with Celine Dion)\nTony Bennett - Just In Time (Duet with Michael Buble')\nTony Bennett - Lullaby Of Broadway (Duet with Dixie Chicks)\nTony Bennett - Put On A Happy Face (Duet with James Taylor)\nTony Bennett - Rags To Riches (Duet with Elton John)\nTony Bennett - Sing, You Sinners (Duet with John Legend)\nTony Bennett - Smile (Duet with Barbra Streisand)\nTony Bennett - The Best Is Yet To Come (Duet with Diana Krall)\nTony Bennett - The Boulevard Of Broken Dreams (Duet with Sting)\nTony Bennett - The Good Life (Duet with Billy Joel)\nTony Bennett - The Shadow Of Your Smile (Duet with Juanes)\nTony Bennett - The Very Thought Of You (Duet with Paul McCartney)\n\n\nTony Bennett - Duets II (2011) \n\nTony Bennett - Blue Velvet (Duet with K.D. Lang)\nTony Bennett - Body And Soul (Duet with Amy Winehouse)\nTony Bennett - Don't Get Around Much Anymore (Duet with Michael Buble)\nTony Bennett - Hoe Do You Keep The Music Playing (Duet with Aretha Franklin)\nTony Bennett - It Had To Be You (Duet with Carrie Underwood)\nTony Bennett - On The Sunny Side Of The Street (Duet with Willie Nelson)\nTony Bennett - One For My Baby (And One For The Road (Duet with John Mayer)\nTony Bennett - Speak Low (Duet with Norah Jones)\nTony Bennett - Stranger In Paradise (Duet with Andrea Bocelli)\nTony Bennett - The Girl I Love (Duet with Sheryl Crow)\nTony Bennett - The Lady Is A Tramp (Duet with Lady Ga-ga)\nTony Bennett - The Way You Look Tonight (Duet with Ms. Faith Hill)\nTony Bennett - This Is All I Ask (Duet with Josh Groban)\nTony Bennett - Watch What Happens (Duet with Natalie Cole)\nTony Bennett - When Do The Bells Ring For Me (Duet with Mariah Carey)\nTony Bennett - Who Can I Turn To (When Nobody Needs Me) (Duet with QueenLatifah)\nTony Bennett - Yesterday I Heard The Rain (Duet with Alejandro Sanz)\n ","torrent":{"xt":"urn:btih:4eac4c518481b35eb6ef24f7007506333b7e64e0","amp;dn":"Mr.+Tony+Bennett+-+The+Duets+Vols+I+%26amp%3B+II+320k+%28musicfromrizz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eac4c518481b35eb6ef24f7007506333b7e64e0","infoHashBuffer":{"type":"Buffer","data":[78,172,76,81,132,129,179,94,182,239,36,247,0,117,6,51,59,126,100,224]},"announce":[],"urlList":[]}}