{"title":"Trailer Park Boys - S01E05 - I'm Not Gay, I Love Lucy. Wait A S","uid":6419738,"size":181212696,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f06dca036626c35a2c1bb64af2c2e31fd7a3953&amp;dn=Trailer+Park+Boys+-+S01E05+-+I%5C%27m+Not+Gay%2C+I+Love+Lucy.+Wait+A+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"The.Buzzsaw","files":-1,"time":1306275446,"description":"                            Welcome to Buzzsaw TV\n                          \n                          Series: &quot;Trailer Park Boys&quot;\n\n                        Season one (1) Episode five (5)\n\n              {I'm Not Gay, I Love Lucy. Wait A Second, Maybe I Am Gay}\n\n\n\n\n     Documented and proven to be the greatest comedy series to ever come from Canada, &quot;Trailer Park Boys&quot; has spread worldwide and even rumored to be the greatest display of comedy of any type or form ever created! The Internet Movie Data Base has the &quot;Trailer Park Boys&quot; ranked 28th all-time greatest television series, and voters have talleyed up almost six-thousand(6,000)votes that has an overall almost unbelieveable average rank to be an astonishing 9.2 out of 10! \n\n     Reviews from across the web can only tell stories of their overwhelmed perception of the show. One guy wrote &quot;The 80's had SCTV, the 90's Kids in the Hall, for Canada, the 00's belong to the Trailer Park boys!&quot; another said(from California), and I quote, &quot;Completely original, brilliantly written, beautifully acted, perpetually shocking and always quotable, TPB is simply one of the top 5 shows of all time. How many shows have had so, so many memorable, hilarious lines? Only the Simpsons, Larry Sanders, Sopranos quickly come to mind. The subject matter is refreshing and daring, it certainly could never escape heavy censorship in the US. Every line is funny, the dialogue is almost &quot;clockwork orange&quot; like. All the characters are excellent, the ensemble works so well together, I love seeing all of them, with their various looks changing season to season. Ricky may the best character overall, but they all have essential roles they have all mastered. I will admit that seasons 4 and 5 are slipping just the slightest bit from the dizzying heights of season 3, but it is still better than 99% of anything else. The Christmas Special &quot;Prequel&quot; from a couple of years ago was pure gold. It answered many questions, especially about Randy, and was brilliant. We finally got to see some winter scenes. Hopefully the movie will have some scenes in winter. The Alex Lifeson episode from season 3 should be in the TV Hall of Fame as one of the greatest 23 minutes ever shown. Thank you Canada!!! I am trying to spread the word down here in California.&quot;\n\n     Others said &quot;One of the funniest &amp; addictive shows ever...&quot;, and &quot;There are some seriously memorable over-the-top characters in this show&quot;, etc.! The compliments go on and on and on. I'll just say that heroine doesn't have near the addictive properties that episodes of &quot;Trailer Park Boys&quot; have. If you become a fan, please show your gratitude and support by seeding.\t\t \n\n","torrent":{"xt":"urn:btih:4f06dca036626c35a2c1bb64af2c2e31fd7a3953","amp;dn":"Trailer+Park+Boys+-+S01E05+-+I%5C%27m+Not+Gay%2C+I+Love+Lucy.+Wait+A+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f06dca036626c35a2c1bb64af2c2e31fd7a3953","infoHashBuffer":{"type":"Buffer","data":[79,6,220,160,54,98,108,53,162,193,187,100,175,44,46,49,253,122,57,83]},"announce":[],"urlList":[]}}