{"title":"Intracranial Aneurysm Surgery [PDF][tahir99] VRG.pdf","uid":10688972,"size":23606519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f4cc1d0078c39c0aae5e6afb9dbda6ccee32836&amp;dn=Intracranial+Aneurysm+Surgery+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tahir99","files":1,"time":1407096495,"description":"Intracranial Aneurysm Surgery: Basic Principles and Techniques\n\nby Duke Samson (Editor), H. Hunt Batjer (Editor), Jonathan White (Editor), Talmadge Trammell (Editor), &amp; 1 more\n\nTRUE PDF, BOOKMARKED\n\nimage\n\nISBN-13: 978-1604066937 | ISBN-10: 1604066938 | Edition: 1st edition | July 29, 2011\n\nPraise for this book:\n\nIntracranial Aneurysm Surgery uses an engaging and conversational writing style to make complex concepts easy to understand and includes beautiful illustrations that elucidate aneurysm surgery techniques. I would recommend this book as a valuable addition to any young neurosurgeons library. -- AANS Newsletter\n\nIntracranial Aneurysm Surgery: Basic Principles and Techniques is a highly approachable and user-friendly manual that takes a step-by-step approach to explaining the techniques of aneurysm surgery. Its straightforward format makes it appealing to all levels, from trainees to seasoned practitioners by putting basic information at the readers fingertips.\n\nSpecial Features:\n\nOffers readers a concise, easy-to-follow guide to aneurysm surgery, so neurosurgeons can quickly find the information they need\nProvides an opportunity for readers to learn the surgical techniques used by senior vascular neurosurgeons with stellar reputations in both open and endovascular treatment of aneurysms\nUses an engaging and conversational writing style to make complex concepts easy to understand\nIntroduces the authors key guiding principles, including their philosophy of the operating room and skill progression, that are especially useful for trainees\nIncludes beautiful original illustrations that elucidate aneurysm surgery techniques\n\nMastering the approaches presented in Intracranial Aneurysm Surgery: Basic Principles and Techniques will not only help young surgeons learn their craft from highly respected specialists, but will also expand their technical abilities and understanding of the breadth of neurosurgical aneurysm pathology.","torrent":{"xt":"urn:btih:4f4cc1d0078c39c0aae5e6afb9dbda6ccee32836","amp;dn":"Intracranial+Aneurysm+Surgery+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4cc1d0078c39c0aae5e6afb9dbda6ccee32836","infoHashBuffer":{"type":"Buffer","data":[79,76,193,208,7,140,57,192,170,229,230,175,185,219,218,108,206,227,40,54]},"announce":[],"urlList":[]}}