{"title":"MicroSoft ToolKit 2.5.1 iso","uid":10412031,"size":51314688,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4f98bf43a0431f541ef68c44d264efc572d49d43&amp;dn=MicroSoft+ToolKit+2.5.1+iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1403552443,"description":"  Check out all prodallasosoft torrents at http://thepiratebay.se\n\n/user/prodallasosoft\n\n                         CREDIT TO MURPHY78\n\nThis is ISO, drag to WINRAR and Double click-or Mount and open in new window.\n\nMicrosoft Toolkit - Official KMS Solution for Microsoft Products\n\nThis is a set of tools and functions for managing licensing, deploying, and activating Microsoft Office and Windows. All output from these functions is displayed in the Information Console. All functions are run in the background and the GUI is disabled to prevent running multiple functions, as they could conflict or cause damage if run concurrently. The Microsoft Office Setup Customization Functions (Customize Setup Tab), AutoKMS Uninstaller (if AutoKMS is installed), AutoRearm Uninstaller (if AutoRearm is installed), Office Uninstaller and Product Key Checker work even if Microsoft Office or Windows is not installed/supported. For information about individual functions, see the program readme.\n\nRequirements:\nMicrosoft .NET Framework 4.0 or 4.5 (Not 3.5)\nMicrosoft Office 2010 or Later for Office Toolkit Support \nWindows Vista or Later for Windows Toolkit Support\n\nMicrosoft Toolkit Changelog: \n\n2.5.1\n-Added Channel Switching of Microsoft Office 2013 SP1 pure edition (SP1 not in Updates folder).\n-Allow AutoKMS to use EZ-Activator routines using command-line parameters (AutoKMS.exe /EZActivator).\n-Fixed Show CMID not working due to being located in 1 of 2 different WMI SPP providers depending on OS.\n-Fixed Show Unlicensed display never showing if you have no keys installed.\n-Improved Channel Switcher unsupported detection.\n\nCredits:\n-Bosh for the original GUI Design and co-development of Office Toolkit\n-ZWT for the original KMSEmulator\n-letsgoawayhell, Phazor, nosferati87, and mikmik38 for KMSEmulator fixes and improvements\n-MasterDisaster, FreeStyler, Daz, nononsense, and janek2012 for work on Key Checker\n\nDownloads:\n2.5.1\nEXE MD5: DB6F89CCB0EBABAFDF9ADD7E10885699\nEXE SHA-1: 88B4103C49DF9CD597334988389D111A272F8B36","torrent":{"xt":"urn:btih:4f98bf43a0431f541ef68c44d264efc572d49d43","amp;dn":"MicroSoft+ToolKit+2.5.1+iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f98bf43a0431f541ef68c44d264efc572d49d43","infoHashBuffer":{"type":"Buffer","data":[79,152,191,67,160,67,31,84,30,246,140,68,210,100,239,197,114,212,157,67]},"announce":[],"urlList":[]}}