{"title":"Helios - Caesura (2008) 320kbps CBR","uid":4648997,"size":118228992,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:505ba9695417b49572497b1b1c25fe980536e3f7&amp;dn=Helios+-+Caesura+%282008%29+320kbps+CBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JimboJangles","files":10,"time":1231981083,"description":"Boston-based multi-instrumentalist Keith Kenniff has been with Type from the very beginning, and now as Type is well into its fifth year, he offers his fifth gorgeous release. The five years have seen Keith's style evolve constantly -- from his drifting piano compositions under his Goldmund alias, to the Helios sound moving out from underneath the clipped beat-heavy electronics of Unomia and into a more unique place, even incorporating vocals on the Ayres mini album. Caesura, however, is a &quot;proper&quot; follow-up to the acclaimed Eingya, and sees Keith return to the instrumental sound he knows so well. In fact, in many ways Caesura is a more electronic work than its predecessors, blending layer upon layer of synthesizer and adding his assured drumming to come up with the perfect meeting of indie-pop and ambient music. The haunting cinematic element is still present of course, but these songs are more rounded and confident than any in Keith's career. From the delicate bliss of &quot;Hope Valley Hill&quot; which opens up the album with gauzy nostalgia and, as the title promised, hope, through the chunky pop of &quot;Come With Nothings,&quot; it is clear that Keith's music is as arresting as it ever was. Taking cues from the lilting indie-electronics of Ulrich Schnauss and the unfussy ambience of Brian Eno, Keith manages to inject this with his knowledge as a composer. The epic harmonies of &quot;Backlight,&quot; for instance, reveal a lightness of touch rarely heard in the genre, with sweeping synthesized chords buzzing alongside Keith's signature guitar. Accompanied by more gorgeous artwork from Matthew Woodson, Caesura is a glowing record for the winter months, and a glimmer of hope to keep the harsher seasons at bay.","torrent":{"xt":"urn:btih:505ba9695417b49572497b1b1c25fe980536e3f7","amp;dn":"Helios+-+Caesura+%282008%29+320kbps+CBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"505ba9695417b49572497b1b1c25fe980536e3f7","infoHashBuffer":{"type":"Buffer","data":[80,91,169,105,84,23,180,149,114,73,123,27,28,37,254,152,5,54,227,247]},"announce":[],"urlList":[]}}