{"title":"Etta James - Rocks The House (Live)@320","uid":4180255,"size":136248212,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50fe30d963123bd4912457d7a5db86e7ca178866&amp;dn=Etta+James+-+Rocks+The+House+%28Live%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"alekow1","files":19,"time":1210361798,"description":"Searing stuff -- easily one of Etta James&amp;#039; greatest albums! The set is a non-stop jam, recorded live at the New Era Club in Nashville before a small and screaming crowd -- a perfect performance all the way through, one that showcases Etta as she rarely sounded on vinyl during the 1960s. The whole album runs away like a train on fire, and it&amp;#039;s filled with incredibly lively readings of tracks like &quot;Something&amp;#039;s Got A Hold On Me&quot;, &quot;Baby What You Want Me To Do&quot;, &quot;Money&quot;, &quot;Seven Day Fool&quot;, and &quot;Woke Up This Morning&quot; -- all taken at versions longer than the usual under-3 minute single takes!\n\nThough the studio albums Etta James made for Chess in the 1960s usually had the blues singer surrounded by lush production and string-heavy arrangements, this live date finds her performing with only a rhythm section, organist, guitarist, and tenor saxophonist. The singer seems to respond to both the stripped-down setting and the enthusiastic audience with noticeable abandon. In fact, James the classy balladeer, a role she sometimes plays on her studio albums, is nowhere to be found on this blazing set. The only time the band slows down is on the tearjerker story-song &quot;All I Could Do Is Cry&quot; (though what the tune lacks in tempo it makes up for in emotional intensity).\n\nThe rest of the set is straight-edged blues and R&amp;B, including covers of some hits of the day, like &quot;Money (That&amp;#039;s What I Want)&quot; and Ray Charles&amp;#039;s &quot;What&amp;#039;d I Say.&quot; Jimmy Reed&amp;#039;s &quot;Baby What You Want Me To Do&quot; (on which James does a growling, harmonica-imitating vocal solo) steps up the blues quotient, as does the band&amp;#039;s finale of Willie Dixon&amp;#039;s &quot;I Just Want To Make Love to You,&quot; with James&amp;#039;s gospel-drenched pipes wailing all the while. ETTA JAMES ROCKS THE HOUSE indeed.\n\n\n\n01. Something&amp;#039;s Got A Hold On Me                                                                                   \n02. Baby What You Want Me To Do                                                                                    \n03. What&amp;#039;d I Say                                                                                                   \n04. Money (That&amp;#039;s What I Want)                                                                                     \n05. Seven Day Fool                                                                                                 \n06. Sweet Little Angel                                                                                             \n07. Ohh Poo Pah Doo                                                                                                \n08. Woke Up This Morning                                                                                           \n09. Ain&amp;#039;t That Lovin&amp;#039; You Baby  (previously unreleased)                                                                               \n10. All I Could Do Is Cry   (previously unreleased)                                                                                 \n11. I Just Want To Make Love To You  (previously unreleased)\n\n\n\nPersonnel: Etta James (vocals); David Walker (guitar); Gavrell Cooper (tenor saxophone); Vonzell Cooper (organ); Marion Wright (bass); Freeman Brown, Richard Waters (drums).\n\nRecorded live at The New Era Club, Nashville, Tennessee on September 27 and 28, 1963. \nOriginally released on Argo (4032). \nIncludes liner notes by Ralph Bass and by Don Snowden.\nDigitally remastered by Paul Elmore (MCA Studios, North Hollywood, California).\nLabel: Chess/Mca\nDate: 1992\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:50fe30d963123bd4912457d7a5db86e7ca178866","amp;dn":"Etta+James+-+Rocks+The+House+%28Live%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50fe30d963123bd4912457d7a5db86e7ca178866","infoHashBuffer":{"type":"Buffer","data":[80,254,48,217,99,18,59,212,145,36,87,215,165,219,134,231,202,23,136,102]},"announce":[],"urlList":[]}}