{"title":"New Dominion Tank Police OVA Complete (1994) (ENG SUBS) [Dual Au","uid":3268399,"size":1468714976,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:517a41cc4f97c28b07ee040c9f5043365aeade49&amp;dn=New+Dominion+Tank+Police+OVA+Complete+%281994%29+%28ENG+SUBS%29+%5BDual+Au&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eez","files":9,"time":1103846429,"description":"Description from http://www.animeshrine.com/vindex.php?series=dominiontankpolice\n\nKobe, Japan-2100 A.D. Urban terrorism in japan is out of control. Newport City and its law enforcement agencies begin to surrender to inner city crime. The Tank Police are assigned to restore order, but their ruthless methods in combating crime only create more destruction and chaos.\n\nEpisode 1: &quot;Launch Tank Police&quot;\nIgnoring the mayor's direct order to tone down their law enforcing tactics, Leona and the Tank Police blast their way into the middle of a mysterious terrorist attack involving the chief of police.\n\nEpisode 2: &quot;Charles Brenten, Master Detective&quot;\nLeona's friend and former co-worker is murdered. Bent on revenge, Leona quits her job to track down the killer, and finds herself captured by the terrorists responsible for her friends death.\n\nEpisode 3: &quot;limit the Tube Way&quot;\nA Dai Nippon Giken truck is charging out of control towards the heart of Newport City, destroying everything in its path. Its cargo is the deadly explosive compound: Liberium W23, enough to obliterate the whole city. Dai Nippon Giken headquarters attempt to shut down its automatic piloting system, but realize that unknown terrorists have intercepted the transmission and taken control of the truck via satellite. Police enforce evacuation measures, realizing they are unable to stop the truck before it reaches the gateway to the city, and their only chance is to summon the Tank Police!\n\nEpisode 4: &quot;The Chase&quot;\nUnder the cover of the biochemical smog engulfing Newport City, the cunning Cat Sisters manage to steal Bonaparte on behalf of a mysterious gang. The gang plans to dispose of the Cat Sisters after retrieving the secret information hidden within Bonaparte. The gang is apparently being supported by a powerful corporate organization...and only Lean, Leona, and the Tank Police have the capability to crack the case.\n\nEpisode 5: &quot;Conflict City&quot;\nLeona and Brenten find out that the mayor of Newport City has been assaulted. When they arrive at the mayors house, they see a high-maneuver combat robot. Leona rescues the wounded mayor and heads towards the hospital. To their surprise, they find out the robot is property of the Dainihon Giken Corporation.\n\nEpisode 6: &quot;End the Dreaming&quot;\nWith the news that the mayor is still alive, the two military research corporations plan an all-out assault on Newport City Hospital The Tank Police surround the building and wait in anticipation for a surprise attack by Coldsman's combat robot. Will the Tank Police be destroyed defending their mayor? Will Leona be able to stop Coldsman before he escapes? It's all or nothing for the Tank Police in this gripping episode.\n\nProduction Credits\nOriginal Story: Masamune Shirow (Published by Seishinsha)\nDirector / Main Character Design: Noboru Furuse\nSupervisor: Junichi Sakai\nScreenplay: Hiroshi Yamaguchi, Mitsuo Mutsuki and Nemuruanzu\nAnimation Director: Shuichi Shimamura, Hisashi Ezura and Kazuto Nakazawa\nArt Direction: Noboru Yoshida\nMechanical Design: Akira Ogura, Kengo Inagaki\nMusic: Yoichiro Yoshikawa\nProduced By: J.C. Staff","torrent":{"xt":"urn:btih:517a41cc4f97c28b07ee040c9f5043365aeade49","amp;dn":"New+Dominion+Tank+Police+OVA+Complete+%281994%29+%28ENG+SUBS%29+%5BDual+Au","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"517a41cc4f97c28b07ee040c9f5043365aeade49","infoHashBuffer":{"type":"Buffer","data":[81,122,65,204,79,151,194,139,7,238,4,12,159,80,67,54,90,234,222,73]},"announce":[],"urlList":[]}}