{"title":"Erin Kelly - The Poison Tree","uid":15223773,"size":339191152,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:519d6a42e42b154abafcbed0b636eaeae7c5333e&amp;dn=Erin+Kelly+-+The+Poison+Tree&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Cybotage","files":31,"time":1467754253,"description":"From an incredible new voice in psychological suspense, a novel about the secrets that remain after a final bohemian summer of excess turns deadly.\r\n\r\nThis taut psychological thriller begins when Karen and her nine-year- old daughter, Alice, pick up Rex from a ten-year stint in prison for murder. Flash back to the sultry summer in 1990s London when Karen, a straight-A student on the verge of college graduation, first meets the exotic, flamboyant Biba and joins her louche life in a crumbling mansion in Highgate. She begins a relationship with Biba's enigmatic and protective older brother, Rex, and falls into a blissful rhythm of sex, alcohol, and endless summer nights. Naïvely, Karen assumes her newfound happiness will last forever. But Biba and Rex have a complicated family history-one of abandonment, suicide, and crippling guilt-and Karen's summer of freedom is about to end in blood.\r\n\r\nWhen old ghosts come back to destroy the life it has taken Karen a decade to build, she has everything to lose. She will do whatever it takes to protect her family and keep her secret. Alternating between the fragile present and the lingering past with a shocker of an ending, The Poison Tree is a brilliant suspense debut that will appeal to readers of Kate Atkinson, Donna Tartt, and Tana French.\r\n\r\nRead by Alison Reid\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:519d6a42e42b154abafcbed0b636eaeae7c5333e","amp;dn":"Erin+Kelly+-+The+Poison+Tree","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"519d6a42e42b154abafcbed0b636eaeae7c5333e","infoHashBuffer":{"type":"Buffer","data":[81,157,106,66,228,43,21,74,186,252,190,208,182,54,234,234,231,197,51,62]},"announce":[],"urlList":[]}}