{"title":"Turing- Pioneer of the Information Age [PDF] [StormRG]","uid":9835284,"size":3449985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51a325f564f21099cc8e5375873486993c0082c9&amp;dn=Turing-+Pioneer+of+the+Information+Age+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":3,"time":1395896921,"description":"Author: Jack Copeland \nHardcover: 224 pages\nPublisher: Oxford University Press, USA (January 20, 2013)\nLanguage: English\nISBN-10: 0199639795\nISBN-13: 978-0199639793\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nIn 1999,Time magazine named Alan Turing one of the twentieth century's 100 greatest minds, alongside the Wright brothers, Albert Einstein, and Watson and Crick. Who was Turing, and what did he achieve during his tragically short life? Marking the centenary of Turing's birth, here is a short, highly accessible introduction to this brilliant scientist and his work, written by leading authority Jack Copeland. Copeland describes Alan Turing's revolutionary ideas about Artificial Intelligence and his pioneering work on Artificial Life, his all-important code-breaking work during World War II, and his contributions to mathematics, philosophy, and the foundations of computer science. To him we owe the brilliant innovation of storing applications and programs inside the computer's memory, ready to be opened when we wish. With this single invention (known as the &quot;stored-program&quot; concept), Turing changed the world. A distinctive feature of the book is the extensive system of hyperlinks to The Turing Archive for the History of Computing, an on-line library of facsimiles of typewritten documents by Turing and his fellow pioneers of the electronic computer.\n","torrent":{"xt":"urn:btih:51a325f564f21099cc8e5375873486993c0082c9","amp;dn":"Turing-+Pioneer+of+the+Information+Age+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51a325f564f21099cc8e5375873486993c0082c9","infoHashBuffer":{"type":"Buffer","data":[81,163,37,245,100,242,16,153,204,142,83,117,135,52,134,153,60,0,130,201]},"announce":[],"urlList":[]}}