{"title":"Lonely Planet - Greek Islands - 9th Ed (2016).pdf Gooner","uid":14723522,"size":53888420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:522bbe04b33eedb1517e8d5fd92a142dbce5ca32&amp;dn=Lonely+Planet+-+Greek+Islands+-+9th+Ed+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464538090,"description":"Lonely Planet - Greek Islands (Travel Guide) - 9th Edition (2016).pdf Gooner\r\n\r\nPublisher: Lonely Planet; 9 edition (11 Mar. 2016)\r\nLanguage: English\r\nISBN-10: 1743218605\r\nISBN-13: 978-1743218600\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Greek Islands is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Meander down the cobbled alleyways of Rhodes Old Town, unwind on sandy stretches of Greece's remote shores, or catch the Santorini sunset; all with your trusted travel companion. Get to the heart of the Greek Islands and begin your journey now!\r\n\r\nInside Lonely Planet Greek Islands Travel Guide:\r\n\r\n* Colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - including customs, history, art, literature, music, dance, architecture, politics, wildlife, and cuisine\r\n\r\n* Free, convenient pull-out Athens map (included in print version), plus over 116 local maps\r\n\r\n* Covers Athens, Crete, the Ionian Islands, the Cyclades, Santorini, the Saronic Gulf Islands, Dodecanese, the Northeastern Aegean Islands, Evia, the Sporades, and more\r\n\r\nThe Perfect Choice: Lonely Planet Greek Islands, our most comprehensive guide to the Greek Islands, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for more coverage? Check out our Lonely Planet Greece guide for a comprehensive look at all the country has to offer, or Lonely Planet Discover Greece, a photo-rich guide to the country's most popular attractions.\r\n\r\n* Looking for a guide focused on Crete? Check out our Lonely Planet Crete guide for a comprehensive look at all the island has to offer.\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:522bbe04b33eedb1517e8d5fd92a142dbce5ca32","amp;dn":"Lonely+Planet+-+Greek+Islands+-+9th+Ed+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522bbe04b33eedb1517e8d5fd92a142dbce5ca32","infoHashBuffer":{"type":"Buffer","data":[82,43,190,4,179,62,237,177,81,126,141,95,217,42,20,45,188,229,202,50]},"announce":[],"urlList":[]}}