{"title":"The Mask Of Zorro - Music From The Motion Picture","uid":9481721,"size":179560460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52c5373dc26d597d0b651ebe63ed8de44aee6949&amp;dn=The+Mask+Of+Zorro+-+Music+From+The+Motion+Picture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389809786,"description":"Source: 1998 CD\n\nThe Mask Of Zorro - Music From The Motion Picture 320cbr (Big Papi) 1998 Soundtrack\n\n\n\nBy -Genevieve-\n\nMuch has already been said about this soundtrack, but I wanted to elaborate on something:\n\nThe only reason the music from the dance sequence isn't on this soundtrack is because it wasn't composed by Horner. I believe the dance sequence music is originally based on a famous folk song from the 1800's called &quot;El Sombrero Blanco&quot;. (Supposedly, it was also used in 1940's The Mark of Zorro during a dance sequence.)\n\nI did find a rendition online by Enrique Rodriguez called &quot;El Sombrero&quot; that sounds very similar to what was used in The Mask of Zorro. Keep in mind that the folk song is more upbeat -- in the movie version, they slowed it down, added more strings, and made it more dramatic.\n\nSo, don't let the fact that the dance sequence isn't on here keep you from buying this soundtrack. The rest of the music is wonderfully orchestrated, with the dancing feet/clapping rhythms matching the quick fencing action seen in the movie. When I first listened to &quot;Zorro's Theme&quot;, during each dramatic crescendo, I could perfectly envision Zorro on-screen making one of his heroic entrances. It's hard to explain -- everytime I hear that song, I feel like standing on a rock, letting the wind blow through my hair, and staring into the sunset. I know that sounds ridiculous, lol, but it's really what goes through my head. Just listen to the song.\n\nAnyway, I originally bought this soundtrack because of &quot;I Want to Spend My Lifetime Loving You&quot;, which is now one of my favorite movie songs of all time. And, I was pleasantly surprised with the rest of the music, which allowed me to relive what was already a beautiful movie-going experience. If you at least &quot;liked&quot; the movie, this soundtrack will be well worth your money.\n\nI believe the music was what made the movie so powerfully enthralling, romantic, adventurous... The music evokes passion; it makes you feel like you're in that era and makes you believe in heroes again. The thrill you feel when you see Zorro, in his trademark gesture, raising his horse Tornado to the sun, waving to the people, and galloping off -- that's the thrill that is captured in this music.","torrent":{"xt":"urn:btih:52c5373dc26d597d0b651ebe63ed8de44aee6949","amp;dn":"The+Mask+Of+Zorro+-+Music+From+The+Motion+Picture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52c5373dc26d597d0b651ebe63ed8de44aee6949","infoHashBuffer":{"type":"Buffer","data":[82,197,55,61,194,109,89,125,11,101,30,190,99,237,141,228,74,238,105,73]},"announce":[],"urlList":[]}}