{"title":"Coldplay 24 Bit Vinyl Pack","uid":8847930,"size":11046831640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53646ae15f1b25d35ff0644c8d98cff451fb2bff&amp;dn=Coldplay+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"politux","files":-1,"time":1377449672,"description":"\n  Coldplay 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Britpop\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  A Rush of Blood to the Head\n  Mylo Xyloto\n  Parachutes\n  Prospekt's March EP\n  The Singles 1999-2006 Boxset\n  Viva La Vida\n  X&amp;Y (two versions)  \n\n  After surfacing in 2000 with the breakthrough single &quot;Yellow,&quot; Coldplay quickly became one of the biggest bands of the new millennium, honing a mix of introspective Brit-pop and anthemic rock that landed the British quartet a near-permanent residence on record charts worldwide. The group's emergence was perfectly timed; Radiohead had just released the overly cerebral Kid A, while Oasis had ditched two founding members and embraced psychedelic experimentation on Standing on the Shoulder of Giants. U.K. audiences were hungry for a fresh-faced rock band with big aspirations and an even bigger sound, and Coldplay were more than happy to take the reins. Parachutes went multi-platinum in several countries and earned the band its first Grammy, but Coldplay continued to grow into the 2000s, topping their debut album's success with higher record sales and an increased public profile.\n\n  Chris Martin (vocals/piano), Jon Buckland (guitar), Will Champion (drums), and Guy Berryman (bass) were all born into musical households. Martin, the eldest of five, began playing the piano as a young child and later took solace in the work of Tom Waits. Buckland, on the other hand, grew up with the heavy guitar sounds of Eric Clapton and Jimi Hendrix. Scotland native Berryman preferred funk to indie rock, thereby leaving him to play bass, while multi-instrumentalist Champion didn't plan to be a drummer until he joined Coldplay's lineup. The bandmates came together in 1996 while attending the University College of London, and the Safety EP was issued shortly after their first gig at a Manchester festival for unsigned bands. The release only saw 500 pressings, as did the subsequent Brothers &amp; Sisters EP. Nevertheless, it was enough to win the band a U.K. deal with Parlophone Records in April 1999, and the five-track Blue Room EP arrived that fall. With nods from the media, Coldplay were hailed as the next Travis, thanks to their simple acoustics and charming personas.\n\n  Parlophone ushered Coldplay into Parr St. Studios in Liverpool, where they recorded the bulk of their debut album. Parachutes was released in July 2000 and became a swift hit on the strength of four U.K. singles, several of which enjoyed popularity in America as well. With &quot;Yellow&quot; climbing the charts on both sides of the Atlantic, Parachutes was released in the U.S. in November, where its sales soon rivaled -- and eventually surpassed -- those in the U.K.\n\n  Riding on the strength of their universally popular debut, Coldplay headed back into the studio in fall 2001 to work on a sophomore album. They emerged with A Rush of Blood to the Head, releasing the album worldwide in August 2002 and embarking on a global concert tour soon after. &quot;The Scientist&quot; enjoyed regular radio rotation, while both &quot;Clocks&quot; and &quot;In My Place&quot; won Grammy awards. The CD/DVD package Live 2003 was issued to highlight the group's popular tour, and Martin specifically earned a higher notch on the celebrity scale by marrying actress Gwyneth Paltrow in December 2003. Paltrow gave birth to the couple's first daughter, Apple Blythe Alison Martin, the following April.\n\n  Fatherhood didn't stop Martin from working, as Coldplay began recording material for a third album within weeks. Previously recorded material with longtime producer Ken Nelson was scrapped early on, while Danton Supple (Morrissey, the Cure) joined Coldplay to complete the recording of X&amp;Y. &quot;Speed of Sound&quot; marked Coldplay's first single from their long-awaited third effort in spring 2005; the album followed in June, topping charts around the world and selling more than eight million copies during its first year.\n\n  Such success put Coldplay on the same commercial level as U2, and Coldplay retreated to the studio in late 2006 to work with famed producer Brian Eno (who had teamed up with U2 several times in the past). Recording sessions with Eno were completed within one year, followed by several months of mixing and growing anticipation from the band's audience. Viva la Vida -- also known by its extended name, Viva la Vida or Death and All His Friends -- ultimately arrived in June 2008. Worldwide sales for the album had approached six million by November, when Coldplay released several new recordings (including a collaboration with hip-hop mogul Jay-Z) as part of the Prospekt's March EP. Preceded by first single &quot;Every Teardrop Is a Waterfall,&quot; Coldplay's fifth studio album, 2011's Mylo Xyloto, was produced by Markus Dravs, Daniel Green, and Rik Simpson (the official press release adds &quot;with enoxification and additional composition by Brian Eno&quot;). Live 2012, the band's second concert film/recording, followed in 2012.","torrent":{"xt":"urn:btih:53646ae15f1b25d35ff0644c8d98cff451fb2bff","amp;dn":"Coldplay+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53646ae15f1b25d35ff0644c8d98cff451fb2bff","infoHashBuffer":{"type":"Buffer","data":[83,100,106,225,95,27,37,211,95,240,100,76,141,152,207,244,81,251,43,255]},"announce":[],"urlList":[]}}