{"title":"Pubmed (11-2012)","uid":7864870,"size":5753244765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53fe082fad328c4176c95d793b4e68de8d02cd41&amp;dn=Pubmed+%2811-2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kunha7","files":1,"time":1354032685,"description":"All valid pubmed posts in medline format up until 23.1M\n\n\nThis 7-zip (PPMd-packaged) file contains all currently available posts, essentially a direct copy of all information present on pubmed in November 2012. It does not contain any full-text articles. All information is publicly accessible by anyone with an internet connection. A substantial fraction of the pmids contain an abstract of approximtaly 200 words.\n\n\nThe articles range from the year 1809 to 2013, spanning all scientific and non-scientific topics known to mankind. All scientific progress we have ever made to better understand the world around us and ourselves, packaged into a single 5.3gb compressed file. This zip decompresses to 40.7gb of raw text, and approximately 0.2gb of meta-data such as lists of valid and non-valid PMIDS. \n\n\nThis is a contribution to the scientific community. Burn it onto a DVD or place it on an old unused USB-stick. Maybe one day, mankind will be in need of a complete &quot;back-up&quot; of all scientific knowledge. No matter how this information is used, please use it for the love of science. If possible, support Foundations that finance scientific research, or dive into the world of science yourself to make your own intellectual contribution.","torrent":{"xt":"urn:btih:53fe082fad328c4176c95d793b4e68de8d02cd41","amp;dn":"Pubmed+%2811-2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53fe082fad328c4176c95d793b4e68de8d02cd41","infoHashBuffer":{"type":"Buffer","data":[83,254,8,47,173,50,140,65,118,201,93,121,59,78,104,222,141,2,205,65]},"announce":[],"urlList":[]}}