{"title":"Oncoplastic Breast Surgery","uid":6518575,"size":14830802,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5443aa3f044e89065267f6ddf51f4be90e181516&amp;dn=Oncoplastic+Breast+Surgery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1309916616,"description":"Oncoplastic Breast Surgery: A Guide to Clinical Practice\n Springer; 1st Edition | August 11, 2010 | ISBN-10: 3211993169 | 256 pages | PDF | 21.08 MB\n\n This teaching atlas is designed for breast surgeons specialized in breast cancer therapy including general surgeons, gynecologists and plastic/reconstructive surgeons. It contains more than 400 high quality photos and illustrations and step-by-step lectures from experienced and well known surgeons in Europe and the US. Its first part presents reviews about the most important and recent published articles regarding breast conserving therapy and oncoplastic surgery. The second part focuses on special operation techniques to improve the cosmetic outcome after breast conserving surgery and mastectomy using small parenchyma flaps, breast reduction techniques and pedicled or free flaps. The text highlights indications, contraindications and preoperative drawings of more than 15 different techniques. In addition, it provides the reader with special considerations for each technique, including upper pedicle and Lejour technique, lower as well as medial/lateral pedicles (Hall-Findlay) or the round block technique.","torrent":{"xt":"urn:btih:5443aa3f044e89065267f6ddf51f4be90e181516","amp;dn":"Oncoplastic+Breast+Surgery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5443aa3f044e89065267f6ddf51f4be90e181516","infoHashBuffer":{"type":"Buffer","data":[84,67,170,63,4,78,137,6,82,103,246,221,245,31,75,233,14,24,21,22]},"announce":[],"urlList":[]}}