{"title":"MacJournal v. 6.0.2 with Core keygen","uid":6987320,"size":30818009,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5465415fcba2a94b8a39ae4074a863b332328674&amp;dn=MacJournal+v.+6.0.2+with+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"polisdavid","files":-1,"time":1327609355,"description":"Note: keygen is a little twitchy so keep reopening it until it stays open!\n\nOfficial Web Site: &lt;a href=&quot; http://www.marinersoftware.com/products/macjournal/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.marinersoftware.com/products/macjournal/&lt;/a&gt;\n\n\nMacJournal is the world's most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geolocation, word count and progress tracking, as well as additional blogging support. A Timeline mode has been added to gig the journaler the ability to see their writing activity in chronological order. \n\nMacJournal 6 even introduces a feature for creating books from journals specially formatted for publishing. Add any kind of content, not just text. Drag PDFs, QuickTime movies, images, audio and more. Record audio and video, even publish to a blog account on Blogger, WordPress, LiveJournal, Posterous, and Tumblr. Dropbox support added as well.\n\nWhat's New:\n\n* Added a way to reveal the preferences file in the Finder.\n\n* Selecting a new custom location for backups will create a MacJournal\n  Backups folder inside that folder for safety reasons. If you had selected\n  your home folder, older folders might be pruned along with older\n  backups.\n\n* Fixed an issue encrypting a journal with an entry duplicated from\n  another entry in that journal but neither entry has changed after that.\n\n* Fixed a crash when syncing with an iOS device.\n\n* Improved memory usage after selecting multiple entries.\n\n* Enabled the cancel button in the Activity window for backups.\n\n* Improved entry detection when importing several entries in a single file\n  if the dates separating them do not have times.\n\n* Fixed improper jumps in scrolling when scrolling through a book\n  between entries.\n\n* Improved compatibility of popovers on 10.6 to work more like the real\n  ones on 10.7.\n\n* Fixed &quot;Send to MobileMe&quot; behavior.\n\n* Added &quot;None&quot; as a formatting option for text sent to blogs. No\n  conversion to HTML will be performed.\n\n* Restored some compatibility information for AppleScripts written\n  looking for the &quot;journals&quot; property on the application.\n\n* Added the ability to unlock journals in the Backup Browser.\n\n* Restoring a journal in the Backup Browser will restore all of its entries\n  as well.\n\n* Fixed the month display in the calendar view mode when switching\n  from single month to multi-month and back again.\n\n* When in the multi-month mode in the calendar view mode, clicking on a\n  shaded date will select an entry in that date.\n\n* Improved locale-specific behaviors for lowercase/uppercase/capitalize\n  Text Clean Up actions.\n\n* Added an indication of where a particular blog originates in the &quot;Send\n  to Other Blog&quot; menu.\n\n* Fixed a problem using auto-start on the Timer window when exiting\n  Full Screen mode.\n\n* Duplicating an entry will append &quot;(Copy)&quot; to the name and select the\n  copy at the end, similar to Finder.\n\n* Added a &quot;Request a Feature&quot; item to the Help menu.\n\n* Added a warning when entering the code for syncing with a touch\n  device if MacJournal cannot save that code for the future.\n\n* Fixed an issue decrypting journals from version 5 where some entries\n  have attachments with specific kinds of filenames.\n\n* When no find result is selected in the Find and Replace, &quot;Replace&quot; will\n  do nothing instead of behaving like &quot;Replace All&quot;.\n\n* Improved performance of smart journals by moving some of the\n  metadata searching into the background.\n\n* Fixed an issue where exported CSV files couldn't be re-imported\n  without shifting the date over a few hours and messing up Unicode\n  characters.\n\n* Added the ability to specify the metadata included in Automatic format\n  exports. This is only used for textual entries.\n\n* Improved handling of entries without any content for Automatic export\n  format to output an empty file with the requested metadata.\n\n* Fixed some problems with trying to export an entry to a location that\n  already has a file by that name.\n\n* Added hidden pref IndexEncryptedJournalContentWhileUnlocked to\n  disable indexing of content in encrypted journals after unlocking it.\n\n* Fixed the &quot;No Color&quot; action in the Text Color toolbar item when some\n  text already has a color.\n\n* Fixed entry content searching after doing a sync with an iOS device.\n\n* Fixed the crash checking functionality.\n\n* Fixed &quot;Allow Comments&quot; for Movable Type and WordPress blogs if\n  the button had never been pressed before.\n\n* Fixed an issue where the Quick Note window required a click before\n  you could type in it if it was shown while in another application.\n\nMore info: http://www.marinersoftware.com/products/macjournal/\n\nSystem Requirements:\n\nIntel, Mac OS X 10.6.8 or later\n\n---- PLEASE SEED ---","torrent":{"xt":"urn:btih:5465415fcba2a94b8a39ae4074a863b332328674","amp;dn":"MacJournal+v.+6.0.2+with+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5465415fcba2a94b8a39ae4074a863b332328674","infoHashBuffer":{"type":"Buffer","data":[84,101,65,95,203,162,169,75,138,57,174,64,116,168,99,179,50,50,134,116]},"announce":[],"urlList":[]}}