{"title":"The One True Barbecue (gnv64)","uid":14619363,"size":44722562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55429e8fa3404b62f304ac7f57f5cf44f76d8f45&amp;dn=The+One+True+Barbecue+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"gnv65","files":5,"time":1463250031,"description":"The One True Barbecue: Fire, Smoke, and the Pitmasters Who Cook the Whole Hog\r\nby Rien Fertel\r\nTouchstone | May 2016 | ISBN-10: 1476793972 | ePUB | 42.1 mb\r\n\r\nIn the spirit of the oral historians who tracked down and told the stories of America’s original bluesmen, this is a journey into the southern heartland (the Pork Belt) to discover the last of the great roadside whole hog pitmasters who hold onto the heritage and the secrets of America’s traditional barbecue.\r\nWhole hog barbecue is a culinary art form that is both disappearing and experiencing a renaissance. In The One True Barbecue, Rien Fertel chronicles the uniquely southern art of whole hog barbecue—America’s original barbecue—through the professional pitmasters who make a living firing, smoking, flipping, and cooking 200-plus pound pigs.\r\nMore than one hundred years have passed since a small group of families in the Carolinas and Tennessee started roasting a whole pig over a smoky, fiery pit. Descendants of these original pitmasters are still cooking, passing down the recipes and traditions across generations to those willing to take on the grueling, dangerous task. This isn’t your typical backyard pig roast, and it’s definitely not for the faint of heart. This is barbecue at its most primitive and tasty.\r\nFertel finds the gatekeepers of real southern barbecue to tell their stories and pays homage to the diversity and beauty of this culinary tradition. For anyone who has enjoyed the heavenly taste of tender, smoky, tangy whole hog, The One True Barbecue illuminates the origins and nuances of America’s one true cuisine, and is an eye-opening and deeply enjoyable look at the fascinating and complex makeup of southern heritage and tradition.\r\n\r\nAbout the Author\r\nRien Fertel is a Louisiana-born and based writer, historian, and teacher. He grew up in his family’s chain of restaurants across the country, and, after graduating from college, ran a grocery-deli in downtown New Orleans. Hurricane Katrina exiled him to New York, where he started writing about food. His work has appeared in Oxford American, Garden &amp; Gun, Southern Living, Spirit, Saveur, The Local Palate, and many other publications. He holds a PhD in History, teaches in New Orleans, and divides his time between the banks of the Mississippi River and a 100-plus year old church in St. Martinville, Louisiana.\r\n\r\nCONTENTS\r\nMap\r\nIntroduction: A Dying Breed\r\nChapter 1: Hungry\r\nChapter 2: The Ballad of Ricky Parker\r\nChapter 3: The Once and Future King of Barbecue\r\nChapter 4: The Prometheus of Pigs\r\nChapter 5: A Pitmaster’s History of Barbecue\r\nChapter 6: My Own Private Barbecue\r\nChapter 7: Ricky Parker Builds a Legacy\r\nChapter 8: South Carolina: The Battleground State\r\nChapter 9: Will Success Spoil Rodney Scott?\r\nChapter 10: Brooklyn and Beyond\r\nChapter 11: Come July, 100 Whole Hogs\r\nEpilogue: My One True Barbecue\r\nPhotographs\r\nAcknowledgments\r\nSelected Sources\r\nAbout Rien Fertel\r\n \nhttps://s32.postimg.org/y9d4lihut/The_One_True_Barbecue.jpg","torrent":{"xt":"urn:btih:55429e8fa3404b62f304ac7f57f5cf44f76d8f45","amp;dn":"The+One+True+Barbecue+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55429e8fa3404b62f304ac7f57f5cf44f76d8f45","infoHashBuffer":{"type":"Buffer","data":[85,66,158,143,163,64,75,98,243,4,172,127,87,245,207,68,247,109,143,69]},"announce":[],"urlList":[]}}