{"title":"XCom: Enemy Unknown for Mac","uid":7904553,"size":13435683376,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:5578cf6bcd2fe7d6bfe2bdf2d126d2c48cb0c8d8&amp;dn=XCom%3A+Enemy+Unknown+for+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ryballs","files":-1,"time":1355061334,"description":"XCom: Enemy Unknown for Mac (Wineskin)\n\nThis epic strategy game has been updated to 1.1 and pre-cracked. Also been modded with Warspace Mod 1.5 so choose Classic difficulty or higher when starting a new game.\n\nInstallation (Geforce or Intel HD Graphics): Unzip. Move XCom Enemy Unknown.app to Applications folder and open.\n\nATI Graphics users: This wrapper is optimised for Geforce graphics cards. It may also work okay with Intel HD cards but ATI will have graphics glitches. To fix this I have included another wrapper optimised for ATI Graphics cards. Read below on how to copy the game files to the other wrapper..\n\nInstallation (ATI Graphics): Unzip. Right click on the XCom Enemy Unknown.app and select &quot;Show Package Contents&quot;. Double click &quot;drive_c&quot; and leave that window open (should show the folders Program Files, users, windows). Now right click on Finder and select &quot;New Finder Window&quot;. Navigate to where you downloaded XCom and open the folder &quot;ATI wrapper&quot;. Right click on this alternate XCom Enemy Unknown.app and select Show Package Contents then open its drive_c folder. Now drag the &quot;Program Files&quot; folder from the original app to the folder you just opened. Choose Replace files. Once this has finished move the XCom Enemy Unknown.app in the ATI wrapper folder to your Applications folder and open. Please note I cannot and have not tested with an ATI graphics card so if you have any problems with ATI glitches direct them to here: http://portingteam.com/files/file/7568-xcom-enemy-unknown/\n\nThanks to thanoulas from portingteam.com for creating the wrapper, FLT for the release, Blackalpha for the mod and of course TPB for being the best torrent site on the internet. If you like this torrent please vote it up and SEED.","torrent":{"xt":"urn:btih:5578cf6bcd2fe7d6bfe2bdf2d126d2c48cb0c8d8","amp;dn":"XCom%3A+Enemy+Unknown+for+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5578cf6bcd2fe7d6bfe2bdf2d126d2c48cb0c8d8","infoHashBuffer":{"type":"Buffer","data":[85,120,207,107,205,47,231,214,191,226,189,242,209,38,210,196,140,176,200,216]},"announce":[],"urlList":[]}}