{"title":"Maggie Tallerman - The Oxford Handbook of Language Evolution [20","uid":10093836,"size":4812869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:557a5bea60ef6acffa5fae6dc1f80d2fa4078455&amp;dn=Maggie+Tallerman+-+The+Oxford+Handbook+of+Language+Evolution+%5B20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1399250301,"description":"Description\nProduct Details\nBook Title: The Oxford Handbook of Language Evolution (Oxford Handbooks in Linguistics)\t\nBook Author: Maggie Tallerman, Kathleen R. Gibson\nSeries: Oxford Handbooks in Linguistics\nHardcover: 800 pages\nPublisher: Oxford University Press (January 13, 2012)\nLanguage: English\nISBN-10: 0199541116\nISBN-13: 978-0199541119\n\n===================================================================================\nBook Description\nPublication Date: January 13, 2012 | ISBN-10: 0199541116 | ISBN-13: 978-0199541119\nIn The Oxford Handbook of Language Evolution, sixty leading scholars present critical accounts of every aspect of the field. Its five parts are devoted to insights from comparative animal behavior; the biology of language evolution (anatomy, genetics, and neurology); the prehistory of language (when and why did language evolve?); the development of a linguistic species; and language creation, transmission, and change.\nResearch on language evolution has burgeoned over the last three decades. Interdisciplinary activity has produced fundamental advances in the understanding of language evolution and in human and primate evolution more generally. The book presents a wide-ranging summation of work in all the disciplines involved. It highlights the links in different lines of research, shows what has been achieved to date, and considers the most promising directions for future work.\nThe Oxford Handbook of Language Evolution will be valued by everyone interested in one of the most productive and fascinating fields in natural and cognitive science.\n\n===================================================================================\nReviews\n&quot;The Oxford Handbook of Language Evolution, much wider in scope and more ambitious than its predecessor in spirit, is a highly commendable and much needed volume that brings together the most important theories and research relevant to this highly interdisciplinary field...The Oxford Handbook of Language and Law is a landmark publication in the field that will serve as a useful guide and reference work through the entanglements and pitfalls of the language evolution jungle for both experienced scholars and newcomers alike.&quot;--Linguist List\n\n&quot;I have reviewed other handbooks in which many of the authors appeared to be talking past each other or never to have communicated at all, so that I came away from reading feeling that I knew less than I had beforehand. Here I have the opposite feeling: that I am reading the results of a long conversation and that both the participants and I have learned quite a bit from this massive exercise.&quot; --Evolutionary Anthropology\n\n===================================================================================\nAbout the Author\nMaggie Tallerman is Professor of Linguistics at Newcastle University. She has spent her professional life in North East England, having previously taught for 21 years at Durham University. Her research interests center on the origins and evolution of syntax and morphology; modern Brythonic Celtic syntax and morphology; and language typology. Her publications include Understanding Syntax (Hodder/OUPUSA, 1998; 3rd edn. 2011); with Robert D. Borsley and David Willis, The Syntax of Welsh (CUP, 2007); and, as editor, Language Origins: Perspectives on Evolution (OUP, 2005). She is also the editor of the series Palgrave Modern Linguistics.\nKathleen R. Gibson is Professor Emerita, Neurobiology and Anatomy, University of Texas Houston. Her co-edited books include, with Sue T. Parker, Language' and Intelligence in Monkeys and Apes (CUP 1990); with Tim Ingold, Tools, Language, and Cognition in Human Evolution (CUP 1993); with Paul Mellars, Modelling the Early Human Mind (McDonald Archaeological Institute 1996); and, with Dean Falk, Evolutionary Anatomy of the Human Neocortex (CUP 2001). She is the co-editor with James R. Hurford of the series, Oxford Studies in the Evolution of Language.\n===================================================================================","torrent":{"xt":"urn:btih:557a5bea60ef6acffa5fae6dc1f80d2fa4078455","amp;dn":"Maggie+Tallerman+-+The+Oxford+Handbook+of+Language+Evolution+%5B20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"557a5bea60ef6acffa5fae6dc1f80d2fa4078455","infoHashBuffer":{"type":"Buffer","data":[85,122,91,234,96,239,106,207,250,95,174,109,193,248,13,47,164,7,132,85]},"announce":[],"urlList":[]}}