{"title":"SCHLONDORFF - Young Torless (1966) CRITERION","uid":3952598,"size":733856972,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55dae83798a1abfc59acb720bdbaa3f562049202&amp;dn=SCHLONDORFF+-+Young+Torless+%281966%29+CRITERION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zeinabqureshi","files":3,"time":1198943978,"description":"Der junge Torless (Young Torless) (1966)\n----------------------------------------------------\n\nFile details: ~\n\n\t624 x 352 pixesl @ 23.98 fps\n\t1h 27m 35s running time\n\tMPEG3 audio @ 128 kbps\n\tXVID compression\n\t\nFilm details: ~ &lt;a href=&quot;\thttp://www.imdb.com/title/tt0060574/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.imdb.com/title/tt0060574/&lt;/a&gt;\n\t\n\tDirected by Volker Schlondorff\n\tStarring \tMathieu Carriere as Torless\n\t\t\t\tMarian Seidowsky as Basini\n\t\t\t\tBernd Tischer as Beineberg\n\t\t\t\tFred Dietz as Reiting, and\n\t\t\t\tBarbara Steele as Bozena\n\tMusic by Hanz Werner Henze\n\t\nSynopsis (taken from Wikipedia.org)\n---------------------------------------\nYoung Torless (German: Der junge Torless) is a 1966 German film directed by \nVolker Schlondorff, adapted from the autobiographical novel The Confusions of Young Torless by Robert Musil. It deals with the sadistic and homoerotic tendencies of a group of boys at an Austrian military academy at the beginning of the 20th century.\n\nWhen Thomas Torless (Mathieu Carriere) arrives at the academy, his interest is soon piqued by the apparently homosexual Anselm von Basini (Marian Seidowsky), who, after having been caught stealing by fellow student Reiting (Fred Dietz), becomes Reiting's &quot;slave,&quot; bowing to Reiting's sadistic rituals. Torless follows their relationship with intellectual interest but without emotional involvement.\n\nAlso partaking in these sessions is Beineberg (Bernd Tischer), with whom Torless visits Bozena (Barbara Steele), the local prostitute. Again, Torless is aloof and more intrigued than excited by the woman.\n\nWhen Basini and Torless are left alone in the academy, Torless sleeps with Basini, though he later decides it was just an experiment.\n\nAfter Basini is nearly lynched by a mob because of one of Reiting's intrigues, Torless, having completed the transition from youth to adult, takes his life in his own hands for the first time and leaves the academy.\n\n(Note)----------------------------------------------------------\nThis was the first film by Volker Schlondorff. It won a prize at the Cannes film festival in 1966, and catapulted the director into the ranks of the world's significant film directors. It is also considered the first film of the German New Wave.\n\nRipped by ZEiNAB on 2007 Dec 28.\n~: Enjoy and please seed :~\n\nMy first torrent, so please bear with me. The file will play OK in VLC. Might give problems with ffdshow. I'm not a &quot;pro&quot; yet, so please give me a chance. This is a masterpiece, and I've never yet seen this anywhere on the 'Net. Enjoy.\n\n******************************** FREAKYFLICKS *********************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:55dae83798a1abfc59acb720bdbaa3f562049202","amp;dn":"SCHLONDORFF+-+Young+Torless+%281966%29+CRITERION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55dae83798a1abfc59acb720bdbaa3f562049202","infoHashBuffer":{"type":"Buffer","data":[85,218,232,55,152,161,171,252,89,172,183,32,189,186,163,245,98,4,146,2]},"announce":[],"urlList":[]}}