{"title":"WiFi Slax Wireless Hacking BootCD","uid":5419576,"size":666091520,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5605ccfd1c1b68a0696f44872c48e860351d9d44&amp;dn=WiFi+Slax+Wireless+Hacking+BootCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"webchella","files":1,"time":1268048535,"description":"WiFi Slax Wireless Hacking BootCD\n &lt;a href=&quot;\nhttp://www.imagengratis.org/images/wifislaxwi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagengratis.org/images/wifislaxwi.jpg&lt;/a&gt;\n\nFast-forward to last summer, when the first of the latest generation of WEP cracking tools appeared. This current generation uses a combination of statistical techniques focused on unique IVs captured and brute-force dictionary attacks to break 128 bit WEP keys in minutes instead of hours. As Special Agent Bickers noted, &quot;It doesn't matter if you use 128 bit WEP keys, you are vulnerable!&quot;\n\nWEP Hacking - The Next Generation\nWEP is an encryption scheme, based on the RC-4 cipher, that is available on all 802.11a, b and g wireless products. WEP uses a set of bits called a key to scramble information in the data frames as it leaves the access point or client adapter and the scrambled message is then decrypted by the receiver.\n\nBoth sides must have the same WEP key, which is usually a total of 64 or 128 bits long. A semi-random 24 bit number called an Initialization Vector (IV), is part of the key, so a 64 bit WEP key actually contains only 40 bits of &quot;strong&quot;encryption while a 128 bit key has 104. The IV is placed in encrypted frame's header, and is transmitted in plain text.\n\nTraditionally, cracking WEP keys has been a slow and boring process. An attacker would have to capture hundreds of thousands or millions of packets? a process that could take hours or even days, depending on the volume of traffic passing over the wireless network. After enough packets were captured, a WEP cracking program such as Aircrack would be used to find the WEP key.\n\nBasic Directions:\n1)Boot from cd\n2)Get the wep key\n3)Write it down\n4)Reboot into windows\n5)Connect using wep key.\n\n\n===========================================\n(((((((((((((((((((&gt;&gt;&lt;&lt;))))))))))))))))))))\n===========================================\n\n\nAvance rÃƒÂ¡pido hasta el verano pasado, cuando el primero de la ÃƒÂºltima generaciÃƒÂ³n de herramientas de cracking WEP apareciÃƒÂ³. Esta generaciÃƒÂ³n actual utiliza una combinaciÃƒÂ³n de tÃƒÂ©cnicas estadÃƒÂ­sticas centradas en un ÃƒÂºnico IVs capturado y fuerza bruta, ataques de diccionario para romper claves WEP de 128 bits en minutos en lugar de horas. Como se discute el agente especial observado, &quot;no importa si utiliza claves de 128 bits WEP, son vulnerables!&quot; \n\nWEP Hacking - The Next Generation \nWEP es un esquema de cifrado, basado en el CR-4 de cifrado, que estÃƒÂ¡ disponible en todas las 802.11a, byg de productos inalÃƒÂ¡mbricos. WEP utiliza un conjunto de bits llamando una llave para revolver la informaciÃƒÂ³n en las tramas de datos, ya que deja el punto de acceso o adaptador de cliente y el mensaje codificado es entonces descifrado por el receptor. \n\nAmbas partes deben tener la misma clave WEP, que es normalmente un total de 64 o 128 bits de longitud. Un semi-aleatoria 24 nÃƒÂºmeros de bits llamado Vector de InicializaciÃƒÂ³n (IV), es parte de la clave, por lo que una clave WEP de 64 bits contiene realmente solamente 40 bits de cifrado &quot;fuerte&quot;, mientras que una clave de 128 bits tiene 104. El IV se coloca en la cabecera del FRAME cifrado, y se transmite en texto plano. \n\nTradicionalmente, la represiÃƒÂ³n claves WEP ha sido un proceso lento y aburrido. Un atacante tendrÃƒÂ­a que capturar centenares de miles o millones de paquetes? de un proceso que podrÃƒÂ­a tomar horas o incluso dÃƒÂ­as, dependiendo del volumen de trÃƒÂ¡fico que pasa a travÃƒÂ©s de la red inalÃƒÂ¡mbrica. DespuÃƒÂ©s de suficientes paquetes fueron capturados, un programa de WEP como Aircrack serÃƒÂ­a utilizado para encontrar la clave WEP. \n\nDirecciones bÃƒÂ¡sicas: \nBoot 1) desde el CD \n2) Obtener la clave WEP \n3) AnÃƒÂ³telo \n4) Reinicie en Windows \n5) ConexiÃƒÂ³n con la clave wep.","torrent":{"xt":"urn:btih:5605ccfd1c1b68a0696f44872c48e860351d9d44","amp;dn":"WiFi+Slax+Wireless+Hacking+BootCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5605ccfd1c1b68a0696f44872c48e860351d9d44","infoHashBuffer":{"type":"Buffer","data":[86,5,204,253,28,27,104,160,105,111,68,135,44,72,232,96,53,29,157,68]},"announce":[],"urlList":[]}}