{"title":"FTVGirls - Violet (Turning Nineteen) All Videos NEW July 11, 201","uid":10534365,"size":971392718,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5672c417cb439835df1335938ffc2fa235fe82a8&amp;dn=FTVGirls+-+Violet+%28Turning+Nineteen%29+All+Videos+NEW+July+11%2C+201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"christian2353","files":16,"time":1405143365,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/iaPImAaFD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iaPImAaFD&lt;/a&gt;\n\n\nAudio: aac, 22050 Hz, mono (und)\nVideo: h264, yuv420p, 854x480, 25.00 fps\n\n\nShe's turning 19 on this shoot, and she wants to experience her birthday with FTV! Seriously! We meet Violet and her best friend Holly at a restaurant, the girls introducing themselves and Violet flashing her breasts there. Her friend is shy about getting naked, but wow does she have some full naturals under there! Going back home, Violet strips down naked in front of her friend, shows off her perfect, flawless butt. Once fully naked, she masturbates with her fingers, and ends up with a nice natural orgasm with visible vaginal contractions. We get extreme closeups of her private parts, and watch her finger herself deeply. Then she spreads her butt, and gets kinky with some fingering anally! Putting on her favorite sexy red heels and white dress, she does a sensual dance for us, then strips down to a faster beat to more music. Notice how sexy and firm her perfect butt is. She then fingers herself some more, then goes to the bed to model some cute panties, talk dirty, then stuff her pink panties deep inside herself. Using the strength of her vaginal muscles, she pushes the panties out and puts them back on! Later in the day, we see her hair in braids jogging by a tennis court, showing off her butt, stretching her legs and giving us peeks under her shorts. No panties, she fingers herself vaginally then anally right next to the tennis court while people are playing! She eventually gets completely naked, runs around the tennis court... then fingers herself anally on a park bench and masturbates! Out at an ice cream store her and her friend tease each other, expose each others' cleavage, then Violet uses the spoon like a toy right in the open seating area of the ice cream store to penetrate herself! The risky public nudity continues with milky juices flowing out, and then she adds some to her nipple and Holly sucks away at her nipple in public! Back home, she masturbates again, to another natural orgasm, then tries fisting herself, ending up with five finger penetration. Using a very thick zucchini, she nearly takes the entire veggie inside her, and fucks herself with it. Putting on some long socks, she finds herself the Big Ten Toy, gives it a deepthroat blowjob, does it doggy style, then rides it on top as deep as she can go! Finishing herself off, she uses the vibraking toy to one last, strong orgasm. Later that night, the girls dress up and go out for a birthday dinner. Enjoy this first timer, she's a spunky, cute natural masturbator smile","torrent":{"xt":"urn:btih:5672c417cb439835df1335938ffc2fa235fe82a8","amp;dn":"FTVGirls+-+Violet+%28Turning+Nineteen%29+All+Videos+NEW+July+11%2C+201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5672c417cb439835df1335938ffc2fa235fe82a8","infoHashBuffer":{"type":"Buffer","data":[86,114,196,23,203,67,152,53,223,19,53,147,143,252,47,162,53,254,130,168]},"announce":[],"urlList":[]}}