{"title":"Oscar Peterson - The Oscar Peterson Trio At Zardis CD 2 (1955) [","uid":4732950,"size":146743067,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:56c31944807184532a691590e023d2a1214d9617&amp;dn=Oscar+Peterson+-+The+Oscar+Peterson+Trio+At+Zardis+CD+2+%281955%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schon55","files":20,"time":1235136604,"description":"Oscar Peterson - The Oscar Peterson Trio At Zardis CD 2 (1955)\nOriginal Release Date: November 8, 1955\nLabel: Pablo \nAudio CD: December 14, 1994\nBitrate: 256 kbps\n\nAmazon.com essential recording:\nThis 1955 Hollywood nightclub recording finds pianist Oscar Peterson, guitarist Herb Ellis, and bassist Ray Brown in superbly relaxed form. Except for two Peterson originals, the double-disc program consists entirely of standards. The solos are more concise than on later Peterson albums, with no tune lasting more than about six and a half minutes. But what's truly remarkable here is how the three musicians lend rhythmic support to each other while at the same time carrying on a rapid-paced, melodic conversation. Not many bassists can walk and sing at the same time the way Brown does. No way a drummer could have helped this group swing any harder. ~ Rick Mitchell \n\nI'm a huge fan of Oscar Peterson and have collected most of his albums. Recorded live at Zardi's on 8 November 1955, this is truly one of his best albums. Together with Ray Brown and Herb Ellis, Oscar put on one of the most dazzling performances in his life. You will find yourself jiving and bopping, from start to end of this incredible one and a half hour double CD. In short, this is a MUST BUY for every jazz fan out there. Just ask my wife. For a jazz-tolerent person, even she thinks it's a great album. So, what are you waiting for? ~ Kenneth Ngiau\n\nThe group that Oscar Peterson led between 1953-58 with guitarist Herb Ellis and bassist Ray Brown was one of the great piano trios of all time. It was never so much a matter of Peterson having two other musicians accompany him as it was that they could meet the pianist as near-equals and consistently inspire him. And unlike most trios, Peterson's had many arranged sections that constantly needed rehearsals and were often quite dazzling. This live double-CD from 1955 has previously unreleased (and unknown) performances of 31 songs (28 standards plus three of Peterson's originals) that were released for the first time in 1994. The pianist is often in typically miraculous form, Ellis (whether playing harmonies, offering short solos or getting his guitar to sound like a conga by tapping it percussively) proves to be a perfect partner, and Brown's subtle but sometimes telepathic contributions should not be overlooked either. ~ AMG\n        \nOscar Peterson Trio:\nOscar Peterson (piano)\nHerb Ellis (guitar)\nRay Brown (bass)\n\nRecorded at Zardi`s, Hollywood, California on November 8, 1955.\n\nThe Oscar Peterson Trio At Zardis Tracks CD 2:\n01  Continental\n02  You Are Too Beautiful\n03  Pompton Turnpike\n04  Surrey With the Fringe on Top\n05  Swinging on a Star\n06  I've Got You Under My Skin\n07  Autumn Leaves\n08  Love for Sale\n09  Soft Winds\n10  Medley: I Loves You Porgy/Anything Goes\n11  It's a Marshmallow World\n12  Tenderly\n13  Honeysuckle Rose\n14  Love You Madly\n15  Have You Met Miss Jones?\n","torrent":{"xt":"urn:btih:56c31944807184532a691590e023d2a1214d9617","amp;dn":"Oscar+Peterson+-+The+Oscar+Peterson+Trio+At+Zardis+CD+2+%281955%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c31944807184532a691590e023d2a1214d9617","infoHashBuffer":{"type":"Buffer","data":[86,195,25,68,128,113,132,83,42,105,21,144,224,35,210,161,33,77,150,23]},"announce":[],"urlList":[]}}