{"title":"BB King &amp; E Clapton-Riding With the King [88.2kHz 24bit ALAC]","uid":5670690,"size":1303264488,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:579a759c66826410e0add07ec45fe7fadb98c130&amp;dn=BB+King+%26+E+Clapton-Riding+With+the+King+%5B88.2kHz+24bit+ALAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"santaro","files":-1,"time":1278336010,"description":"B.B. King &amp; Eric Clapton - Riding With the King [Reprise Records]\nDVD-A rip in 24-bit/88.2kHz / ALAC\n\n2001 hi-res remaster of the 2000 release.\n\n1. Riding With the King - 4:23\n2. Ten Long Years - 4:39\n3. Key to the Highway - 3:40\n4. Marry You - 5:00\n5. Three O Clock Blues - 8:36\n6. Help the Poor - 5:06\n7. I Wanna Be - 4:46\n8. Worried Life Blues - 4:26\n9. Days of Old - 3:00\n10. When My Heart Beats Like a Hammer - 7:00\n11. Hold On I'm Coming - 6:21\n12. Come Rain Or Come Shine - 4:11\n\nThe potential for a collaboration between B.B. King and Eric Clapton is enormous, of course, and the real questions concern how it is organised and executed. This first recorded pairing between the 74-year-old King and the 55-year-old Clapton was put together in the most obvious way: Clapton arranged the session using many of his regular musicians, picked the songs, and co-produced with his partner Simon Climie. That ought to mean that King would be a virtual guest star rather than earning a co-billing, but because of Clapton's respect for his elder, it nearly works the other way around. The set list includes lots of King specialties -- &quot;Ten Long Years,&quot; &quot;Three O'Clock Blues,&quot; &quot;Days of Old,&quot; &quot;When My Heart Beats Like a Hammer&quot; -- as well as standards like &quot;Hold on I'm Coming&quot; and &quot;Come Rain or Come Shine,&quot; with some specially written and appropriate recent material thrown in, so King has reason to be comfortable without being complacent. The real danger is that Clapton will defer too much; though he can be inspired by a competing guitarist such as Duane Allman, he has sometimes tended to lean too heavily on accompanists such as Albert Lee and Mark Knopfler when working with them in concert. That danger is partially realised; as its title indicates, Riding With the King is more about King than it is about Clapton. But the two players turn out to have sufficiently complementary, if distinct, styles so that Clapton's supportive role fills out and surrounds King's stinging single-string playing. (It's also worth noting that there are usually another two or three guitarists on each track.) The result is an effective, if never really stunning, work.","torrent":{"xt":"urn:btih:579a759c66826410e0add07ec45fe7fadb98c130","amp;dn":"BB+King+%26+E+Clapton-Riding+With+the+King+%5B88.2kHz+24bit+ALAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579a759c66826410e0add07ec45fe7fadb98c130","infoHashBuffer":{"type":"Buffer","data":[87,154,117,156,102,130,100,16,224,173,208,126,196,95,231,250,219,152,193,48]},"announce":[],"urlList":[]}}