{"title":"Tony Hawk's Underground PC (Full DVD Image)","uid":5957854,"size":2207092090,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:57c4e7c294d54dd59140f9a4bd856d5f9f30b84b&amp;dn=Tony+Hawk%5C%27s+Underground+PC+%28Full+DVD+Image%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ngp2789","files":10,"time":1289805756,"description":"Well, it's November 2010. Four years since the Internet last saw a full DVD copy of this online. Here it is, in its complete form: Tony Hawk's Underground on the PC!\n\nFor those who are still interested in this game, please download and seed! Also check out the readme's I made as they provide details about what to do with the .mdf/.mds files as well as how to get back online with this game!\n\nEnjoy and remember, SEED! We don't want a repeat of what happened in 2006 do we?\n\nngp2789\n\n\n--UPDATE--\n\n\n**HOW TO INSTALL TONY HAWK'S UNDERGROUND PC WITH THE KEYGEN**\n\nThings Needed:\n\n1. The ripped version of Tony Hawk's Underground PC fromwebsite.\n\n2. This torrent\n\n\nSTEPS:\n\n1. Mount the THUG_1.mds from this Tony Hawk's Underground PC torrent\n\n2. Copy all the files from the mounted disc to a folder named &quot;THUG DVD&quot;\n\n3. When the files are all copied from the DVD, unmount the THUG_1.mds\n\n4. Next, go to the &quot;tony hawks underground 1&quot; folder (this is the ripped versions folder, NOT this torrent's folder!) and extract \n\nthe files in the &quot;Tony Hawk's Underground 1.7z&quot; to their own folder called &quot;thugpcrip&quot; seperate from the &quot;THUG DVD&quot; folder you \n\ncreated earlier.\n\n5. Within the newly created folder &quot;thugpcrip&quot;, you should see a file called &quot;thugcd1.iso&quot;.  Take this file, and mount it.\n\n6. Go to &quot;My Computer&quot; or &quot;Computer&quot; and you should see the THUG icon for the mounted &quot;thugcd1.iso&quot; file.  Since, like my DVD, it \n\nwill be called THUG_1, you can check to see if you have the correct disc image mounted by right clicking and hitting &quot;Explore&quot; and \n\nthen running the Setup file.  You should get an error 1158: message, this let's you know that you mounted the &quot;thugcd1.iso&quot; and NOT \n\nmy &quot;THUG_1.mds&quot; file.\n\n7. Extract all of the files from &quot;thugcd1.iso&quot; and put them in the &quot;THUG DVD&quot; folder, overwriting all files that need to be \n\noverwritten.  Basically, now the contents of &quot;thugcd1.iso&quot; are now inside the &quot;THUG DVD&quot; folder.\n\n8. Now, inside the &quot;tony hawks underground 1&quot; folder, look for a folder called &quot;cd2-3&quot;.  Inside this folder are a bunch of the same \n\nfiles found on the &quot;thugcd1.iso&quot;, however these files are modified.\n\n9. Copy all of the files in the &quot;cd2-3&quot; folder to the &quot;THUG DVD&quot; folder EXCEPT THE &quot;Setup&quot; FOLDER!!!!  THIS IS EXTREMELY IMPORTANT! \n\n We will copy the files in the setup folder, but only certain ones.\n\n10. Now go into the setup folder (from inside the &quot;cd2-3&quot; folder, NOT the &quot;THUG DVD&quot; folder).  You should see two folders called \n\n&quot;Data&quot; and &quot;rsrc&quot;.  Copy the &quot;rsrc&quot; folder over to the &quot;THUG DVD&quot; folder's setup folder, replacing the &quot;rsrc&quot; folder there.  The \n\ntwo folders should now be identical, so keep track of which folder is which by looking up at the address bar at the top of the \n\nscreens.\n\n11. In &quot;cd2-3&quot; setup folder, click the &quot;Data&quot; folder.  You should now be presented with a &quot;Game&quot; folder as well as several THUG \n\nicons, a web link to Activision, and a &quot;gdiplus.dll&quot; file.  Copy everything here over to the &quot;THUG DVD'S Data directory EXCEPT THE \n\n&quot;Game&quot; FOLDER!!!\n\n12. In the &quot;cd2-3&quot; data folder, click the &quot;Game&quot; folder.  You should now be presented with another &quot;Data&quot; folder, a &quot;binkw32.dll&quot; \n\nfile, and a THUG icon file.  Copy everything here over to the &quot;THUG DVD'S Game directory EXCEPT THE &quot;Data&quot; FOLDER!!\n\n13. Now, close out of both the &quot;THUG DVD&quot; folder as well as the &quot;cd2-3&quot; folder.  This makes it less confusing so as to be sure you \n\ndon't install from the wrong folder.  We are ALMOST THERE!! :D\n\n14. Un-mount the &quot;thugcd1.iso&quot; file.  You should now have nothing mounted in the virtual drive.\n\n15. Open up the &quot;THUG DVD&quot; folder and double click on the &quot;Launch.exe&quot; file (the purple play arrow icon).  Ignore the  RUN THIS \n\nBEFORE INSTALLING icon.\n\n16. You should now be presented with the THUG autoplay menu.  Install the game like normal.  When it asks for a key, use the keygen \n\nI provided with this torrent.  It should work and you should see the following message:\n\n&quot;The CD key you entered appears to be valid...&quot;\n\nNow you will be taken to the installer and you can install the game like normal.  DON'T STOP READING THOUGH, there is one more \n\ncrucial step!\n\n17. When the game is done installing, quit out of the autorun.  DO NOT HIT PLAY!\n\n18. Now mount the THUG_1.mds&quot; from my torrent.  Now the autorun should appear and you can hit play and play the game with FULL \n\nCAPABILITIES.  You can also copy the &quot;Savegame&quot; file over and use that to get 100% completion.  Also don't forget to install the \n\nonline fixes to play online!\n\n\nEnjoy and sorry for the delay with this release.","torrent":{"xt":"urn:btih:57c4e7c294d54dd59140f9a4bd856d5f9f30b84b","amp;dn":"Tony+Hawk%5C%27s+Underground+PC+%28Full+DVD+Image%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c4e7c294d54dd59140f9a4bd856d5f9f30b84b","infoHashBuffer":{"type":"Buffer","data":[87,196,231,194,148,213,77,213,145,64,249,164,189,133,109,95,159,48,184,75]},"announce":[],"urlList":[]}}