{"title":"Low Temperatures and Cold Molecules - Ian W. M. Smith","uid":11740360,"size":34414216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57f3c0e9ba0e492e19049a649f7ee0b293d43a4a&amp;dn=Low+Temperatures+and+Cold+Molecules+-+Ian+W.+M.+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425767678,"description":"New, unexpected and largely unexplored physical phenomena occur in systems cooled to very low temperatures. The background temperature in the universe is approximately 2.7 K, but much lower temperatures have now been obtained in the laboratory. This book reviews the progress in a number of related fields in which the common themes are low temperatures and molecules, not atoms.\n\nThis book brings together, for the first time, the results of recent research in areas ranging from the chemistry of cold interstellar clouds (10 20 K), through laboratory studies of the spectroscopy and kinetics of ions, radicals and molecules, to studies of molecules in liquid helium droplets, to attempts to create molecular (as distinct from atomic) Bose Einstein condensates.\n\nThe chapters fall into two parts, the first one dealing with low-temperature experiments and environments (ca. 1 20 K). In the context of this book, these chapters can be said to deal with relatively mature fields. The second part deals with very low temperatures and very cold molecules. Here, more emphasis is placed on the methods employed to generate samples of molecules at extremely low (&lt;1 K) temperatures","torrent":{"xt":"urn:btih:57f3c0e9ba0e492e19049a649f7ee0b293d43a4a","amp;dn":"Low+Temperatures+and+Cold+Molecules+-+Ian+W.+M.+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f3c0e9ba0e492e19049a649f7ee0b293d43a4a","infoHashBuffer":{"type":"Buffer","data":[87,243,192,233,186,14,73,46,25,4,154,100,159,126,224,178,147,212,58,74]},"announce":[],"urlList":[]}}