{"title":"Seconds (1966 _  John Frankenheimer _ Rock Hudson) [mp4-iPhone]","uid":6221583,"size":589225659,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:58108ad30745cc4e7df812c8e23ee15438019fa9&amp;dn=Seconds+%281966+_++John+Frankenheimer+_+Rock+Hudson%29+%5Bmp4-iPhone%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"naba888","files":3,"time":1299348271,"description":"Middle-aged banker Arthur Hamilton is given the opportunity to start a completely new life when he receives calls from his old friend Charlie. The only problem is that Charlie is supposed to be dead. Hamilton is eventually introduced to a firm that will fake his death and create an entirely new look and life for him. After undergoing physical reconstruction surgery and months of training and psychotherapy, Hamilton returns to the world in the form of artist Tony Wilson. He has a nice house in Malibu and a manservant, a company employee who is there to assist him with his adjustment. He finds that the life he had hoped for isn't quite what he expected and asks the company to go through the process with surprising results. \n\nComment: No, this film is not about your mid-life crisis. Isn't it interesting that our interpretation of a movie tells us more about ourselves, our own mental projections than about the movie itself? The true meaning of a movie lies in the eye of the beholder. Truth isn't absolute, it's relative thing. Different people seen different things in the same movie. And no, the film-director isn't the absolute authority of a film's meaning, and neither is it's author. This film is about reincarnation, it's about how our unfulfilled dreams and desires go on creating another incarnation, and then another, and on and on. This spiritual process has been brought down to earth to communicate it to materialistic people in a materialistic age. Behold, in this film there is wisdom.","torrent":{"xt":"urn:btih:58108ad30745cc4e7df812c8e23ee15438019fa9","amp;dn":"Seconds+%281966+_++John+Frankenheimer+_+Rock+Hudson%29+%5Bmp4-iPhone%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58108ad30745cc4e7df812c8e23ee15438019fa9","infoHashBuffer":{"type":"Buffer","data":[88,16,138,211,7,69,204,78,125,248,18,200,226,62,225,84,56,1,159,169]},"announce":[],"urlList":[]}}