{"title":"Assessing Food Safety of Polymer Packaging","uid":12031943,"size":3662476,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5825915ed110a56f9324159428b9fdc8b3937fca&amp;dn=Assessing+Food+Safety+of+Polymer+Packaging&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1434635004,"description":"Many foods depend on additives for safety, stability or preservation. Foods are packaged to protect them and keep them in good condition while they are delivered to shops, stacked on shelves or stored at home. The packaging material has to both preserve the food and to protect it from deterioration, outside contamination or damage during distribution and storage; and the packaging material in direct contact with a food must not harm itself or be harmed by the food. The packaging material for a particular food must therefore be carefully selected with these considerations in mind. This book is designed to help current and prospective researchers in this field, understand the theory of food safety in plastic packaging. The book is divided into 7 chapters: Chapter 1 is devoted to a theoretical discussion of the process of diffusion through a sheet. Chapter 2 is concerned with the transfer of the contaminants taking place in packages before they are in contact with food. Chapter 3 is devoted to the problems caused by the process of co-extrusion or co-moulding of the films or of the packages. Chapter 4 is the chapter in which some applications of the theoretical considerations established in Chapters 1 to 3 are developed further. Chapter 5 considers the future, when use of active packaging will be widespread. Chapter 6 discusses the misconceptions arising from the processes or misuse of equations. Chapter 7 details the conclusions arising from the book. This book will be of interest to anyone who uses polymeric food packaging","torrent":{"xt":"urn:btih:5825915ed110a56f9324159428b9fdc8b3937fca","amp;dn":"Assessing+Food+Safety+of+Polymer+Packaging","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5825915ed110a56f9324159428b9fdc8b3937fca","infoHashBuffer":{"type":"Buffer","data":[88,37,145,94,209,16,165,111,147,36,21,148,40,185,253,200,179,147,127,202]},"announce":[],"urlList":[]}}