{"title":"The Life and Times of Grizzly Adams (1974) VHSrip (English only)","uid":4108598,"size":704606720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58480c61622c19d5e14476c8ce906e3aaad8b6b1&amp;dn=The+Life+and+Times+of+Grizzly+Adams+%281974%29+VHSrip+%28English+only%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"asshound00","files":1,"time":1206927177,"description":"The Life and Times of Grizzly Adams (1974) VHSrip\n\nEnglish Only - No Subtitles (sorry)\n\n\nThis is the full VHS movie.  I have never seen it in DVD.  The quality is what you might expect of a 34 year old VHS tape.  Please don\\\\\\&amp;#039;t complain,unless you have a better version and want to want to upload it so we can all share it!!! \n\nDan Haggerty and his high school level of acting are easy to ignore against the beautiful scenery, the well filmed animal antics and the comic narration.  I think there is a plot and story of some kind some where along the way, but it really does not matter.  This is the 1970s ideal of the every-man returning to live in harmony with nature.  He sets lots of traps and wears leather, but we never watch him killing or skinning anything.  Maybe he was trapping wandering vegetables... I digress.  \n\nI am limited to about 20-40 KB/s upload speed by my cable company.  I should be glad I am not living in California where the same company is transmitting bogus bittorrent completion messages to their clients to cut down on torrent traffic.  It screws up the traffic to Blackberry handheld devices, too.  My point is that I will do my best to seed this, but it may make for a slow upload.  Please be patient, and if you are going to do a hit and run (i.e.: download but not help seed), please wait until a few people have completed uploading so we can get a decent swarm going.\n\nEncouraging or constructive comments would be nice, but I do not demand them nor even expect them!","torrent":{"xt":"urn:btih:58480c61622c19d5e14476c8ce906e3aaad8b6b1","amp;dn":"The+Life+and+Times+of+Grizzly+Adams+%281974%29+VHSrip+%28English+only%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58480c61622c19d5e14476c8ce906e3aaad8b6b1","infoHashBuffer":{"type":"Buffer","data":[88,72,12,97,98,44,25,213,225,68,118,200,206,144,110,58,170,216,182,177]},"announce":[],"urlList":[]}}