{"title":"The Zeitgeist Movement and the Historical Jesus - Michael S.","uid":11773404,"size":86240520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:587d06e73b4b1e9693a92ff1b882f333d44f909e&amp;dn=The+Zeitgeist+Movement+and+the+Historical+Jesus+-+Michael+S.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1427166726,"description":"\nThe Zeitgeist Movement and the Historical Jesus: Separating Fact from Fiction\n\nSince the days of the early Christian church, unbelievers have dismissed the Gospel of Christ as a myth or hoax, so far as to say that Jesus of Nazareth was not even a historical figure. Christianity, they say, is a system of faith which is merely a reworking of pre-existing beliefs and motifs from both pagan mythology and astrology. In this book, these claims will be put to the test in order to separate fact from fiction in such accusations against Christianity. Additionally, it will be shown in what ways the person of Jesus of Nazareth is so drastically unique from other deities purported to be among the world's many &quot;crucified saviors.&quot;\n\nAbout the author:\nMichael Sturgulewski holds a bachelor?s degree in commercial art and has been a lay student in theological studies for more than twenty years. He is currently enrolled in a program for a Master?s of Divinity degree from The North American Reformed Seminary, after which his intent is to pursue a doctorate in apologetics. He has spent the past decade working on various book projects with friend and fellow artist Jonathan Myers. In the year 2000 Jonathan and he founded Ambition Studios (now Odyssey Illustrated Press).\n\nA proficient oil painter, Michael continues to work on projects of his own making, as well as in conjunction with other studios. Formerly a Pittsburgh, PA native, Michael currently resides in upstate New York with his seven cats and a hamster, and is the proud uncle of two nieces and a nephew","torrent":{"xt":"urn:btih:587d06e73b4b1e9693a92ff1b882f333d44f909e","amp;dn":"The+Zeitgeist+Movement+and+the+Historical+Jesus+-+Michael+S.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587d06e73b4b1e9693a92ff1b882f333d44f909e","infoHashBuffer":{"type":"Buffer","data":[88,125,6,231,59,75,30,150,147,169,47,241,184,130,243,51,212,79,144,158]},"announce":[],"urlList":[]}}