{"title":"The Art of Game Design a book of lenses, Jesse Schell","uid":7528762,"size":3356503,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:59a859e0f33bebd4efafc49f3393b440650b44d1&amp;dn=The+Art+of+Game+Design+a+book+of+lenses%2C+Jesse+Schell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Goldernie","files":1,"time":1344868498,"description":"Anyone can master the fundamentals of game design no technological expertise is necessary. The Art of Game Design: A Book of Lenses shows that the same basic principles of psychology that work for board games, card games and athletic games also are the keys to making top-quality videogames. Good game design happens when you view your game from many different perspectives, or lenses. While touring through the unusual territory that is game design, this book gives the reader one hundred of these lenses one hundred sets of insightful questions to ask yourself that will help make your game better. These lenses are gathered from fields as diverse as psychology, architecture, music, visual design, film, software engineering, theme park design, mathematics, writing, puzzle design, and anthropology. Anyone who reads this book will be inspired to become a better game designer and will understand how to do it. \n* Jesse Schell is a highly recognizable name within the game industry - he is the former chair of the International Game Developer's Association, and has designed many successful games, including Disney's award-winning Toontown Online. \n* The book's design methodology was developed at Carnegie Mellon University's Entertainment Technology Center, co-founded by Dr. Randy Pausch, of &quot;Last Lecture&quot; fame. \n* 100 'lenses' are scattered throughout the book. These are boxed sets of questions, each a different way of seeing a game that will inspire the creative process.","torrent":{"xt":"urn:btih:59a859e0f33bebd4efafc49f3393b440650b44d1","amp;dn":"The+Art+of+Game+Design+a+book+of+lenses%2C+Jesse+Schell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a859e0f33bebd4efafc49f3393b440650b44d1","infoHashBuffer":{"type":"Buffer","data":[89,168,89,224,243,59,235,212,239,175,196,159,51,147,180,64,101,11,68,209]},"announce":[],"urlList":[]}}