{"title":"CSiCOL Version 9.0.1","uid":15351783,"size":33061940,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a1214f2e016cb959457d24e24032cb027910cb4&amp;dn=CSiCOL+Version+9.0.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"JeffreyLato","files":2,"time":1468944972,"description":"New crack, license available until July 2017!\r\n\r\nCSi COL - Concrete Column Design Software\r\n\r\nCSiCOL is a comprehensive software package used for the analysis and design of columns. The design of columns of any concrete, reinforced concrete, or composite cross-section can be carried out by the program. CSiCOL provides a 'Quick Design Wizard' tool that guides the users step-by-step, through the whole process of column design. This makes the design process simple, organized and efficient. The design can be carried out in accordance with ACI-318-11, ACI-318-08, ACI 318-05, ACI 318-02, ACI 318-99, BS8110, CSA A-23.3-04, CSA A23.3-94, Eurocode 2-2004 and IS 456-2000 codes.\r\n\r\nCSiCOL is capable of handling an unlimited number of load combinations both for sway and non-sway conditions. The design actions may be specified directly or may be computed by the program using the moment magnification method. The design and analysis take into account the slenderness effects. Sway or non-sway condition checks may also be performed by the program as specified by the selected design code. Moreover, CSiCOL is capable of determining the Effective Length Factor based on the framing and end conditions of the column. CSiCOL output includes the capacity interaction surface, load-moment curves, moment-moment curves, moment-curvature curves for various failure criteria, combined axial-flexural elastic stress contours, rebar stresses, cracked section stresses, load point location, capacity vector, neutral axis depth and orientation, etc. Reports may be created as part of the output for the analysis and design process. The reports may be customized by adding information and graphics of your choice.\r\n\r\nCSiCOL provides several predefined parametric shapes, including a variety of solids, hollow, and flanged shapes, in addition to a large collection of Standard Steel Database Shapes, which can be used in composite columns. It is easy to merge, edit and draw Shapes to suit geometry requirements and create complex cross-sections. The program provides tools for the alignment, stacking, and placement of these Shapes. Rebars can be placed anywhere (corner, perimeter, sides, circle, irregular, etc.) in the cross-section using several addition and placement tools. Standard (ASTM, Metric, and Imperial ) as well as user defined rebar sets may be used.\r\n\r\nCSI COL Version 9.0.1 with Keygen/License Generator by LAVteam (Thanks!)\r\n\r\n1. Disconnect from the Internet\r\n2. Run Setup\r\n3. Run the csi_column_v901_kg.exe and in the keygen folder it will be generated a lservrc license file (~144B)\r\n4. Copy the license file to : C:Program Files (x86)Computers and StructuresCSiCol 9\r\n5. Make sure CSICOL.exe is blocked at the Firewall from connecting to the Internet\r\n\r\nThe How-to-crack above works. If the error &quot;...license file missing etc etc&quot; repeat the step above\r\nLicense is valid for 365 days starting from 19/07/2016 (ends somewhere in mid July 2017). If you want this time not to end :\r\n1. Change time at your windows clock and put it some years before 2016\r\n2. Wait for the next CSI COL update (Version 9 or 10.x.x) coming in the beggining of year 2017 (or earlier 2016) or another crack.\r\nUntil then support by keeping this torrent alive by seeding it or adding it to a seedbox, trust me it's worth the share!","torrent":{"xt":"urn:btih:5a1214f2e016cb959457d24e24032cb027910cb4","amp;dn":"CSiCOL+Version+9.0.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a1214f2e016cb959457d24e24032cb027910cb4","infoHashBuffer":{"type":"Buffer","data":[90,18,20,242,224,22,203,149,148,87,210,78,36,3,44,176,39,145,12,180]},"announce":[],"urlList":[]}}