{"title":"LogoSmartz.v8.0-Lz0","uid":7049693,"size":50677320,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a42a1d91092561520c36f6d1a72af2b0d66652f&amp;dn=LogoSmartz.v8.0-Lz0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"scene4all","files":-1,"time":1329871961,"description":"---------------------------------------------------------------------------------\n                                                                                 \n           SSSSSSSSSSSSSSS       444444444                 AAA                   \n         SS:::::::::::::::S     4::::::::4                A:::A                  \n        S:::::SSSSSS::::::S    4:::::::::4               A:::::A                 \n        S:::::S     SSSSSSS   4::::44::::4              A:::::::A                \n        S:::::S              4::::4 4::::4             A:::::::::A               \n        S:::::S             4::::4  4::::4            A:::::A:::::A              \n         S::::SSSS         4::::4   4::::4           A:::::A A:::::A             \n          SS::::::SSSSS   4::::444444::::444        A:::::A   A:::::A            \n            SSS::::::::SS 4::::::::::::::::4       A:::::A     A:::::A           \n               SSSSSS::::S4444444444:::::444      A:::::AAAAAAAAA:::::A          \n                    S:::::S         4::::4       A:::::::::::::::::::::A         \n                    S:::::S         4::::4      A:::::AAAAAAAAAAAAA:::::A        \n        SSSSSSS     S:::::S         4::::4     A:::::A             A:::::A       \n        S::::::SSSSSS:::::S       44::::::44  A:::::A               A:::::A      \n        S:::::::::::::::SS        4::::::::4 A:::::A                 A:::::A     \n         SSSSSSSSSSSSSSS          4444444444AAAAAAA                   AAAAAAA    \n                                                                                 \n                                                                                 \n---------------------------------------------------------------------------------\n\n                               LogoSmartz.v8.0-Lz0                               \n\n---------------------------------------------------------------------------------\n\nLineZer0!\n\ncpN    cRo\n\npresents\n\nLogoSmartz v8.0\n\nRelease Date : 2012-02-17\nNfo Date : 2012-02-17\n\nNum. Disks : xx/10                       OS : Windows\nNfo Time : 13:37                 Rel Type : Cracked\nCracker : Team Lz0               Archive : lz0*.zip\nPacker : Team Lz0                Rating : Your choice\nSupplier : Team Lz0              Language : English\nProtection : Limitations\n\nRequirements : N/A\n: Always use a firewall.\nPublisher URL : http://www.logosmartz.com\nPublisher : -\n\n(-)  Keyfile / License          (-)  Emulator\n(-)  Patch                      (-)  Serial\n(-)  Cracked .EXE / .DLL        (-)  Retail\n(-)  Keygen                     (-)  Trainer\n(-)  Loader                     (x)  Other\n\n1999 - 2012\n\n+ I N F O +\n\nCreate your own logos with LogoSmartz, the logo design\nsoftware. Get a professional, attractive logo\nin minutes! No knowledge of graphic design required!\n\n+ I N S T A L L +\n\n1) Unpack and install.\n2) Overwrite existing with cracked files.\n3) Enjoy this release!\n\nNOTE: For obvious reasons you should always make sure that\nthe title is restricted access to internet by a firewall\nto avoid any problems. Further, when running our\nkeygens/patches you might need to run it with admin\nrights while in Vista/Win7 to ensure that it has\nenough privileges.\n\n+ J O I N +\n\nSo you are interested in joining one of the most successful\ngroups of all time? Then you might want to continue reading.\nNot only can we offer whatever your heart might desire, but\nbecoming part of the group will also be one of the more\nsignificant decisions you perhaps will take.\n\nEver since our beginning in 1999 we?ve strived to make a group\nthat not only is a group of knowledge, but a gathering of\npeople that wants friendship, devotion, respect and fun. Hard\nwork is what has brought us where we are today, and hard work\nis also what we would expect from you.\n\nGiven the amount of hours we all put into this every day, we\nlike to see our self as a secondary family. We strive to take\ncare of each other and thus ? mutual respect is the essence of\nour group. We never pushed for being elite, as we do not believe\nthat any of us deserve the mark of the elitists. Every member\nof our group is taught to honor the next guy or gal with the\nsame respect as he or her demands for themselves. The same\nthought applies to how we look at other groups.\n\nAre you ready to become part of a family? Do you think you have\nwhat it takes? Then now is the time to get up and contact us.\nPerhaps you will find a new road to follow with us. Open\npositions are as follows, but if you do feel you have something\nto contribute with but feel that it doesn?t match any of the\nopen positions, then do contact us and let us be the judge\nof that.\n\nCRACKERS\nDo you have a thrill to find solutions to various protection\nschemes? May it be unpacking, patching, finding algorithms\nor emulating? We?re always open for individuals that want to\nexpand their knowledge in reversing. You are required to have\nsome former knowledge in reversing as we do not tutor people\nfrom scratch. Former experience from other scene groups is\ngood, but not a necessity. Unsure if you qualify? Contact us,\nand we?ll decide based on your qualities. Be prepared that\nwe will demand examples of previous work.\n\nCODERS\nYou?re enthusiastic about coding, you love to optimize and\nintegrate various projects; we always have projects ranging\nfrom smaller ones to large ones that are in need of attendance.\nIf you are joining our family as a coder you will be appointed\na variety of projects that will push you to do your best and\nwill probably also serve as a great way of becoming an even\ngreater coder. Projects are ranging from database integrations,\nIRC bots, and cracktros to tools and security oriented\ndevelopment. Examples of previous work will be required and\nexperience beyond 2 years is also a requirement.\n\nSUPPLIERS\nDo you have access to good titles? Perhaps you work as an\nengineer, network administrator, or by any other means can\nacquire the latest versions of what you have access to? Then\nfeel free to contact us and let us know what you have. We do\nnot focus on anything in particular and as such you will find\nthat we do titles ranging from CAD/CAM to more common graphics,\nmusic and programming titles ? as well as ordinary shareware\ntitles. Contact us today and we will see if your titles are\nsomething we?d like to put some effort into.\n\nSITES\nYou?ve been running a dedicated and well supported site for\nmore than 6 months, the site has grown some reputation and your\nstaff as well as the chosen link location is security oriented.\nWe do not accept sites that are running of rented boxes;\nneither do we accept sites located in United States of America,\nGermany or Austria. The speed of the site does not matter, what\ndo matter is that it?s stable, it?s secure and above all ? the\nentire site as well as crew is operating encrypted. You feel\nthat this might be you? Then let us know today, and we will\nbe getting back to you shortly.\n\nBOX OPERATORS\nYou have been running hosting services for years; either being\nBNC solutions or IRC daemons ? or perhaps just have some boxes\nthat you might think we can use. You?re an administrator of a\nnetwork and have complete control over the box, the network\narea and access levels. If so, then you are someone we are\ninterested to talk to. Keep in mind that we do not offer any\nboxes residing in the same countries as mentioned under ?SITES?.\n\nRemember, we all started out somewhere so do not keep yourself\nfrom contacting us thinking you aren?t good enough to help out,\nlet us decide that.\n\n+ L E G A L +\n\nOur releases are made to make sure that the end-user is able\nto fully test a title before going into a purchase as well as\ngive the end-user an opportunity to make backup copies of\ntitles he or she already owns. Please do respect our stance\non this and make sure that you buy the required licenses upon\ndeciding to buy the product. Respect the software authors\nthat have put time, money and effort into creating the title\nyou now have in your hand.\n\n1. You should only use this title for the period of time\nas you decide if this is the right product for you\npersonally or for your business. Upon deciding\nthat this is the product you are looking for then\nwe encourage you to buy the necessary licenses.\n\n2. If you already own this title then this release can be\nused as a substitute to the original disks for backup\nand archiving purposes. This is convenient if you\nown a large set of various titles that all require\ndongles to run and you keep on mixing up the dongles.\nOur releases have removed those checks and thus will\nbe more convenient to use. Again, this should only\nbe the case if you own the required licenses.\n\n3. We do not wish for our releases to be widely spread\nacross web boards, P2P networks and the like. While we\ndo know that occurs we strongly urge people to not\nshare these titles at such places.\n\n4. The group is not involved with the spreading of the\nrelease, partial files or any of the cracks. The\ndistribution of our releases are all done by third\nparties ? and as such according to the laws of the\ncountries where our members reside, it is not our\nresponsibility what others decides to do with\nthese releases.\n\n5. You are NOT allowed to distribute our titles with the\nintent of earning money. This title is not yours to\nsell. We, as a group, do not participate in such\nactions and we plead to those that are thinking about\nselling pirated titles, reconsider ? not only are you\nhurting us seeing our releases being abused, but above\nall ? you are actually stealing profit from the\nsoftware authors.\n\n6. We do not take any responsibility of computer or data\nloss that may occur from using our releases. Keep in\nmind that you are using a third party solution that\ndoes not come from the original software authors.\nHowever we strive to make perfect releases so the\nchances of something like that happening are slim.\n\n7. The usage of our cracks is legal in most countries\noutside of the United States, if and only if you own a\ncomplete copy of the program or game. But you are\nrequired to read the end user license agreements (EULAs)\nthat comes with the various titles to be sure that you\nare not violating any agreements.\n\nAccording to the DMCA ACT in the United States you have no\nrights to circumvent any copy protection. Keep this in mind\nas the penalties for doing so there are harder than if you\nstole the actual title from the self. Our base of operation\nhowever is not located in the states, and thus we are not\nbound by any of the legislations like ?no electronic theft act?\n?digital millennium copyright act? or ?the patriot act?. But\nyou as a end-user might be, so be certain to read the EULAs\nthat you agree to upon installing something to make sure\nyou are not breaking any domestic laws.\n\nFinally, we do encourage you to explore the open source\ncommunity. In most cases you will find open and free software\nthat does exactly what you need, and it won?t cost you\nanything. At the same time you can enjoy the feeling of\ndoing something good, and support the open source community.\n\nBy using this release you agree to the statement written above,\nand accept that the responsibility to whet ever the usage of\nthis title is legal or not is with you and you only. Make sure\nthat you understand the potential risks of using this release.\n\n+ G R E E T S +\n\nHERiTAGE, RAZOR1911, F4CG, EMPHASiS, ZENiTH, MYTH\nGHOST RiDERS, LEGENDS NEVER DiE, ENFUSiA, BiN\nFATiGUED COURiERS NETWORK (FCN)\nCHEMiCAL REACTiON (CRO)\n\n+ C O N T A C T +\n\nIf you want to contact the group either for a open membership\nposition, for a site offer or just want to let us know that\nsome release might be flawed, then we welcome your response.\nHowever we do not send out releases, files from releases,\ncracks or information to where you might find this. For quick\nresponse you might want to search for us online, if you can\nmanage to wait then send us an email on the address below.\n\nEMAIL : &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d9b5b0b7bca3bcabe999b7bcabbdaab1b8bab2f7bab6b4&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nUPDATED : 4th of November 2011\n\nascii proudly done\nby cpN of cRo\nin 2oo6\n\n---------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:5a42a1d91092561520c36f6d1a72af2b0d66652f","amp;dn":"LogoSmartz.v8.0-Lz0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a42a1d91092561520c36f6d1a72af2b0d66652f","infoHashBuffer":{"type":"Buffer","data":[90,66,161,217,16,146,86,21,32,195,111,109,26,114,175,43,13,102,101,47]},"announce":[],"urlList":[]}}