{"title":"Precious Gifts: A Novel - Danielle Steel","uid":12953642,"size":602138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b7def7d1a9056154ebb29913b1c56140fa6ba3f&amp;dn=Precious+Gifts%3A+A+Novel+-+Danielle+Steel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449762062,"description":"Precious Gifts: A Novel - Danielle Steel\r\n\r\n\r\nHandsome, widowed, sophisticated, utterly charming, Paul Parker won the heart of a wealthy young Frenchwoman—the daughter of an American financier, the granddaughter of a major French art dealer—as his second wife. In two marriages, he fathered a challenging son and three very different daughters. But as irresponsible as he was irresistible, he ultimately shrugged off the demands of marriage and parenting to pursue life as an international bon vivant.\r\n\r\nRaised by their mother with all the care and resolve their father lacked, the three Parker sisters have become vibrant, self-reliant young women: Timmie, the oldest, a fiercely dedicated social worker in New York; sweet, nurturing Juliette, proprietor of a fledgling bakery in Brooklyn; and their younger sister, Joy, who is struggling to build an acting career in Los Angeles. While they love their mostly absent, glamorous father, he has left them with a legacy of impermanence and uncertainty in their own relationships with men. And with no strong role model to guide him, Paul’s son has gone from one failure to another, even while his stepmother makes excuses for him, as he seethes with jealousy of his younger sisters.\r\n\r\nNow, after a long illness, Paul has slipped away peacefully in his sleep, and his family has gathered together to read his will. As his final wishes are revealed, his son is forced to face reality as an adult. And his daughters see a new side to their father—one that shows a caring man trying to redeem himself with a different, lasting legacy. He has made a very personal bequest to each of his children, carefully designed to help them achieve their own unique dreams and find true happiness. But Paul has saved the biggest surprise for his ex-wife Véronique: a secret from the past that shakes her world and sets her free. He leaves her a gift that remained a mystery for their entire marriage, and she begins a search to discover its history and rightful owner.\r\n\r\nThe story of a man’s last wish to make a difference—and of the loved ones he leaves behind fulfilling their destinies at last—Precious Gifts is bursting with indelible characters and emotional complexity as it takes readers from New York and Los Angeles to the art capitals of Europe and the South of France. Inspiring and uplifting, it is a deeply moving exploration of the rich territory of loss, inheritance, and reawakening—Danielle Steel at the height of her literary prowess.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:5b7def7d1a9056154ebb29913b1c56140fa6ba3f","amp;dn":"Precious+Gifts%3A+A+Novel+-+Danielle+Steel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b7def7d1a9056154ebb29913b1c56140fa6ba3f","infoHashBuffer":{"type":"Buffer","data":[91,125,239,125,26,144,86,21,78,187,41,145,59,28,86,20,15,166,186,63]},"announce":[],"urlList":[]}}