{"title":"[Parody]Batman Vs. SuperMan","uid":15062714,"size":1669544294,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5b844b43cf66f148a137ac008aca36a4910e4418&amp;dn=%5BParody%5DBatman+Vs.+SuperMan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"distinc","files":1,"time":1466771857,"description":"[Parody]Batman Vs. SuperMan XXX\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=382234594\r\n \nhttp://imagedisco.net/?g=9761721491\r\n\r\n\r\nPlot:\r\n\r\nWe begin the movie with Superman in exile in space, following the events of a previous Axel Braun Superman movie in which a Bizarro duplicate created by Lex Luthor has made Superman a wanted criminal. So out in space, Maxima tries to persuade the Man of Steel to stay with her. Her pitch? They need to repopulate the universe with Kryptonians.\r\n\r\nIntrigued, or so he says, Superman starts having sex with her. Then, while she’s sucking him off, he blows his load in her face and tells her that while her offer piqued his interest, he had no desire to repopulate their race. Or to be a father.\r\n\r\nAfter Batman’s done trying to learn Harley Quinn’s secret plan by having sex with her (she marvels at how the Bat-cape doubles as a sex rug), he finds himself light-headed and losing consciousness…as she reveals that Poison Ivy taught her a thing or two.\r\n\r\nBruce Wayne was totally nailing Lois all along. Funnily enough, even though this flashback is the ONLY time we see Bruce with his clothes off, and a rare moment in which a sex scene would be totally justified even in a mainstream film…we never see them do it.\r\n\r\nSo Bruce knows Clark will be pissed because he is pissed. And Catwoman is remarkably understanding about it all.\r\n\r\nReturning to Earth once Maxima finally realizes he won’t father her children, Superman hears of Lois’ death, so he starts flying around the world backwards really fast…only to find himself right back exactly where started, having only effectively rewound the previous scene. Instead of trying again for longer, he goes to fight Batman, whom he presumes will not let him kill the Joker without a fight.\r\n\r\nBatman shoots him in the eyes.\r\n\r\nThe two stop fighting to fuck Wonder Woman and once they finish, the movie ends","torrent":{"xt":"urn:btih:5b844b43cf66f148a137ac008aca36a4910e4418","amp;dn":"%5BParody%5DBatman+Vs.+SuperMan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b844b43cf66f148a137ac008aca36a4910e4418","infoHashBuffer":{"type":"Buffer","data":[91,132,75,67,207,102,241,72,161,55,172,0,138,202,54,164,145,14,68,24]},"announce":[],"urlList":[]}}