{"title":"Cannonball Adderley - Mercy, Mercy, Mercy! Live At &quot;The Club","uid":4049199,"size":47039232,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c1efb503b9f1f685a2030d270857d6d620c422f&amp;dn=Cannonball+Adderley+-+Mercy%2C+Mercy%2C+Mercy%21+Live+At+%5C%22The+Club&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dfcook","files":6,"time":1204069786,"description":"Cannonball Adderley&amp;#039;s most popular album, Mercy, Mercy, Mercy wasn&amp;#039;t actually recorded &quot;Live at &amp;#039;The Club&amp;#039;,&quot; as its subtitle says. The hoax was meant to publicize a friend&amp;#039;s nightclub venture in Chicago, but Adderley actually recorded the album in Los Angeles, where producer David Axelrod set up a club in the Capitol studios and furnished free drinks to an invitation-only audience. Naturally, the crowd is in an extremely good mood, and Adderley&amp;#039;s quintet, feeding off the energy in the room, gives them something to shout about. By this point, Adderley had perfected a unique blend of earthy soul-jazz and modern, subtly advanced post-bop; very rarely did some of these harmonies and rhythms pop up in jazz so saturated with blues and gospel feeling. Those latter influences are the main inspiration for acoustic/electric pianist Joe Zawinul&amp;#039;s legendary title cut, a genuine Top 40 pop hit that bears a passing resemblance to the Southern soul instrumentals of the mid-&amp;#039;60s, but works a looser, more laid-back groove (without much improvisation). The deep, moaning quality and spacy texture of &quot;Mercy, Mercy, Mercy&quot; stand in contrast to the remainder of the record, though; Nat Adderley contributes two upbeat and challenging originals in &quot;Fun&quot; and &quot;Games,&quot; while Zawinul&amp;#039;s second piece, &quot;Hippodelphia,&quot; is on the same level of sophistication. The leader&amp;#039;s two selections -- the gospel-inflected &quot;Sticks&quot; and the hard-swinging, bluesy bop of &quot;Sack O&amp;#039; Woe&quot; (the latter of which became a staple of his repertoire) -- are terrific as well, letting the group really dig into its roots. Adderley&amp;#039;s irrepressible exuberance was a major part of his popularity, and no document captures that quality as well -- or with such tremendous musical rewards -- as Mercy, Mercy, Mercy.\n\n1 \tFun \tAdderley \t8:26\n2 \tGames \tAdderley \t7:19\n3 \tMercy, Mercy, Mercy \tZawinul \t5:10\n4 \tSticks \tAdderley \t3:54\n5 \tHippodelphia \tZawinul \t5:49\n6 \tSack O&amp;#039; Woe \tAdderley \t10:29","torrent":{"xt":"urn:btih:5c1efb503b9f1f685a2030d270857d6d620c422f","amp;dn":"Cannonball+Adderley+-+Mercy%2C+Mercy%2C+Mercy%21+Live+At+%5C%22The+Club","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c1efb503b9f1f685a2030d270857d6d620c422f","infoHashBuffer":{"type":"Buffer","data":[92,30,251,80,59,159,31,104,90,32,48,210,112,133,125,109,98,12,66,47]},"announce":[],"urlList":[]}}