{"title":"Lonely Planet Moscow (Travel Guide) - 6th Ed (2015).epub Gooner","uid":14701236,"size":79321816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c5a803edf76d434bf38a5a2af3040cf3f1e9255&amp;dn=Lonely+Planet+Moscow+%28Travel+Guide%29+-+6th+Ed+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1464304487,"description":"Lonely Planet Moscow (Travel Guide) - 6th Edition (2015).epub Gooner\r\n\r\nPublisher: Lonely Planet; 6 edition (13 Mar. 2015)\r\nLanguage: English\r\nISBN-10: 174220998X\r\nISBN-13: 978-1742209982\r\n\r\nLonely Planet Moscow is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Explore the wonders of the Kremlin, marvel at the multi-coloured onion domes of St Basil's Cathedral, or take a day-trip to the ancient city of Vladimir; all with your trusted travel companion. Get to the heart of Moscow and begin your journey now!\r\n\r\nInside Lonely Planet's Moscow Travel Guide:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - history, literature, performing arts, palaces, churches\r\n\r\n* Free, convenient pull-out city map (included in print version), plus over 30 colour maps\r\n\r\n* Covers the Kremlin, Red Square, Gorky Park and Suzdal, plus Moscow Metro tours, ballet at the Bolshoi and more\r\n\r\nThe Perfect Choice: Lonely Planet Moscow, our most comprehensive guide to Moscow, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet's Russia guide for a comprehensive look at all the Russia has to offer.\r\nAuthors: Written and researched by Lonely Planet, Mara Vorhees and Leonid Ragozin.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:5c5a803edf76d434bf38a5a2af3040cf3f1e9255","amp;dn":"Lonely+Planet+Moscow+%28Travel+Guide%29+-+6th+Ed+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5a803edf76d434bf38a5a2af3040cf3f1e9255","infoHashBuffer":{"type":"Buffer","data":[92,90,128,62,223,118,212,52,191,56,165,162,175,48,64,207,63,30,146,85]},"announce":[],"urlList":[]}}