{"title":"Fabio Montale (+ English Subs)","uid":8385823,"size":1568746821,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ce22e18cd8209dee641d5d4f7429f2aa212d989&amp;dn=Fabio+Montale+%28%2B+English+Subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"unopoleco","files":7,"time":1366243698,"description":"Total Chaos - This first installment in the legendary Marseilles Trilogy sees Fabio Montale turning his back on a police force marred by corruption and racism and taking the fight against the mafia into his own hands.\n\nChourmo - In this second installment of Jean-Claude Izzo's legendary Marseilles Trilogy-which includes Total Chaos,Chourmo, and Solea-Fabio Montale has left a police force riddled with corruption, racism, and greed to follow the ancient rhythms of his native town: the sea, fishing, the local bar, hotly contested games of belote. But his cousin's son has gone missing, and Montale is dragged back onto the mean streets of a violent, crime-infested Marseilles.\n\nSoleo - The third and final installment in the remarkable Marseilles Trilogy (including Total Chaos and Chourmo), Solea continues Jean-Claude Izzo's distinctive brand of vibrant crime writing, skillfully evoking a time and place that have captured the hearts and imaginations of readers the world over. Marseilles' simmering issues of race, politics, organized crime, and big business come to a rolling boil. Ex-cop, loner, and would-be bon vivant, Fabio Montale is back. His heartfelt cry against the criminal forces devastating his beloved Marseilles provides the touching conclusion to a trilogy that epitomizes the aspirations and ideals of the Mediterranean noir movement.","torrent":{"xt":"urn:btih:5ce22e18cd8209dee641d5d4f7429f2aa212d989","amp;dn":"Fabio+Montale+%28%2B+English+Subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce22e18cd8209dee641d5d4f7429f2aa212d989","infoHashBuffer":{"type":"Buffer","data":[92,226,46,24,205,130,9,222,230,65,213,212,247,66,159,42,162,18,217,137]},"announce":[],"urlList":[]}}