{"title":"The Winner-Take-All Society: Why the Few at the Top Get So Much","uid":8543028,"size":4773680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d0b7e684a4ef328bfc0a05ea428163ca953cea1&amp;dn=The+Winner-Take-All+Society%3A+Why+the+Few+at+the+Top+Get+So+Much&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370448070,"description":"\nRobert H. Frank, Philip J. Cook, &quot;The Winner-Take-All Society: Why the Few at the Top Get So Much More Than the Rest of Us&quot;\nEnglish | 1996 | ISBN: 0140259953 | 278 pages | PDF | 4,6 MB\n\nSelected by Business Week as one of the 10 best business books of the year, this text is &quot;a major contribution to the debate about the causes and consequences of inequality in America&quot;.--The New York Times Book Review.\n\nIf everyday avarice explained the astronomical remunerations garnered by stars and enter(info)tainers, this would be a one-page book, but economists Frank and Cook have broken down the market forces that push salaries into the stratosphere and produced some 200-odd pages on the subject. One major culprit is inherent in mass culture: when millions have a small interest in the winner's performance, however minutely superior to the runner-up's, a large reward goes to that winner (as in a golf tournament). The reward ratchets upward as the market in question becomes overcrowded with aspiring winners (as in acting), but at the end of the game, the inevitable multitude of losers are left with little reward for their efforts. Result: increasing inequality in income.\n\nIf confined to arts and sports, the authors would just be telling interesting anecdotes, but the phenomenon has invaded law, business, and academia, where the pressure to win leads to sterile &quot;positional arms races.&quot; Their solution won't appease free marketeers, who nonetheless will have nothing to object about in this economic analysis of the situation.","torrent":{"xt":"urn:btih:5d0b7e684a4ef328bfc0a05ea428163ca953cea1","amp;dn":"The+Winner-Take-All+Society%3A+Why+the+Few+at+the+Top+Get+So+Much","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0b7e684a4ef328bfc0a05ea428163ca953cea1","infoHashBuffer":{"type":"Buffer","data":[93,11,126,104,74,78,243,40,191,192,160,94,164,40,22,60,169,83,206,161]},"announce":[],"urlList":[]}}