{"title":"The Tonight Show with Conan O'Brien","uid":7082241,"size":53208136768,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5d3cb9f0097a3b59452f5aa1c5e2072074a6a453&amp;dn=The+Tonight+Show+with+Conan+O%27Brien&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"DarkDrift","files":-1,"time":1331073374,"description":"This torrent includes the entire running of The Tonight Show with Conan O'Brien. I downloaded it a while back and thought I should share it with my fellow piratebay users. \n\nIt's become really hard to find anything Conan related from NBC. This is because after he was basically forced out, NBC went crazy on the internet deleting anything related to Conan and NBC. This is one of the reasons they're are only a few videos on Youtube and even those are in poor quality and hard to come by. I hope by putting this on here it will preserve The Tonight Show with Conan O'Brien a little while longer.\n\nFrom Wikipedia:\n\nThe Tonight Show with Conan O'Brien is an American late-night talk show that featured Conan O'Brien as host from June 1, 2009 to January 22, 2010 as part of NBC's long-running Tonight Show franchise. The program's host, Conan O'Brien, previously hosted NBC's Late Night with Conan O'Brien, which followed The Tonight Show with Jay Leno for 16 years, until O'Brien's brief succession over Leno\n\nMany members of the Late Night cast and crew made the transition to The Tonight Show. The Max Weinberg 7, the house band from O'Brien's Late Night, served as the house band under the new name, Max Weinberg and The Tonight Show Band. Andy Richter returned to the show as announcer, and also began resuming his role as sidekick, shortly before the show's conclusion. The opening and closing theme song from Late Night was also carried over to Tonight, in a slightly altered form.","torrent":{"xt":"urn:btih:5d3cb9f0097a3b59452f5aa1c5e2072074a6a453","amp;dn":"The+Tonight+Show+with+Conan+O%27Brien","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d3cb9f0097a3b59452f5aa1c5e2072074a6a453","infoHashBuffer":{"type":"Buffer","data":[93,60,185,240,9,122,59,89,69,47,90,161,197,226,7,32,116,166,164,83]},"announce":[],"urlList":[]}}