{"title":"The Behaviour Gap: Simple Ways to Stop Doing Dumb Things","uid":10573235,"size":2701383,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d95f6e476a1b230e135be0d7a9810d5dee3d1a6&amp;dn=The+Behaviour+Gap%3A+Simple+Ways+to+Stop+Doing+Dumb+Things&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405610189,"description":"The Behaviour Gap: Simple Ways to Stop Doing Dumb Things with Money By Carl Richards\n2012 | 240 Pages | ISBN: 1591844649 | EPUB \n\n\n\nWhy do we lose money? It's easy to blame the economy or the financial markets-but the real trouble lies in the decisions we make. As a financial planner, Carl Richards grew frustrated watching people he cared about make the same mistakes over and over. They were letting emotion get in the way of smart financial decisions. He named this phenomenon - the distance between what we should do and what we actually do - &quot;the behavior gap&quot;. Using simple drawings to explain the gap, he found that once people understood it, they started doing much better. Richards's way with words and images has attracted a loyal following to his blog posts for &quot;The New York Times&quot;, appearances on National Public Radio, and his columns and lectures. His book will teach you how to rethink all kinds of situations where your perfectly natural instincts (for safety or success) can cost you money and peace of mind. He'll help you to: avoid the tendency to buy high and sell low; avoid the pitfalls of generic financial advice; invest all of your assets-time and energy as well as savings-more wisely; quit spending money and time on things that don't matter; identify your real financial goals; start meaningful conversations about money; simplify your financial life; and, stop losing money! It's never too late to make a fresh financial start. As Richards writes: &quot;We've all made mistakes, but now it's time to give yourself permission to review those mistakes, identify your personal behavior gaps, and make a plan to avoid them in the future. The goal isn't to make the 'perfect' decision about money every time, but to do the best we can and move forward. Most of the time, that's enough&quot;.","torrent":{"xt":"urn:btih:5d95f6e476a1b230e135be0d7a9810d5dee3d1a6","amp;dn":"The+Behaviour+Gap%3A+Simple+Ways+to+Stop+Doing+Dumb+Things","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d95f6e476a1b230e135be0d7a9810d5dee3d1a6","infoHashBuffer":{"type":"Buffer","data":[93,149,246,228,118,161,178,48,225,53,190,13,122,152,16,213,222,227,209,166]},"announce":[],"urlList":[]}}