{"title":"Vio-lence - Discography (1986-2003)","uid":9174786,"size":352190819,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5db818cc0b1141d3a4883fe8f33b1b6c07fd409f&amp;dn=Vio-lence+-+Discography+%281986-2003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":58,"time":1384130598,"description":"\nDiscography\n1986 - First Demo [Demo] @192kbps\n1986 - Second Demo [Demo] @192kbps\n1988 - Eternal Nightmare @192kbps\n1990 - Oppressing The Masses @192kbps\n1991 - Torture Tactics [EP] @192kbps\n1993 - Nothing To Gain @320kbps\n2003 - They Just Keep Killing [EP] @128kbps\n\n\nBiography\nVio-lence was formed under the name Death Penalty in 1985. They quickly changed their name to Violence, and then the two-tiered logo with hyphen forced the name change to its permanent form. The original lineup was Jerry Birr on vocals, Phil Demmel and Troy Fua on guitars, Eddie Billy (brother of Testament's Chuck Billy) on bass, and Perry Strickland on drums. This lineup appeared on the Eastern Front (Live at Ruthies) 2LP compilation in 1985 with the song &quot;Gutterslut&quot;. Eddie Billy left soon and was replaced by Dean Dell, and this lineup recorded a rehearsal tape that was released as a demo.\n\nJerry Birr (later to appear in Enemy Mind) was replaced by Sean Killian on vocals, and the band recorded their first official demo, before Troy Fua left and was replaced by Forbidden Evil founding member Robb Flynn in early 1987.\n\nThe band re-recorded all the songs on their first demo for a second one, in 1988, with minor lyrical changes, and new song titles, for their &quot;Mechanic Records demo&quot; in 1988. This label released their debut, Eternal Nightmare, later that year. A tour with Testament and Sanctuary followed, and then another tour with Voi Vod, followed by a second album, Oppressing the Masses, in 1990.\n\nOne track, Torture Tactics, was deleted off the album due to its offensive lyrical content, but then was released as the title track of a 1991 EP. Another tour, this time with Defiance, followed. The third album, Nothing to Gain, was recorded in 1991 but constant record label problems delayed its release.\n\nAt this point, Robb Flynn left to form Machine Head, and was replaced by Ray Vegas on guitar, and Perry Strickland was replaced by Mark Hernandez on drums. A final demo was recorded in 1993, before the band broke up.\n\nVio-lence reunited for Thrash of the Titans, a benefit for Chuck Billy and Chuck Schuldiner, in August 2001. The lineup of Killian, Demmel, Vegas, Dell, and Strickland played a 64 minute gig, which led to further shows in the Bay Area. Ray Vegas was replaced by a returning Troy Fua, and for one gig, Phil Demmel, who was unable to attend, was replaced by Steve Schmidt. Phil also helped out Machine Head as a second guitarist for a few gigs, with Machine Head bassist Adam Duce returning the favour for a gig at Dean Dell's wedding in 2002!\n\nThe band has officially split up, with Phil Demmel concentrating exclusively on Machine Head.","torrent":{"xt":"urn:btih:5db818cc0b1141d3a4883fe8f33b1b6c07fd409f","amp;dn":"Vio-lence+-+Discography+%281986-2003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db818cc0b1141d3a4883fe8f33b1b6c07fd409f","infoHashBuffer":{"type":"Buffer","data":[93,184,24,204,11,17,65,211,164,136,63,232,243,59,27,108,7,253,64,159]},"announce":[],"urlList":[]}}