{"title":"Pavlov's Dog - At The Sound Of The Bell [1976] [FLAC]","uid":8041765,"size":208464196,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5e22a8d13ed81b4fead2e01d54ad46cd42a707e5&amp;dn=Pavlov%27s+Dog+-+At+The+Sound+Of+The+Bell+%5B1976%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":12,"time":1358647991,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Pavlov's Dog\nRelease: At The Sound Of The Bell\nDiscogs: 1042164\nReleased: 1976\nLabel: Columbia / CBS\nCatalog#: PC 33964 / CDCBS 32405\nFormat: CD, Album\nCountry: UK\nStyle: Rock, Classic Rock\n\nTracklisting:\n\n01. She Came Shining (4:18)\n02. Standing Here With You (Megan's Song) (3:51)\n03. Mersey (3:05)\n04. Valkerie (5:23)\n05. Try To Hang On (2:08)\n06. Gold Nuggets (3:27)\n07. She Breaks Like A Morning Sky (2:27)\n08. Early Morning On (3:11)\n09. Did You See Him Cry (5:38)\n\nPavlov's Dog lead singer David Surkamp was everything that was wrong with the band's Columbia debut Pampered Menial. Tempered here by Blue Oyster Cult producers Murray Krugman and Sandy Pearlman, who also recorded the first disc, the sound is more appealing to the ear. The question is, where was it going? Too pop for progressive rock, and too progressive for Top 40, the music is driving and more focused the second time around. There are some heavy guests to add to the festivities, Roxy Music's sax player Andy Mackay along with drummer William Bruford and Arista sax player Michael Brecker, though the tracks they appear on are not designated. &quot;Valkerie&quot; has a great hook, of &quot;bring back the good old days,&quot; and the production here is cleaner than the first time around, but there is something very left field about this group, extremely non-commercial, even on a pretty ballad like &quot;Standing Here With You (Megan's Song).&quot; The music isn't as artsy as the Mothers of Invention, and certainly not as on target as Blue Oyster Cult, making one wonder if A&amp;R man Mark Spector was just being courteous to producers Krugman and Pearlman? Mark Spector had produced Bob Segarini's 1975 effort with Dudes on Columbia, and went on to manage 38 Special, his pop leanings make this signing all the more mysterious. That being said, this outing is actually more pop oriented, or at least as poppy as this style and singer may want to be. &quot;Try to Hang On&quot; is light and listener friendly, one of the best tracks on the album; it is followed by &quot;Gold Nuggets&quot; which is almost a continuation of &quot;Try to Hang On.&quot; &quot;She Breaks Like Morning Sky&quot; interrupts the flow a bit, driving a little harder, but the performance is still light years beyond the previous album. The producers have brought the music up in the mix, and the skillful playing of Pampered Meniel is brought a few notches up. &quot;Early Morning On&quot; is a superior track, musically, and though Surkamp is more subdued, it is still his voice which throws the monkey wrench into this affair. The cover concept with model Michael Mantel dressed as the Hunchback of Notre Dame and swinging upside down from bells is very cool, while the mascot from the previous album's cover, the 1849 artwork/engravings by Robert Vernon, appears again on the record sleeve/lyric sheet. At the risk of sounding cruel to the lead vocalist/writer/co-writer of all the songs, both albums would work better as instrumentals -- David Surkamp's voice a little too grating for the elegant and complex music inside these grooves. Adventurous and meaningful, The Sound of the Bell is a great concept and musical experience that falls short. Have to give them A for effort, though.\n\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:5e22a8d13ed81b4fead2e01d54ad46cd42a707e5","amp;dn":"Pavlov%27s+Dog+-+At+The+Sound+Of+The+Bell+%5B1976%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e22a8d13ed81b4fead2e01d54ad46cd42a707e5","infoHashBuffer":{"type":"Buffer","data":[94,34,168,209,62,216,27,79,234,210,224,29,84,173,70,205,66,167,7,229]},"announce":[],"urlList":[]}}