{"title":"Individual Psychology - Adler - 1 of only 3 great Psycholgies","uid":6779403,"size":398069336,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e392462f2c61de25d528ec753e34e82d3c55422&amp;dn=Individual+Psychology+-+Adler+-+1+of+only+3+great+Psycholgies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"UnviolentPeacemaker","files":42,"time":1319844068,"description":"Individual Psychology, by Alfred Adler\n\nThis, and Frankl's 'Man's Search for Meaning' are the two most important, non-toxic books on psychology.  The 3rd and 4th worth mention are the variety of Pitirim Sorokin's work that reveal is most useful of all models of psychology - that we best can be understood as two warring options in our nervous system - the Heart (Supraconscious), vs the Head and Flesh, tho his terms are different.  And finally, on this site, Csikszentmihalyi's 'The Evolving Self,' reveals a powerful 'psychology' for evolving 'culturally' and 'personally' in time to survive, and even flourish as a species [UnviolentPeaceMaker torrent].\n &lt;a href=&quot;\nhttp://www.amazon.com/Individual-Psychology-Alfred-Adler-Torchbooks/dp/0061311545&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Individual-Psychology-Alfred-Adler-Torchbooks/dp/0061311545&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.alfredadler.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.alfredadler.org/&lt;/a&gt;\n\n''Health' lies in the direction of COURAGE.' Adler paraphrase\n'Anyone's mental health can be restored if they will but devote themselves to the service of others.' Adler paraphrase\n'Health is in seeing that we are all part of the same unit. Pathology is seeing, and acting, on the mistaken perception that one exists on enemy territory.' Adler paraphrase \n\nEver see 'One Flew Over a Cuckoos' nest?  99.99% of psychologies and psychologists are right in there with Nurse Ratched, right?  I mean truly, clinically.  Did you know there are well over 100 different, and approved psychologies?  Imagine that there were 100 best ways, supposedly, to get from point A to point b, or to do an appendectomy.  Quackery.  Witch-doctory.  Sham.  Scam.\n\nWould you go to a medical doctor that said, 'well, I have no idea what 'health' is?'  I wouldn't.  How do you know what illness is if you don't know what Health is.  Yet all but three of the hundreds of psychologies run from defining 'Health' as though it were the plague itself.\n\nPsychology as practiced is nothing more than a place to go to feel less sick, while being very sick, and being made sick, in a toxic, sick, western society.\n\nSome psychologists are a little better than the norm just outlined.  Csikszentmihalyi, Carl Rogers and Abraham Maslow come to mind, but all three too much, especially Rogers and even Maslow, don't clearly see that Loving is the opposite of Lusting, and they fall into the trap of 'adjusting' us to a meaningless, intoxicating existence of Lusting rather than a Life of Loving (Serving, in Solidarity, from the Soul), for which we are designed.\n\nThree great Hearts and Minds have escaped this trap and offer us Great, Hopeful, Promising Psychologies - Alfred Adler, Viktor Frankl, and surprisingly given his 'profession' as sociologist (founding that school at Harvard) is Pitirim Sorokin who comes closest to articulating the most powerful model of all - that Health is Living out of Heart, and Pathology is existing with Head and Flesh in charge.  Sorokin's must-reads include - 'The Ways and Power of Love,' and the one volume summary version of 'Social and Cultural Dynamics.'\n\n-----------------------\n\n1. URGENT, PLS, SEED, SEED, SEED ALL, ALL, ALL ...\nUnviolentPeaceMaker's TPB uploads       &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt; .  \nSOON I MAY BE PREVENTED.  DO IT.  \nKEEP THESE TORRENTS ALIVE.  Thanks.  All of them.\n\n2. NOTE:  High Quality ATT Voice. Dont like it?  Dont download it.  Dont complain.  Dont get in the way.\n\n------------------------\n\n\nmp3 audio book free download txt ebook","torrent":{"xt":"urn:btih:5e392462f2c61de25d528ec753e34e82d3c55422","amp;dn":"Individual+Psychology+-+Adler+-+1+of+only+3+great+Psycholgies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e392462f2c61de25d528ec753e34e82d3c55422","infoHashBuffer":{"type":"Buffer","data":[94,57,36,98,242,198,29,226,93,82,142,199,83,227,78,130,211,197,84,34]},"announce":[],"urlList":[]}}