{"title":"Cool Infographics: Effective Communication with Data Visualizati","uid":10509780,"size":168959845,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e849e5e10f86f812ebce9c423280d38e1c27795&amp;dn=Cool+Infographics%3A+Effective+Communication+with+Data+Visualizati&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":1,"time":1404833730,"description":"ool Infographics: Effective Communication with Data Visualization and Design by Randy Krum\nEnglish | 2013 | ISBN: 1118582306 | 368 pages | PDF | 161 MB\n\nMake information memorable with creative visual design techniques\n\nResearch shows that visual information is more quickly and easily understood, and much more likely to be remembered. This innovative book presents the design process and the best software tools for creating infographics that communicate. Including a special section on how to construct the increasingly popular infographic resume, the book offers graphic designers, marketers, and business professionals vital information on the most effective ways to present data.\n\nExplains why infographics and data visualizations work\nShares the tools and techniques for creating great infographics\nCovers online infographics used for marketing, including social media and search engine optimization (SEO)\nShows how to market your skills with a visual, infographic resume\nExplores the many internal business uses of infographics, including board meeting presentations, annual reports, consumer research statistics, marketing strategies, business plans, and visual explanations of products and services to your customers\nWith Cool Infographics, you'll learn to create infographics to successfully reach your target audience and tell clear stories with your data. ","torrent":{"xt":"urn:btih:5e849e5e10f86f812ebce9c423280d38e1c27795","amp;dn":"Cool+Infographics%3A+Effective+Communication+with+Data+Visualizati","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e849e5e10f86f812ebce9c423280d38e1c27795","infoHashBuffer":{"type":"Buffer","data":[94,132,158,94,16,248,111,129,46,188,233,196,35,40,13,56,225,194,119,149]},"announce":[],"urlList":[]}}