{"title":"Riding Dirty (Ruiners Motorcycle Club) by Abriella Blake epub","uid":9723931,"size":276867,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5eaecb6111ba517c9e1399ccd0a874c98f9ed999&amp;dn=Riding+Dirty+%28Ruiners+Motorcycle+Club%29+by+Abriella+Blake+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AtomTPB","files":1,"time":1394275207,"description":"She'll risk everything for love...but can she tame his wild heart?\n\nGood girl Rowan Thomas is smart, determined--and about to take a walk on the wild side. Her little sister, Lacy, desperately needs a liver transplant. Without one, she has less than a year to live. So Rowan drops out of college, risking her scholarship and her ticket out of her destructive past, to head for Las Vegas...where she'll do anything to get enough money for a black-market operation.\n\nAnd then, she meets him.\n\nBronson Ramsey. MMA fighter, bad ass outlaw biker, and womanizer extraordinaire. Bronson has his own financial problems--every cent he makes on his brutal, high-profile fights is going to pay off a vicious cartel that's at war with the biker club he calls family. He has no time for relationships, even if he wanted one. But something in Rowan calls out to his battered soul.\n\nWhen Bronson &quot;wins&quot; Rowan in a card game, she responds by trying to rob him--ineffectively, since her smarts are all books and no street. Bronson discovers that she's a virgin and makes a daring proposition: she works a high-end escort scam with him and the club, and they'll split the profits. No one will touch her. But at the end, she'll reward him with her virginity.\n\nWhat Bronson doesn't need is a relationship, and least of all love. He's convinced it's only for the money and sex. \n\nRowan agrees, for Lacy's sake. And once it's over, she promises herself that she'll find a way to escape Bronson and his lawless MC--but she's already starting to fall for him hard. Can she save a man from himself...one who doesn't want to be saved?","torrent":{"xt":"urn:btih:5eaecb6111ba517c9e1399ccd0a874c98f9ed999","amp;dn":"Riding+Dirty+%28Ruiners+Motorcycle+Club%29+by+Abriella+Blake+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eaecb6111ba517c9e1399ccd0a874c98f9ed999","infoHashBuffer":{"type":"Buffer","data":[94,174,203,97,17,186,81,124,158,19,153,204,208,168,116,201,143,158,217,153]},"announce":[],"urlList":[]}}