{"title":"Brad Steiger - Conspiracies and Secret Societies - The Complete","uid":15449272,"size":26394730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ed2f32312149db98a5b3d1fdfc62938bcf3d786&amp;dn=Brad+Steiger+-+Conspiracies+and+Secret+Societies+-+The+Complete+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469927616,"description":"https://extraimago.com/images/2016/07/31/99d9e2769bb4babf5c49ee6fd210443c-d.jpg\r\n\r\nBrad Steiger - Conspiracies and Secret Societies - The Complete Dossier 2006\r\n\r\nStartling allegations. Suppressed evidence. Missing witnesses. Assassinations. Cover-ups and threats. Documented connections to even deeper intrigue. Allusions to the New World Order. Coincidences? Too many to be mere coincidence? American history is replete with warnings of hidden plots by the Illuminati, the Freemasons, the Zionists, the Roman Catholics, the Communists, World Bankers, the Secret Government, and Extra-Terrestrial Invaders, to name a few.\r\n\r\nSeparating fact from fiction, this compelling work provides gripping details and presents the information without bias, including hundreds of individuals, organizations, and events where official claims and standard explanations of actions and events remain shrouded in mystery. Conspiracies and Secret Societies: The Complete Dossier examines the most common subjects among conspiracy theorists, from historical topics such as the true relationship between Jesus and Mary Magdalene, the Roswell UFO crash, and the assassinations of John F. Kennedy and Martin Luther King Jr. to more current issues such as the death of Princess Diana, FEMA’s response following hurricane Katrina, and the recent earthquake and tsunami in Japan","torrent":{"xt":"urn:btih:5ed2f32312149db98a5b3d1fdfc62938bcf3d786","amp;dn":"Brad+Steiger+-+Conspiracies+and+Secret+Societies+-+The+Complete+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ed2f32312149db98a5b3d1fdfc62938bcf3d786","infoHashBuffer":{"type":"Buffer","data":[94,210,243,35,18,20,157,185,138,91,61,31,223,198,41,56,188,243,215,134]},"announce":[],"urlList":[]}}