{"title":"The Appetizer Atlas - A World of Small Bites","uid":6559526,"size":1977394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f1bcd0eca1ee0b95bb0e5faf6a7cd27b619187a&amp;dn=The+Appetizer+Atlas+-+A+World+of+Small+Bites&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lionzbay","files":1,"time":1311411727,"description":"\nAuthor(s): Arthur L. Meyer\nPublisher: Wiley\nDate: 2003-03-10\nFormat: pdf\nLanguage: English\nISBN10: 0471411027\nPages: 640\nISBN13: 9780471411024\n\nProduct Description: The ultimate single-source cookbook for a world of appetizers\nWhether in the form of a passed hors d'oeuvre, canap?, or a dish of small bites placed at a table setting, appetizers are the perfect showcase of a cook's creativity and skill. The Appetizer Atlas brings together an enticing range of starters from around the world that will help lead off any dining experience in style. This unique, encyclopedic cookbook offers 400 authentic, savory recipes for appetizers from twenty-eight distinctive regional cuisines-from Mexico to Maghreb, from China to the Caribbean, along with France, India, Italy, Japan, Thailand, and many more. All recipes are kitchen tested, perfect for home cooking, professional catering, and entertaining. With photographs of finished dishes, plus background material on specialty ingredients and regional cooking methods, this comprehensive resource is the only appetizer book a cook will ever need.\nArthur L. Meyer (Austin, TX) is a professional chef, pastry chef, and consultant for commercial bakeries.\nJon M. Vann is an award-winning chef, restaurant consultant, and a food writer for the Austin Chronicle.","torrent":{"xt":"urn:btih:5f1bcd0eca1ee0b95bb0e5faf6a7cd27b619187a","amp;dn":"The+Appetizer+Atlas+-+A+World+of+Small+Bites","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1bcd0eca1ee0b95bb0e5faf6a7cd27b619187a","infoHashBuffer":{"type":"Buffer","data":[95,27,205,14,202,30,224,185,91,176,229,250,246,167,205,39,182,25,24,122]},"announce":[],"urlList":[]}}