{"title":"Land Girls Season 1 DVD NL subs DutchReleaseTeam","uid":8552424,"size":2353209930,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f25221412539d3525f1b41794795df4f758b9b0&amp;dn=Land+Girls+Season+1+DVD+NL+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Recon06","files":8,"time":1370678870,"description":"Land Girls Season 1 DVD NL subs DutchReleaseTeam\n\n[IMG]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/LandGirls1dvdcase_zps5593b516.png[/IMG]\n\n'Land Girls' was de koosnaam voor jonge vrouwen die in de Tweede Wereldoorlog huis en haard achterlieten om als lid van de Women's Land Army de Britse landbouw draaiende te houden. \nIn deze hartverwarmende dramaserie volgen we de lotgevallen van vier van deze dappere dames: de nuchtere Annie, haar vrolijke zus Bea, de onhandige Joyce en de koele Nancey. \nHet leven van deze stadsmeiden komt op zijn kop te staan als ze zomaar van de ene op de andere dag keihard aan het werk gaan op het platteland. \nZe worden snel volwassen en sluiten vriendschappen voor het leven. \nOverdag werken ze zij aan zij met krijgsgevangenen. Hun vrije tijd brengen ze samen door in een slaapzaal met primitieve voorzieningen. \nTerwijl ze wachten op nieuws over hun dierbaren dreigt er van alle kanten gevaar. En dat gevaar is niet alleen afkomstig van de vijand...\n\t\t\nGenre: Romantiek &amp; Drama\n\nActeurs: Rachel Weisz, Catherine McCormack, Anna Friel, Maureen O'Brien, Gerald Down, Paul Bettany, Nick Mollo, Michael Mantas, Celia Bannerman\nTaal: Engels\nOndertiteling: Nederlands\nLanguage: English\nSubtitle: Dutch (Hardcoded)\n\n\n[url=http://www.imdb.com/title/tt1449940/][img]http://hetmultimediacafe.nl/images/afbeeldingen/imdb.png[/img][/url]\n\n\n\nChildhood's End\nSeries 1 Episode 1 of 5\nDURATION: 44 MINUTES\nFour girls have different reasons for joining the Women's Land Army: patriotic Joyce wants to 'do her bit', argumentative Nancy is there under sufferance, and sensible Annie joined so that her younger sister Bea could escape an abusive father.\nBea rebels from her sister's control and finds herself enthralled by a charming GI, Cal Gillespie, while at the dance Nancy tries to get closer to Lord Hoxley.\n\nSecrets\nSeries 1 Episode 2 of 5\nDURATION: 45 MINUTES\nBea has been hiding her pregnancy from everyone for three months, but it is becoming increasingly difficult. \nTucker is on the prowl for enemy sympathisers and Nancy is in his sights.\nFarmer Finch gets involved in a scam to flog home-made carrot whiskey, while Lord Hoxley realises that his marriage is over, driving him into the arms of Nancy. \nMeanwhile, Tucker finds Annie to tell her the devastating news that her husband has been killed in action.\n\n\nCodes of Honour\nSeries 1 Episode 3 of 5\nDURATION: 46 MINUTES\nThree months on, and Annie is not dealing very well with Harry's death. \nNancy and Lawrence's attraction has blossomed into a full-on affair. \nMeanwhile, Esther is screening Nancy's letters for Sergeant Tucker, fearing that she might be a Nazi collaborator.\nJoyce, the patriot, has a dilemma - should she shelter her deserter husband or turn him in? Farmer Finch's old enemy Ernest Luckhurst, a food rations officer, arrives at the farm and is intent on catching him out.\n\n\nTrekkers\nSeries 1 Episode 4 of 5\nDURATION: 44 MINUTES\nFarmer Finch hires some 'trekkers', families displaced by the bombing, as cheap labour, but when there is then a break-in at the manor house Lady Hoxley orders Finch to get rid of them all. \nA riot ensues and Tucker gets the dogs out.\nThe Hoxleys hold a swanky party, but after clashing with Nancy over a visit to her husband John, Joyce tells Lady Hoxley about the affair. \nBilly finally proposes to Bea, but she goes into labour before she can answer.\n\n\nDestinies\nSeries 1 Episode 5 of 5\nDURATION: 47 MINUTES\nBea prepares for her wedding to Billy and discovers that Finch has doubts about her motives. \nDetermined to leave, Nancy is shocked to the core when Ellen reveals Lawrence's dark secret. \nWill Annie choose her duty to Harry or her love for Adam?\nMeanwhile, Tucker sets out on a trail of murderous revenge that will have shocking consequences for Nancy, Annie, Bea and Joyce.\n\nDutchReleaseteam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.be","torrent":{"xt":"urn:btih:5f25221412539d3525f1b41794795df4f758b9b0","amp;dn":"Land+Girls+Season+1+DVD+NL+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f25221412539d3525f1b41794795df4f758b9b0","infoHashBuffer":{"type":"Buffer","data":[95,37,34,20,18,83,157,53,37,241,180,23,148,121,93,244,247,88,185,176]},"announce":[],"urlList":[]}}