{"title":"War Against the Chtorr series by David Gerrold (#1-#4)","uid":10407941,"size":2156060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f992e7758cc75239dcffdf95d93f1e0a5aa93b1&amp;dn=War+Against+the+Chtorr+series+by+David+Gerrold+%28%231-%234%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":4,"time":1403487956,"description":"\nDavid Jerrold Friedman (born 24 January 1944, in Chicago, Illinois), better known by his pen name David Gerrold, is an American science fiction author who started his career in 1966 while a college student by submitting an unsolicited story outline for the television series Star Trek. \n\nHe was invited to submit several premises, and the one chosen by Star Trek was filmed as &quot;The Trouble with Tribbles&quot; and became one of the most popular episodes of the original series. Gerrold's novelette &quot;The Martian Child&quot; won both Hugo and Nebula awards.\n\nGenre: Science Fiction, Post-Apocalyptic\n\n\n#1 - A Matter for Men\n\nTerrible plagues have devastated the Earth. The first wave of the infestation has arrived, wiping out billions. The desperate survivors discover that terrible strange creatures are now hatching, growing, and breeding. The crimson-colored ecology creeps relentlessy across the unprotected countryside. \n\nYoung James Edward McCarthy, barely out of high school, is drafted into the Special Forces Warrant Agency, an elite group whose sole mission is to target and destroy the most voracious of all the Chtorran creatures -- the gigantic carnivorous worms.\nMcCarthy will quickly discover that the horror of the Chtorr is surpassed only by the horrors of what human beings must become to fight the invasion.\n\n#2 - A Day for Damnation\n\nMcCarthy was drafted from his college biology studies and became a member of the Special Forces. Then he is given the opportunity to contact the Chtorr, but when a helicopter crash leaves him and his companions stranded in enemy territory, he must decide whether to communicate with the Chtorr--or kill them! \n\nNow a trusted lieutenant in the Special Forces, McCarthy discovers how much he's torn between his desire to fight the Chtorran infestation and learn more about what it really is. When his chopper goes down in the middle of a vast 'pink storm,' Jim McCarthy and beautiful red-haired pilot Lizard Tirelli get a box seat to the life cycles of myriad Chtorran creatures. \n\nWho are the 'bunnydogs' and is their bizarre behavior a critical clue to communicating with their Chtorran masters? Can McCarthy decipher the mystery? Or even more disturbing--what if there's no mastermind at all behind the invasion?\n\n#3 - A Rage for Revenge\n\nThe years of battle have begun to take their toll on Captain Jim McCarthy. He has become hardened and cynical, bitter about the possibilities of survival on the Earth. Even the love of Lizard Tirelli is not enough to keep him anchored in his own humanity. \n\nJust when he thinks he has reached the limit of his ability to continue, he is captured by renegades--humans who have discovered a way to live in partnership with the Chtorr. Jim is intrigued by the mysteries they have unraveled, but their horrifying secrets leave him shattered. Pushed beyond the limits of sanity, can Jim recover from what he has learned--or will the cure be worse than the disease? And what is the real truth behind The Mode Training?\n\n#4 - A Season for Slaughter\n\nIngram As tenacious aliens transform the war torn Earth into a replica of their own terrifying world, a handful of scientists, soldiers, and citizens prepares to fight back. Aerial surveillance reveals a growing horror. \n\nDeep in the heart of the corrupted Amazon lies the most extensive Chtorran infestation on the planet. Jim McCarthy and Lizard Tirelli travel with a team of scientists in a giant airship across the teeming jungle to observe this massive ecological cancer. But even as they find the first glimmers of hope, they also find disaster.","torrent":{"xt":"urn:btih:5f992e7758cc75239dcffdf95d93f1e0a5aa93b1","amp;dn":"War+Against+the+Chtorr+series+by+David+Gerrold+%28%231-%234%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f992e7758cc75239dcffdf95d93f1e0a5aa93b1","infoHashBuffer":{"type":"Buffer","data":[95,153,46,119,88,204,117,35,157,207,253,249,93,147,241,224,165,170,147,177]},"announce":[],"urlList":[]}}