{"title":"Hackers Films - Hackers 1 &amp; Takedown &amp; Antitrust","uid":4606500,"size":2060339768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5fa627f644b41c6dd65ca724f36ea17c43ac7484&amp;dn=Hackers+Films+-+Hackers+1+%26+Takedown+%26+Antitrust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"itztex","files":3,"time":1230487940,"description":"Hosted on a &quot;Seedbox&quot;. \n\nSo you should get good speeds depending on how many files im uploading.. (On ofcourse you location and broadband speed. =] )\n\nEnjoy..\t\n\n\n\nHad a few issues before but server is going know.\n\n\n\nHackers (1995)\nPlot : \nA young boy is arrested by the US Secret Service for writing a computer virus and is banned from using a computer until his 18th birthday. Years later, he and his new-found friends discover a plot to unleash a dangerous computer virus, but they must use their computer skills to find the evidence while being pursued by the Secret Service and the evil computer genius behind the virus\n\n\n\nTakedown (2000)\nPlot:\n\nKevin Mitnick is quite possibly the best hacker in the world. Hunting for more and more information, seeking more and more cybertrophies every day, he constantly looks for bigger challenges. When he breaks into the computer of a security expert and an ex-hacker, he finds one - and much more than that...  \n\n\nAntitrust (2001) \nPlot:\n\nThis movie is the fictional story of computer programming genius Milo Hoffman after graduating from Stanford and getting out into the competitive world of computer software. In his contemplation of where to begin his career, he is contacted by Gary Winston whose character is loosely based on Bill Gates. Winston is the CEO of a company called NURV, and they are on the brink of completing the global communication's system, Synapse. They need Hoffman to help them meet their launch date, so after much thought and with the full support of his girlfriend Alice, he accepts the job. Tragedy soon after strikes and Milo becomes suspicious of the company he has been wrapped up in. He learns that trusting anyone could be a mistake, and that nothing is as it seems.  Written by Jordan Thornsburg\n\nAfter graduating from Stanford, two idealistic computer whiz kids who are best friends are offered jobs at NURV, a giant Portland company with a driven boss, Gary Winston, on the verge of a world-linking satellite communication system. With support from his girlfriend Alice, Milo takes the job; Teddy says no and continues work on a media compression program he wants to make available free. Winston takes a personal interest in Milo, whose genius can help NURV meet its launch date, and Milo responds with brilliance and long hours. When Teddy meets with tragedy and Winston's offhand remark makes Milo suspicious, he decides to investigate Winston and NURV. But, whom can he trust? \n\n\n\n","torrent":{"xt":"urn:btih:5fa627f644b41c6dd65ca724f36ea17c43ac7484","amp;dn":"Hackers+Films+-+Hackers+1+%26+Takedown+%26+Antitrust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa627f644b41c6dd65ca724f36ea17c43ac7484","infoHashBuffer":{"type":"Buffer","data":[95,166,39,246,68,180,28,109,214,92,167,36,243,110,161,124,67,172,116,132]},"announce":[],"urlList":[]}}