{"title":"Starting At Zero - His Own Story (2013) By Jimi Hendrix (Epub,Mo","uid":9611265,"size":4309562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:600f17a42e48e160f046189c9572372d5ae36fb5&amp;dn=Starting+At+Zero+-+His+Own+Story+%282013%29+By+Jimi+Hendrix+%28Epub%2CMo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1392323910,"description":"Format: mobi/epub/azw3\nLength: 256 pages\nGenre: Non-Fiction/Biography\nDate: 27 November 2013\n\nIt took just four years in the spotlight for Jimi Hendrix to become an international cultural icon. The sheer impact and originality of his music and his unique mastery of the guitar placed him forever amongst musical giants. \n\nBut what of the man behind the public image? Modest and intensely private by nature, Jimi was shrouded in intrigue from the moment he first came into the public eye, and the mystery has only grown with time. Much has been written about him by experts, fans, and critics, some of it true and some of it not. \n\nHe did, however, leave his own account of himself, locked away like a Chinese puzzle in his many interviews, lyrics, writings, poems, diaries, and even stage raps. Starting at Zero brings all these elements together in narrative form. The result is an intimate, funny, and poetic memoir - one that tells, for the first time, Jimi's own story as only he could tell it.\n\nAuthor:\n\nJimi Hendrix was an American guitarist, singer and songwriter. Hendrix is considered one of the greatest and most influential guitarists in rock music history. Hendrix helped develop the technique of guitar feedback with overdriven amplifiers. He was influenced by blues artists such as B.B. King, Muddy Waters, Albert King, and Elmore James, rhythm and blues and soul guitarists Curtis Mayfield, Steve Cropper, as well as by some modern jazz.","torrent":{"xt":"urn:btih:600f17a42e48e160f046189c9572372d5ae36fb5","amp;dn":"Starting+At+Zero+-+His+Own+Story+%282013%29+By+Jimi+Hendrix+%28Epub%2CMo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"600f17a42e48e160f046189c9572372d5ae36fb5","infoHashBuffer":{"type":"Buffer","data":[96,15,23,164,46,72,225,96,240,70,24,156,149,114,55,45,90,227,111,181]},"announce":[],"urlList":[]}}