{"title":"Dufay - Music for St James the Greater -Binchois Csrt [Philidor]","uid":15855621,"size":319844350,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6035dafe244c50889a4e2434dff393778ba41ad5&amp;dn=Dufay+-+Music+for+St+James+the+Greater+-Binchois+Csrt+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Philidor","files":17,"time":1474239737,"description":"The 15th century composer Guillaume Dufay understandably left no portraits, as none dated from the time are accurate. Any that survive are non-representational. He was however one of the most highly regarded composers of his age, and was richly rewarded by his royal sponsors with various benefices. He was the most influential musician of his age, with his works copied in manuscript throughout much of Europe. Inevitably, some that were not his were attributed to him, creating a cottage industry among modern musicologists seeking to separate out the real from the wishful. \r\n\r\n\r\nAccording to the disc, &quot;St James the Greater, Apostle of Christ, foster son of the Virgin Mary, brother of St John the Evangelist, and indelibly—if somewhat perplexingly—associated with Compostela, became the focus of many composers; after all, anyone who was anyone in the Middle Ages (including Chaucer’s Wife of Bath) would make a pilgrimage to St James’s shrine in Spain at some point in their life. The exact background to Dufay’s Mass is as yet unknown but it is an enormous work (forty minutes plus) of great passion.\r\n\r\n&quot;Also included on this disc are three motets composed around the same time as the Mass, and a Gloria/Credo pairing, remarkable for up-beat, if irreverent, interpolations of snippets from Italian and French popular songs during the ‘Amens’.&quot;\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio is enclosed, as well as an essay Latin texts with English translations. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread: \r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:6035dafe244c50889a4e2434dff393778ba41ad5","amp;dn":"Dufay+-+Music+for+St+James+the+Greater+-Binchois+Csrt+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6035dafe244c50889a4e2434dff393778ba41ad5","infoHashBuffer":{"type":"Buffer","data":[96,53,218,254,36,76,80,136,154,78,36,52,223,243,147,119,139,164,26,213]},"announce":[],"urlList":[]}}