{"title":"EXPLOITED COLLEGE GIRLS - Daisy - Teen ANAL Fiend  **NEW**","uid":11471595,"size":513293712,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:60497cdeafd306521ea7d240757a26affa8e600e&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Daisy+-+Teen+ANAL+Fiend++%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"beta2008x","files":1,"time":1416095705,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=icvta_dys.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=icvta_dys.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=kdl3t_ecg_daisy_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=kdl3t_ecg_daisy_s.jpg&lt;/a&gt;\n\n\nThere are girls who &quot;like anal&quot; and then there are girls like Daisy who REALLY LIKE ANAL. In this week's update, after warming her up with a couple of real orgasms, Jay goes right for the back door and fills Daisy's ass. But this week's scenes aren't just about anal; there's also some amazing deep throat, some great hard fucking and a huge half facial, half swallow finish.\n\nAs we listen in on Jay's interview with Daisy we learn initially that she has 22 piercings. Unfortunately for us the pornstar name &quot;Pin Cushion&quot; is already taken. But as we get to know her better it seems like she's either lying or she's the perfect girl. Turns out she isn't lying. She loves sucking cock, she's multi-orgasmic, she's a total cumslut and she loves getting her ass pounded. The only she's missing, really, is in the bra department. Daisy has a great little body but is a little bottom heavy with her A cup tits, well not exactly A cup. Like, A cup with room for a cellphone. And a wallet. And some padding.\n\nAs cute as she is, the best thing about Daisy is probably her attitude. She doesn't whine or complain, she just relaxes into it and rides that D like a good girl should. As soon as Jay gets her naked and starts in with his fingers and then a vibrator, she completely loses herself in the shoot and before long she's overcome by a huge orgasm and is begging Jay to fuck her.\n\nLucky for you, Jay isn't the kind of guy who let's chicks tell him what to do and before any fucking is going to happen Daisy is going to swallow some dick. Swallow it she does, making a full deep throat look as natural as smiling. Turns out that Daisy knows exactly how to get fucked at Ex Co Gi - suck that thing like it has a candy center and eventually our man Jay is gonna put it anyplace you want it. In Daisy's case it's her pussy and then her ass for some exotic anal reverse cowgirl until Jay finishes with a shot to the face that's supposed ot be a facial but Daisy won't stop trying to swallow.\n\nLike we said, the perfect girl","torrent":{"xt":"urn:btih:60497cdeafd306521ea7d240757a26affa8e600e","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Daisy+-+Teen+ANAL+Fiend++%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60497cdeafd306521ea7d240757a26affa8e600e","infoHashBuffer":{"type":"Buffer","data":[96,73,124,222,175,211,6,82,30,167,210,64,117,122,38,175,250,142,96,14]},"announce":[],"urlList":[]}}