{"title":"Head in the Cloud - William Poundstone","uid":15542049,"size":4614694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6097e7b2f8f6f47fb2ebbcc8d58994d2bb627228&amp;dn=Head+in+the+Cloud+-+William+Poundstone&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mr_mando","files":2,"time":1470926643,"description":"More people know who Khloe Kardashian is than who Rene Descartes was. Most can't find Delaware on a map, correctly spell the word occurrence, or name the largest ocean on the planet. But how important is it to fill our heads with facts? A few keystrokes can summon almost any information in seconds. Why should we bother learning facts at all?\r\n\r\nBestselling author William Poundstone confronts that timely question in HEAD IN THE CLOUD. He shows that many areas of knowledge correlate with the quality of our lives--wealth, health, and happiness--and even with politics and behavior. Combining Big Data survey techniques with eye-opening anecdotes, Poundstone examines what Americans know (and don't know) on topics ranging from quantum physics to pop culture. \r\n\r\nHEAD IN THE CLOUD asks why we're okay with spelling errors on menus but not on resumes; why Fox News viewers don't know which party controls Congress; why people who know &quot;trivia&quot; make more money than those who don't; how individuals can navigate clickbait and media spin to stay informed about what really matters. \r\n\r\nHilarious, humbling, and wildly entertaining, HEAD IN THE CLOUD is a must-read for anyone who doesn't know everything","torrent":{"xt":"urn:btih:6097e7b2f8f6f47fb2ebbcc8d58994d2bb627228","amp;dn":"Head+in+the+Cloud+-+William+Poundstone","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6097e7b2f8f6f47fb2ebbcc8d58994d2bb627228","infoHashBuffer":{"type":"Buffer","data":[96,151,231,178,248,246,244,127,178,235,188,200,213,137,148,210,187,98,114,40]},"announce":[],"urlList":[]}}