{"title":"CSS3 For Dummies 2013 [PDF &amp; Epub]","uid":9209911,"size":48700070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6117b8262a0219e0e26fc1772267fdc9a646c147&amp;dn=CSS3+For+Dummies+2013+%5BPDF+%26amp%3B+Epub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"F1restorm","files":-1,"time":1384760305,"description":"CSS3 For Dummies\nAuthors: John Paul Mueller\nPublished: October 9, 2013\nPublisher: Wiley\nISBN: 9781118441428\nFormat: Retail Epub and Retail PDF\nReader Required: \nPDF- Adobe Reader, Adobe Digital Editions\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre\nThere's a cheatsheet and a couple of articles available from the publisher's website with no registration required (links in book). \nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\nGet the most out of the new features in CSS3\n\nCascading Style Sheets (CSS3) boasts many new features that designers love. Things like better mobility, cleaner code, less maintenance, and basic interactivity without JavaScript are just a few. Get thoroughly up to speed on CSS3 with CSS3 For Dummies. Whether you're a web developer or designer with a lot or very little experience in HTML and CSS, or just want assistance applying it to multiple browser and mobile apps, this book delivers. Explore in depth how CSS3 effects and transforms work and how to use them for animation and interactivity.\n\n-Explains CSS3 in detail for web developers and designers who may or may not know HTML, CSS, or tools like Dreamweaver\n-Instructs how to define and apply CSS3 effects and transforms that work in multiple browsers\n-Covers how to animate CSS3 effects and transforms with CSS and basic JavaScript\n-Provides detailed information and helpful examples, in the friendly, non-intimidating, For Dummies style\n-Start putting the great new features of CSS3 to work on your next project with CSS3 For Dummies.","torrent":{"xt":"urn:btih:6117b8262a0219e0e26fc1772267fdc9a646c147","amp;dn":"CSS3+For+Dummies+2013+%5BPDF+%26amp%3B+Epub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6117b8262a0219e0e26fc1772267fdc9a646c147","infoHashBuffer":{"type":"Buffer","data":[97,23,184,38,42,2,25,224,226,111,193,119,34,103,253,201,166,70,193,71]},"announce":[],"urlList":[]}}