{"title":"Justin Cronin-The Twelve","uid":14039068,"size":761292704,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:616b4b519209bc488a92a16e5e19f86f6c5de554&amp;dn=Justin+Cronin-The+Twelve&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twocows","files":24,"time":1459003259,"description":"The Twelve\r\nby Justin Cronin\r\n\r\n  NEW YORK TIMES BESTSELLER\r\nThe end of the world was only the beginning.\r\nIn his internationally bestselling and critically acclaimed novel The Passage, Justin Cronin constructed an unforgettable world transformed by a government experiment gone horribly wrong. Now the scope widens and the intensity deepens as the epic story surges forward with . . .\r\n\r\nTHE TWELVE\r\nIn the present day, as the man-made apocalypse unfolds, three strangers navigate the chaos. Lila, a doctor and an expectant mother, is so shattered by the spread of violence and infection that she continues to plan for her child's arrival even as society dissolves around her. Kittridge, known to the world as &quot;Last Stand in Denver,&quot; has been forced to flee his stronghold and is now on the road, dodging the infected, armed but alone and well aware that a tank of gas will get him only so far. April is a teenager fighting to guide her little brother safely through a landscape of death and ruin. These three will learn that they have not been fully abandonedand that in connection lies hope, even on the darkest of nights.\r\nOne hundred years in the future, Amy and the others fight on for humankind's salvation . . . unaware that the rules have changed. The enemy has evolved, and a dark new order has arisen with a vision of the future infinitely more horrifying than man's extinction. If the Twelve are to fall, one of those united to vanquish them will have to pay the ultimate price","torrent":{"xt":"urn:btih:616b4b519209bc488a92a16e5e19f86f6c5de554","amp;dn":"Justin+Cronin-The+Twelve","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"616b4b519209bc488a92a16e5e19f86f6c5de554","infoHashBuffer":{"type":"Buffer","data":[97,107,75,81,146,9,188,72,138,146,161,110,94,25,248,111,108,93,229,84]},"announce":[],"urlList":[]}}