{"title":"Wilbur Smith - Pora Umierania [PL]","uid":14188807,"size":445661433,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:61746efbd5d63484c11bfe8f07e0775088c518e5&amp;dn=Wilbur+Smith+-+Pora+Umierania+%5BPL%5D+MP3%4048&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"everdarksoul","files":46,"time":1459870922,"description":"Audiobook PL - 43 części /   \r\nrozmiar: 424 MB / czas: 20:37:45\r\nczyta: Leszek Teleszyński\r\n\r\nChoć na przestrzeni lat, z każdą wydaną po niej częścią, zmieniała się jej &quot;numeracja&quot;, to wydana w 1989 roku &quot;Pora Umierania/Ostatnie Polowanie&quot; pozostaje ostatnią chronologicznie częścią cyklu &quot;Saga Rodu Courtneyów&quot; - opisującą wydarzenia rozgrywające się w drugiej połowie XX wieku. Cóż, autor nie wydawał swoich książek w z góry ustalonym porządku czasowym wydarzeń w nich opisywanych, i do pewnych wątków, przedziałów czasowych, nieregularnie powracał - czasem nawet po długiej przerwie - co czyni ten cykl jednym z najbardziej obfitujących w sequele i prequele, pierwszych powstałych 7 tomów tej znakomitej sagi rodzinnej.\r\n\r\nJesteśmy zatem w południowej Afryce końca lat '70. XX wieku - w regionie trapionym licznymi, poważnymi problemami. Wojna, epidemie, korupcja i wysoka przestępczość sprawiają, że życie tu nie jest lekkie... Sposobem wielu krajów z tego regionu na stały dopływ gotówki do pustych kas państwa są safari - kontrolowane polowania na dzikie zwierzęta. W ten sposób majętni ludzie, którzy są skorzy wyłożyć całkiem sporą gotówkę, szukają prawdziwych emocji, a biedne państwo zarabia tak tu pożądaną &quot;twardą walutę&quot;.\r\nZ Ameryki do Zimbabwe przybywa półkownik Riccardo Monterro, wraz ze swą córką. Claudia jest niezamężną, atrakcyjną, dwudziesto-sześcioletnią kobietą. Z ojcem łączy ją trudna do zrozumienia mieszanka miłości i nienawiści. Claudia towarzyszy ojcu w podróży, która prawdopodobnie jest jego ostatnim safari w życiu - śmiertelna choroba odlicza bowiem ostatnie tygodnie egzystencji Ricardo.\r\nIch przewodnikiem zostaje Sean Courtney - weteran wojny domowej, znakomity tropiciel i myśliwy - twardy, bezlitosny i ...diabelnie przystojny. Sean jest stałym organizatorem safari w których często brał udział Ricardo.\r\nW pościgu za słoniem grupa myśliwych przekracza nielegalnie granice ogarniętego wojennym chaosem Mozambiku. Schwytany pomiędzy dwie walczące do ostatniej kropli krwi armie, miotany uczuciem do Claudii, Sean broni się przed zaangażowaniem w kolejny konflikt. Na próżno...\r\nTym razem to on i jego towarzysze staną się tropioną zwierzyną - i tylko od Seana będzie zależeć, czy Claudii uda się przeżyć krwawe piekło...\r\n\r\nSaga Rodu Courtneyów to niezwykle soczysta, intensywna i wyrazista proza. Pełna życia, emocji i namiętności. Wilbur Smith pisze w sposób mocno zaangażowany, wręcz &quot;skażony&quot; jego miłością do Afryki - ziemi na której się urodził. Można nie zgadzać się z postawami czy poglądami bohaterów jego książek, można nie przyjmować do siebie diagnoz problemów trapiących &quot;od zawsze&quot; ten kontynent - ale trudno też nie doceniać dojrzałego, mocnego i ...po prostu urzekającego stylu pisarza","torrent":{"xt":"urn:btih:61746efbd5d63484c11bfe8f07e0775088c518e5","amp;dn":"Wilbur+Smith+-+Pora+Umierania+%5BPL%5D+MP3%4048","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61746efbd5d63484c11bfe8f07e0775088c518e5","infoHashBuffer":{"type":"Buffer","data":[97,116,110,251,213,214,52,132,193,27,254,143,7,224,119,80,136,197,24,229]},"announce":[],"urlList":[]}}