{"title":"Counter-Strike: Global Offensive Non-Steam","uid":7917587,"size":2413527040,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:618f56a02df07f01a3ad06fd2f772b03b23956ab&amp;dn=Counter-Strike%3A+Global+Offensive+Non-Steam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ansi_kun","files":-1,"time":1355358088,"description":"Year: 2012\nGenre: Action\nDeveloper: Valve Corporation and Hidden Path Entertainment\nPublisher: Valve\n\n--------------------------------------------------------------------------------\n\nSystem requirements:\n\nOperating system: Windows XP SP3 / Windows Vista / Windows 7 SP1\nProcessor: Pentium 4 3 GHz or dual core from Intel 2 GHz / AMD64X2\nMemory: 1 GB (XP) / 2 GB (Vista / 7)\nVideo Card: 128 MB VRAM compatible with DirectX 9.0 and the technology to support Pixel Shader 2.0b (ATI Radeon X800 or better / NVIDIA GeForce 7600 or better / Intel HD Graphics 2000)\nSound card: compatible with DirectX 9.0c\nFree space on hard drive: 10 GB\n\nPublication Type: Informal\nLanguage: Multilingual\nSound language: English\n--------------------------------------------------------------------------------\n\nDescription: Counter-Strike: Global Offensive - the new multiplayer first-person shooter, designed to deepen and refine the very command game mechanics &quot;five by five,&quot; for which all come to love and Counter-Strike.\n\nThe program includes entertainment Global Offensive as all-new maps, characters and weapons, and the mountain of &quot;classic&quot; things like de_dust and other religious levels, a small post-restructuring. A pile of original game modes, board leaders and indispensable lobby for the soldiers - all of this is also included.\n\nInstallation:\n1. When you first start the launcher you need to generate client.dll, why click &quot;Generate&quot; and wait. After starting Steam automatically launch the game and generate your client.dll. Be sure to wait for the success message is generated.\n2. Used to generate more than one account with a licensed version. Perhaps at the time you click &quot;Generate&quot; all accounts will be busy generating other players, in consequence of which you will be asked to do it later. Standby time is 7 minutes.\n3. After successful generation, you should always close the STEAM, if he did not close automatically and change the name of the game, to then click &quot;Profile Settings&quot;, then you will discover a field to enter a name and change the language game.\n4. After the name change, press the &quot;Start Game&quot;, then run the auto-obnovlyator which will install no-steam emulator on your game. Well, the game you can run in the auto obnovlyatore. When you run the auto-obnovlyatora, this launcher closes.\n5. Next time you start, use only with the &quot;Start Game&quot;. Generate the next launch is not required. Re-generation is required in the event that was updated by the game developers.\n6. Just do not click the &quot;Generate&quot;, because you reduce the opportunity for other players to generate itself client.dll. Generation is needed only when the very first start the game.\t\t","torrent":{"xt":"urn:btih:618f56a02df07f01a3ad06fd2f772b03b23956ab","amp;dn":"Counter-Strike%3A+Global+Offensive+Non-Steam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618f56a02df07f01a3ad06fd2f772b03b23956ab","infoHashBuffer":{"type":"Buffer","data":[97,143,86,160,45,240,127,1,163,173,6,253,47,119,43,3,178,57,86,171]},"announce":[],"urlList":[]}}