{"title":"Be Yourself, Everyone Else is Already Taken: Transform Your Life","uid":6231065,"size":2299201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:618fe9fce5eead2df3b73f3549f0787106878a34&amp;dn=Be+Yourself%2C+Everyone+Else+is+Already+Taken%3A+Transform+Your+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MANTESH","files":4,"time":1299715019,"description":" &lt;a href=&quot;http://img703.imageshack.us/img703/5651/mantesh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img703.imageshack.us/img703/5651/mantesh.jpg&lt;/a&gt;\n\n\n\n\n\n\nBe Yourself, Everyone Else is Already Taken: Transform Your Life with the Power of Authenticity\n\n\n\nJossey-Bass; 1 Edition (April 6, 2009) \nMike Robbins, \nEnglish \nISBN 047039501X \n256 pages \nPDF \n2.12 MB\n\nAuthenticity is the buzzword of the moment. &quot;Be true to yourself.&quot; &quot;Be your real self.&quot; &quot;Be the person you were meant to be.&quot; \nThe message is loud and clear. Or is it? There is pressure from all around (our parents, teachers, spouses, co-workers, friends, and the media) telling us it's more important to be liked and to fit in than it is to be who we truly are. We are also constantly bombarded with messages telling us that we aren't good enough and need to be fixed. \nWritten by Mike Robbins - best-selling author and motivational speaker - Be Yourself, Everyone Else Is Already Taken shows how you can overcome your fear about being who you really are and accept yourself without a mask, pretentions, bluff, or fakery. This encouraging book will help you confront some of your own personal challenges with honesty and genuineness. It contains powerful ideas, principles, and practices that when integrated into your life on a regular basis can help you access a deeper place of truth within you. Be Yourself, Everyone Else Is Already Taken will empower you to \n\n* Confront and transform your fear \n* Express yourself fully and confidently \n* Deal with conflicts directly and resolve them effectively \n* Take risks and go for what you truly want in life \n* Keep things in perspective and have more fun \n* Trust, forgive, and celebrate yourself \n* Have more freedom, peace, and confidence in your relationships, your work, and your life \n\nBeing your authentic self is not for the faint of heart, but once you're willing to truly engage and do the work to become real, your life will be more exciting, meaningful, and fulfilling!\n\n\n\n","torrent":{"xt":"urn:btih:618fe9fce5eead2df3b73f3549f0787106878a34","amp;dn":"Be+Yourself%2C+Everyone+Else+is+Already+Taken%3A+Transform+Your+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"618fe9fce5eead2df3b73f3549f0787106878a34","infoHashBuffer":{"type":"Buffer","data":[97,143,233,252,229,238,173,45,243,183,63,53,73,240,120,113,6,135,138,52]},"announce":[],"urlList":[]}}