{"title":"TIBET - Tibet - Sherab Ling Monks - Sacred Tibetan Chant","uid":4423481,"size":64520078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61947936f87c897a87a3de159186ac2919f8e337&amp;dn=TIBET+-+Tibet+-+Sherab+Ling+Monks+-+Sacred+Tibetan+Chant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starinar","files":6,"time":1222903608,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC. \nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY! \n\n\nThis live recording was made during actual ceremonies and \nincludes the natural ambient sounds of normal activety. Over \nmany centuries, the prayer ceremonies on this CD have been \nperformed by the Tibetan Buddhist monks and nuns of the Karma \nKagyu lineage, forming part of the foundation of their daily \nlives. These ceremonies originated in the great Buddhist \nmonasteries of Tibet, and have been brought by the devoted \npractitioners to India, where they continue this ancient tradition. \nContents: \n\nMahamudra Lineage Prayer and Meditation, Mahakala Puja - Invocation \nand offering to Mahakala, Mahakala Puja - Receiving blessings and \ndedicating the merit to world peace &amp; harmony, \n\nEditorial Reviews \nProduct Description \n2003 GRAMMY Award Winner for Best Traditional World Music Album \nSherab Ling Monastery nestles in the gentle pine-forested foothills \nof northern India's Kangra Valley, the seat of its founder His \nEminence Ti Situpa XII, a leading Tibetan Buddhist teacher and peace \ncampaigner. Here the monks perform as part of their daily lives prayer \nceremonies originating many centuries ago in the great Buddhists \nmonasteries of Tibet. This CD presents the Lineage Prayer with which \nthe monks begin their day, offering respect to a line of great \nmeditation practitioners going back as far as the 7th century, and \nthe Mahakala Ceremony, part of each day's closing ritual in which \nthe monks ask for purification and dedicate their blessings to all \nsentient creatures. \n\nQuality: 130Kbps","torrent":{"xt":"urn:btih:61947936f87c897a87a3de159186ac2919f8e337","amp;dn":"TIBET+-+Tibet+-+Sherab+Ling+Monks+-+Sacred+Tibetan+Chant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61947936f87c897a87a3de159186ac2919f8e337","infoHashBuffer":{"type":"Buffer","data":[97,148,121,54,248,124,137,122,135,163,222,21,145,134,172,41,25,248,227,55]},"announce":[],"urlList":[]}}