{"title":"Everything Is Under Control - Conspiracies, Cults, And Cover-ups","uid":8785130,"size":3816083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:619b918fb69e7665f4b8051284f20f41ed37a7d0&amp;dn=Everything+Is+Under+Control+-+Conspiracies%2C+Cults%2C+And+Cover-ups&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1375814470,"description":"Everything Is Under Control: Conspiracies, Cults, and Cover-ups\n\nRobert A. Wilson \n448 pages\nPDF\nPublisher: Collins; 1 edition (June 23, 1998)\nLanguage: English\nISBN-10: 0062734172\n\nRobert Anton Wilson is the grand pooh-bah of late-20th-century conspiracy theory, but regular Wilson fans may find Everything Is Under Control inchoate in comparison to such masterworks as the Illuminatus! trilogy. The format may be encyclopedic, but the information isn't; to note one glaring omission, the only entries on Ronald Reagan refer readers to three other entries in which Reagan is briefly mentioned--none of which has anything to do with Iran-Contra. (Actually, there is a listing for Iran-Contra, but again, it merely points to some of the pieces of the puzzle.)\n\nThe book's primary value, then, apart from the snippets of conspiracy &quot;proof&quot; it does provide, is in Wilson's playful yet insightful articulation of the psychology and linguistics of conspiratorial thinking. &quot;Because we can say 'the Jews' or 'the New World Order' or 'the Patriarchy,'&quot; he writes, &quot;we can believe, or almost believe, that these grammatical abstractions have the same kind of reality as basketballs, barking dogs, and baked beans.&quot; There are also some fun private jokes, including a lot of data on the Discordians. It's not the best Wilson book--that, perhaps, is Masks of the Illuminati--but it's an adequate introduction to his imaginative philosophy","torrent":{"xt":"urn:btih:619b918fb69e7665f4b8051284f20f41ed37a7d0","amp;dn":"Everything+Is+Under+Control+-+Conspiracies%2C+Cults%2C+And+Cover-ups","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619b918fb69e7665f4b8051284f20f41ed37a7d0","infoHashBuffer":{"type":"Buffer","data":[97,155,145,143,182,158,118,101,244,184,5,18,132,242,15,65,237,55,167,208]},"announce":[],"urlList":[]}}