{"title":"The 100 S02E04 Web X264 NL Subs DutchReleaseTeam","uid":11676986,"size":768900307,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6211a83f1152ae620133b15107f0f6896ef7cb24&amp;dn=The+100+S02E04+Web+X264+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Recon06","files":8,"time":1422911498,"description":"The 100 S02E04 Web X264 NL Subs DutchReleaseTeam\n\n[img]http://i19.photobucket.com/albums/b187/vivitronl/Het%20Multimedia%20Cafe%20Afbeeldingen/Serie%20Screenshot/The100se2dvdcase_zps726a2edb.png[/img]\n\n[color=red][b]Please give a feedback[/b][/color]\n\nDe serie speelt zich af 97 jaar nadat een nucleaire oorlog de beschaving heeft verwoest.\nEen ruimteschip dat huisvesting geeft aan de eenzame menselijke overlevenden stuurt 100 jeugddelinquenten terug naar de aarde om te onderzoeken of er een mogelijkheid is tot rekolonisatie.\n\nNinety-seven years ago, nuclear Armageddon decimated planet Earth, destroying civilization. \nThe only survivors were the 400 inhabitants of 12 international space stations that were in orbit at the time. \nThree generations have been born in space, the survivors now number 4,000, and resources are running out on their dying &quot;Ark&quot; - \nthe 12 stations now linked together and repurposed to keep the survivors alive. \nDraconian measures including capital punishment and population control are the order of the day, \nas the leaders of the Ark take ruthless steps to ensure their future, \nincluding secretly exiling a group of 100 juvenile prisoners to the Earth's surface to test whether it's habitable. \nFor the first time in nearly a century, humans have returned to planet Earth. \nAmong the 100 exiles are Clarke, the bright teenage daughter of the Ark's chief medical officer; \nWells, son of the Ark's Chancellor; the daredevil Finn; and the brother/sister duo Bellamy and Octavia, whose illegal sibling status has always led them to flaunt the rules. \nTechnologically blind to what's happening on the planet below them, the Ark's leaders - Clarke's widowed mother, Abby; \nthe Chancellor, Jaha; and his shadowy second in command, Kane - are faced with difficult decisions about life, death and the continued existence of the human race. \nFor the 100 young people on Earth, however, the alien planet they've never known is a mysterious realm that can be magical one moment and lethal the next. \nWith the survival of the human race entirely in their hands, The 100 must find a way to transcend their differences, \nunite and forge a new path on a wildly changed Earth that's primitive, intense and teeming with the unknown. \n(Source: The CW)\n\nActeurs: Eliza Taylor-Cotter, Thomas McDonell, Marie Avgeropoulos, Christopher Larkin, Paige Turco, Ricky Whittle, Isaiah Washington and many more\nGenre: Drama | Sci-Fi | Thriller\nTaal orig. Versie : Engels\nLanguage: English\nOndertiteling: Nederlands\nSubtitles: Dutch (Hardcoded)\nMet heel veel dank aan de orginele vertalers\n\n\n\n\n\nDutchReleaseTeam = Hardcoded Dutch Subs\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op http://www.hetmultimediacafe.org or http://www.hetmultimediacafe.nl","torrent":{"xt":"urn:btih:6211a83f1152ae620133b15107f0f6896ef7cb24","amp;dn":"The+100+S02E04+Web+X264+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6211a83f1152ae620133b15107f0f6896ef7cb24","infoHashBuffer":{"type":"Buffer","data":[98,17,168,63,17,82,174,98,1,51,177,81,7,240,246,137,110,247,203,36]},"announce":[],"urlList":[]}}