{"title":"Active File Recovery Professional v10.0.5 with Key [TorDigger]","uid":8026649,"size":18934918,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:62844e66c390999c1dbbdec7053eefbde8acec1a&amp;dn=Active+File+Recovery+Professional+v10.0.5+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TorDigger","files":10,"time":1358321663,"description":"Active File Recovery Professional\n\nActive@ File Recovery is a powerful software utility, designed to restore accidentally files and directories, that have been lost or deleted from your Windows system. It allows you to recover files that have been deleted from the Recycle Bin, as well as those deleted after avoiding the Recycle Bin (e.g. Shift-Delete) and allows you to recover data after formatting or loss of partitions. Active@ File Recovery will also undelete files that have been lost by damage, virus or directory destruction. The utility scans computer hard drives in minutes and displays all files which can be recovered.\n\nThe Enterprise package of Active@ File Recovery also includes a Partition Recovery tool. They can be launched from the bootable CD to work with a crashed or failing computer system.\nActive@ File Recovery Enterprise installation package contains a CD/DVD ISO image that you can burn to get a bootable CD or DVD with a lightweight version of Windows 7 running in RAM (WinPE 3.0). It is the only way to recover your data in the case that your system is not bootable and you cannot attach the damaged Hard Disk Drive to another machine.\n\nFeatures:\n\n- Data Recovery on unbootable system due to a computer crash, virus attack, damage by malicious program,or power failure (Enterprise version)\n- Recovers deleted files from damaged, formatted or reformatted partitions\n- File recovery. Files that have been lost by formatting, damaged by virus attack, or a power failure\n- Partition recovery after disk partition(s) loss / format / damage on FAT, FAT32 and NTFS partitions (Professional and Enterprise versions)\n- Photos recovery, pictures recovery if they were deleted from flash media, or lost due to formatting a memory card\n- RAW Disk Image creation\n- Supports FAT12, FAT16, FAT32, NTFS, NTFS5, NTFS+EFS file systems\n- Supports hardware RAID arrays and software RAID volumes. RAID data recovery\n- SuperScan technology recognizes 28 file types by signatures and sorts them in folders (see details)\n- Two types of drive scan: QuickScan (Fast) and SuperScan (Slow)\n- Full support for multi-language character sets (Unicode), recovers files and folders having names containing non-English characters (ex. Spanish, Chinese, Korean, etc.)\n\nSupported OS:\n\nWindows: 8, 7, Vista, Server 2008, Server 2003, XP, 2000\n\nHomepage: http://www.file-recovery.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name and key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:62844e66c390999c1dbbdec7053eefbde8acec1a","amp;dn":"Active+File+Recovery+Professional+v10.0.5+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62844e66c390999c1dbbdec7053eefbde8acec1a","infoHashBuffer":{"type":"Buffer","data":[98,132,78,102,195,144,153,156,29,187,222,199,5,62,239,189,232,172,236,26]},"announce":[],"urlList":[]}}