{"title":"The Ultimate Book of Saturday Science -Why Cats Land on Their Fe","uid":8689445,"size":14797160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:629ea6c98015d99d38afdd2c578db93a47931483&amp;dn=The+Ultimate+Book+of+Saturday+Science+-Why+Cats+Land+on+Their+Fe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"MANTESH","files":2,"time":1373856238,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61lmOvhgKaL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61lmOvhgKaL.jpg&lt;/a&gt;\n\n\nThe Ultimate Book of Saturday Science: The Very Best Backyard Science Experiments You Can Do Yourself\n\n\nPublisher: Princeton University Press\nNeil A. Downie\n2012\nLanguage: English\nISBN-10: 0691149666\nISBN-13: 978-0691149660\nEPUB \n576 pages \n11.5 MB\n\nThe Ultimate Book of Saturday Science is Neil Downie's biggest and most astounding compendium yet of science experiments you can do in your own kitchen or backyard using common household items. It may be the only book that encourages hands-on science learning through the use of high-velocity, air-driven carrots. \n\nDownie, the undisputed maestro of Saturday science, here reveals important principles in physics, engineering, and chemistry through such marvels as the Helevator--a contraption that's half helicopter, half elevator--and the Rocket Railroad, which pumps propellant up from its own track. The Riddle of the Sands demonstrates why some granular materials form steep cones when poured while others collapse in an avalanche. The Sunbeam Exploder creates a combustible delivery system out of sunlight, while the Red Hot Memory experiment shows you how to store data as heat. Want to learn to tell time using a knife and some butter? There's a whole section devoted to exotic clocks and oscillators that teaches you how.\n\nThe Ultimate Book of Saturday Science features more than seventy fun and astonishing experiments that range in difficulty from simple to more challenging. All of them are original, and all are guaranteed to work. Downie provides instructions for each one and explains the underlying science, and also presents experimental variations that readers will want to try.\n\n[/color][/quote][/b]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41DL8KcxDhL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41DL8KcxDhL._SS500_.jpg&lt;/a&gt;\n\nWhy Cats Land on Their Feet: And 76 Other Physical Paradoxes and Puzzles\n\n\nPublisher: Princeton University Press\nMark Levi\n2012\nLanguage: English\nISBN-10: 0691148546\nISBN-13: 978-0691148540\nPDF\n216 pages \n2.60 MB\n\nEver wonder why cats land on their feet? Or what holds a spinning top upright? Or whether it is possible to feel the Earth's rotation in an airplane? Why Cats Land on Their Feet is a compendium of paradoxes and puzzles that readers can solve using their own physical intuition. And the surprising answers to virtually all of these astonishing paradoxes can be arrived at with no formal knowledge of physics. \n\n Mark Levi introduces each physical problem, sometimes gives a hint or two, and then fully explains the solution. Here readers can test their critical-thinking skills against a whole assortment of puzzles and paradoxes involving floating and diving, sailing and gliding, gymnastics, bike riding, outer space, throwing a ball from a moving car, centrifugal force, gyroscopic motion, and, of course, falling cats.\n\nWant to figure out how to open a wine bottle with a book? Or how to compute the square root of a number using a tennis shoe and a watch? Why Cats Land on Their Feet shows you how, and all that's required is a familiarity with basic high-school mathematics. This lively collection also features an appendix that explains all physical concepts used in the book, from Newton's laws to the fundamental theorem of calculus.\n\n","torrent":{"xt":"urn:btih:629ea6c98015d99d38afdd2c578db93a47931483","amp;dn":"The+Ultimate+Book+of+Saturday+Science+-Why+Cats+Land+on+Their+Fe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629ea6c98015d99d38afdd2c578db93a47931483","infoHashBuffer":{"type":"Buffer","data":[98,158,166,201,128,21,217,157,56,175,221,44,87,141,185,58,71,147,20,131]},"announce":[],"urlList":[]}}