{"title":"Transformers.La.Vendetta.Del.Caduto.2009.iTALiAN.BDRip.XviD-TRL","uid":5267928,"size":1467537455,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:634e4bb3949a8c38b1755f070d2841b4d18aecbb&amp;dn=Transformers.La.Vendetta.Del.Caduto.2009.iTALiAN.BDRip.XviD-TRL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AvalonMe","files":3,"time":1262956134,"description":"REGIA: Michael Bay\nSCENEGGIATURA: Ehren Kruger, Alex Kurtzman, Roberto Orci\nATTORI: Shia LaBeouf, Megan Fox, John Turturro, Rainn Wilson, Josh Duhamel, Tyrese Gibson, Isabel Lucas, Matthew Marsden, Ramon Rodriguez\nRuoli ed Interpreti\nFOTOGRAFIA: Ben Seresin\nMONTAGGIO: Roger Barton\nMUSICHE: Steve Jablonsky\nPRODUZIONE: Paramount Pictures, DreamWorks SKG, Di Bonaventura Pictures, Hasbro, Tom DeSanto/Don Murphy Production\nDISTRIBUZIONE: Universal Pictures Italia\nPAESE: USA 2009\nUSCITA CINEMA: 26/06/2009\nGENERE: Azione, Fantascienza\nDURATA: 150 Min\nFORMATO: Colore 35MM - 1.44 : 1\nSito Italiano\nSito Ufficiale\n \t Questo film non ÃƒÂ¨ attualmente programmato al cinema.\nTRAMA DEL FILM TRANSFORMERS 2: LA VENDETTA DEL CADUTO: \nSono ormai passati due anni da quando il giovane Sam Witwicky (Shia LaBeouf) ha salvato l'intero universo dall'apocalittica battaglia fra due razze rivali di robot alieni, e malgrado le sue gesta eroiche, Sam ÃƒÂ¨ ancora il ragazzo di prima, con tutti i problemi e le ansie dei suoi coetanei. All'inizio di questo nuovo capitolo di Transformers, Sam sta affrontando la non facile decisione di partire per frequentare il college, e di doversi quindi separare per la prima volta dalla sua ragazza Mikaela (Megan Fox), e dai suoi genitori (Kevin Dunn e Julie White), e dal suo nuovo, fidato amico &quot;robot&quot; di nome Bumblebee. Sam non aspira ad altro che a condurre una normale vita universitaria ma per poterlo fare, dovrebbe ignorare il suo destino. Infatti, nonostante il ragazzo abbia cercato di lasciarsi alle spalle il conflitto di Mission City e di tornare alla sua routine, la battaglia fra Autobots e Decepticons ha causato molti cambiamenti. Sector 7 ÃƒÂ¨ stato smantellato e il suo piÃƒÂ¹ fedele soldato, l'Agente Simmons (John Turturro), ÃƒÂ¨ stato liquidato senza troppi convenevoli. Al suo posto ÃƒÂ¨ nata una nuova agenzia, la NEST, che si avvale di esperti comandanti di campo come Lennox (Josh Duhamel) ed Epps (Tyrese Gibson), che lavorano al fianco degli Autobots al fine di evitare un ennesimo confronto fatale con i Decepticons. Sfortunatamente il Consulente della Sicurezza Nazionale, Theodore Galloway (John Benjamin Hickey) non ÃƒÂ¨ abbastanza lungimirante da rendersi conto degli inesorabili cambiamenti che stanno per verificarsi. Desideroso di controllare tutte le organizzazioni preposte alla difesa e di gestirne il potere, e deciso a disfarsi di ciÃƒÂ² che considera un superfluo bureau governativo, Galloway vorrebbe chiudere la NEST, convinto che le minacce di guerra siano ormai acqua passata. Oltre tutto Galloway crede che gli esseri umani non abbiano alcun interesse reale a restare coinvolti nella disputa fra gli Autobots e i Decepticons. Proprio nel momento in cui Sam ha da poco fatto il suo ingresso nella sua nuova scuola, familiarizzando con un nuovo compagno di stanza un pÃƒÂ² invadente di nome Leo (Ramon Rodriguez), e una ragazza vivace e molto carina di nome Alice (Isabel Lucas), improvvisamente viene colto da visioni che gli attraversano il cervello come lampi. Preoccupato di soffrire della stessa malattia che ha colpito suo nonno, Sam non rivela a nessuno il suo problema, fino a quando non puÃƒÂ² piÃƒÂ¹ fare a meno di ignorare i messaggi e i simboli che si fanno strada nella sua mente. Nonostante le sue migliori intenzioni, Sam si trova nuovamente coinvolto nel braccio di ferro fra Autobots e Decepticons, in cui ÃƒÂ¨ ancora una volta in gioco il destino dell'universo. E non sa di essere l'unico a possedere la chiave dell'esito di questa battaglia fra le opposte forze di bene e malvagitÃƒÂ . Grazie all'aiuto dei suoi amici piÃƒÂ¹ cari, dei suoi colleghi della NEST e dei suoi genitori, Sam alla fine imparerÃƒÂ  ad accettare il diritto di nascita dei Witwicky, senza piÃƒÂ¹ cercare di sottrarsi alla missione della sua famiglia: Nessun sacrificio, nessuna vittoria!","torrent":{"xt":"urn:btih:634e4bb3949a8c38b1755f070d2841b4d18aecbb","amp;dn":"Transformers.La.Vendetta.Del.Caduto.2009.iTALiAN.BDRip.XviD-TRL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634e4bb3949a8c38b1755f070d2841b4d18aecbb","infoHashBuffer":{"type":"Buffer","data":[99,78,75,179,148,154,140,56,177,117,95,7,13,40,65,180,209,138,236,187]},"announce":[],"urlList":[]}}