{"title":"How to Survive the End of the World as We Know It: Tactics, Tech","uid":7298605,"size":495416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6367fa6692637464d47da02d4212411300db63e1&amp;dn=How+to+Survive+the+End+of+the+World+as+We+Know+It%3A+Tactics%2C+Tech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DaRule762","files":-1,"time":1337966307,"description":"The definitive guide on how to prepare for any crisis--from global financial collapse to a pandemic.\n\nIt would only take one unthinkable event to disrupt our way of life. If there is a terrorist attack, a global pandemic, or sharp currency devaluation--you may be forced to fend for yourself in ways you've never imagined. Where would you get water? How would you communicate with relatives who live in other states? What would you use for fuel?\n\nSurvivalist expert James Wesley, Rawles, author of Patriots and editor of SurvivalBlog.com, shares the essential tools and skills you will need for you family to survive, including:\n\n* Water: Filtration, transport, storage, and treatment options.\n* Food Storage: How much to store, pack-it-yourself methods, storage space and rotation, countering vermin.\n* Fuel and Home Power: Home heating fuels, fuel storage safety, backup generators.\n* Garden, Orchard Trees, and Small Livestock: Gardening basics, non-hybrid seeds, greenhouses; choosing the right livestock.\n* Medical Supplies and Training: Building a first aid kit, minor surgery, chronic health issues. ","torrent":{"xt":"urn:btih:6367fa6692637464d47da02d4212411300db63e1","amp;dn":"How+to+Survive+the+End+of+the+World+as+We+Know+It%3A+Tactics%2C+Tech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6367fa6692637464d47da02d4212411300db63e1","infoHashBuffer":{"type":"Buffer","data":[99,103,250,102,146,99,116,100,212,125,160,45,66,18,65,19,0,219,99,225]},"announce":[],"urlList":[]}}