{"title":"Gothic Arches, Latin Crosses - Anti Catholicism and American Chu","uid":10056493,"size":3728297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:637aad7237055609e554fff0b5f98237382d24dd&amp;dn=Gothic+Arches%2C+Latin+Crosses+-+Anti+Catholicism+and+American+Chu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1398672851,"description":"Ryan K. Smith - Gothic Arches, Latin Crosses: Anti-Catholicism and American Church Designs in the Nineteenth Century\nPublished: 2006-05-29 | ISBN: 0807830259, 0807856894 | PDF | 240 pages | 3 MB\n\n\nCrosses, candles, choir vestments, sanctuary flowers, and stained glass are common church features found in nearly all mainline denominations of American Christianity today. Most Protestant churchgoers would be surprised to learn, however, that at one time these features were viewed as suspicious, foreign implements associated strictly with the Roman Catholic Church. Blending history with the study of material culture, Ryan K. Smith sheds light on the ironic convergence of anti-Catholicism and the Gothic Revival movement in nineteenth-century America.\nSmith finds the source for both movements in the sudden rise of Roman Catholicism after 1820, when it began to grow from a tiny minority into the country's largest single religious body. Its growth triggered a corresponding rise in anti-Catholic activities, as activists representing every major Protestant denomination attacked &quot;popery&quot; through the pulpit, the press, and politics. At the same time, Catholic worship increasingly attracted young, genteel observers around the country. Its art and its tangible access to the sacred meshed well with the era's romanticism and market-based materialism.\nSmith argues that these tensions led Protestant churches to break with tradition and adopt recognizably Latin art. He shows how architectural and artistic features became tools through which Protestants adapted to America's new commercialization while simultaneously defusing the potent Catholic &quot;threat.&quot; The results presented a colorful new religious landscape, but they also illustrated the durability of traditional religious boundaries.","torrent":{"xt":"urn:btih:637aad7237055609e554fff0b5f98237382d24dd","amp;dn":"Gothic+Arches%2C+Latin+Crosses+-+Anti+Catholicism+and+American+Chu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637aad7237055609e554fff0b5f98237382d24dd","infoHashBuffer":{"type":"Buffer","data":[99,122,173,114,55,5,86,9,229,84,255,240,181,249,130,55,56,45,36,221]},"announce":[],"urlList":[]}}