{"title":"&quot;ShakespeaRe-Told&quot; (2005)","uid":4358436,"size":2496798720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63e62a7c77f338b792311d0c57e95ae091a5f977&amp;dn=%5C%22ShakespeaRe-Told%5C%22+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"nastasia1","files":4,"time":1219524042,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1062205/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1062205/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/ShakespeaRe-Told&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/ShakespeaRe-Told&lt;/a&gt;\n\n\nMuch Ado About Nothing\n\n    * Adapted by David Nicholls\n    * Broadcast 7th November 2005\n    * Set in a local news studio, with Beatrice (Sarah Parish) and Benedick (Damian Lewis) as bickering anchors. Hero (Billie Piper), the weathergirl and daughter of station manager Leonard (Martin Jarvis), becomes engaged to Claude (Tom Ellis), the sports presenter. The roles of Don John and Borachio are combined into jealous visual effects manager Don (Derek Riddell), who plots to break up Hero and Claude. Meanwhile the other characters plot to get Beatrice and Benedick together. The ending is highly modified from the original text, with the final wedding being that of Beatrice and Benedick, while a bitter Hero vows never to marry.\n\n\n Macbeth\n\n    * Adapted by Peter Moffat\n    * Broadcast 14 November 2005\n    * Set in a three-star restaurant owned by celebrity chef Duncan Docherty (Vincent Regan), with Joe Macbeth (James McAvoy) as the sous chef and his wife, Ella, (Keeley Hawes) as the maitre d&amp;#039;. Joe and his fellow chef Billy Banquo (Joseph Millson) are annoyed that Duncan takes credit for Joe&amp;#039;s work, and that Duncan&amp;#039;s son Malcolm has, in their opinion, no real flair for the business. Then they encounter three supernatural binmen who predict that Macbeth will get ownership of the restaurant, as will Billy&amp;#039;s children. Joe and Ella are inspired to hire Eastern European hitmen to kill Duncan, but the binmen subsequently warn that Macbeth should be wary of Peter Macduff (Richard Armitage), the head waiter.\n\nMacbeth&amp;#039;s first name may be a reference to the 1955 film Joe Macbeth, which likewise modernised the story, in this case to a Chicago gang-war.\n\n\n The Taming of The Shrew\n\n    * Adapted by Sally Wainwright\n    * Broadcast 21 November 2005\n    * Katherine Minola (Shirley Henderson) is a career politician, who is told her abrasive personality is bad PR and that it might be good for her image to get married. When penniless nobleman Petruchio (Rufus Sewell) shows up, interested at first in Katherine&amp;#039;s money, sparks fly in more senses than one. The relationship and battle of wills brings surprises for both parties. David Mitchell played Kate&amp;#039;s hapless secretary Tim.\n\n\nA Midsummer Night&amp;#039;s Dream\n\n    * Adapted by Peter Bowker\n    * Broadcast 28 November 2005\n    * Theo (Bill Paterson) and Polly (Imelda Staunton) visit Dream Park inclusive leisure facility to celebrate their daughter Hermia&amp;#039;s engagement to James (Theseus and Hippolyta are not Hermia&amp;#039;s parents in the original). The engagement party is, much to the irritable Theo&amp;#039;s horror, disrupted by Hermia&amp;#039;s true love Xander. Despite their own disagreements, the fairy rulers of the woods around Dream Park, Titania (Sharon Small) and Oberon (Lennie James), have a duty to ensure a happy ending, so Oberon gets Puck (Dean Lennox Kelly) (portrayed as a sort of magical wide boy) to try to sort things out with &quot;love juice&quot; eyedrops, while Oberon and Theo discuss their marriages. Puck&amp;#039;s efforts inevitably lead to more confusion. Comedian Johnny Vegas appears as Nick Bottom who, like the other Mechanicals, is a Dream Park security guard who hopes to make it onto the entertainment staff.\n","torrent":{"xt":"urn:btih:63e62a7c77f338b792311d0c57e95ae091a5f977","amp;dn":"%5C%22ShakespeaRe-Told%5C%22+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63e62a7c77f338b792311d0c57e95ae091a5f977","infoHashBuffer":{"type":"Buffer","data":[99,230,42,124,119,243,56,183,146,49,29,12,87,233,90,224,145,165,249,119]},"announce":[],"urlList":[]}}