{"title":"Ch4 Grand Designs Collection 4 10of12 Customised German Kit Hous","uid":8966379,"size":73930625,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:642f31e61dfd812e2e8ed7aca938f7daec73f80e&amp;dn=Ch4+Grand+Designs+Collection+4+10of12+Customised+German+Kit+Hous&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1380228739,"description":"Grand Designs: Collection 4\n\nArts Documentary hosted by Kevin McCloud, published by Channel 4 broadcasted as part of CH4 Grand Designs series in 2004 - English narration\n\n\nInformation\n------------------------------\n\nGrand Designs: Collection 4 \nWould you risk everything to design and build your unique dream home? Join presenter Kevin McCloud in the fourth series of Grand Designs as he meets some truly extraordinary, brave and visionary people as they take the ultimate gamble to create the home of their dreams. All seven episodes from the fourth season of the Channel 4 series presented by Kevin McCloud, which follows people as they undertake the arduous and expensive process of building their own dream home. Houses featured include: a Manhattan loft-style conversion, a 19th century stone house in Edinburgh, a Bauhaus inspired white cube in Hastings, a wooden framed house in Dorset, a modern curved house in Clapham, a German Huf Haus in Walton and a wooden, sea-view house in Glasgow.\n\n\n1)  The Violin Factory \nLouise and Milko Ostendorf wanted to build the home of a lifetime. Milko's job as a well-paid City banker meant they could think big, so Louise set up her own architectural practice and they bought a disused violin factory in the heart of London's Waterloo. The crumbling building was hemmed in on all sides and had no views, but Louise had a vision of a spectacular loft-style home that would combine stunning design with utter luxury.\n\n2)  The Violin Factory: Revisited \nKevin McCloud revisits Louise and Milko Ostendorf who bought a disused violin factory in the heart of London's Waterloo.\n\n3)  19th Century Sandstone House \nWhen Reuben Welch and April Marr came across a ruined 19th-century house amid the tower blocks of Leith, Edinburgh, they saw it as their future home. They had no clear idea of how to restore it, and precious little building experience. Still, they were young and fit (they had met on Reuben's climbing wall) and they liked a challenge. So they bought the crumbling shell and set about transforming it with their own hands.\n\n4)  19th Century Sandstone House: Revisited \nApril Marr and Reuben Welch. Kevin McCloud revisits a thrill-seeking couple who bought a derelict 19th-century stone house in Edinburgh with the aim of restoring it to its former glory. He hopes to discover whether their lack of building experience hindered their ambitious project or if their energy and enthusiasm managed to pull them through.\n\n5)  The Modernist Sugar Cube \nTom Watkins and Darron Copping wanted to build a house that would be home to them, their art collection and their two large dogs. Darron's passion for surfing meant it would also have to be near a beach. They already shared a timber beach house in a hamlet on the Sussex coast, and when a neighbour's bungalow came up for sale, they decided to buy it, demolish it and build a dazzling white modernist house in its place.\n\n6)  An Idiosyncratic Home \nAmid 55 acres of organic farmland in the New Forest, Lizzie Vann and Mike Thrasher set out to build an idiosyncratic home. They wanted a house that would reflect their love of travel and eastern cultures, yet blend into the very English countryside around them. Their first proposal, for a wooden Japanese house, was refused planning permission, but after three years of adapting their ideas with architect David Underhill, they were finally ready to build. Their ingenious design was in three sections: a living wing, a bedroom wing and a romantic tower.\n\n7)  The Curved House \nDavid and Anjana Devoy's tiny coach house was proving too small for them and their two children. So they decided to build a new house in their own garden, which was big by London standards. But this particular grassy plot came with problems. It was overlooked by huge blocks of flats, and in the middle of it stood a chestnut tree they weren't allowed to cut down. They came up with an inspired solution: they would build a curving house along the borders of their plot. What's more, they would do a lot of the work themselves.\n\n8)  The Curved House: Revisited \nKevin calls back to see to catch-up on David and Anjana Devoy's who's tiny coach house was proving too small for them and their two children. So they decided to build a new house in their own garden.\n\n9)  Customised German Kit House \nDavid and Greta Iredale loved their home, a modernist structure in Surrey that they had built themselves almost 40 years ago. It was filled with things they'd chosen over the years - design classics, mementoes, David's paintings. But that house was falling apart and had to come down. Meanwhile, they had lost their hearts to a German post-and-beam house, designed by architect Peter Huf and available as a customised kit (Huf Haus).\n\n10)  Customised German Kit House: Revisited \nKevin McCloud revisits David and Greta Iredale and there German post-and-beam house\n\n11)  The Oak-Framed House \nTony and Jo Moffat, musicians with Scottish Opera, had long dreamed of a home in the countryside. They found a perfect site on the Clyde estuary in Argyll and Bute. Located in a small village on a hillside, it had glorious views as far as the isle of Arran and was less than an hour's drive from Glasgow. Inspired by local oak-framed barns, they gave architect Andy McAvoy an open brief. In return, he gave them a design that fused medieval and modern and promised a beautifully simple interior. However, the construction was anything but simple...\n\n12)  The Oak-Framed House: Revisited \nInspired by local oak-framed barns, they gave architect Andy McAvoy an open brief. In return, he gave them a design that fused medieval and modern and promised a beautifully simple interior. However, the construction was anything but simple...\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img40.imageshack.us/img40/274/zg39.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img40.imageshack.us/img40/274/zg39.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/8738/q0pr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/8738/q0pr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img594.imageshack.us/img594/3162/wbwm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img594.imageshack.us/img594/3162/wbwm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img29.imageshack.us/img29/6731/6tpw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img29.imageshack.us/img29/6731/6tpw.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img708.imageshack.us/img708/2994/kh4s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img708.imageshack.us/img708/2994/kh4s.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img405.imageshack.us/img405/35/iwmu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img405.imageshack.us/img405/35/iwmu.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img560.imageshack.us/img560/8991/c72j.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img560.imageshack.us/img560/8991/c72j.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/9522/qsoc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/9522/qsoc.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img21.imageshack.us/img21/8507/3a7o.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img21.imageshack.us/img21/8507/3a7o.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;450d2c222d0509766b75&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1813 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 49mins\n * Framerate: 25fps\n * Number of Parts: 12\n * Part Size: average 676 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n * Release Notes\n * Merged Subtitles\n * Parts 2,4,8,10 and 12 are very short revisits\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://scrapbook.channel4.com/experts/kevinmccloud&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://scrapbook.channel4.com/experts/kevinmccloud&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:642f31e61dfd812e2e8ed7aca938f7daec73f80e","amp;dn":"Ch4+Grand+Designs+Collection+4+10of12+Customised+German+Kit+Hous","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642f31e61dfd812e2e8ed7aca938f7daec73f80e","infoHashBuffer":{"type":"Buffer","data":[100,47,49,230,29,253,129,46,46,142,215,172,169,56,247,218,236,115,248,14]},"announce":[],"urlList":[]}}