{"title":"Gothic  Complete  Pack  +  Arcania  Gold  Edition","uid":8117727,"size":28696751190,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64324c5ce85ccf5710d449acda8638b1ba844cb6&amp;dn=Gothic++Complete++Pack++%2B++Arcania++Gold++Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"esharoth","files":-1,"time":1360333208,"description":"Title: Gothic Complete Pack + Arcania Gold Edition\nGenre: RPG / fantasy / 3rd-person\nReleased: \n\n- Gothic: 15th December 2001\n- Gothic 2: 13th June 2003\n- Gothic 2 The Night of the Raven: 22nd August 2003\n- Gothic 3: 13th October 2006\n- Gothic 3 Forsaken Gods: 21st November 2008\n- Arcania Gothic 4: 14th October 2010\n- Arcania Fall of Setarrif: 25th October 2011\n\nDeveloper: Piranha Bytes / Spellbound Entertainment\nPublisher: Nordic Games\n\nDescription:\nGothic is a series of role-playing games with action combat, originally created by the German developer Piranha Bytes. The games are set in an unnamed medieval fantasy world, in or around the fictional kingdom of Myrtana.\n\nThe first three Gothic games are united by an overarching storyline. The nameless male hero is initially deported by Rhobar, king of Myrtana, to a prison colony separated from the rest of the world by a magic barrier. The first Gothic describes the hero's struggle in the colony, which ends in his escape. In Gothic 2, the hero travels to the island of Khorinis, trying to avert the advent of a fearsome dragon, and getting involved in a war between humans and orcs. Finally, in Gothic 3, aided by his friends, the hero reaches Myrtana and neighboring countries, where he must find a way to stop the war and discover the plans of the manipulative magician Xardas, who had been his instructor in the first two games. Arcania Gothic 4 is based upon the stories of the previous games, but does not continue it. Taking place a decade later, players take the role of a new hero whose motivation and goal is to destroy the forces who have massacred his loved ones.\n\nThe Gothic games are set in vast 3D environments, which can usually be freely explored. The protagonist is able to jump, climb, swim, and dive. Combat is action-oriented. Experience points are awarded for defeating enemies and completing main and secondary quests. Leveling up grants the player a number of ability points. However, the player must also find NPCs who can train the hero in various categories. The player can then decide into which ability to channel the experience. The protagonist can specialize in close combat, ranged weapons, and magic, but choosing one path does not exclude the others.\n\nConversations with NPCs and missions play a significant role. Typically, the player must perform quests to gain the trust of NPCs and raise the hero's social rank. The player can join some of the factions present in the games. Usually, joining a faction alters some of the subsequent quests, and might also influence the events of the storyline.\n\nHow to play:\nRead the Installation text files provided for each game, found in their respective folders.\n\nIf you like this collection, BUY it!","torrent":{"xt":"urn:btih:64324c5ce85ccf5710d449acda8638b1ba844cb6","amp;dn":"Gothic++Complete++Pack++%2B++Arcania++Gold++Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64324c5ce85ccf5710d449acda8638b1ba844cb6","infoHashBuffer":{"type":"Buffer","data":[100,50,76,92,232,92,207,87,16,212,73,172,218,134,56,177,186,132,76,182]},"announce":[],"urlList":[]}}