{"title":"Build Gamified Websites with PHP and jQuery(EPUB, PDF)","uid":9791292,"size":8973102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6448659a8598dc11cf72e4e34ec549ae85ea6923&amp;dn=Build+Gamified+Websites+with+PHP+and+jQuery%28EPUB%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"xXGalaxyXx","files":-1,"time":1395251315,"description":"2013 | ISBN: 1782168117 | 124 pages | EPUB, PDF | 8,6 MB\n \nGamification involves the process of leveraging the features of real games into real life. A gamified website has the potential to increase user engagement, ROI, and learning. This book will help you build gamified websites with PHP and jQuery by making you understand the gamification design process to implement game mechanics in practical applications.\nGamified websites are very popular amongst Internet users. The gamification of a web content draws users into action to empower them and help them develop new skills. Games engage user attention into the task and each task accomplished will mean the development and enhancement of new skills. This book will help you to apply the essence of games into real word applications such as business and education.\nBuild Gamified Websites with PHP and jQuery aims at empowering and educating the users with an educational gamified website. The book walks through the process of developing a gamified website. Through the course of the book, you will learn gamification development process. The book emphasizes on the application of game mechanics to motivate the user. You will then use the Fogg behaviour model to influence the user behaviour. By the end of the book, you will see yourself building more engaging yet simple websites based on rational principles.","torrent":{"xt":"urn:btih:6448659a8598dc11cf72e4e34ec549ae85ea6923","amp;dn":"Build+Gamified+Websites+with+PHP+and+jQuery%28EPUB%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6448659a8598dc11cf72e4e34ec549ae85ea6923","infoHashBuffer":{"type":"Buffer","data":[100,72,101,154,133,152,220,17,207,114,228,227,78,197,73,174,133,234,105,35]},"announce":[],"urlList":[]}}