{"title":"John Entwistle - Smash Your Head Against The Wall [DELUXE] [320k","uid":6975546,"size":167811560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:648ada433a4bf3df707655fd53c364dbb1ccbe16&amp;dn=John+Entwistle+-+Smash+Your+Head+Against+The+Wall+%5BDELUXE%5D+%5B320k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1327241843,"description":"Smash Your Head Against the Wall is the debut solo album by John Entwistle of The Who, released on Track Records in the UK and Decca Records in the US. Its bizarre cover strangely resembles an Egyptian sarcophagus - but it is in fact Entwistle wearing a death mask while looking through the chest X-ray of a lung cancer patient, a parody of anti-smoking advertisements of the era.\n\nThe album itself offers a more downbeat and aggressive view of life than even the Who had to offer at their most pessimistic, as witnessed in the title track (aka &quot;My Size&quot;), and the closing track, &quot;I Believe in Everything&quot;, which ends with a seemingly impromptu chorus of &quot;Rudolph the Red-Nosed Reindeer&quot;, to end a sometimes uncompromising album on an unexpectedly happy note. The album also features a remake of Entwistle's Who classic &quot;Heaven and Hell&quot; with Who roadie Cyrano Langston providing some acid-drenched guitar.\n\nWhen Entwistle was asked about the song &quot;I Believe In Everything&quot; in comparison to the rest of the album he said:\n\n    I've been saying a lot of stuff that I didn't really believe in. I sort of wrote it for the heads, really, the people thinking, &quot;ah, so that's where Entwistle's brain's at, he really sort of believes in the devil and hell and all that sort of business.&quot; So I wrote a number that touches on reincarnation, then goes into the absurd, with Father Christmas and the whole bit and right at the end just to prevent the heads from thinking that I did believe in everything like I was saying, 'cause they always seem to believe that you actually believe in your own words. I believe in some of them but not all of them, so I just wrote the joke in to throw them off, and it's done it.\n\nWho bandmate Pete Townshend once said about the album, &quot;We learned more about John from him making an album than we did in all the years he'd ever played bass with us&quot;, a reference to both his quiet demeanor and his then-mostly unknown capabilities as a songwriter.\n\nThe demo of the song &quot;It's Hard to Write a Love Song&quot; that is included as a bonus track on the 2005 reissue, would later develop into the song &quot;Drowning&quot; on the 1975 album, Mad Dog.\n\nKeith Moon, Vivian Stanshall and Neil Innes all make guest appearances.\n\nTrack Listing [320k MP3]\n\nAll tracks composed by John Entwistle, except where indicated.\n\n    &quot;My Size&quot;\n    &quot;Pick Me Up (Big Chicken)&quot;\n    &quot;What Are We Doing Here?&quot;\n    &quot;What Kind of People Are They?&quot;\n    &quot;Heaven and Hell&quot;\n    &quot;Ted End&quot;\n    &quot;You're Mine&quot;\n    &quot;No. 29 (External Youth)&quot;\n    &quot;I Believe in Everything&quot;\n\nBonus tracks\n\n    &quot;Cinnamon Girl&quot; (Neil Young) (Previously released out-take)\n    &quot;It's Hard to Write a Love Song&quot; (demo)\n    &quot;The Haunted Can Be Free&quot; (demo)\n    &quot;World Behind My Face&quot; (demo)\n    &quot;My Size&quot; (early take)\n    &quot;What Kind of People Are They?&quot; (demo)\n    &quot;Pick Me Up (Big Chicken)&quot; (demo)\n    &quot;No. 29 (External Youth)&quot; (demo)\n    &quot;Ted End&quot; (demo)\n\n---------------------------------------------------------------------------\n\nPersonnel\n\n    John Entwistle - lead and backing vocals, bass guitar, brass, percussion, piano, keyboards\n    Dave &quot;Cyrano&quot; Langston - electric and acoustic guitar, percussion, backing vocals\n    Jerry Shirley - drums, percussion\n    Keith Moon - percussion, backing vocals\n    Neil Innes - percussion, backing vocals\n\n","torrent":{"xt":"urn:btih:648ada433a4bf3df707655fd53c364dbb1ccbe16","amp;dn":"John+Entwistle+-+Smash+Your+Head+Against+The+Wall+%5BDELUXE%5D+%5B320k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"648ada433a4bf3df707655fd53c364dbb1ccbe16","infoHashBuffer":{"type":"Buffer","data":[100,138,218,67,58,75,243,223,112,118,85,253,83,195,100,219,177,204,190,22]},"announce":[],"urlList":[]}}