{"title":"(PSX-PSP) Tomb Raider 1,2,3 converted properly (Kingdom-games by","uid":4507068,"size":1392510191,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:64cd1fc03fe0a7b3567018d285e1c7fcfa128dec&amp;dn=%28PSX-PSP%29+Tomb+Raider+1%2C2%2C3+converted+properly+%28Kingdom-games+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"toxicjuggalo","files":4,"time":1226631098,"description":"Tomb Raider 1:\n\nClimb, swim, and backflip your way through a maze of cryptic deathtraps so realistic you can practically smell the decaying flesh. Unload an arsenal of lethal firepower on any wild-dog, giant lizard or blood-thirsty mercenary that gets in your way. Your mission is the deadliest one to date -- the recovery of the fabled Scion, an incredible treasure reputed to give its possessor vast power. Get ready to cross the globe to take on impossible odds while exploring Incan ruins, Ancient Rome, Egyptian Pyramids, and the Lost City of Atlantis\n\nTomb Raider 2:\n\nThis exciting TOMB RAIDER sequel will have you swimming, jumping, climbing, backflipping, diving, rolling, and shooting your way across the globe. In this journey, you&amp;#039;ll explore frozen Tibet, exotic China, the beautiful canals of Venice, and an underwater ship. You once again play the sexy but deadly Lara Croft. Investigate dark passages, cryptic ruins, and immense caverns over a variety of levels and expansive continents. Attempt to uncover the frightening mystery of The Dagger of Xian, an ancient artifact that leads you over the Great Wall of China and into the very heart of power itself. Wade into battle with your lethal arsenal of weapons that includes pistols, hefty magnums, powerful shotguns, harpoons, and M-16s. You&amp;#039;ll fight wily henchmen, vicious sharks, Yetis, Warrior Monks, and rabid Dobermans in your dangerous quest of puzzle solving, action, and discovery.\n\nTomb Raider 3:\n\nIn this exciting third installment of the TOMB RAIDER series, you&amp;#039;ll swim, jump, crawl, climb, sprint, dive, roll, and shoot your way across the globe. You&amp;#039;ll explore teeming jungles, London rooftops, the icy wastes of Antarctica and Nevada&amp;#039;s infamous Area 51. Once again you play the role of Lara Croft, who has many new moves, including the monkey swing. You can also drive new vehicles including a kayak, ATV, and a snowmobile. Collect scattered pieces and attempt to uncover the frightening mystery of an ancient meteor, rumored to have amazing life-giving powers. Wade into battle with your lethal arsenal of weapons that includes pistols, hefty magnums, powerful shotguns, and machine guns. Fight swarms of wily henchmen, vicious piranhas, monkeys, and the now infamous T-Rex, in your dangerous quest of puzzle solving, action, and discovery.\n\n\nI will be releasing 4 &amp; 5 1 day after I finish seeding this....KloWn","torrent":{"xt":"urn:btih:64cd1fc03fe0a7b3567018d285e1c7fcfa128dec","amp;dn":"%28PSX-PSP%29+Tomb+Raider+1%2C2%2C3+converted+properly+%28Kingdom-games+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64cd1fc03fe0a7b3567018d285e1c7fcfa128dec","infoHashBuffer":{"type":"Buffer","data":[100,205,31,192,63,224,167,179,86,112,24,210,133,225,199,252,250,18,141,236]},"announce":[],"urlList":[]}}