{"title":"BBC Grow Your Own Drugs Series 2 1of6 Garden Herbs PDTV XviD AC3","uid":7770666,"size":366649344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64e943a1506b549543d8a62c72c7e172902d0cb7&amp;dn=BBC+Grow+Your+Own+Drugs+Series+2+1of6+Garden+Herbs+PDTV+XviD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":1,"time":1351518637,"description":"Grow Your Own Drugs Series 2\n\nHealth-Medical Documentary hosted by James Wong, published by BBC in 2011 - English narration\n\n\n\nInformation\n------------------------------\n\nGrow Your Own Drugs Series 2\nEthnobotanist James Wong returns with another series packed full of inspiring natural remedies for minor everyday ailments, plus a few luxurious beauty treats to make you look and feel wonderful. James wants us to see beyond the ornamental value of familiar plants and appreciate the role they can play in taking care of our health, and offers horticultural tips on the best plant varieties to select and how to grow and harvest them.\n\n\n1)  Garden Herbs \nIn this opening episode, James sets out to reinvent our perception of common and garden herbs. His simple, cheap but highly original recipes include an angelica stomach soother for indigestion, fragrant anti-dandruff hair oil, and an insecticidal wormwood and sage repellent to help banish the pesky clothes moth. Members of the public try James's remedies and are often surprised by the results.\n\n2)  Incredible Edibles \nIn the second episode of ethnobotanist James Wong's series about plant based medicine, he challenges us to look at the medicinal and not just the nutritional value of some of the food we eat. In a fascinating blend of gardening, cookery, science and history, James shows us how to use turmeric to help ease muscular aches and pains, whips up a moisturising body cream from something you would normally have for breakfast, invites two willing members of the public to try his pungent onion gargle for their recurring sore throats, and shows how to grow watercress on your kitchen work top and transform it in to a mouth watering and vitamin packed soup, ideal if you're a bit anaemic.\n\n3)  Exotic Plants \nEthnobotanist James Wong investigates plant-based medicine. Although his natural remedies for everyday minor ailments frequently use plants that we would consider to be exotic, many of these will grow really well in our own back gardens. James shows us how to use lemongrass in an insect repellent spray, transform olive leaves into a pampering face mask, make a soothing burns treatment from aloe vera and chamomile and, perhaps most surprisingly of all, reveals that, not only can you grow tea bushes in this country, you can also turn them into a zingy mouthwash to help fight plaque and freshen breath. Members of the public, in need of help, give his remedies and beauty treatments a go.\n\n4)  Petals \nEthnobotanist James Wong believes plants have more uses than just brightening up a flower border. They contain beneficial properties that could help ease the symptoms of minor everyday health complaints. James focuses on petals, turning chamomile into a luxurious bath milk and honeysuckle and jasmine into soothing jellies for sore throats. Members of the public are impressed by his ear drops made from mullein flowers, while James puts his money where his mouth is and bravely tries out his own rose petal leg waxing treatment. He shows us how to make a chamomile seat and sniffs out the most fragrant rose varieties. His recipes are simple to follow and cheap to make, and might just soothe your symptoms if you're in need of help\n\n5)  Shrubs and Trees \nIn the penultimate episode of his ethnobotanical guide to the medicinal property of plants, James Wong uses trees and shrubs to tackle minor everyday complaints. He shows one shaving rash sufferer how to grow witch hazel and turn it into a cooling gel, and offers three sinusitis sufferers some relief with a fragrant eucalyptus rub that takes just moments to make. He meets expert growers and turns St John's Wort into a skin balm for cuts and wounds, and creates a delicious looking frozen granita from willow bark to help provide pain relief.\n\n6)  Wild Plants \nIt's the end of James Wong's ethnobotanical journey, and he rounds his series off with a look at the plants that have provided a free living pharmacy for thousands of years: wild plants. Taking care to point out the perils of picking in the wild, James travels to Northern Ireland, where he harvests seaweed for a luxurious seaweed body scrub, forages for elderberries and turns them into an anti-viral jam to help ward off colds and flu, and tries to offer hayfever sufferers some relief with his nettle tea. He also seeks out a tiny wild flower called eyebright, and uses it to make a compress to soothe tired and itchy eyes. For the green-fingered, James demonstrates how you can make your own mini wild flower meadow in a tiny back garden, and offers some historical and scientific background to the plants he uses.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1573 kbps\n * Video Resolution: 720 x 416\n * Video Aspect Ratio: (16:9)\n * Frames Per Second: 25\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 128 kb/s AC3 48000 Hz)\n * Audio Streams: 2\n * Audio Languages: English\n * RunTime Per Part: 29.Mins\n * Number Of Parts: 6\n * Part Size: 350 MB\n * Source: PDTV\n * Encoded by Harry65\n * Thanks to llambert\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b00pst7w&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b00pst7w&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Grow%20Your%20Own%20Drugs%20Series%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Grow%20Your%20Own%20Drugs%20Series%201&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:64e943a1506b549543d8a62c72c7e172902d0cb7","amp;dn":"BBC+Grow+Your+Own+Drugs+Series+2+1of6+Garden+Herbs+PDTV+XviD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e943a1506b549543d8a62c72c7e172902d0cb7","infoHashBuffer":{"type":"Buffer","data":[100,233,67,161,80,107,84,149,67,216,166,44,114,199,225,114,144,45,12,183]},"announce":[],"urlList":[]}}