{"title":"Nancy Drew - The Deadly Device","uid":7698420,"size":2444879744,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:655f2960e407b3177c82715fd63338c76bb5c8bc&amp;dn=Nancy+Drew+-+The+Deadly+Device&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Inpuris","files":-1,"time":1349432486,"description":"Fear lingers in a remote laboratory after a physicist's suspicious demise. A police investigation resulted in nothing except a case as cold as the secretive personalities and steel walls that enshroud a top-secret Tesla-inspired facility. That's why the lab owner asked you, as Detective Nancy Drew, to expose the terrifying truth about The Deadly Device!\n\n\n\n\n\nI know I haven't uploaded anything here before, but I used to upload lots of stuff at Demonoid in the Games and Books Section as Inpurisnatura.  Perhaps someone who knows me from there will vouch for me, but if not (for what it's worth) I downloaded this game from Wendy's games in the 3 parts - which took FOREVER (3+ hours) so TPB could have a good copy of it that worked without viruses.  I'm playing it myself now and don't have any screenshots to offer because I just started it.  But I scanned it and it scanned safe.  YOu can find screenshots online, of course, and it seems to be like most of the other Nancy Drew Games so far.\n\nAs always, download at your own risk.\n\nOf course, thanks to Wendy99, whose site I got this from and from the original uploader she thanks on her site.\n\nBest,\nInpuris","torrent":{"xt":"urn:btih:655f2960e407b3177c82715fd63338c76bb5c8bc","amp;dn":"Nancy+Drew+-+The+Deadly+Device","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"655f2960e407b3177c82715fd63338c76bb5c8bc","infoHashBuffer":{"type":"Buffer","data":[101,95,41,96,228,7,179,23,124,130,113,95,214,51,56,199,107,181,200,188]},"announce":[],"urlList":[]}}