{"title":"Nanoscience and Nanoengineering - Advances and Applications (gnv","uid":10726632,"size":34658588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6607ad730f50d877ed06e29f3b92e920bddb0e24&amp;dn=Nanoscience+and+Nanoengineering+-+Advances+and+Applications+%28gnv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1407576464,"description":"Nanoscience and Nanoengineering: Advances and Applications \nby Ajit D. Kelkar, Daniel J.C. Herr and James G. Ryan\nCRC Press | May 2014 | ISBN-10: 1482231190 | True PDF | 331 pages | 33 mb\n\nReflecting the breadth of the field from research to manufacturing, Nanoscience and Nanoengineering: Advances and Applications delivers an in-depth survey of emerging, high-impact nanotechnologies. Written by a multidisciplinary team of scientists and engineers and edited by prestigious faculty of the Joint School of Nanoscience and Nanoengineering, this book focuses on important breakthroughs in nanoelectronics, nanobiology, nanomedicine, nanomodeling, nanolithography, nanofabrication, and nanosafety. This authoritative text:\n\n-  Addresses concerns regarding the use of nanomaterials\n-  Discusses the advantages of nanocomposites versus conventional materials\n-  Explores self-assembly and its potential for nanomanufacturing applications\n-  Covers compound semiconductors and their applications in communications\n-  Considers display technology and infrared optics in relation to nanoelectronics\n-  Explains how computational nanotechnology is critical to the design of process materials and nanobiotechnologies\n-  Describes the design and fabrication of nanoelectromechanical systems (NEMS) and their applications in nanomedicine\n\nBy seamlessly integrating interdisciplinary foundational science with state-of-the-art engineering tools, Nanoscience and Nanoengineering: Advances and Applications offers a holistic approach to understanding the mechanisms underpinning the nanotechnology-based products we enjoy today, as well as those that will change our society in the near future. \n\nAbout the Author\nDr. Ajit D. Kelkar is professor and chair of the Nanoengineering Department at the Joint School of Nanoscience and Nanoengineering. He also serves as associate director for the Center for Advanced Materials and Smart Structures at North Carolina A&amp;T State University and is a member of NIA, ASME, SAMPE, AIAA, ASM, and ASEE.\nDr. Daniel Herr is professor and chair of the Nanoscience Department at the Joint School of Nanoscience and Nanoengineering. Previously he served as director of nanomanufacturing sciences for Semiconductor Research Corporation (SRC). \nDr. James G. Ryan is the founding dean of the Joint School of Nanoscience and Nanoengineering. He previously served as associate vice president of technology and professor of nanoscience for the College of Nanoscale Science and Engineering (CNSE) at the University at Albany.\n\nCONTENTS\nPreface....xi\nEditors.....xv\nContributors....xvii\nChapter 1 Introduction: The Mechanical and Biological Paradigms....1\nSECTION I Nanoelectronics\nChapter 2 Nano-Electro-Mechanical Systems: Processes and Devices.... 13\nChapter 3 A Study of Ga-Assisted Growth of GaAs/GaAsSb Axial Nanowires by Molecular Beam Epitaxy.... 31\nChapter 4 Application of Micro-/Nanotechnology in the Design and Control of Neural Interfaces.... 51\nSECTION II Nanobio\nChapter 5 Characterization of Biological and Condensed Matter at the Nanoscale....69\nChapter 6 Biological Nanostructures of Insect Cuticles: Formation, Function, and Potential Applications....93\nSECTION III Nano Medicine\nChapter 7 Current Nanodelivery Systems for Imaging and Therapeutics....113\nChapter 8 Nanodevices and Systems for Clinical Diagnostics....131\nChapter 9 Fullerenes and Their Potential in Nanomedicine....147\nSECTION IV Nanomodeling\nChapter 10 Modeling at Nano Scale: Material Chemistry Level Modeling in Processing and Mechanics of Engineered Materials....167\nChapter 11 Computational Modeling of Nano-Bio Interfaces....185\nSECTION V Nanolithography and Nanofabrication\nChapter 12 Multiscale Glass Fiber-Reinforced Composite Developed from Epoxy Resin Containing Electrospun Glass Nanofibers....201\nChapter 13 Templated Self-Assembly for Nanolithography and Nanofabrication: Overview and Selected Examples....225\nSECTION VI Nanosafety\nChapter 14 Toward Understanding Toxicity of Engineered Nanomaterials....243\nChapter 15 The Safety of Nanomaterials: What We Know and What We Need to Know....267","torrent":{"xt":"urn:btih:6607ad730f50d877ed06e29f3b92e920bddb0e24","amp;dn":"Nanoscience+and+Nanoengineering+-+Advances+and+Applications+%28gnv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6607ad730f50d877ed06e29f3b92e920bddb0e24","infoHashBuffer":{"type":"Buffer","data":[102,7,173,115,15,80,216,119,237,6,226,159,59,146,233,32,189,219,14,36]},"announce":[],"urlList":[]}}