{"title":"No.1 Ladies' Detective Agency - Audio Drama - MP3 - Slimoo","uid":12240168,"size":842360081,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:663cce78270ab5d56bf88d35835958d6cfed63eb&amp;dn=No.1+Ladies%27+Detective+Agency+-+Audio+Drama+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_Slimoo_","files":20,"time":1439760142,"description":"The No.1 Ladies' Detective Agency - Audio Drama - BBC Radio\n20 x 45 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nThe No. 1 Ladies' Detective Agency is a series of ten novels by British author Alexander McCall Smith.\n\nThe agency is located in Gaborone, capital of Botswana. Its founder is a Motswana woman, Mma Precious Ramotswe, who features as the stories' protagonist and main detective.\n\nThe episodic novels are as much about the adventures and foibles of different characters as they are about solving mysteries. They have been adapted for radio and television.\n\n\n\n\nMma Ramotswe....Claire Benedict\nMma Makutsi....Nadine Marshall\nMr J L B Matekoni....Ben Onwukwe\nMma Potokwani....Janice Acquah\nWritten by Alexander McCall Smith.\n\n\n\nThe No.1 Ladies' Detective Agency - S01 - E01 - The Daddy\nThe No.1 Ladies' Detective Agency - S01 - E02 - The Bone\nThe No.1 Ladies' Detective Agency - S01 - E03 - The Maid\nThe No.1 Ladies' Detective Agency - S01 - E04 - Tears Of The Giraffe\n\nThe No.1 Ladies' Detective Agency - S02 - E01 - The Chief Justice Of Beauty\nThe No.1 Ladies' Detective Agency - S02 - E02 - The Confession\nThe No.1 Ladies' Detective Agency - S02 - E03 - The Kalahar Typing School For Men\nThe No.1 Ladies' Detective Agency - S02 - E04 - The Admirer\n\nThe No.1 Ladies' Detective Agency - S03 - E01 - How To Handle Men Through The Application Of Psychology\nThe No.1 Ladies' Detective Agency - S03 - E02 - House Of Hope\nThe No.1 Ladies' Detective Agency - S03 - E03 - The Return Of Note\nThe No.1 Ladies' Detective Agency - S03 - E04 - The Ceremony\n\nThe No.1 Ladies' Detective Agency - S04 - E01 - There Is No Such Thing As Free Food\nThe No.1 Ladies' Detective Agency - S04 - E02 - The Best Profession For A Blackmailer\nThe No.1 Ladies' Detective Agency - S04 - E03 - A Very Rude Woman\nThe No.1 Ladies' Detective Agency - S04 - E04 - Talking Shoes\n\nThe No.1 Ladies' Detective Agency - S05 - E01 - Tea Time For The Traditionally Built\nThe No.1 Ladies' Detective Agency - S05 - E02 - The Seller Of Beds\n\nThe No.1 Ladies' Detective Agency - S06 - E01 - An Exceptionally Wicked Lady\nThe No.1 Ladies' Detective Agency - S06 - E02 - Canoeing For Ladies\n\nAudio Format : MP3\nDuration Approx : 44mn 00s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits","torrent":{"xt":"urn:btih:663cce78270ab5d56bf88d35835958d6cfed63eb","amp;dn":"No.1+Ladies%27+Detective+Agency+-+Audio+Drama+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663cce78270ab5d56bf88d35835958d6cfed63eb","infoHashBuffer":{"type":"Buffer","data":[102,60,206,120,39,10,181,213,107,248,141,53,131,89,88,214,207,237,99,235]},"announce":[],"urlList":[]}}