{"title":"Unreal Tournament ( UT 99  FULL ONLINE PLAY FREE)","uid":4510939,"size":514297405,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6647f54559b420cb5998d48e233024cbf8ba8534&amp;dn=Unreal+Tournament+%28+UT+99++FULL+ONLINE+PLAY+FREE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"unreal99","files":-1,"time":1226775767,"description":"InstruÃƒÂ§ÃƒÂµes em portugues no final desta pÃƒÂ¡gina !!!\n\n\n##########  THE BEST MULTIPLAYER GAME OF THE ALL TIMES #########\n.\n\n*****************AFTER DOWNLOAD SEED PLEASE *************************\n.\n\nOTHER OPTION TO FAST DOWNLOAD :\n\n.\nINSTALL :\n.\nUse the UT99full/Setup.exe to install and UT99full/utpatch436creative.exe to update.\n.\nPLAY :\n.\nFor play online: start the game -&gt; click multiplayer -&gt; click open location -&gt; use the server in the servers list to play\n.\nFor save server in favorite list -&gt; start the game -&gt; click multiplayer -&gt; find internet location -&gt; favorite -&gt; boton right -&gt; paste a server adress of the server list in the box. The ip are the numbers after two dot and the port are the 4 number after two dot.\n.\nFREE Servers to play online :\n.\nut.brturbo.com:6666\nut.terra.com.br:6666\nut.terra.com.br:7777\n200.155.33.82:7777\n200.155.33.82:7778\nutarena.servegame.com:7777\nutarena.servegame.com:5555\nservers donÃ‚Â´t tested :\n189.19.206.179:7777\n189.19.206.179:6666\nclanarena.servegame.com:6666\nclanarena.servegame.com:7777\nclanarena.servegame.com:7778\ndrawind.ddns.com.br:7777\n.\nOTHERS :\n.\nUT was designed as an arena FPS, with head-to-head multiplayer deathmatches being the primary focus of the game. The game's single-player campaign is essentially a series of arena matches played with bots. For team matches, bots are again used to fill the roles of the player's teammates. Even on dedicated multiplayer servers, bots are sometimes used to pad out teams that are short on players.\n\nUT is known and widely praised for its bot A.I., the product of programmer Steve Polge who had earlier risen to fame by designing the Reaper Bot for Quake, one of the earliest examples of an effective deathmatch bot. The player can choose a bot skill level (anywhere from &quot;Novice&quot; to &quot;Godlike&quot;) or set it to automatically adjust to the player's performance. Bots can be further customized by changing names, appearance, accuracy, weapon preferences, awareness, and so forth. \n\n\n\nO melhor jogo multiplayer de todos os tempos, jogue online gratuitamente!!\nThe Best Multiplayer game !! \n.\nBaixe o jogo via FTP em :\nGet a game in ftp file: \n.\nwww.utarena.com.br -&gt; downloads\nhttp://www.utarena.com.br/downloads/UT99full.zip\n.\nou torrent em :.\nInstale executando o Setup.exe e atualize executando o utpatch436creative.exe\nuse the Setup.exe to install and utpatch436creative.exe to update\n.\n* Para jogar online, abra o jogo -&gt; na guia Multiplayer click em open location -&gt; coloque um dos servidores na lista abaixo.\n.\n*Para sair do full screen click no quadrado ao lado do version no canto superior direito assim fica mais fÃƒÂ¡cil copiar e colar os endereÃƒÂ§os dos servidores.\n.\n* Para salvar um servidor em na lista de favoritos do jogo e nÃƒÂ£o ter de fornecer o IP sempre que for jogar -&gt; abra o jogo -&gt; na guia Multiplayer click em find internet location -&gt;  favorites -&gt; click com o botÃƒÂ£o direito -&gt; new favorite ( o ip sÃƒÂ£o os numeros antes dos dois pontos, a pota os quatro numeros apÃƒÂ³s os dois pontos, marque a opÃƒÂ§ÃƒÂ£o auto-update).\n.\n* Para procurar mais servidores click na guia Multiplayer -&gt; click em find internet location -&gt; selecione uma modalidade de jogo -&gt; pressione F5, aguarde atualizar a lista depois sÃƒÂ³ clicar em um servidor .  \n.\nServidores gratuitos para jogar online :\nServers list :\n.\nut.brturbo.com:6666\nut.terra.com.br:6666\nut.terra.com.br:7777\n200.155.33.82:7777\n200.155.33.82:7778\nutarena.servegame.com:7777\nutarena.servegame.com:5555\n200.199.201.73:6666\n200.177.229.248:7777\n200.177.229.248:6666\n209.190.24.37:7777\n208.71.112.192:7777\n213.19.131.207:7777\n208.167.232.10:7777\n8.9.6.26:7777\nNÃƒÂ£o testados :\n189.19.206.179:7777 \n189.19.206.179:6666 \nclanarena.servegame.com:6666\nclanarena.servegame.com:7777\nclanarena.servegame.com:7778\ndrawind.ddns.com.br:7777\n\n.\n*Jogar contra a mÃƒÂ¡quina :\n\n1Ã‚Âº opÃƒÂ§ÃƒÂ£o - iniciar uma campanha no estilo passar de fase\n\nexecutar o jogo -&gt; clicar na guia game -&gt;start Unreal Tournamet depois sÃƒÂ³ preencher os dados como nome e avanÃƒÂ§ar a 1Ã‚Âª fase &quot;Tutorial&quot; pode ser saltada e inicar o jogo direto no mapa obvision\n\n2Ã‚Âº OpÃƒÂ§ÃƒÂ£o - Jogar um mapa ÃƒÂ  escolha do usuÃƒÂ¡rio :\n\nexecutar o jogo -&gt; clicar na guia game -&gt; start pratice section depois sÃƒÂ³ escolher o mapa e comeÃƒÂ§ar a matanÃƒÂ§a.\n.\n\nMais info em : &lt;a href=&quot;\nhttp://www.orkut.com.br/Main#Community.aspx?cmm=9121&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orkut.com.br/Main#Community.aspx?cmm=9121&lt;/a&gt;\nwww.utarena.com.br\n.\nSobre o jogo :\n.\nUnreal Tournament, abreviadamente UT (TambÃƒÂ©m conhecido como UT99, UT GOTY, UT1 ou UT Classic), ÃƒÂ© um popular jogo de Tiro em primeira pessoa feito pela Epic Games e Digital Extreme. Muito conhecido pela velocidade frenÃƒÂ©tica de sua jogabilidade e pelo seu foco voltado ao Multiplayer, foi lanÃƒÂ§ado para competir com o jogo Quake III Arena feita pela id Software que embora apresentasse grÃƒÂ¡ficos melhores e uma jogabilidade simples, UT tinha uma InteligÃƒÂªncia Artificial superior, um audio mais envolvente, efeitos de fisica muito mais realistas, um segundo tiro alternativo para as armas, alem ser bem mais variado no modo Multiplayer.\n.\nAssim como seu antecessor Unreal existe uma enorme facilidade em modificar o jogo, como ÃƒÂ© o caso dos Mutators, onde vocÃƒÂª pode modificar o tipo de jogo como deixar o jogo sem gravidade ou modificar a arena para deixar usar apenas um tipo de arma e tambÃƒÂ©m o jogador criar o seu proprio tipo de modificaÃƒÂ§ÃƒÂ£o. Alem disso, UT tem muitos tipos de Equipes, ClÃƒÂ£s e Comunidades dos FÃƒÂ£s que deixam o jogo vivo atÃƒÂ© os dias de Hoje.\n.\n\nModalidades de jogo\n.\nUma das principais caracterÃƒÂ­sticas do jogo ÃƒÂ© que alÃƒÂ©m do jogador poder jogar em uma campanha, onde ele terÃƒÂ¡ que derrotar vÃƒÂ¡rios oponentes controlados por computador (bot), cada um com seu nÃƒÂ­vel de AI (InteligÃƒÂªncia artificial), o jogador pode optar por uma partida online ou abrir uma seÃƒÂ§ÃƒÂ£o de treino onde ele poderÃƒÂ¡ jogar em qualquer uma das fases contidas no jogo em qualquer modalidade, podendo ajustar o nÃƒÂ­vel de dificuldade da AI dos bots.\n.\nO jogo conta com as seguintes modalidades:\n.\n* Deathmatch: Todos os jogadores disputam uma batalha mortal um contra o outro, onde sÃƒÂ³ vence quem tiver o maior nÃƒÂºmero de pontos que for escolhida antes do comeÃƒÂ§o do jogo, que sÃƒÂ£o adquiridos quando o jogador mata o outro.\n.\n* Team Deathmatch: Igual ao Deathmatch, porÃƒÂ©m o jogo ÃƒÂ© feito tem times que podem ser divididos em atÃƒÂ© no mÃƒÂ¡ximo 4 times e no minimo 2, tambÃƒÂ©m ÃƒÂ© possÃƒÂ­vel dar ordens para os bots se tiver jogando na seÃƒÂ§ÃƒÂ£o de treino, assim, podendo facilitar o combate.\n.\n* Last Man Standing: Cada jogador comeÃƒÂ§a com um determinado nÃƒÂºmero de vidas, onde ele terÃƒÂ¡ que mantÃƒÂª-las para vencer, se por exemplo o jogador comeÃƒÂ§a com 3 (trÃƒÂªs) pontos de vida e se ele for morto por um adversÃƒÂ¡rio, ele perderÃƒÂ¡ 1 (um) ponto e quando ele chegar ÃƒÂ¡ 0 (zero) pontos ele ÃƒÂ© eliminado; portanto vencerÃƒÂ¡ aquele que eliminar todos os adversÃƒÂ¡rios, sendo o ÃƒÂºnico que sobreviveu durante todo o combate.\n.\n* Capture the Flag (Capturar a bandeira): O modo consiste em que um equipe terÃƒÂ¡ que invadir a base inimiga e roubar sua bandeira, depois terÃƒÂ¡ que levar a mesma atÃƒÂ© a bandeira do seu prÃƒÂ³prio time para marcar 1 (um) ponto. Vence o time que atingir a pontuaÃƒÂ§ÃƒÂ£o mÃƒÂ¡xima estabelecida antes do comeÃƒÂ§o do jogo.\nNota: Se ambos os times estiverem com a bandeira do outro ao mesmo tempo, um dos times terÃƒÂ¡ que recuperar sua bandeira de origem para depois marcar o ponto.\n.\n* Domination: A equipe terÃƒÂ¡ que dominar certos locais espalhados pela fase e defendÃƒÂª-los, quanto mais tempo a equipe mantiver o local, mais ela pontos a equipe ganharÃƒÂ¡. Vence quem atingir uma certa pontuaÃƒÂ§ÃƒÂ£o primeiro.\n.\n* Assault: Uma equipe (vermelha) ataca e a outra (azul) defende um local. A equipe atacante terÃƒÂ¡ que completar vÃƒÂ¡rios objetivos localizados na fase, enquanto a outra equipe terÃƒÂ¡ de evitar que seus adversÃƒÂ¡rios o completem. Depois que os objetivos foram completados ou o tempo acabar, ÃƒÂ© a vez da equipe que estava defendendo atacar completando os objetivos em menos tempo que a outra, acabando assim por conseguir a vitÃƒÂ³ria quem terminar com o menor tempo.","torrent":{"xt":"urn:btih:6647f54559b420cb5998d48e233024cbf8ba8534","amp;dn":"Unreal+Tournament+%28+UT+99++FULL+ONLINE+PLAY+FREE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6647f54559b420cb5998d48e233024cbf8ba8534","infoHashBuffer":{"type":"Buffer","data":[102,71,245,69,89,180,32,203,89,152,212,142,35,48,36,203,248,186,133,52]},"announce":[],"urlList":[]}}