{"title":"M. S. King - The War Against Putin - What the Government-Media C","uid":15899825,"size":2726623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6658eb609ab95de617f341219a475e385f002455&amp;dn=M.+S.+King+-+The+War+Against+Putin+-+What+the+Government-Media+C&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1474996735,"description":"https://cdn.pximg.xyz/538bbc3c4facf38e563895ed67bba141.png\r\n \nhttp://boltimg.com/images/YjnJf.jpg\r\n\r\nM. S. King - The War Against Putin - What the Government-Media Complex Isnt Telling You About Russia - epub [TKRG]\r\n\r\nIn the West, politicians and journalists of all stripes have referred to Russian President Vladimir Putin as a &quot;thug&quot;, a &quot;tyrant&quot;, a &quot;murderer&quot;, a &quot;Communist&quot;, a &quot;Nazi&quot;, the next &quot;Hitler&quot; and more. But amongst the Russian people, his popularity rating has reached levels as high as 85%. There is even a very popular hit 'disco' song about him - 'A Man Like Putin'. So, who's right? Why such hatred for Vladimir Putin? Is it justified? Or has Putin been targeted merely for standing up the US-EU Axis of Internationalism? In clear, simple, powerful and concise language - supported by more than 100 illustrations - 'The War Against Putin' takes readers on an exciting 'crash course' journey from Russia's Medieval founding, through the days of the Czars, through the Communist Revolution and bloody Civil War, through Stalin &amp; World War II, through the Cold War, through the Soviet collapse, through the Yeltsin disaster, and finally the Putin-led rebirth of the Russian nation. It is one of the &quot;greatest stories never told&quot;, and will shed badly needed light on the new Russia, its dynamic leader, the dark forces aiming to bring about its demise, and maybe even World War III. Says Dr. William Carlucci: &quot;I was glued to the edge of my seat with jaw wide open as I read this gem of a book from start to finish, in a single sitting. The clarity and simplicity with which King's masterpiece demystifies current events represents a rare ability to speak to the reader with entertaining and understandable prose. This piece really needs to go viral, and fast. 5 Huge Stars!&quot;","torrent":{"xt":"urn:btih:6658eb609ab95de617f341219a475e385f002455","amp;dn":"M.+S.+King+-+The+War+Against+Putin+-+What+the+Government-Media+C","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6658eb609ab95de617f341219a475e385f002455","infoHashBuffer":{"type":"Buffer","data":[102,88,235,96,154,185,93,230,23,243,65,33,154,71,94,56,95,0,36,85]},"announce":[],"urlList":[]}}