{"title":"Elliott Smith - Either/Or","uid":5536545,"size":222855515,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:66c706e905de1fcd884538c886b4c740d6b4efce&amp;dn=Elliott+Smith+-+Either%2FOr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nmoscar","files":12,"time":1273088155,"description":"Enjoy!\n\nElliott Smith's third album sees his one-man show getting a little more ambitious. While he still plays all the instruments himself, he plays more of them. Several of the songs mimic the melody mastery of pop bands from 1960s. The most alluring numbers, however, are still his quietly melancholy acoustic ones. While the full-band songs are catchy and smart, Smith's recording equipment isn't quite up to the standards set by the Beatles and the Beach Boys. The humbler arrangements are better suited to the sparse equipment. &quot;Between the Bars,&quot; for example, plays Smith's strengths perfectly. He sings, in his endearingly limited whisper, of late-night drinking and introspection, and his subdued strumming creates a minor-key mood befitting the mysteries of self. &quot;Angeles&quot; is equally ethereal -- Smith's acoustic fingerpicking spins out notes which briskly move around a single atmospheric keyboard chord, like aural minnows swimming toward a solitary light at the surface of the water. The lyrics are a darkly biting rejection of the hypercapitalist dream machinery of Los Angeles (it would make a great theme song for Smith's label, Kill Rock Stars). Ironically, &quot;Angeles&quot; was included on the Good Will Hunting soundtrack, which won Smith the acclaim of Hollywood's biggest, brightest, and best connected voting body, the Academy of Motion Picture Arts &amp; Sciences. Smith's stock in L.A. soared after he took his bow at the Oscars with Celine Dion and Trisha Yearwood. It might have been more interesting had he sung &quot;Angeles.&quot; \n\nAll Apple Lossless (ALAC) (average 800kbps)","torrent":{"xt":"urn:btih:66c706e905de1fcd884538c886b4c740d6b4efce","amp;dn":"Elliott+Smith+-+Either%2FOr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66c706e905de1fcd884538c886b4c740d6b4efce","infoHashBuffer":{"type":"Buffer","data":[102,199,6,233,5,222,31,205,136,69,56,200,134,180,199,64,214,180,239,206]},"announce":[],"urlList":[]}}