{"title":"Free-Energy plans","uid":4382490,"size":158043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66cabfc04a4c6ee46dd306170a9bcdcdace31117&amp;dn=Free-Energy+plans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GTRX","files":1,"time":1220730582,"description":"5. Why isn't this technology everywhere if it is so advanced? Just because you dont see something on the news doesn't mean that its not real! Big business and governments dont want most of this technology to be readily available for many reasons. Mostly because it reduces their contol over the masses and the amount of money they make from supressing the truth. Most of us have heard of the stories of the backyard inventer who developed a 100 mile per gallon carburator, only to be bought out and supressed by the oil companies. You see the oil companies have a world monopoly and stand to loose trillions if free energy was common. The truth of the matter is that this technology has come from all over the world and all different sources. Some of it was even discovered by governments. Some of the items we sell are unpredictable, meaning their results vary as according to conditions.\n\n\nFree-Energy Plans\n\nFREE(when you place an order OVER $50.00)\n \nExperiments and Plans\n\n\nSimple Circuit to prove free-energy exists. Also plans to show you how to build a completely solid-state free-energy circuit! Output is over 100% efficient!\n\n\nThis motor consumes no charge\n &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v385/zippiz/Unavngivet-16.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v385/zippiz/Unavngivet-16.jpg&lt;/a&gt;\n\nThis is a simple experiment using a toy motor to demonstrate the principle that charge is not consumed but wasted in conventional electrical circuits. You could actually use just about any type of load even an LED, but some people will argue that the LED would &quot;consume&quot; too little energy.\n\n\nSo here is the setup: C1 &amp; C2 each consist of (4) 10,000 uf electrolytic capacitors hooked in parallel adding up to 40,000 uf EACH. C1 is charged with 12.5 volts C2 got 0 volts. The key point of the experiment is to transfer charge from C1 to C2 through the toy motor. After discharge C1 and C2 are left with 6.25 volts EACH. Joules energy calculations rule a 50% energy loss. This incorporates the claim energy was not equal to charge. If you can't believe that, try it on your own. Theoretically it seems possible to pulse the current of the 6.25 v capacitors through a 1:2 transformer up to 12.5 v. Some people argued that the method of measuring the running time only was not enough since there was no regard to the RPM. I agree on that and repeated the experiment with a 74-gr. weight to be lifted by the motor measuring the distance of lifting. The results were different. You'll find them further down on this page.","torrent":{"xt":"urn:btih:66cabfc04a4c6ee46dd306170a9bcdcdace31117","amp;dn":"Free-Energy+plans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66cabfc04a4c6ee46dd306170a9bcdcdace31117","infoHashBuffer":{"type":"Buffer","data":[102,202,191,192,74,76,110,228,109,211,6,23,10,155,205,205,172,227,17,23]},"announce":[],"urlList":[]}}