{"title":"What Is Relativity - An Intuitive Introduction to Einstein's Ide","uid":9682143,"size":4949526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66ec2c288553c037cab63966211dbe04d1aa9ca1&amp;dn=What+Is+Relativity+-+An+Intuitive+Introduction+to+Einstein%27s+Ide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393682347,"description":"Pages: 224 pages\nPublished: 3 March 2014\nLanguage: English\nISBN-10: 0231167261\nISBN-13: 978-0231167260\nFormat: EPUB\n\n\nWhat Is Relativity? is a well-written and uniquely readable book that beautifully serves as an introduction to special and general relativity. Jeffrey Bennett carefully avoids bombastic statements and 'spectacularization' of the subject, sticking with well-established facts and presenting them in a clear and compelling manner. -- Alberto Nicolis, Columbia University Since it first appeared more than a decade ago, I have used Cosmic Perspectives by Jeffrey Bennett and his colleagues in no small part because of the excellence of its chapters on relativity. It is wonderful to now have a stand-alone volume in which his lucid, explanatory text and figures are coupled with a thoughtful commentary on why relativity is important in constructing our scientific and personal views of space and time. -- David J. Helfand, President, American Astronomical Society, and President and Vice Chancellor, Quest University Canada I have read lots of introductions to relativity, but none is as clear and compelling as this one. For anyone who is keen to grasp the fundamentally simple yet non-intuitive ideas of both special and general relativity, Jeffrey Bennett's book is the way to go. Impressively understandable and interesting. -- Seth Shostak, Senior Astronomer, SETI Institute ...Bennett's fun book shows readers what relativity means, and what it reveals about our universe. Publishers Weekly 12/2/2013 For in its relatively few pages, Bennett explains relativity to ordinary readers... An impressively accessible distillation of epoch-making science. Booklist (starred review) 2/1/2014 A sober, comprehensible account of what every intelligent layman should know about space and time. Kirkus Reviews 1/15/2014","torrent":{"xt":"urn:btih:66ec2c288553c037cab63966211dbe04d1aa9ca1","amp;dn":"What+Is+Relativity+-+An+Intuitive+Introduction+to+Einstein%27s+Ide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ec2c288553c037cab63966211dbe04d1aa9ca1","infoHashBuffer":{"type":"Buffer","data":[102,236,44,40,133,83,192,55,202,182,57,102,33,29,190,4,209,170,156,161]},"announce":[],"urlList":[]}}