{"title":"Listening to Western Music (7th Ed)(gnv64)","uid":9445305,"size":124744111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67231aca0d22f87844d6c41f6c48378ba6ce35f1&amp;dn=Listening+to+Western+Music+%287th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"gnv65","files":-1,"time":1389083499,"description":"Listening to Western Music (7th Ed)\nby Craig Wright\nCengage Learning | January 2013 | ISBN-10: 1133953913 | True PDF | 432 pages | 118 mb &lt;a href=&quot;\nhttp://www.amazon.com/Listening-Western-Music-Introduction-CD/dp/1133953913&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Listening-Western-Music-Introduction-CD/dp/1133953913&lt;/a&gt;\n\nLISTENING TO WESTERN MUSIC is designed to help you develop and refine the listening skills of your students and inspire a lifelong appreciation of music. Author and award-winning scholar-teacher Craig Wright, who has taught Music Appreciation courses for more than 35 years, is consistently praised by reviewers and other professors for his unparalleled accuracy and his clear, direct, conversational style. Throughout the book, Wright connects with today's students by incorporating comparisons between pop and classical music and by using examples from popular artists to illustrate core concepts. This chronological text succinctly covers traditional Western music from medieval to modern, discussing examples from each historical period within their social contexts and the construction of each piece. LISTENING TO WESTERN MUSIC is the only text that provides Craig Wright's own Listening Exercises, in the book and online, which help students focus on important musical elements and episodes. A free CD, packaged with each print copy of the text, includes all of the musical examples for the Part 1 listening exercises. A full set of optional online student resources includes Active Listening Guides, streaming music, an interactive eBook, quizzing, and more--all to challenge your students. All of the music discussed in the text is also available on CD and on Sony Music download cards.\n\nAbout the Author\nCraig M. Wright received his Bachelor of Music degree at the Eastman School of Music in 1966 and his Ph.D. in musicology from Harvard University in 1972. He began his teaching career at the University of Kentucky and for the past 40 years has been teaching at Yale University, where he is currently the Henry L. and Lucy G. Moses Professor of Music. At Yale, Wright's courses include his perennially popular introductory course &quot;Listening to Music,&quot; also part of the offerings of Open Yale Courses, and his selective seminar &quot;Exploring the Nature of Genius.&quot; He is the author of numerous scholarly books and articles on composers ranging from Leoninus to Bach. Wright has also published LISTENING TO MUSIC, CHINESE EDITION (Schirmer Cengage Learning/Three Union Press, 2012), translated and simplified by Profs. Li Xiujung (China Conservatory, Beijing) and Yu Zhigang (Central Conservatory, Beijing), both of whom worked with Wright at Yale; THE ESSENTIAL LISTENING TO MUSIC (Schirmer Cengage Learning, 2012); and MUSIC IN WESTERN CIVILIZATION, MEDIA UPDATE (Schirmer Cengage Learning, 2010), with coauthor Bryan Simms. He is presently at work on a volume entitled MOZART'S BRAIN: EXPLORING THE NATURE OF GENIUS.","torrent":{"xt":"urn:btih:67231aca0d22f87844d6c41f6c48378ba6ce35f1","amp;dn":"Listening+to+Western+Music+%287th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67231aca0d22f87844d6c41f6c48378ba6ce35f1","infoHashBuffer":{"type":"Buffer","data":[103,35,26,202,13,34,248,120,68,214,196,31,108,72,55,139,166,206,53,241]},"announce":[],"urlList":[]}}