{"title":"Ken Burns' America - Frank Lloyd Wright (1998)","uid":4521015,"size":2080699380,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6735c315f3e031b9361b5f0fe7bb6d6832d6d793&amp;dn=Ken+Burns%5C%27+America+-+Frank+Lloyd+Wright+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":6,"time":1227161650,"description":"AVI File Details\n========================================\nName.........: Ken Burns&amp;#039; America - Frank Lloyd Wright I.avi\nFilesize.....: 699 MB (or 715,852 KB or 733,032,448 bytes)\nRuntime......: 01:22:21 (148,083 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1068 kb/s\nAudio Codec..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 110 kb/s (55/ch, stereo) VBR LAME3.97\nFrame Size...: 528x400 (1.32:1) [=33:25] \nThis DVD has no subtitles.\n\nThe review below is a commentary from a contributor at IMDB.com\n\nI think the thing to remember about this documentary is that it&amp;#039;s called &quot;Frank Lloyd Wright,&quot; not &quot;The Buildings of Frank Lloyd Wright.&quot; There are many other resources for those wishing to learn about his designs and the structures he built. (A personal recommendation is the 2002 documentary, &quot;Restoration of Frank Lloyd Wright&amp;#039;s Heurtley House&quot;).\n\nThe format that Ken Burns&amp;#039;s films use is well known by now: pans of many still photographs, informative narration -- often jam-packed with facts but clearly presented and in a generally objective tone. Shifts in time and place are smoothly integrated such that it&amp;#039;s unlikely that an attentive viewer will get lost.\n\nFrank Lloyd Wright died in 1959 at age 91, and there were very few years in his long life that were not without controversy. He broke all kinds of rules with his architectural designs to create some truly remarkable structures -- &quot;Fallingwater,&quot; the Johnson Wax Building in Racine, Wisconsin, the Imperial Hotel in Tokyo and most especially the Guggenheim Museum in New York. They are all examples of his iconoclasm. They and other structures sealed his reputation as the most famous American architect of his or any other generation. But it was the personal scandals, generally involving other men&amp;#039;s wives, that forced him to flee the country on a number of occasions, and put his career in a deep freeze for long spells.\n\nBy his own admission Wright was an absent and negligent father to his many children; he seems to have been serially unfaithful until late middle age, and he was wild and extravagant with money -- particularly other people&amp;#039;s. Clips from a 1958 TV interview with a chain-smoking Mike Wallace are interspersed throughout, and a snippet of it concludes the documentary with Wright proclaiming his immortality. Wright the man seems to have been insufferable, and he seems to have gotten little joy out of life.\n\nYet his doesn&amp;#039;t appear to have been a tortured soul; his personal life may have been absent any harmony, and yet that quality repeatedly found its way into his work. Many of Wright&amp;#039;s buildings are in breathtaking concert with nature. His interior designs, including that of the Unity Temple and almost all of his stained glass, suggest they are the creation of an unfettered and free spirit. Wright may have been such a man, but if so he directed those energies in many of the wrong places. His self-centeredness, arrogance and certainty of his genius hurt a lot of people around him.\n\nIt&amp;#039;s well to ask why anyone wanted to work under him, and yet the waiting list for the scholarship program he operated at his Taliesin West studios in Arizona in the 1930s, 40s and 50s was a mile long. Students of Wright&amp;#039;s were bent to his will; they had to do four hours&amp;#039; manual labor a day, grow their own food, submit to having their love relationships and even some marriages orchestrated by his wife, Olgivanna. The place was run like a boot camp, but the opportunity to work side by side with Wright was enough to keep the applications flowing in. Several graduates of the school are interviewed in the documentary, and for all of them working with Wright seems to have been the seminal experience of their lives -- they don&amp;#039;t recall the hoops they had to jump through and the indignities they signed on for in order to have that privilege.\n\nTo truly love and appreciate the works of Frank Lloyd Wright, it&amp;#039;s almost better if you don&amp;#039;t know too much about their designer. Still, the dichotomy between the man and his sublime creations makes a great story, and this documentary is a largely successful attempt to bridge that gap.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0144937/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0144937/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Frank_Lloyd_Wright&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Frank_Lloyd_Wright&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6735c315f3e031b9361b5f0fe7bb6d6832d6d793","amp;dn":"Ken+Burns%5C%27+America+-+Frank+Lloyd+Wright+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6735c315f3e031b9361b5f0fe7bb6d6832d6d793","infoHashBuffer":{"type":"Buffer","data":[103,53,195,21,243,224,49,185,54,27,95,15,231,187,109,104,50,214,215,147]},"announce":[],"urlList":[]}}