{"title":"X-Art - Marie (The Art of Anal Sex) 720p","uid":10270742,"size":455153911,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:67849db95ed0ec391012be7ec0ae344ebc116b68&amp;dn=X-Art+-+Marie+%28The+Art+of+Anal+Sex%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"9jntm","files":1,"time":1401580756,"description":"X-Art - Marie (The Art of Anal Sex)\n &lt;a href=&quot;\nhttp://hotimages.eu/img-538a4bdf5d1b6.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hotimages.eu/img-538a4bdf5d1b6.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://hotimages.eu/img-538a4c147499b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hotimages.eu/img-538a4c147499b.html&lt;/a&gt;\n\nAnal sex truly is an art form. It takes patience, practice, and love to do it right. \n&quot;Some people are afraid of anal sex because they've never tried it, or they had a bad experience once and never went back.&quot; says Marie, a brunette beauty from Spain. \n21-year-old Marie told us she really enjoys a good ass fucking now and then, and she wanted to share her thoughts on the topic with our members.\n&quot;The key to anal sex is to make sure your girlfriend/wife/lover is TOTALLY turned on, relaxed and ready - before you get started. Once her pussy is dripping wet and she's teetering on the brink of orgasm, you'll both find it more enjoyable.&quot;\n&quot;Next... get your cock nice and wet with her pussy juice, saliva or a water-based lube. Let her get on top, putting her in control and giving you an incredible show!&quot; Marie demonstrated with her lover for our cameras. \n&quot;Start out really slow, like this. Push just the head of your cock inside.&quot; Marie sat down gently on her lover's bulging cock, taking it only a half-inch at a time. \n&quot;Take your time... It's really tight at first. The slower you go, the longer you can savor the experience!&quot; \nGradually Marie slid his entire shaft inside her tight ass. \n&quot;One of the best parts about having a cock buried deep in your ass, is playing with your pussy at the same time.&quot; she said, stroking her clit and spreading her pussy lips apart. \n&quot;When my ass is full, it makes my pussy tighter than ever! Look. I can barely fit one finger inside now. &quot; \nMarie bucked and arched her back as she came, gently rubbing her engorged clit as she banged herself with her fingers. \nHer lover couldn't wait any longer, his cock exploded in a wave of ecstasy as he shot his hot cum deep in her ass. \nThe lovers shared a slow, deep french kiss, as Marie added one final thought. &quot;My deepest and most fulfilling orgasms always happen when my boyfriend fucks my ass while I play with my pussy. The feeling is incredible!&quot;","torrent":{"xt":"urn:btih:67849db95ed0ec391012be7ec0ae344ebc116b68","amp;dn":"X-Art+-+Marie+%28The+Art+of+Anal+Sex%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67849db95ed0ec391012be7ec0ae344ebc116b68","infoHashBuffer":{"type":"Buffer","data":[103,132,157,185,94,208,236,57,16,18,190,126,192,174,52,78,188,17,107,104]},"announce":[],"urlList":[]}}