{"title":"[PornMegaload] Amy Anderssen (If The Bra Fits, Fuck Amys Tits / ","uid":11729910,"size":295433543,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:67e56ea999e84cb9cf4226d3d5e9ebd25bddc865&amp;dn=%5BPornMegaload%5D+Amy+Anderssen+%28If+The+Bra+Fits%2C+Fuck+Amys+Tits+%2F+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"chkm8te","files":1,"time":1425252849,"description":"[PornMegaload] Amy Anderssen (If The Bra Fits, Fuck Amys Tits / 02.27.2015)\n\nAmy Anderssen has gone shopping. And what did Amy shop for? That garment that's revered by all at SCORELAND. Brassieres. They hold the goodies that Amy loves so dear. She loves to shop for them. Dressing her big boobs is very important to Amy.\n\nAmy wants to put on a private bra modeling show for Tony Rubino. He won't need to jack to those Victoria's Secret catalogs anymore. Not after seeing Amy's cleavage concert and getting her to play his skin flute. But first, the warm-up.\n\nAmy's first choice looks too small to cover her giant jugs. &quot;I can make it work,&quot; says Amy. We know she will. The candy-colored pair of boulder holders Amy picks shows lots of undercleavage and doesn't cover all of her big areolae. But ya gotta admit, her tits are thrust forward so far and pushed together, you could rest two cocktails on her boob shelf. Tony finds a place for his face in that tight space.\n\nAmy leaves and returns with two more bras. Tony helps her put on a purple number. Amy knows breasts and brassieres so she instructs him on adjusting the fit. It doesn't pass her test. &quot;There's too much give to this one,&quot; a frowning Amy tells him. She wants to try the third one if Tony will get his mitts of her tits.\n\nAfter putting on bra #3, Amy strikes a pose and asks him what he thinks, then aims her bubble booty in his direction and twerks it. Tony buries his face between her ass cheeks. She twerks her ass again against his package. He can't take anymore.\n\nAmy unbuckles him and engulfs his hard-on between her lips and sucks it hands-free. Her mouth drips with thick saliva strings. Laying on her back, Amy wants Tony's cock between her super-colossal jugs first before her pinkalicious pooswaa is filled and drilled in her favorite positions.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=wua9xemqomrjesxrpy3t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=wua9xemqomrjesxrpy3t.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9sw57wyq0kos5i38kd15.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9sw57wyq0kos5i38kd15.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:67e56ea999e84cb9cf4226d3d5e9ebd25bddc865","amp;dn":"%5BPornMegaload%5D+Amy+Anderssen+%28If+The+Bra+Fits%2C+Fuck+Amys+Tits+%2F+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e56ea999e84cb9cf4226d3d5e9ebd25bddc865","infoHashBuffer":{"type":"Buffer","data":[103,229,110,169,153,232,76,185,207,66,38,211,213,233,235,210,91,221,200,101]},"announce":[],"urlList":[]}}