{"title":"Miles Davis - 1956 - Relaxin' with the Miles Davis Quintet (2003","uid":10679070,"size":798246642,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:681ba55b4568414a96ff524ad9a8f5be4ce243ff&amp;dn=Miles+Davis+-+1956+-+Relaxin%27+with+the+Miles+Davis+Quintet+%282003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eika256","files":-1,"time":1407006660,"description":"Miles Davis - 1956 - Relaxin' with the Miles Davis Quintet (2003)\nSACD rip at 24 bits, 88.2 KHz\n\nRelaxin' features the Miles Davis Quintet in a pair of legendary recording dates -- from May and October of 1956 -- which would generate enough music to produce four separate long-players: Cookin', Relaxin', Workin', and Steamin'. Each of these is considered not only to be among the pinnacle of Davis' work, but of the entire bop subgenre as well. As with the other titles, Relaxin' contains a variety of material which the band had concurrently been performing in their concert appearances. In a brilliant stroke of time conservation, the scheme was hatched for the quintet -- who includes: Davis (trumpet), John Coltrane (tenor sax), Philly Joe Jones (drums), and Red Garland (piano) -- to perform the equivalent of their live repertoire in the studio for eventual release. The results are consistently superior both in terms of song selection as well as performance. The solid nature of the unit as a singular musical force is immediately apparent. &quot;If I Were a Bell&quot; -- from the play Guys and Dolls -- includes some remarkable soloing via Coltrane and Garland. Davis' solos are additionally impressive, as they're derived from the same four-note motive as the melody. Hearing the many variations that he comes up with throughout the song conveys how intrigued Davis must have been by the tune, as it stayed in his performance repertoire for decades. Tracks such as &quot;You're My Everything&quot; and &quot;Oleo&quot; highlight the synchronic nature of Davis and Coltrane as they carry each other's melodies while trading off solos. The steady syncopation of Philly Joe Jones keeps the rhythms tight and the delicate interplay all the more conspicuous. Relaxin' offers something for every degree of jazz enthusiast. Likewise, the quintet's recordings provide a tremendous introduction for the curious jazz consumer. (AllMusic)\n\nTrack list:\n01 - If I Were A Bell\n02 - You're My Everything\n03 - I Could Write A Book\n04 - Oleo\n05 - It Could Happen To You\n06 - Woody'n You\n\nPersonnel:\nMiles Davis - trumpet\nJohn Coltrane - tenor saxophone\nRed Garland - piano\nPaul Chambers - bass\nPhilly Joe Jones - drums\n\nEnjoy and share!","torrent":{"xt":"urn:btih:681ba55b4568414a96ff524ad9a8f5be4ce243ff","amp;dn":"Miles+Davis+-+1956+-+Relaxin%27+with+the+Miles+Davis+Quintet+%282003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681ba55b4568414a96ff524ad9a8f5be4ce243ff","infoHashBuffer":{"type":"Buffer","data":[104,27,165,91,69,104,65,74,150,255,82,74,217,168,245,190,76,226,67,255]},"announce":[],"urlList":[]}}