{"title":"Little Joy - Little Joy (2008) [Lossless/FLAC]","uid":5195749,"size":200497622,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:684a4136d6408d810d17cc0ee9a0ab0f25fab3ce&amp;dn=Little+Joy+-+Little+Joy+%282008%29+%5BLossless%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"cenkota","files":22,"time":1259919219,"description":"Email me if you are looking for an album in Lossless/FLAC (even obscure ones). I'd be willing to send you a link to it if you would share the album on publicbt/thepiratebay after you finish downloading it. My email: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;375452594345585e53440677505a565e5b1954585a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e4c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9c9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;-------\n\nLossless/FLAC\nIncludes: Log/Cue\n\nFrom the Beatles' Ringo Starr and the Rolling Stones' Charlie Watts behind the drums, to bassist Alex James of Blur, it's often the guys at the back, treating the whole music business as some vast, cosmic joke, who seem to be loving every minute of it. Swanning through press conferences, photocalls, and video shoots with an air of amused detachment, dutifully turning up to the studio for a couple of hours work, dating supermodels and movie starlets, and all the while quietly banking royalty checks-- it's a good living.\n\nFabrizio Moretti is a classic case in point. Brilliant name, great hair, stupidly handsome, and what did he even do on those Strokes records? On most of those tracks it sounds like they plugged a fritzy old drum machine through a busted radio. And he still winds up dating Drew Barrymore. Now, just to rub it in, he's casually made the best record involving a Stroke in years.\n\nThe film writer David Thomson once posited the secret genre of movies where nothing really happens. Meet Me in St Louis, where the Smith family almost moves to New York-- but then doesn't. Or Rio Bravo, where there's supposedly some business about a jailbreak or something, but the film is really about Howard Hawks, John Wayne, and Dean Martin sitting around on a Hollywood set wisecracking, flirting with Angie Dickinson, singing the occasional song with Ricky Nelson, and not quite believing their luck that they get paid for this.\n\nI can imagine Little Joy as one of those movies. Here's the storyline: Fab has just split up with his Hollywood royalty squeeze, and while drowning his sorrows at some insanely lucrative half-hour festival appearance in Portugal, winds up knocking back Casa Nobles backstage with a Brazilian named Rodrigo Amarante. Amarante used to be in this band Los Hermanos, which means &quot;The Brothers&quot;-- perfect for an Apatow bromantic comedy. Fab digs Rodrigo's slow sad croon, which floats on a breeze blown all the way from his own childhood back in Brazil. They hatch a plan to hook up some time back in L.A.\n\nSoon enough they catch up again, jamming at Devendra Banhart's pad up in Topanga (possible part for Russell Brand?), and decide to get a place down in Echo Park, work on some songs and see what happens. By now Fab has hooked up with this broad Binki Shapiro-- crazy cute, with a voice like summer wine. The three of them spend their afternoons hanging out a down-at-heel neighborhood bar (it's called Little Joy), mixing their own cocktails, strumming on ukuleles, and singing along to a jukebox stuffed with Brazilian bossa nova, Portuguese fado, Julie London ballads, some early Mazzy Star, one of those Spanish Jonathan Richman albums, and the Velvet Underground's Loaded. And that's it... and it's pretty great.\n\nLittle Joy is not going to stop the world or change your life, but it's one of the sweetest, most listenable, consistently enjoyable records of the season. &quot;No One's Better Sake&quot; mixes things up a little, trying out a soused skank. &quot;Keep Me in Mind&quot; sounds a little like the Strokes if Julian Casablancas mellowed out and better carried a tune. &quot;Unattainable&quot; puts Shapiro's smoky, sleepy-eyed voice center stage. If you were going to download one track, you'd go for &quot;Don't Watch Me Dancing&quot;-- another Shapiro number, it sounds like a standard already, like if Lou Reed gave one of his Mo Tucker tunes to Ann-Margret.\n\nLCD Soundsystem's James Murphy once told me he could imagine in 15 years' time, he might be having a barbecue, and someone would dig out the Strokes' debut from a pile of old CDs and, as the half-forgotten power-pop drifted across the summer lawns, he would realize, &quot;You know what? That was a great little record! A perfect barbecue record!&quot; The modest genius of Little Joy is that now he (or you) doesn't have to wait 15 years.\n\n- Stephen TroussÃƒÆ’Ã‚Â©, November 7, 2008\n\n\n\nAttempting to compile a list of good side-project albums by drummers of successful bands is a task that will have you stumped almost from the beginning. It appears that Strokes drummer Fabrizio Moretti has done the impossible, though, with Little Joy, the band he formed in 2008 with Rodrigo Amarante of the Brazilian band Los Hermanos and Los Angeles singer/songwriter Binki Shapiro. Fab doesn't do the singing, but he wrote (or co-wrote) all the songs and provides a good portion of musical backing for Amarante and Shapiro's restrained vocals. Not only is the result not the embarrassment that some more uncharitable people may have anticipated, but Little Joy is a good -- sometime very good -- album. A laid-back and easy to digest album with no grand statements to absorb or deeper meanings to dig for, it's made up of simple songs recorded simply and sung sweetly. The variety of influences on display (like midtempo Memphis soul, lovers rock, bossa nova, early-'70s singer/songwriters, and sunshiny pop) gives you an idea of the mood the record conjures. The pieces are mixed and matched smoothly and with an ease and peaceful grace, making the record a joy to listen to. The hooky songs with summery grooves (the sweetly romantic &quot;Brand New Start,&quot; &quot;No One's Better Sake&quot;) and the semi-rockers (the kinda Stroke-y &quot;Keep Me in Mind&quot;) are the first to grab you, but the quiet acoustic songs are just as nice. The gentle touch they display on &quot;Unattainable&quot; and &quot;Don't Watch Me Dancing&quot; is far from what you'd expect from the drummer of the Strokes, but it works perfectly for the trio. It's unlikely that this will become Moretti's full-time gig anytime soon, but he's using his downtime to the fullest with Little Joy.\n\n-allmusic\n\n\n1 The Next Time Around\n2 Brand New Start\n3 Play the Part\n4 No One's Better Sake\n5 Unattainable\n6 Shoulder to Shoulder\n7 With Strangers\n8 Keep Me in Mind\n9 How to Hang a Warhol\n10 Don't Watch Me Dancing\n11 Evaporar\n","torrent":{"xt":"urn:btih:684a4136d6408d810d17cc0ee9a0ab0f25fab3ce","amp;dn":"Little+Joy+-+Little+Joy+%282008%29+%5BLossless%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"684a4136d6408d810d17cc0ee9a0ab0f25fab3ce","infoHashBuffer":{"type":"Buffer","data":[104,74,65,54,214,64,141,129,13,23,204,14,233,160,171,15,37,250,179,206]},"announce":[],"urlList":[]}}