{"title":"EXPLOITED COLLEGE GIRLS - Teanna - Her First Hard Fuck *NEW*","uid":9516313,"size":1989424412,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6855c43d96b6f0524d808ddf8913fd608a8d5c74&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Teanna+-+Her+First+Hard+Fuck+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"beta2008x","files":1,"time":1390528847,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=0phz8_tna.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=0phz8_tna.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=uqr8s_ecg_14_01_23_teanna_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=uqr8s_ecg_14_01_23_teanna_.jpg&lt;/a&gt;\n\n\n\nAfter her budding porn career was discovered and outed on social media and then brought to her attention by her high school principal (he's probably a fan, hi dude!) Teanna's senior year has been less than traditional. So, she's not technically a 'college girl' but when you see her perfect body and enthusiastic deep throat skills you'll know why I shot her. In fact, her BJ skills are so amazing you'll see why I got it from as many different camera angles as I could. She's as talented as she is enthusiastic and you can see this in her performance.\n\nI start shooting right away because the story Teanna tells about getting booted out of high school is priceless. When she strips off her clothes and shows off her nearly flawless cheerleader body, you'll know why she caused such a stir at school: she's got a sex doll body and a nympho attitude to match. It's rare that a girl has a body that's a ten, a face that's a ten and then on top of that an attitude that's a ten, but Teanna nails it. She loves to fuck and she loves to do it on camera and it shows.\n\nAs usual, I start with a vibrator and Teanna really likes it. So much so that as she gets more and more turned on and in no time is just begging for me to fuck her. I have to tell you, there is nothing as hot as an 18 year old begging for cock. Before I give it to her, I have her drop to her knees and prove how much she likes giving head. Verdict? She loves it. Before I blow my load in her mouth, I get her up on the bed and drill her to several nice orgasms. When she starts begging for me to cum on her face I can't really hold back much longer and I blow a monster load that coats her face and tits.\n\nYou guys know that I always do my best to find true amateur college girls to exploit every week and Teanna is clearly none of those things, but she's also clearly lava hot and fucks like a fat girl with something to prove. So how could I let a few details stand in my way? I know you'll agree that she was worth bending the rules for.\n","torrent":{"xt":"urn:btih:6855c43d96b6f0524d808ddf8913fd608a8d5c74","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Teanna+-+Her+First+Hard+Fuck+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6855c43d96b6f0524d808ddf8913fd608a8d5c74","infoHashBuffer":{"type":"Buffer","data":[104,85,196,61,150,182,240,82,77,128,141,223,137,19,253,96,138,141,92,116]},"announce":[],"urlList":[]}}