{"title":"Eric B. &amp; Rakim - Studio Album Discogaphy 1987-1992 [FLAC]","uid":9090090,"size":2075580888,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6884c765e82bbdf454601d84b410da3e137ce384&amp;dn=Eric+B.+%26amp%3B+Rakim+-+Studio+Album+Discogaphy+1987-1992+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"rudown78","files":144,"time":1382577329,"description":"Eric B. &amp; Rakim - Studio Album Discography 1987-1992 [FLAC]\n\n\nThey never had a mainstream hit of their own, but during rap's so-called golden age in the late '80s, Eric B. &amp; Rakim were almost universally recognized as the premier DJ/MC team in all of hip-hop. Not only was their chemistry superb, but individually, each represented the absolute state of the art in their respective skills. Eric B. was a hugely influential DJ and beatmaker whose taste for hard-hitting James Brown samples touched off a stampede through the Godfather of Soul's back catalog that continues up to the present day. Rakim, meanwhile, still tops fan polls as the greatest MC of all time. He crafted his rhymes like poetry, filling his lines with elaborate metaphors and complex internal rhymes, and he played with the beat like a jazzman, earning a reputation as the smoothest-flowing MC ever to pick up a mic. His articulation was clear, his delivery seemingly effortless, and his influence on subsequent MCs incalculable. Together, their peerless technique on the microphone and turntables upped the ante for all who followed them, and their advancement of hip-hop as an art form has been acknowledged by everyone from Gang Starr to the Wu-Tang Clan to Eminem. While certain elements of their sound might come off as slightly dated today, it's also immediately clear how much of a hand Eric B. &amp; Rakim had in leading hip-hop into the modern age.\n\nEric B. was born Eric Barrier in 1965 in Elmhurst, Queens; his future partner, William Griffin, Jr., was born in 1968 and also hailed from the suburbs of New York, specifically Wyandanch, Long Island. At age 16, Griffin converted to Islam and adopted the name Rakim Allah. Barrier played trumpet and guitar early on, but switched to the turntables in high school, and eventually landed a job as the mobile DJ for radio station WBLS. It was there that he met Rakim, and the two officially formed a partnership in 1985. Their first single -- &quot;Eric B. Is President&quot; (an ode to Barrier's DJ skills) b/w &quot;My Melody&quot; -- was released on the tiny Harlem-based indie label Zakia. It was a street-level sensation during the summer of 1986, and the duo was picked up by the larger 4th &amp; Broadway imprint. The equally monumental singles &quot;I Ain't No Joke&quot; and &quot;I Know You Got Soul&quot; sampled James Brown and his cohort Bobby Byrd, respectively, and their utter funkiness began to revolutionize the sound of hip-hop. Moreover, Rakim's line &quot;pump up the volume&quot; on the latter track was in turn sampled itself, becoming the basis for M/A/R/R/S' hit of the same name.\n\nIn 1987, 4th &amp; Broadway issued the duo's full-length debut, Paid in Full; accompanied by a mighty underground buzz, the record climbed into the Top Ten on the R&amp;B LP charts (as would all of their subsequent albums). Additionally, the British DJ duo Coldcut remixed the title cut into a bona fide U.K. smash. The exposure helped make &quot;Paid in Full&quot;'s drum track one of the most sampled beats this side of James Brown's &quot;Funky Drummer&quot;; it provided the foundation for Milli Vanilli's &quot;Girl You Know It's True,&quot; among many other, more credible hits. On the heels of Paid in Full, Eric B. &amp; Rakim signed with MCA subsidiary Uni and consolidated their reputation with another landmark hip-hop album, 1988's Follow the Leader. The title cut took its place among the classic singles already in their canon, and Jody Watley soon tapped the duo for a guest spot on her 1989 single &quot;Friends,&quot; which brought them into the pop Top Ten for the first and only time.\n\nThe 1990 follow-up Let the Rhythm Hit 'Em proved relatively disappointing from a creative standpoint, although 1992's slightly jazzier Don't Sweat the Technique was a more consistent affair that bolstered their legacy. As it turned out, the record also completed that legacy. The duo's contract with MCA was almost up, and they had discussed the possibility of each recording a solo album. Unfortunately, the resulting tension over the future of their partnership ultimately destroyed it. In the aftermath of the breakup, various legal issues prevented both parties from starting their solo careers for quite some time. The only recording to appear was Rakim's first solo cut, &quot;Heat It Up,&quot; which was featured on the soundtrack of the 1993 film Gunmen. Finally, in 1995, Eric B. issued his self-titled solo debut on his own 95th Street label. Rakim, meanwhile, signed with Universal and delivered a pair of acclaimed comeback albums, 1997's The 18th Letter and 1999's The Master.\n\n\n1987 - Paid in Full [2009 Remaster]\n1988 - Follow the Leader\n1990 - Let the Rhythm Hit 'Em\n1992 - Don't Sweat the Technique\n\nPlus special a bonus: Rakim - The 18th Letter/The Book of Life [1997]\n\nAlbum artwork, rip logs and audiochecker logs are included. Enjoy!!!!!!!!!!!! ","torrent":{"xt":"urn:btih:6884c765e82bbdf454601d84b410da3e137ce384","amp;dn":"Eric+B.+%26amp%3B+Rakim+-+Studio+Album+Discogaphy+1987-1992+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6884c765e82bbdf454601d84b410da3e137ce384","infoHashBuffer":{"type":"Buffer","data":[104,132,199,101,232,43,189,244,84,96,29,132,180,16,218,62,19,124,227,132]},"announce":[],"urlList":[]}}