{"title":"[Ebook-Ita-Pdf-Avventura]Marco Buticchi - L'anello dei Re[sur","uid":5138229,"size":1557421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:688578a02c51986cde04f37272268a32a803eef6&amp;dn=%5BEbook-Ita-Pdf-Avventura%5DMarco+Buticchi+-+L%5C%27anello+dei+Re%5Bsur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mitimex","files":1,"time":1256673640,"description":"\n\nNew York, 2002. Italia, 1915. Venezia, 1348. Sinai, 1967. \nQuattro scenari, quattro momenti cruciali della storia mondiale e un unico, misterioso gioiello che passa di mano in mano, di generazione in generazione intrecciando la sua storia con quella di principi romeni, gloriosi guerrieri arabi, terroristi, ufficiali della prima guerra mondiale, piloti dell'esercito israeliano.\nUna serie di attentati sanguinosi sta sterminando il terrore in oni parte del mondo, ma i vertici delle agenzie di intelligence brancolano nel buio. Undici indizi i folli comunicati di un serial bomber, che  preannuncia i massacri a mezzo di messaggi tortuosi fra le righe del Corano, agghiaccianti promesse di morte siglate dall'arcano simbolo di un anello leggendario. Un anello che incatena avvenimenti lontanissimi nel tempo, drammaticamente legati al suo infausto luccichio: Venezia ed il Mediterraneo del Trecento, teatro di una sfida cruenta fra un misterioso ragazzo dagli occhi color del mare, discendente di un leggendario pirata, e un perfido ricco mercante; il fosco scenario della Grande Guerra sulle Dolomiti italiane, dove fiorisce un'amicizia straordinaria che condurrÃƒÂ  un ufficiale italiano ed un nobile rumeno in viaggio nelle terre di Dracula, e poi nell'America sospesa fra le ombre della Depressione e le luci di Holliwood; la Romania di Ceausescu, dove, fra le tenebre della dittatura, si celano le chiavi di un ulteriore, tragico enigma. Difficile ereditÃƒÂ  per chi, trent'anni dopo, sarÃƒÂ  chiamato a tentare di sciogiere questi nodi fatali: Oswald Breil, ex primo ministro israeliano, sempre affiancato da donne bellissime quanto intelligenti, dovrÃƒÂ   affrontare i fantasmi del proprio passato per fronteggiare la minacci che incombe sul futuro del pianeta, oltre che sulla sua stessa vita.\n","torrent":{"xt":"urn:btih:688578a02c51986cde04f37272268a32a803eef6","amp;dn":"%5BEbook-Ita-Pdf-Avventura%5DMarco+Buticchi+-+L%5C%27anello+dei+Re%5Bsur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"688578a02c51986cde04f37272268a32a803eef6","infoHashBuffer":{"type":"Buffer","data":[104,133,120,160,44,81,152,108,222,4,243,114,114,38,138,50,168,3,238,246]},"announce":[],"urlList":[]}}