{"title":"The Last Poets - Niggers are Scared of Revolution &amp; other songs","uid":4275218,"size":29668721,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:68bac09578a12556ac1c922e3a50f440c8075683&amp;dn=The+Last+Poets+-+Niggers+are+Scared+of+Revolution+%26+other+songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rovhal_knullare","files":-1,"time":1215150893,"description":"** The Last Poets **\n** Wake Up, Niggers ** &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Last_Poets_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Last_Poets_(album)&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Last_Poets&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Last_Poets&lt;/a&gt;\n\n\nGenre: Spoken Word, Jazz, Poetry\n\nThe Last Poets is a group of poets and musicians who arose from the late 1960s African American civil rights movement's black nationalist thread. Their name is taken from a poem by the South African revolutionary poet Keorapetse Kgositsile, who believed he was in the last era of poetry before guns would take over.\n\nThe original Last Poets formed on May 19, 1968 (Malcolm X's birthday), at Marcus Garvey Park (formerly Mount Morris Park, at 124th Street and Fifth Avenue) in the East Harlem neighborhood of New York City. The original members were Felipe Luciano, Gylan Kain, and David Nelson.\n\nThe group continued to evolve via a 1969 Harlem writers' workshop known as East Wind. Jalal Mansur Nuriddin, Umar Bin Hassan, and Abiodun Oyewole, along with percussionist Nilaja, are generally considered the primary and core members of the group, as they appeared on the group's 1970 self-titled debut (contracted by noted Jimi Hendrix producer Alan Douglas) and, in various combinations, on subsequent releases. Luciano, Kain, and Nelson recorded separately as -The Original Last Poets,- gaining some renown as the soundtrack artists for the 1971 film -Right On!-. See also Performance (1970 film) soundtrack: song -Wake Up Niggers.-\n\nThe Last Poets have been cited as one of the earliest influences on what would become hip-hop music - critic Jason Ankeny writes - With their politically charged raps, taut rhythms, and dedication to raising African-American consciousness, the Last Poets almost single-handedly laid the groundwork for the emergence of hip-hop\n\nMore recently The Last Poets found their fame again refreshed through a collaboration with rap artist Common on the Kanye West produced song The Corner, as well as with the Wu-Tang Clan - affiliated political rap group Black Market Militia on the song The Final Call. They are also featured on the controversial Nas album Untitled, on the song You Can't Stop Us Now.\n\nJalal Mansur Nuriddin aka Lightning Rod -The Hustlers Convention 1972- recently collaborated with UK-based poet Mark T Watson -aka Malik Al Nasir- writing the foreword to Mark's debut poetry collection Ordinary Guy published in December 2004 by Liverpool based publisher Fore-Word Press Ltd link title. Jalal's foreword was written in rhyme and has now been recorded for release in 2008 in a collaborative album by Mark T Watson's band Malik and The OG's featuring Gil Scott-Heron, percussionist Larry Mc Donald, drummers Rod Youngs and Swiss Chris, New York Dub poet Ras Tesfa and a host of young rappers from New York and Washington DC. Produced by Malik Al Nasir, Lloyd Masset Larry McDonald and Swiss Chris the albums Rhythms of the Diaspora; Vol. 1 and 2 are the 1st albums of their kind to unite these pioneers of poetry and RAP with each other, as well as the youth of this Rap generation.\n\nList of Files:\n\n01 The Last Poets - Run, Nigger.mp3\n02 The Last Poets - On the Subway.mp3\n03 The Last Poets - Niggers Are Scared of Revolution.mp3\n04 The Last Poets - Black Thighs.mp3\n05 The Last Poets - Gashman.mp3\n06 The Last Poets - Wake Up, Niggers.mp3\n07 The Last Poets - New York, New York.mp3\n08 The Last Poets - Jones Comin' Down.mp3\n09 The Last Poets - Just Because.mp3\n10 The Last Poets - Black Wish.mp3\n11 The Last Poets - When The Revolution Comes.mp3\n12 The Last Poets - Two Little Boys.mp3\n13 The Last Poets - Surprises.mp3\nAbiodun Oyewole.jpg\nfilelist.txt\nThe Last Poets.jpg\n\n              16 File(s)     29,664,704 bytes\n               \nIf you don't seed you better watch out.\n &lt;a href=&quot;\nhttp://www.thepiratebay.se/user/rovhal_knullare&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thepiratebay.se/user/rovhal_knullare&lt;/a&gt;","torrent":{"xt":"urn:btih:68bac09578a12556ac1c922e3a50f440c8075683","amp;dn":"The+Last+Poets+-+Niggers+are+Scared+of+Revolution+%26+other+songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68bac09578a12556ac1c922e3a50f440c8075683","infoHashBuffer":{"type":"Buffer","data":[104,186,192,149,120,161,37,86,172,28,146,46,58,80,244,64,200,7,86,131]},"announce":[],"urlList":[]}}