{"title":"Dizzy Gillespie All-Star Big Band - 2005 - Dizzy's Business FLAC","uid":10384429,"size":454785686,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:69598715d1d11ace847f38c2c2988c1824dfd3e5&amp;dn=Dizzy+Gillespie+All-Star+Big+Band+-+2005+-+Dizzy%27s+Business+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"eika256","files":-1,"time":1403121318,"description":"Dizzy Gillespie All-Star Big Band - 2005 - Dizzy's Business\n\nThe Dizzy Gillespie All-Star Big Band's Dizzy's Business continues where 2002's Things to Come (credited to the Dizzy Gillespie Alumni All-Stars) left off. Gone is the fabulous trumpeter Jon Faddis, who also led that aggregation, but many of the other key players return, among them tenor saxman Jimmy Heath, baritone saxman Gary Smulyan, alto saxmen/flutists Antonio Hart and Frank Wess, trombonists Jay Ashby and Douglas Purviance, trumpeters Greg Gisbert and Claudio Roditi, guitarist Marty Ashby, drummer Dennis Mackrel, and bassist John Lee (who co-produced with the Ashbys). This time around, the all-star cast boasts even greater star power, however, with the additions of James Moody on tenor sax, flute and vocals, Randy Brecker on trumpet, and Mulgrew Miller playing piano. Trombonist Slide Hampton, who also performed on Things to Come, returns here as bandleader, trumpet hotshot Roy Hargrove appears as a guest soloist, and Italian vocalist Roberta Gambarini adds her deliciously sweet tones, scatting dizzily with Hargrove on Gillespie's steaming &quot;Blue 'N Boogie&quot; and turning in a sensitive, moody lead on the classic &quot;Stardust.&quot; Not surprisingly, there's a lot of world-class blowing going on here, both in an ensemble format and in the solos. Miller does Thelonious Monk proud on the album-closing &quot;Off Minor&quot; and &quot;I Mean You&quot; (which Monk co-penned with Coleman Hawkins). Brecker shines on Gillespie's &quot;Tour de Force&quot; and the opening title track, and Hargrove proves himself up to the task of playing in the Gillespie vets' company with his solo turn on the classic &quot;Hot House.&quot; The updated arrangements fashioned by Mackrel and Hampton remain faithful to Gillespie's vision without becoming trapped in retro-ville. Recorded live in Pittsburgh in 2005, Dizzy's Business accomplishes what it sets out to do: pay tribute to the master and nudge him into the future. (AllMusic)\n\n01 - Dizzy's Business\n02 - Con Alma\n03 - Blue 'N' Boogie\n04 - I Mean You\n05 - Without You - No Me (To Dizzy)\n06 - Hot House\n07 - Stardust\n08 - Tour De Force\n09 - Moody's Groove\n10 - Morning Of The Carnival\n11 - Off Minor\n\nPersonnel: \nSlide Hampton: director, arranger, trombone; \nFrank Greene, Greg Gisbert, Randy Brecker: trumpet; \nClaudio Roditi: trumpet, percussion; \nFrank Wess, Antonio Hart: alto sax, flute; \nJimmy Heath: tenor sax; \nJames Moody: tenor sax, flute, vocals; \nGary Smulyan: baritone sax; \nJason Jackson, Steve Davis: trombone; \nJay Ashby: trombone, percussion; \nDouglas Purviance: bass trombone; \nMulgrew Miller: piano; \nMarty Ashby: guitars; \nJohn Lee: bass; \nDennis Mackrel: drums; \nRoberta Gambarini: vocals. \nSpecial guest artist: Roy Hargrove: trumpet (3,6).\n\nEnjoy and share!","torrent":{"xt":"urn:btih:69598715d1d11ace847f38c2c2988c1824dfd3e5","amp;dn":"Dizzy+Gillespie+All-Star+Big+Band+-+2005+-+Dizzy%27s+Business+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69598715d1d11ace847f38c2c2988c1824dfd3e5","infoHashBuffer":{"type":"Buffer","data":[105,89,135,21,209,209,26,206,132,127,56,194,194,152,140,24,36,223,211,229]},"announce":[],"urlList":[]}}