{"title":"Thomas Walter Laqueur - Making Sex. Body and Gender from the Gre","uid":10317113,"size":9344987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6996c3b54dffaba06f31e32803f82bf1a0fc7568&amp;dn=Thomas+Walter+Laqueur+-+Making+Sex.+Body+and+Gender+from+the+Gre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Anette14","files":-1,"time":1402262119,"description":"Description\nProduct Details\nBook Title: Making Sex: Body and Gender from the Greeks to Freud\t\nBook Author: Thomas Laqueur\nPaperback: 336 pages\nPublisher: Harvard University Press; Reprint edition (March 2, 1992)\nLanguage: English\nISBN-10: 0674543556\nISBN-13: 978-0674543553\n\n===================================================================================\nBook Description\nRelease date: March 2, 1992 | ISBN-10: 0674543556 | ISBN-13: 978-0674543553 | Edition: Reprint\nThis is a book about the making and unmaking of sex over the centuries. It tells the astonishing story of sex in the West from the ancients to the moderns in a precise account of developments in reproductive anatomy and physiology. We cannot fail to recognize the players in Thomas Laqueur's story--the human sexual organs and pleasures, food, blood, semen, egg, sperm--but we will be amazed at the plots into which they have been woven by scientists, political activists, literary figures, and theorists of every stripe.\nLaqueur begins with the question of why, in the late eighteenth century, woman's orgasm came to be regarded as irrelevant to conception, and he then proceeds to retrace the dramatic changes in Western views of sexual characteristics over two millennia. Along the way, two &quot;masterplots&quot; emerge. In the one-sex story, woman is an imperfect version of man, and her anatomy and physiology are construed accordingly: the vagina is seen as an interior penis, the womb as a scrotum, the ovaries as testicles. The body is thus a representation, not the foundation, of social gender. The second plot tends to dominate post-Enlightenment thinking while the one-sex model is firmly rooted in classical learning. The two-sex story says that the body determines gender differences, that woman is the opposite of man with incommensurably different organs, functions, and feelings. The two plots overlap; neither ever holds a monopoly. Science may establish many new facts, but even so, Laqueur argues, science was only providing a new way of speaking, a rhetoric and not a key to female liberation or to social progress. Making Sex ends with Freud, who denied the neurological evidence to insist that, as a girl becomes a woman, the locus of her sexual pleasure shifts from the clitoris to the vagina; she becomes what culture demands despite, not because of, the body. Turning Freud's famous dictum around, Laqueur posits that destiny is anatomy. Sex, in other words, is an artifice.\nThis is a powerful story, written with verve and a keen sense of telling detail (be it technically rigorous or scabrously fanciful). Making Sex will stimulate thought, whether argument or surprised agreement, in a wide range of readers.\n\n===================================================================================\nReviews\n[Making Sex is] a brilliant documentation of difference between the one-sex and two-sex models...presenting a simple theme with broad and cascading implications...I didn't need Laqueur to teach me that sex was interesting, but now I have a broader base for this greatest of certainties. (Stephen Jay Gould New York Review of Books)\n\n[Laqueur] gives us an excellent sense of how our predecessors, including physicians and scientists, thought about the anatomy that fascinates every schoolchild...No one can doubt, after reading this book, that our notions of masculinity or femininity have been imposed on what are supposed to be objective biological observations. (Melvin Konner New York Times Book Review)\n\n[In this] challenging analysis of our ideas on gender...Laqueur shows how radically our consciousness of ourselves, our bodies, our sex has changed over the centuries. The categories we think of as most basic turn out to be mutable...And in this transformation, Laqueur emphasises, social changes were as crucial as medical teachings. (Roy Porter The Independent)\n===================================================================================","torrent":{"xt":"urn:btih:6996c3b54dffaba06f31e32803f82bf1a0fc7568","amp;dn":"Thomas+Walter+Laqueur+-+Making+Sex.+Body+and+Gender+from+the+Gre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6996c3b54dffaba06f31e32803f82bf1a0fc7568","infoHashBuffer":{"type":"Buffer","data":[105,150,195,181,77,255,171,160,111,49,227,40,3,248,43,241,160,252,117,104]},"announce":[],"urlList":[]}}