{"title":"Son Lux - Discography (2008-2013) [FLAC]","uid":9081612,"size":745891225,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a1285b8014d6572c957b012407c0241185356f3&amp;dn=Son+Lux+-+Discography+%282008-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"politux","files":-1,"time":1382394431,"description":"\n  Son Lux - Discography (2008-2013) [FLAC]\n\n  Genre: Electronic\n  Styles: Experimental, Indie, Post-Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2008 At War with Walls &amp; Mazes \n  2011 We Are Rising\n  2013 Lanterns \n\n  The youngest of three children, Ryan Lott spent much of his childhood moving from place to place. Born in Colorado in 1979, Lott lived in California and Connecticut before landing in Atlanta for high school. He had been playing classical piano since age six; he also played the guitar; and in Georgia he picked up the drums and began learning pop and jazz piano as well. While studying composition and piano at Indiana University, Lott first explored writing for dance choreography, something that he continued not only after graduation when he was living in Cleveland, where, as the recipient of an arts grant, he was able to spend time working on his own music and its interaction with other media, but also after he moved to New York City in 2007 for a job as a composer at an ad agency, where he continued his collaborations with the Gina Gibney Dance Company, an all-female modern dance group.\n\n  During this same time Lott also decided to pursue his solo work, using tiny samples and his own voice to make ethereal, nocturnal music that drew both from hip-hop rhythms and experimental rock and electronica arrangements, and decided to call himself Son Lux. He won a songwriting competition that gave him the opportunity to perform (for the first time under his new moniker) at the Festival of Faith &amp; Music in Grand Rapids, MI, opening for artists like Emmylou Harris and Sufjan Stevens, and soon was playing in New York City and remixing songs by artists like Beirut and Castanets. Signed to anticon, Son Lux released his debut album, At War with Walls and Mazes, in March of 2008. For his second album, Lott had to completely upend his normally slow and careful creative process after being invited to patrticipate in the 2011 RPM Challenge, in which musicians attempt to completely write and record an album in the month of February. This was a major change for him, as Walls and Mazes took four years to create, but Lott stepped up to the challenge, releasing We Are Rising in 2011.","torrent":{"xt":"urn:btih:6a1285b8014d6572c957b012407c0241185356f3","amp;dn":"Son+Lux+-+Discography+%282008-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a1285b8014d6572c957b012407c0241185356f3","infoHashBuffer":{"type":"Buffer","data":[106,18,133,184,1,77,101,114,201,87,176,18,64,124,2,65,24,83,86,243]},"announce":[],"urlList":[]}}