{"title":"Gino Vannelli - Black Cars 1984 [FLAC] - Kitlope","uid":6785288,"size":231822512,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a44711ba015db0b3cc48d045b9ad14d12c63d96&amp;dn=Gino+Vannelli+-+Black+Cars+1984+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kitlope","files":13,"time":1320019929,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 6A44711BA015DB0B3CC48D045B9AD14D12C63D96\nFile Size: 221.08 MB\nYear: 1984\nLabel: Polydor Records\nCatalog #: 825 108-2\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\nFrom Wiki:\n\nGino Vannelli (born June 16, 1952) is an Italian-Canadian singer, songwriter, musician and composer.\n\nBorn in Montreal, Quebec, Vannelli is one of three sons (Joe, Gino, and Ross)[1] born to Russ and Delia Vannelli. Russ, his father, was a big band musician. As a child, Gino's greatest passion was music, and he began playing percussion at an early age. By the age of 15, Gino began writing songs. Just out of high school, he signed his first recording contract with RCA under the pseudonym Vann Elli, but went on to study music at McGill University.\n\nAfter a stint in New York City, Vannelli and his brothers went to Los Angeles, California in a financially distraught and desperate state to wait outside trumpeter Herb Alpert's locked gate for an audition. Alpert was Gino's last hope prior to heading back to Montreal the next day. Alpert liked what he heard and two days later signed Gino with his A&amp;M Records, releasing his first album in 1973. Gino's brother, Joe, served as arranger and keyboardist for most of his recording career. At a time when polyphonic synthesizers were non-existent, Joe overdubbed multiple parts to create a texture of sound that was progressive for the early 1970s.\n\nIn 1974, &quot;People Gotta Move&quot; made it to #22 on the Billboard Top 100. On 15 February 1975, Vannelli became the second Caucasian performer to appear on Soul Train (Dennis Coffey appeared on 8 January 1972).[2] This was his television debut. With his records climbing the charts, Vannelli toured as the opening act for Stevie Wonder. In 1978, the song &quot;I Just Wanna Stop&quot; earned Gino an American Grammy Award nomination and was a number #1 single in Canada (#4 in United States). Vannelli's album &quot;Brother To Brother&quot; was certified platinum in early 1979. Gino won Canada's Juno Award for Best Male Artist. Vannelli also won Juno Awards in 1976 and 1979. Gino's additional recordings of the 1970s include: &quot;Crazy Life,&quot; &quot;Powerful People,&quot; &quot;Storm at Sunup,&quot; &quot;The Gist of the Gemini&quot; and &quot;A Pauper in Paradise&quot;.\n\nIn April 1981, &quot;Living Inside Myself&quot; was on Billboard's Top 100 at number 6. Canadian comedy legend Eugene Levy satirized Gino in Episode 4 of SCTV/Network 90 also in 1981. The Vannelli brothers shared the Juno Award for Recording Engineer of the Year in 1986 for &quot;Black Cars&quot;. The prestigious Juno Award was again shared by the Vannelli brothers in 1987 for Recording Engineer of the Year for &quot;Wild Horses&quot; and &quot;Young Lover&quot;. Gino's additional recordings of the 1980s era include: &quot;Nightwalker&quot; and &quot;Big Dreamers Never Sleep.&quot;\n\nDuring this time he married his wife, Patricia, and with whom he would have a son, Anton.\n\nIn 1990, the album Inconsolable Man delivered new releases by Vannelli to excellent reviews. In 1991, the Vannelli brothers shared the Juno Award once again, for &quot;The Time of Day&quot; and &quot;Sunset on L.A.&quot;, both from the Inconsolable Man CD. In 1993, French-speaking Quebecer singer Martine St. Clair recorded &quot;Wheels of Life&quot; as a duet with Vannelli as well as a French-language version called &quot;L'Amour Est Loi&quot;. On Vannelli's next CD release, Yonder Tree, he pays homage to his roots in jazz (apparent on his earlier albums). On Yonder Tree, Gino sings a musical tribute to the renowned poet, author and humanitarian Walt Whitman, in &quot;Walter Whitman, Where Are You?&quot; Vannelli's additional recordings of the 1990s include: &quot;Live in Montreal,&quot; and &quot;Slow Love&quot;.\n\nThe latest recordings released by Vannelli are &quot;Canto&quot; and &quot;These Are the Days&quot;. He surprised the music world by revealing his operatic license in &quot;Canto&quot;, which heralds Vannelli's superlative vocals in Italian, French, Spanish and English. The Northwest Orchestral Assembly is also featured on the &quot;Canto&quot; recording, which aired on CBC in Canada. Vannelli was commissioned by the Vatican to perform for Pope John Paul II. On the &quot;Canto&quot; recording is a loving tribute to Vannelli's father titled, &quot;Parole Per Mio Padre&quot;, which was also a favorite of Pope John Paul II. Vannelli's electrifying vocals and music garnered rave reviews for &quot;Canto&quot;. &quot;These Are the Days&quot; made yet another hit; a wonderful combination of Vannelli's new releases and classics.\n\nGino Vannelli lives and works in Amersfoort, Netherlands and in the United States.[3] His music is also heard on popular European television and radio commercials. When not in concert, Gino is actively working on various projects and teaching Master classes.\n\nIn March 2007, Vannelli performed in Las Vegas to sold-out shows. By request, encore performances were given two months later at the Flamingo Showroom.[3] In November 2007, Vannelli gave three sold out performances in New Orleans, Louisiana. The concerts were a humanitarian effort with proceeds benefiting local charities. By popular demand, Vannelli continues to tour globally.[1]\n\nIn 2008, Vannelli became a symbol of sorts for the National Basketball Association championship run by the Boston Celtics. After each home victory during the 2008 season, the video crew at the TD Banknorth Garden played a clip from Dick Clark's American Bandstand that featured a mustachioed disco dancer clad in a tight Gino Vannelli t-shirt. The tradition became known in Boston as &quot;Gino Time&quot; and Gino t-shirts became common at Celtics games.[2]\n\nThe Wall Street Journal reported in 2008 that the dancer in the Gino shirt was a man named Joseph R. Massoni, who passed away of pneumonia in 1990.[3]\n\nGino Vannelli with Uropa appearing in De Noot, Hoogland, Netherlands.\n\nIn October 2007, Vannelli performed in a small setting with Dutch sextet Uropa in the small yet renowned music cafe &quot;De Noot&quot; in Hoogland near Amersfoort.\n\n\n\n\n\n\n\nBlack Cars 1984\n\n\nBlack Cars is the eighth album by Gino Vannelli released in 1985. Co-produced with his brothers Joe and Ross, the album has a distinctive 80s sound with heavy use of Yamaha keyboards and synthesizers. It produced two hit singles in the title track and &quot;Hurts to be in Love&quot;.\n\nGino was nominated for the 1986 Juno Award for &quot;Male Vocalist of the Year&quot; (an award he had previously won in 1979) for this album. Gino and Joe also won the 1986 Juno Award for &quot;Recording Engineer of the Year&quot; for the title track.\n\nTracks: \n\n1.\t&quot;Black Cars&quot; (Gino Vannelli, Roy Freeland) - 3:07\n2.\t&quot;The Other Man&quot; (G. Vannelli, Freeland) - 3:37\n3.\t&quot;It's Over&quot; (G. Vannelli, R. Vannelli, Freeland) - 3:40\n4.\t&quot;Here She Comes&quot; (G. Vannelli) - 3:18\n5.\t&quot;Hurts to Be in Love&quot; (G. Vannelli) - 3:39\n6.\t&quot;Total Stranger&quot; (G. Vannelli, Freeland, Bill LaBounty) - 4:53\n7.\t&quot;Just a Motion Away&quot; (G. Vannelli, R. Vannelli) - 4:18\n8.\t&quot;Imagination&quot; (G. Vannelli) - 3:04\n9.\t&quot;How Much&quot; (G. Vannelli) - 3:51\n\n\n\n\nEnjoy :)\n\n","torrent":{"xt":"urn:btih:6a44711ba015db0b3cc48d045b9ad14d12c63d96","amp;dn":"Gino+Vannelli+-+Black+Cars+1984+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a44711ba015db0b3cc48d045b9ad14d12c63d96","infoHashBuffer":{"type":"Buffer","data":[106,68,113,27,160,21,219,11,60,196,141,4,91,154,209,77,18,198,61,150]},"announce":[],"urlList":[]}}