{"title":"Clasico nÃ‚Âº1: Blancanieves y los siete enanitos.","uid":4474810,"size":787052544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a4431d3a094bd9fcbffa9f5088c2163c9c36c09&amp;dn=Clasico+n%C3%82%C2%BA1%3A+Blancanieves+y+los+siete+enanitos.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"NITRISH","files":1,"time":1225298149,"description":"Hace muchos aÃƒÂ±os, en un paÃƒÂ­s lejano, vivÃƒÂ­a una princesa llamada Blancanieves. Su madrastra, una bellÃƒÂ­sima hechicera, consultÃƒÂ³ con su espejo mÃƒÂ¡gico quiÃƒÂ©n era la mujer mÃƒÂ¡s hermosa del reino, y al contestarle que Blancanieves ordenÃƒÂ³ a uno de sus vasallos que llevara a la princesa al interior del bosque y le quitara la vida.En lugar de cumplir la cruel misiÃƒÂ³n que le habÃƒÂ­a sido encomendada, el verdugo dejÃƒÂ³ libre a Blancanieves, con la condiciÃƒÂ³n de que no volviera nunca mÃƒÂ¡s al castillo, de modo que la reina no supiera que continuaba viva.Guiada por un grupo de animalillos del bosque, la princesa llegÃƒÂ³ a una casita situada en lo mÃƒÂ¡s profundo de la floresta. En su interior todo era muy pequeÃƒÂ±o: muebles, enseres..., como si estuviera habitada por niÃƒÂ±os. Todo estaba muy sucio, tanto que Blancanieves y los animales del bosque necesitaron el dÃƒÂ­a entero para limpiarlo. Al fin, cuando la casa brillaba resplandeciente y el puchero hervÃƒÂ­a alegremente en el fuego, la princesa se acostÃƒÂ³ sobre tres camas y se quedÃƒÂ³ dormida. En el otro lugar del bosque, siete enanitos daban por terminada su jornada de trabajo en la mina de diamantes. Caminando, volvieron a su casa y se quedaron muy sorprendidos al ver una luz brillando en la ventana y humo saliendo por la chimenea. Al principio pensaron que la casa estaba invadida por los duendes y tenÃƒÂ­an mucho miedo a entrar, po lo que enviaron por delante al mÃƒÂ¡s pequeÃƒÂ±o de todos, mientras ellos le seguÃƒÂ­an, armados de garrotes, dispuestos a dar una paliza al intruso. Dormida sobre su cama encontraron a la princesa Blancanieves. DespertÃƒÂ³, admirÃƒÂ¡ndose de encontrar a los siete enanitos, a los que contÃƒÂ³ la causa por la que se hallaba allÃƒÂ­. A cambio de que le permitieran quedarse, Blancanieves se ofreciÃƒÂ³ a limpiar la casa y cocinar para ellos, cosa que los enanitos admitieron encantados, y tras la abundante cena celebraron una fiesta. Mientras tanto, en su castillo, la reina consultaba a su espejo mÃƒÂ¡gico sobre la idenidad de la mujer mÃƒÂ¡s bella del reino, a lo que el espejo contestaba que continuaba siÃƒÂ©ndolo Blancanieves y que vivÃƒÂ­a en el bosque en la casa de los enanitos. La madrastra tomÃƒÂ³ el aspecto de una horrible bruja y encantÃƒÂ³ una manzana con un hechizo que harÃƒÂ­a que quien la mordiese caerÃƒÂ­a como muerto y sÃƒÂ³lo recobrarÃƒÂ­a la vida si recibÃƒÂ­a un beso de amor, tras lo cual se dirigiÃƒÂ³ al bosque dispuesta a acabar por sÃƒÂ­ misma con la vida de la princesa. Cuando los enanitos se fueron al trabajo, la bruja le dio a Blancanieves la manzana envenenada y cayÃƒÂ³ como muerta. Al momento se apercibiÃƒÂ³ de que los amigos de la princesa regresaban, por lo que huyÃƒÂ³ hacia el monte, encontrando la muerte en su fuga.Los siete enanitos depositaron el cuerpo de su amiga en una urna de cristal. Lloraban amargamente la desapariciÃƒÂ³n de Blancanieves, cuando apareciÃƒÂ³ un prÃƒÂ­ncipe llegado de un lejano paÃƒÂ­s, atraÃƒÂ­do por la fama de la belleza de la princesa. Al verla tan bonita, el prÃƒÂ­ncipe la besÃƒÂ³, con lo que el hechizo quedÃƒÂ³ deshecho. El prÃƒÂ­ncipe se llevÃƒÂ³ a Blancanieves a su reino y vivieron felices durante muchos aÃƒÂ±os, sin que olvidaran a sus amigos, los siete enanitos del bosque.\n","torrent":{"xt":"urn:btih:6a4431d3a094bd9fcbffa9f5088c2163c9c36c09","amp;dn":"Clasico+n%C3%82%C2%BA1%3A+Blancanieves+y+los+siete+enanitos.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4431d3a094bd9fcbffa9f5088c2163c9c36c09","infoHashBuffer":{"type":"Buffer","data":[106,68,49,211,160,148,189,159,203,255,169,245,8,140,33,99,201,195,108,9]},"announce":[],"urlList":[]}}