{"title":"Austin Grossman - Soon I Will Be Invincible","uid":15499830,"size":295964493,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6a76b64783965dac6c1748fc9d1ac76bf4a12f90&amp;dn=Austin+Grossman+-+Soon+I+Will+Be+Invincible&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Laverna","files":10,"time":1470483939,"description":"Doctor Impossible, evil genius, diabolical scientist, wannabe world dominator, languishes in a federal detention facility. He's lost his freedom, his girlfriend, and his hidden island fortress.\r\n\r\nOver the years, he's tried to take over the world in every way imaginable, using doomsday devices of all varieties (nuclear, thermonuclear, nanotechnological) and mass mind control. He's traveled backwards in time to change history, forward in time to escape it. He's commanded robot armies, insect armies, and dinosaur armies. A fungus army. An army of fish. Of rodents. Aliens. All failures. But not this time. This time it's going to be different.\r\n\r\nFatale is a rookie superhero on her first day with the Champions, the world's most famous superteam. She's a patchwork woman of skin and chrome, a gleaming technological marvel built for the next generation of warfare. Filling the void left by a slain former member, we watch as Fatale joins a team struggling with a damaged past, having to come together in the face of unthinkable evil.\r\n\r\nSoon I Will Be Invincible is a thrilling first novel, a fantastical adventure that gives new meaning to notions of power, glory, responsibility, and (of course) good and evil.\r\n\r\nRead by Coleen Marlo, Paul Boehmer\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:6a76b64783965dac6c1748fc9d1ac76bf4a12f90","amp;dn":"Austin+Grossman+-+Soon+I+Will+Be+Invincible","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a76b64783965dac6c1748fc9d1ac76bf4a12f90","infoHashBuffer":{"type":"Buffer","data":[106,118,182,71,131,150,93,172,108,23,72,252,157,26,199,107,244,161,47,144]},"announce":[],"urlList":[]}}