{"title":"John Eliot - The Maverick Mindset","uid":8784821,"size":133248815,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6a8b395c781b1bcc24500569bdc4f3f2509d84d9&amp;dn=John+Eliot+-+The+Maverick+Mindset&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"acer47x","files":54,"time":1375805437,"description":"Relax. Set Goals. Focus on the outcome.\n\nLose yourself in &quot;The Zone&quot;\n\nAll reasonable, sensible, rational words of advice when you are facing a performance challenge.\n\nAll utterly, hopelessly WRONG!\n\nCutting-edge research in cognitive neuroscience has revealed something ASTONISHING about what really goes on in the minds of extraordinary achievers.\n\nRead on and discover the radically different principles and practices that set truly exceptional achievers apart from the rest!\n\nWhile most people are busy goal setting, visualising success, trying to get in the flow, and doing all the other things they've been convinced will bring results they're looking for, the world's most exceptional performers - are doing NONE OF THEM!\n\nThese mavericks have bucked the standard &quot;success system&quot; in favour of a radically different mode of thinking.\n\nThey're living better, earning more, and achieving at the highest levels.\n\nIn The Maverick Mindset: The New Science of Exceptional Achievement, renowned elite performance consultant Dr. John Eliot, reveals everything he has learned about how the truly exceptional achievers in this world have - and HAVEN'T - attained their exalted heights of accomplishment.\n\nThe Maverick Mindset will show you what they do, and how you can make their unconventional, contrarian habits and practices your own.\n\nYou'll discover how to:\n\n* Attain the intense level of focus that enables business moguls to close billion-pound deals and renowned heart surgeons to successfully perform life and death procedures. (It all comes down to one simple habit).\n* Change how much you get done and how well you get it done with a shift in thinking you can make immediately (You'll be stunned by the difference it makes in each and every day).\n* Distinguish the important from the unimportant in any situation, so you can concentrate only on information that brings you the most return on investment. (A fantastically critical skill; it will free up enormous reserves of space in your mind and time in your life).\n* Create a &quot;pre-performance routine&quot; that will automatically move you into 'The Maverick Mindset'.\n* Pull yourself out of any slump or lapse in confidence, with a succinct and extremely potent seven-word philosophy. (This has got some of the biggest successes in the world through some of the most devastating failures you can imagine - and believe me, all successful people have failed - a lot.)\n* Measure your performance without impeding your success by following two rules common among great performers. (Hint: It has to do with what they evaluate and when they evaluate it).\n* Identify trends and patterns in your behaviour, both positive and negative, using a highly effective technique that doesn't take a lot of time. (Maverick achievers know themselves, but they don't waste time filling in charts or taking personality quizzes in order to get that knowledge. Neither should you.)\n* Reframe your self-image in a way that will completely transform you. (Top achievers think of themselves in a uniquely confident way; everyone else doesn't.)\n* And a whole lot more!\n\nMaverick achievers don't &quot;visualise&quot; ... they don't practice &quot;stress management&quot; ... they don't &quot;focus on the outcome&quot; ... they don't practice &quot;positive thinking&quot; ... they aren't &quot;careful&quot; or &quot;conscientious&quot; or &quot;realistic,&quot; not in the ways we've all been trained to understand those concepts.\n\nThe really elite performers in the world, the true greats in every field, operate under a radically different set of principles and practices from the ones most people have bought into. They're counter-intuitive, they're unconventional, and that's why these individuals are able to rise so much higher and achieve so much more than everyone else.\n\nIt's not that their incredible success has allowed high achievers the luxury of bucking the system, as sceptics (and, I might add, failures) sometimes like to speculate. Bucking the system is the reason for their incredible success.\n\nIn The Maverick Mindset: The New Science of Exceptional Achievement, you'll learn about how the truly exceptional achievers in this world have - and HAVEN'T - attained their exalted heights of accomplishment.\n\nIn story after story, and example after example, you'll discover how the most spectacularly successful people in the world turned their backs on the conventional success wisdom that's out there, and by doing so, achieved more than people ever dream of. But, more importantly how you can make their unconventional, contrarian habits and practices your own!\n\nBelieve me, if you think you've &quot;heard it all before&quot; on the subject of Personal Achievement, you need this program.","torrent":{"xt":"urn:btih:6a8b395c781b1bcc24500569bdc4f3f2509d84d9","amp;dn":"John+Eliot+-+The+Maverick+Mindset","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a8b395c781b1bcc24500569bdc4f3f2509d84d9","infoHashBuffer":{"type":"Buffer","data":[106,139,57,92,120,27,27,204,36,80,5,105,189,196,243,242,80,157,132,217]},"announce":[],"urlList":[]}}