{"title":"The Fantastic Laboratory of Dr Weigl- How Two Brave Scientists B","uid":11518678,"size":8673678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ab9fffd218935bb6a04ad3a198b21a778f024dd&amp;dn=The+Fantastic+Laboratory+of+Dr+Weigl-+How+Two+Brave+Scientists+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"gratefuldawg77","files":6,"time":1416467905,"description":"Few diseases are more gruesome than typhus. Transmitted by body lice, it afflicts the dispossessed refugees, soldiers, and ghettoized peoples causing hallucinations, terrible headaches, boiling fever, and often death. The disease plagued the German army on the Eastern Front and left the Reich desperate for a vaccine. For this they turned to the brilliant and eccentric Polish zoologist Rudolf Weigl. In the 1920s, Weigl had created the first typhus vaccine using a method as bold as it was dangerous for its use of living human subjects. The astonishing success of Weigl s techniques attracted the attention and admiration of the world giving him cover during the Nazi s violent occupation of Lviv. His lab soon flourished as a hotbed of resistance. Weigl hired otherwise doomed mathematicians, writers, doctors, and other thinkers, protecting them from atrocity. The team engaged in a sabotage campaign by sending illegal doses of the vaccine into the Polish ghettos while shipping gallons of the weakened serum to the Wehrmacht.\n\nAmong the scientists saved by Weigl, who was a Christian, was a gifted Jewish immunologist named Ludwik Fleck. Condemned to Buchenwald and pressured to re-create the typhus vaccine under the direction of a sadistic Nazi doctor, Erwin Ding-Schuler, Fleck had to make an awful choice between his scientific ideals or the truth of his conscience. In risking his life to carry out a dramatic subterfuge to vaccinate the camp s most endangered prisoners, Fleck performed an act of great heroism.\n\nDrawing on extensive research and interviews with survivors, Arthur Allen tells the harrowing story of two brave scientists a Christian and a Jew who put their expertise to the best possible use, at the highest personal danger.&quot;","torrent":{"xt":"urn:btih:6ab9fffd218935bb6a04ad3a198b21a778f024dd","amp;dn":"The+Fantastic+Laboratory+of+Dr+Weigl-+How+Two+Brave+Scientists+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ab9fffd218935bb6a04ad3a198b21a778f024dd","infoHashBuffer":{"type":"Buffer","data":[106,185,255,253,33,137,53,187,106,4,173,58,25,139,33,167,120,240,36,221]},"announce":[],"urlList":[]}}