{"title":"Civilization.V.Gods.and.Kings.Expansion.Cracked-REVOLT","uid":7368944,"size":1438601790,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6aced248e07f7ffdc7d9485123c7dbe02e084afb&amp;dn=Civilization.V.Gods.and.Kings.Expansion.Cracked-REVOLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ontotita","files":-1,"time":1340185831,"description":"Sid Meierï¿½s Civilization V: God &amp; Kings takes players through time as they engage in new quests and global competitions, interact with new types of city-states, and master exciting new systems for land and naval combat. The game features nine new civilizations, each ruled by a new leader, nine new wonders, three original scenarios and dozens of new units, buildings, technologies and resources that have been added to offer even more ways for players to expand their empire on their quest to rule the world.\n\nFeatures:\n\n    Expanded Epic Game: The core game experience has been greatly expanded with the addition of new technologies (like Combined Arms), 27 new units (like the new 1-hex ranged unit Machine Gunner), 13 new buildings (like the Bomb Shelter), and 9 new Wonders (see below).\n   \nNew Civilizations: The expansion will deliver 9 new civilizations, such as Carthage, Netherlands, the Celts, and the Maya (it is 2012, after all), along with their unique traits, units and buildings.\n\n    Religion: A righteous people will seek out Faith to found a Pantheon of the Gods. As your Faith becomes stronger, you can cultivate Great Prophets who build on these simple beliefs to create a religion that you can customize and enhance as desired.\n\n    Enhanced Diplomacy and Espionage: Establish embassies at foreign courts for closer ties (or clandestine operations). As the religions of the world start settling in, and the world moves into the Renaissance, you unlock your first spy (with more to come).\n\n    City-States: Two new city-state types have been added (Mercantile and Religious) to bring all new advantages to the table. The city-state quest system has received a complete overhaul to decrease the importance of gold and add a whole range of new quests that further the narrative of the game, as well as make the diplomatic victory a more varied option.\n\n    World Domination: The fight for world domination is now more dynamic than ever before. The Gods and Kings expansion features a reworked combat system and AI that puts more emphasis on a balanced army composition.\n\n    Naval Combat: Your navy is now split into two different ship types, melee and ranged. This means that no coastal city should be considered safe, and can now fall to a surprise naval attack.\n\n    New Wonders: There will be 9 new Wonders with all new effects including Neuschwanstein, the Great Mosque of Djenne, the Terracotta Army, the Great Firewall, and the Hubble Space Telescope.\n\n    Three new Scenarios:\n    Medieval\n    Fall of Rome\n    Empires of the Smoky Skies\n\nInstallation (CAUTION, this is an EXPANSION ONLY, Civilization V is required for play):\n\n1.  Extract to your Civ V installation dir\n2.  Play game using CivilizationV.exe or CivilizationV_DX11.exe\n\nEnjoy! ","torrent":{"xt":"urn:btih:6aced248e07f7ffdc7d9485123c7dbe02e084afb","amp;dn":"Civilization.V.Gods.and.Kings.Expansion.Cracked-REVOLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aced248e07f7ffdc7d9485123c7dbe02e084afb","infoHashBuffer":{"type":"Buffer","data":[106,206,210,72,224,127,127,253,199,217,72,81,35,199,219,224,46,8,74,251]},"announce":[],"urlList":[]}}