{"title":"Gary US Bonds-5 cd","uid":5386987,"size":383252149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ad9e780e8e3b651c5cb368714c5873af72fc550&amp;dn=Gary+US+Bonds-5+cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"flitigalisa","files":87,"time":1266884149,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\n\nGary U.S. Bonds (born Gary Anderson, June 6, 1939, Jacksonville, Florida) is an American rhythm and blues and rock and roll singer. He is also a prolific songwriter.\nBorn in Jacksonville, Bonds was living in Norfolk, Virginia in the 1950s when he began singing publicly in church, and with a group called The Turks.[1] He joined record producer Frank Guida's small Legrand Records label, and Guida changed Anderson's name to &quot;U.S. Bonds&quot; in hope that it would be confused with a public service announcement advertising the sale of government bonds and thus get more airplay. His first album (Dance till Quarter to Three) was released under the name U.S. Bonds, but people mistook it for the name of a group, so his second album (Twist-Up Calypso) was released under the name Gary (U.S.) Bonds, to avoid the confusion.\nBonds's first hit was the song &quot;New Orleans&quot; (reached #6), which was followed by &quot;Not Me&quot;, a flop for Bonds but later a hit for The Orlons, and then by his only number one hit, &quot;Quarter to Three&quot; in June 1961. &quot;Quarter to Three&quot; sold one million records, gaining a gold disc.[1] Subsequent hits, under his modified name, included &quot;School Is Out&quot; (#5), &quot;Dear Lady Twist&quot; (#9), &quot;School Is In&quot; (#28) and &quot;Twist, Twist, SeÃƒÂ±ora&quot; (#10) in the early 1960s. In a 1963 tour of Europe, he headlined above The Beatles. His hits often featured solos by the saxophonist Gene Barge.\n&quot;Quarter to Three&quot; appears on The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll list.\nIn the early 1980s, Bonds had a career resurgence, working off collaborations with Bruce Springsteen, Steven Van Zandt, and the E Street Band. Later hits included &quot;This Little Girl&quot; (his comeback hit in 1981, which reached #11 on the pop chart and #5 on the mainstream rock chart), &quot;JolÃƒÂ© Blon&quot; and &quot;Out of Work&quot;. Bonds continues to release albums sporadically, and today is a mainstay of the nostalgia concert circuit.\nWhile Bonds is mostly known for achievements within rhythm and blues and rock and roll, he often transcends these genres, e.g. his song &quot;She's All I Got&quot;, co-written by Jerry Williams, Jr. (better known as Swamp Dogg), was nominated for the Country Music Association's &quot;Song of the Year&quot; in 1972 when it was a big hit for Johnny Paycheck. He is also an honoree of the Rhythm &amp; Blues Foundation. Bonds is an accomplished golfer and often plays celebrity PGA Tour events.\nHe was inducted into the Long Island Music Hall of Fame on October 15, 2006.\nIn 2009 he toured the UK as a special guest of Bill Wyman's Rhythm Kings. \n","torrent":{"xt":"urn:btih:6ad9e780e8e3b651c5cb368714c5873af72fc550","amp;dn":"Gary+US+Bonds-5+cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad9e780e8e3b651c5cb368714c5873af72fc550","infoHashBuffer":{"type":"Buffer","data":[106,217,231,128,232,227,182,81,197,203,54,135,20,197,135,58,247,47,197,80]},"announce":[],"urlList":[]}}