{"title":"Introduction to Nanoscience - S.M. Lindsay","uid":15390522,"size":6618041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b1c3cf91302171b9b1c561707ec2253a1683cdf&amp;dn=Introduction+to+Nanoscience+-+S.M.+Lindsay&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469331788,"description":"Introduction to Nanoscience - S.M. Lindsay (OUP, 2010).pdf\r\n\r\nNanoscience is not physics, chemistry, engineering or biology. It is all of them, and it is time for a text that integrates the disciplines. This is such a text, aimed at advanced undergraduates and beginning graduate students in the sciences. The consequences of smallness and quantum behaviour are well known and described Richard Feynman's visionary essay 'There's Plenty of Room at the Bottom' (which is reproduced in this book). Another, critical, but thus far neglected, aspect of nanoscience is the complexity of nanostructures. Hundreds, thousands or hundreds of thousands of atoms make up systems that are complex enough to show what is fashionably called 'emergent behaviour'. Quite new phenomena arise from rare configurations of the system. Examples are the Kramer's theory of reactions (Chapter 3), the Marcus theory of electron transfer (Chapter 8), and enzyme catalysis, molecular motors, and fluctuations in gene expression and splicing, all covered in the final Chapter on Nanobiology. The book is divided into three parts. Part I (The Basics) is a self-contained introduction to quantum mechanics, statistical mechanics and chemical kinetics, calling on no more than basic college calculus. A conceptual approach and an array of examples and conceptual problems will allow even those without the mathematical tools to grasp much of what is important. Part II (The Tools) covers microscopy, single molecule manipulation and measurement, nanofabrication and self-assembly. Part III (Applications) covers electrons in nanostructures, molecular electronics, nano-materials and nanobiology. Each chapter starts with a survey of the required basics, but ends by making contact with current research literature","torrent":{"xt":"urn:btih:6b1c3cf91302171b9b1c561707ec2253a1683cdf","amp;dn":"Introduction+to+Nanoscience+-+S.M.+Lindsay","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b1c3cf91302171b9b1c561707ec2253a1683cdf","infoHashBuffer":{"type":"Buffer","data":[107,28,60,249,19,2,23,27,155,28,86,23,7,236,34,83,161,104,60,223]},"announce":[],"urlList":[]}}