{"title":"Kyu Sakamoto - &quot;Ue O Muite Aruko&quot; (Sukiyaki)","uid":3711788,"size":39619937,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b3989cf73be4600a82a0dd594b4c6e8b269a4ad&amp;dn=Kyu+Sakamoto+-+%5C%22Ue+O+Muite+Aruko%5C%22+%28Sukiyaki%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"reichert","files":5,"time":1181627819,"description":"\nHere are some very rare music video&amp;#039;s and the songs in (Stereo!) of &quot;Sukiyaki&quot; in English and original Japanese...\n\n\nMore: Sakamoto, Kyu &quot;Kyu-chan&quot; - b. November 10, 1941. d. August 12, 1985.He was 43 years old at the time of his death.\n\nInternationally acclaimed singer. Sakamoto made his show business debut in 1960. His biggest hit, Ue o Muite Aruko (I Look Up When I Walk; &quot;Sukiyaki&quot; in the West), was released in Japan in 1961. After its release in the U.S. in 1963, the song&amp;#039;s earnestness and melodic beauty proved irresistible despite its incomprehensible lyrics. \n\nAgainst all odds, on June 15, 1963, the song ousted Leslie Gore&amp;#039;s &quot;It&amp;#039;s My Party&quot; to become the No. 1 popular song in the U.S. &quot;Sukiyaki&quot; remains the biggest international hit by a Japanese popular singer. Credit for the song&amp;#039;s popularity also is due to the music by Hachidai Nakamura and the lyrics by Rokusuke Ei, who is said to have written this touching evocation of loneliness after his heart was broken by the actress Meiko Nakamura. Sakamoto also recorded such popular songs as &quot;Shiawase Nara Te o Tatako&quot; and &quot;Miagete Goran Sora no Hoshi o.&quot; \n\nTragically, he was killed when JAL Flight 123, a 747 bound from Haneda Airport in Tokyo to Osaka, lost pieces of its tail sections and spiraled downward nightmarishly for 30 minutes (long enough for some passengers to scribble shaky farewells to their families). The plane crashed and burned on a thickly wooded mountain about 60 miles northwest of Tokyo, killing 520 and injuring four, in the worst single airplane disaster in aviation history. \n\nSakamoto&amp;#039;s songs remain popular in Japan and overseas. &quot;A Taste of Honey&quot; and &quot;4PM&quot; are among the performers who have subsequently released their own renditions of &quot;Sukiyaki.&quot;\n\nMr. Sakamoto&amp;#039;s grave is at the Chookokuji Temple, in the Minato-ku(district) in Tokyo.\n\n","torrent":{"xt":"urn:btih:6b3989cf73be4600a82a0dd594b4c6e8b269a4ad","amp;dn":"Kyu+Sakamoto+-+%5C%22Ue+O+Muite+Aruko%5C%22+%28Sukiyaki%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b3989cf73be4600a82a0dd594b4c6e8b269a4ad","infoHashBuffer":{"type":"Buffer","data":[107,57,137,207,115,190,70,0,168,42,13,213,148,180,198,232,178,105,164,173]},"announce":[],"urlList":[]}}