{"title":"Martin Amis - Money: A Suicide Note (pdf)","uid":10158883,"size":4814603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ba1b87977eb602f16db5924d637c26cf7bc4659&amp;dn=Martin+Amis+-+Money%3A+A+Suicide+Note+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400207242,"description":"Martin Amis - Money: A Suicide Note (Penguin, 1984, 1985). 394 pages.\n\nNew scan. Searchable pdf (clearscan) with accurate metadata, bookmarks, etc. This book doesn't have chapter titles, so I've marked the section dividers as best I could.\n\nEvery other digital version of this book I've found has been defective. Many are truncated, with a large part of the end of the book simply missing. All the others seem to be semi-proofed conversions from a plain text OCR source. The version in this torrent is a new scan and contains everything in the print version, including all the proper formatting. My paperback copy had a very ugly cover, and I couldn't find a good cover image elsewhere, so I've left the pdf coverless. Enjoy.\n\n\nThis Martin Amis satire of '80s excess is listed among Time magazine's &quot;100 best English-language novels from 1923 to the present.&quot;\n\n\ndescription:\n\n'Super-charged, anarchic and full of narrative acrobatics, Money burst on to the Eighties literary scene leaving a trail of imitators and devotees in its wake'\n--Observer \n\nThis is the story of John Self, consumer extraordinaire. Rolling around New York and London, he makes deals, spends wildly and does reckless movie-world business, all the while grabbing everything he can to sate his massive appetites: alcohol, tobacco, pills, pornography, a mountain of junk food and more. Ceaselessly inventive and thrillingly savage, this is a tale of life lived without restraint; of money, the terrible things it can do and the disasters it can precipitate.\n\n'Terribly, terminally funny'\n--Guardian","torrent":{"xt":"urn:btih:6ba1b87977eb602f16db5924d637c26cf7bc4659","amp;dn":"Martin+Amis+-+Money%3A+A+Suicide+Note+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba1b87977eb602f16db5924d637c26cf7bc4659","infoHashBuffer":{"type":"Buffer","data":[107,161,184,121,119,235,96,47,22,219,89,36,214,55,194,108,247,188,70,89]},"announce":[],"urlList":[]}}