{"title":"Photography as Activism - Images for Social Change by Michelle B","uid":10289087,"size":66838050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6bb05cad4dc4b1b2d61e0511f5b310df8b2d49d5&amp;dn=Photography+as+Activism+-+Images+for+Social+Change+by+Michelle+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1401836128,"description":"Photography as Activism: Images for Social Change by Michelle Bogre\nEnglish | 2011 | ISBN: 0240812751 | 184 pages | PDF | 63,7 MB\n\nYou want to look through the lens of your camera and change the world. You want to capture powerful moments in one click that will impact the minds of other people. Photographic images are one of the most popular tools used to advocate for social and environmental awareness. \n\nThis can be as close to home as drug use, prostitution, or pollution or as far away as famine, war, and the plight of refugees and migrant workers. One well-known example of an activist photographer would be landscape photographer Ansel Adams, who trudged to Washington with stunning images of the American west to advocate protecting these areas. His images and testimony were instrumental in creating the National Park System and garnering specific protection for Yellowstone National Park. More recently Robert Glenn Ketchum's images of Alaska's Arctic National Wildlife Refuge raised awareness of why this area should be protected. Nigel Barker's seal photographs advocates against seal clubbing. What is your cause and how can you use your camera to make the world a better place?\n\nThis book provides a comprehensive theory of, and history of, photography as activism. It also includes interviews with contemporary photographers. It is a call to action for young photographers to become activists, a primer of sorts, with advice for how to work with NGOs and non-profits, how to work safely in conflict zones and with suggestions for distribution on websites, blogs, and interactive agencies.","torrent":{"xt":"urn:btih:6bb05cad4dc4b1b2d61e0511f5b310df8b2d49d5","amp;dn":"Photography+as+Activism+-+Images+for+Social+Change+by+Michelle+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb05cad4dc4b1b2d61e0511f5b310df8b2d49d5","infoHashBuffer":{"type":"Buffer","data":[107,176,92,173,77,196,177,178,214,30,5,17,245,179,16,223,139,45,73,213]},"announce":[],"urlList":[]}}