{"title":"BLACKHOLE - FLT","uid":11731894,"size":913007655,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6bb63993c36e70129f4b043fd8967580e3be3b1e&amp;dn=BLACKHOLE+-+FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dauphong","files":2,"time":1425413428,"description":"BLACKHOLE (c) FiolaSoft Studio: Supplied by: FAIRLIGHT: Release Date: 02/03/2015: Cracked by: FAIRLIGHT Game Type: Platformer\nPackaged by: FAIRLIGHT Image Format: ISO\nDISCS: 1 Protection: Steam\n\nSystem Requirements: Nobody knows!\n\nGame information:\n\nBecome a hero and discover the secrets hidden in a mysterious Entity. The\nworld inside the black hole is waiting for you to explore it!\n\nWhen the crew of a spaceship called Endera is sucked into a black hole, it\nseems like it is the end. Fortunately, the ship crashes on Entity; an\nobject resembling a planet. After the crash, the first member to wake up\nis the guy who made coffee for the crew. He discovers a copied artificial\nintelligence of the ship, Auriel, on his PDA. Together, they come up with\na plan on how to fix their spaceship, save the survivors of the crew and\nbecome heroes of the planet Earth by shutting the black hole once and for\nall\n\nFeatures:\n\n* Amazing places: Explore the colourful caves, a lost city of an\nancient civilization, reach the skies in the Entity of huge\nmountains and have no fear to pass through a living jungle\nEvery step you make will be worth it!\n* Change the gravity: Levels are designed in a unique way; turn the\ngravity in four different directions and reach places you had no\nchance to reach before. Every level is the same as the other\nfour and it is only up to you to choose the best way in\ncompleting your quests\n* Beat the time: Your time in each level is recorded. You can share\nit with your friends afterwards. Find the fastest way to complete\nthe level and earn the top spot in global charts\n* Full English voices: This space comedy, narrated by the best voice\nactors, can begin! Kind help from the director Chris Niosi\nabsolutely diversifies this game from other games in the\ngenre. The lines and dialogues are based on the greatly\ndiverse character personalities!\n* Captivating soundtrack: Made by composers Jakub Mirejovsky and\nJan Sevcik. Enjoy listening to strong melodies. Rhytmic drums\ndynamic dubstep and fairytale orchestra will not keep you calm\n* Logic puzzles, action minigames: Pass through all the\ntricky traps and discover all the hidden secrets\nbehind closing black holes\n* 2D graphics in FULL HD: Animations and all the graphics are\nhand painted. Everything is prepared for the best gaming\nexperience in steady 50 frames per second! Turn the\nworld, laugh and compete for the best times in\nbeautiful full HD graphics!\n\nInstallation Information:\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall","torrent":{"xt":"urn:btih:6bb63993c36e70129f4b043fd8967580e3be3b1e","amp;dn":"BLACKHOLE+-+FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb63993c36e70129f4b043fd8967580e3be3b1e","infoHashBuffer":{"type":"Buffer","data":[107,182,57,147,195,110,112,18,159,75,4,63,216,150,117,128,227,190,59,30]},"announce":[],"urlList":[]}}