{"title":"Walt Disney Treasures - Silly Symphonies (all of them)","uid":11438578,"size":28678808535,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6c180d03599ec452d66e73bc1d4f05dd3d68868d&amp;dn=Walt+Disney+Treasures+-+Silly+Symphonies+%28all+of+them%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":11,"uploader":"Invader97","files":109,"time":1415776447,"description":"I believe that all of the Silly Symphonies and the More Silly Symphonies are here - in two different versions. The first version has the individual videos ripped from DVDs. The second version is in DVD format, one folder containing the Silly Symphonies and a second folder containing the More Silly Symphonies. However, this confuses me, since the Silly Symphonies and the More Silly Symphonies were each put out by Disney as a set of two DVDs. Therefore, this DVD version should include four folders, one for each DVD issued by Disney. Perhaps the people who created the torrents I downloaded merged the two DVDs in each set.\n\nI have not done a thorough review of all the videos, so I don't know if any of the cartoons are missing or defective, or if the bonus features and the introductions by Leonard Maltin are included.\n\nI look forward to comments by downloaders of this torrent about the above issue, about which version is preferred, and about the completeness and quality of the contents","torrent":{"xt":"urn:btih:6c180d03599ec452d66e73bc1d4f05dd3d68868d","amp;dn":"Walt+Disney+Treasures+-+Silly+Symphonies+%28all+of+them%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c180d03599ec452d66e73bc1d4f05dd3d68868d","infoHashBuffer":{"type":"Buffer","data":[108,24,13,3,89,158,196,82,214,110,115,188,29,79,5,221,61,104,134,141]},"announce":[],"urlList":[]}}