{"title":"Namibia - Genocide and the Second Reich ~ BBC 2005. 08.15 avi","uid":3926557,"size":524490752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c1db944203d7b3dd9fda016a3cc1f0b610acdd6&amp;dn=Namibia+-+Genocide+and+the+Second+Reich+%7E+BBC+2005.+08.15+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"shunster07","files":1,"time":1197134734,"description":"Namibia - Genocide and the Second Reich ~ BBC 2005. 08.15 avi\n\n\nThe story of Germany&amp;#039;s forgotten genocide. This powerful documentary by David Adetayo Olusoga took a sensitive and uncompromising look at the tragic circumstances leading to the massacre of three quarters of the Namibia population in German concentration camps built in Africa. The programme included graphic reconstructions and did not shirk from showing disturbing scenes which revealed the savagery ofeEuropean colonial ideology put into practise. \n\nThe documentary also showed the 2004 footage of Germany&amp;#039;s ambassador to Namibia expressing regret for their killing of thousands of Namibia&amp;#039;s Hereros during the colonial era. Unsurprisingly, the Germans refused to agree to the justifiable calls for reparations.\n\nThe program also explored the current call for land reforms where most of Namibia&amp;#039;s commercial land is still owned by european farmers who make up 6 percent of the country&amp;#039;s population of 1.8 million. Throughout it included interviews and powerful testimony from African survivors, descendants and reparation movement representatives thus making this a compelling programme which both educated the audience whilst treating the sensitive subject matter with the respect it deserved.\n\nThe term Second Reich is sometimes applied retrospectively to this period. The term was popularised by German nationalist historian Arthur Moeller van den Bruck in the 1920s, and drew an explicit link with the earlier Holy Roman Empire of the German Nation (the &quot;First Reich&quot;), as well as underlining his desire for the establishment of a &quot;Third Reich&quot;.[6] \n\nThis term was adopted during the time of Nazi rule for propaganda purposes - and therefore its use among historians after World War II has generally been discouraged, as many consider it to give legitimacy to Nazi historiography.\n\n &lt;a href=&quot;\nhttp://www.mazalien.com/namibia-genocide-and-the-second-reich.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mazalien.com/namibia-genocide-and-the-second-reich.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6c1db944203d7b3dd9fda016a3cc1f0b610acdd6","amp;dn":"Namibia+-+Genocide+and+the+Second+Reich+%7E+BBC+2005.+08.15+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c1db944203d7b3dd9fda016a3cc1f0b610acdd6","infoHashBuffer":{"type":"Buffer","data":[108,29,185,68,32,61,123,61,217,253,160,22,163,204,31,11,97,10,205,214]},"announce":[],"urlList":[]}}