{"title":"Julian Assange - UnAuthorized AutoBiography [PDF] [Qwerty80]","uid":8016697,"size":2040689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c33754db04f233114916989570ca66e6c43a691&amp;dn=Julian+Assange+-+UnAuthorized+AutoBiography+%5BPDF%5D+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KatQwerty","files":3,"time":1358116847,"description":"\n[b]Publication Date: September 1, 2011[/b]\n \n \n \n\nIn December 2010, Julian Assange signed a contract with Canongate Books to write a book - part memoir, part manifesto - for publication the following year. At the time, Julian said: 'I hope this book will become one of the unifying documents of our generation. In this highly personal work, I explain our global struggle to force a new relationship between the people and their governments.' \n \n \n \nIn the end, the work was to prove too personal. Despite sitting for more than fifty hours of taped interviews and spending many late nights at Ellingham Hall (where he was living under house arrest) discussing his life and the work of WikiLeaks with the writer he had enlisted to help him, Julian became increasingly troubled by the thought of publishing an autobiography. After reading the first draft of the book at the end of March, Julian declared: 'All memoir is prostitution.' \n \n \n \nIn June 2011, with thirty-eight publishing houses around the world committed to releasing the book, Julian told us he wanted to cancel his contract. We disagree with Julian's assessment of the book. We believe it explains both the man and his work, underlining his commitment to the truth. Julian always claimed the book was well written; we agree, and this also encouraged us to make the book available to readers. And the contract? \n \n \nBy the time Julian wanted to cancel the deal he had already used the advance money to settle his legal bills. So the contract still stands. We have decided to honour it - and to publish. This book is the unauthorised first draft. It is passionate, provocative and opinionated - like its author. It fulfils the promise of the original proposal and we are proud to publish it.\n ","torrent":{"xt":"urn:btih:6c33754db04f233114916989570ca66e6c43a691","amp;dn":"Julian+Assange+-+UnAuthorized+AutoBiography+%5BPDF%5D+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c33754db04f233114916989570ca66e6c43a691","infoHashBuffer":{"type":"Buffer","data":[108,51,117,77,176,79,35,49,20,145,105,137,87,12,166,110,108,67,166,145]},"announce":[],"urlList":[]}}