{"title":"Doom ","uid":8946165,"size":194220236,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6ccfec5195cca214bbde182c59d2770c69a26d10&amp;dn=Doom+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1379782773,"description":"\nDoom (typeset as DOOM in official documents)[1] is a 1993 science fiction horror-themed first-person shooter video game by id Software. In Doom, players assume the role of a space marine, popularly known as &quot;Doomguy&quot;, who must fight his way through the hordes of invading demons from Hell. The game is divided into three nine-level episodes. The Ultimate Doom, an updated release of the original game featuring the fourth episode, came out in 1995.\nWith one third of the game (nine levels) distributed as shareware, Doom was played by an estimated 10 million people within two years of its release, popularizing the mode of gameplay and spawning a gaming subculture; as a sign of its effect on the industry, games from the years 1994-1997 boom of first-person shooters are often known simply as &quot;Doom clones&quot;. As such, Doom is widely known as one of the most important video games of all time for having popularized the first-person shooter genre, pioneering immersive 3D graphics, networked multiplayer gaming, and support for customized additions and modifications via packaged files in a data archive known as &quot;WADs&quot;. Its graphic and interactive violence, as well as its satanic imagery, also made it the subject of considerable controversy.\n\nDOOM:\nGenre: First-person shooter\nDeveloper: id Software\nPublisher: id Software\nRelease Date: December 10, 1993\n\n\nInstallation Instructions:\nJust download the game and play it!\n[/spoiler]","torrent":{"xt":"urn:btih:6ccfec5195cca214bbde182c59d2770c69a26d10","amp;dn":"Doom+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ccfec5195cca214bbde182c59d2770c69a26d10","infoHashBuffer":{"type":"Buffer","data":[108,207,236,81,149,204,162,20,187,222,24,44,89,210,119,12,105,162,109,16]},"announce":[],"urlList":[]}}