{"title":"Windward v16.05.2015","uid":11931149,"size":53702758,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6d23994224035b2d5e3411a147cc3cdee45626fe&amp;dn=Windward+v16.05.2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dauphong","files":1,"time":1431803576,"description":"About This Game\nDesigned from the start to be a fully procedural co-op game, Windward can be played both by yourself and with friends. Start by generating a procedural world that will be unique to you, then sail forward fighting pirates, trading with towns, doing quests or simply exploring -- it's up to you how you want to play.\n\nAs you sail about you will find resources you can make use of, upgrades for your ship, new towns that will ask your assistance, and as you get farther out from the starting area -- various pirates that will attempt to take what's rightfully yours. Combat experience will let you unlock new talents and abilities to make that particular line of work easier.\n\nAs you take up consignments with towns and fulfill their production shortages, the towns will grow, offering more quests, more resources and better items. As the towns continue to grow they will offer you a choice to upgrade your ship itself. Would you prefer a fast Schooner to explore the world, or a heavy Galleon that's able to take up 5 consignments at once? Or perhaps a massive Ship of the Line to take the fight with the pirates to their heartlands?\n\nAs you explore the world and get farther away from your starting area, the game will become progressively more difficult -- but so will the rewards. Throughout all of this you can expect the pirates to put up a fair fight, as the AI is bound by the same rules as the player: they have sight, and must explore the map before they can know what's there.\n\nSpeaking of AI, build a fearsome reputation and the AI will respect you, even fear you -- avoiding you if at all possible. Some friendly AI will even choose to follow you and assist you in your own adventures.\n\nAnd so, on the topic of adventures -- ready to have yours?","torrent":{"xt":"urn:btih:6d23994224035b2d5e3411a147cc3cdee45626fe","amp;dn":"Windward+v16.05.2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d23994224035b2d5e3411a147cc3cdee45626fe","infoHashBuffer":{"type":"Buffer","data":[109,35,153,66,36,3,91,45,94,52,17,161,71,204,60,222,228,86,38,254]},"announce":[],"urlList":[]}}