{"title":"Paul Scheele - Abundance For Life","uid":8687664,"size":1565608981,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d5d44dcae94b10d89d8138f1aabd408120672f0&amp;dn=Paul+Scheele+-+Abundance+For+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"neoisp","files":187,"time":1373835335,"description":"Some of the blurb:\n\n***\n\nCall it supercharged serendipity, even blessed luck. It is when things go your way and all you can do is shout to the heavens, &quot;Thank you!&quot;\n\nWe figured out how to bottle it!\n\nWe began sharing our findings in one of our retreats....\n\nCharlotte Ward was there. She is co-author of &quot;Simply Live it UP!&quot; and an accomplished PhotoReading instructor who lives in Bethesda, Maryland.\n\nShe was asked to participate in a network television show. The producer, who liked her work in accelerated learning, needed to see an audition video. But Charlotte had never been on TV.\n\nWe attempted to squeeze her in for a taping session with our video crew when she was here for the retreat, but we ran out of time. She flew home out of luck, or so we all thought.\n\nYou see, at the retreat she had opened a flow of abundance. Within a week I got an unexpected telephone call from a producer at WNBC in New York. They wanted to do a segment on PhotoReading. I said an instructor was already scheduled to be in New York for a class on November 7, but they wanted someone sooner.\n\nEureka! This would be perfect for Charlotte, I thought. In a heartbeat, Charlotte was on a train to teach a special class of law students for a segment in their &quot;Today Show.&quot; She got the video she needed for the other network show!\n\nWhen you open the flow of energy as our system will show you, health, wealth, abundance, and power come your way - automatically on their own, without your having to do anything more - all to serve you, to make you happy. Just ask Paul Scheele:\n\n \n\n***\n\nFrom a personal perspective, this course is a lesson in Spirituality, a bit along the lines of Abraham Hicks.\n\nEnjoy.","torrent":{"xt":"urn:btih:6d5d44dcae94b10d89d8138f1aabd408120672f0","amp;dn":"Paul+Scheele+-+Abundance+For+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5d44dcae94b10d89d8138f1aabd408120672f0","infoHashBuffer":{"type":"Buffer","data":[109,93,68,220,174,148,177,13,137,216,19,143,26,171,212,8,18,6,114,240]},"announce":[],"urlList":[]}}