{"title":"Roger Love - The Perfect Voice","uid":9477170,"size":275997030,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6e2402671647334929f2c8e2862289a6fff88e6b&amp;dn=Roger+Love+-+The+Perfect+Voice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"yTSa6","files":-1,"time":1389723612,"description":"\nVoice Training\nDo you like the sound of your voice?\n\nTake a moment and listen to your own voice. Say something aloud, or better yet, listen to the greeting on your voice mail. Do you like what you hear? Many people don't, and yet that's the voice everyone is hearing and judging you by. You might not realize it, but your professional success, personal happiness, and satisfaction in life is directly linked to your ability to communicate. And by communicate, we're not just talking about the words you use. In fact, your vocabulary only counts for about 7% of whether or not people deem you to be smart, funny, strong or successful. More importantly, tonality, the sounds your voice makes aside from the words, counts for more than 38%. The Perfect Voice's speech therapy materials teach you how to understand and use tonality to your advantage for effective communication.\n\nUse Roger Love's Vocal Lessons &amp; Change What Is Wrong With Your Voice!\n\nIf you really want to change your life, the most immediate and effective way is to CHANGE THE WAY YOU SOUND! Because chances are, if you don't like the way you sound, neither do the people who are listening, or NOT listening to you. The Perfect Voice, an amazing new and exclusive vocal training system to improve your communication skills has been developed and presented by Roger Love, America's Favorite Vocal Coach, teaches you the tips and techniques used by some of the most famously successful speakers of our time like Anthony Robbins, John Gray, Dr. Laura Schlessinger, Glenn Beck and Suze Orman. Roger has also trained many of the biggest singing stars including John Mayer, Maroon 5, Matchbox 20, The Jacksons, Chicago, Def Leppard, The Jonas Brothers, Eminem and many more. Read the success stories of these people and learn how Roger's voice lessons changed their lives!","torrent":{"xt":"urn:btih:6e2402671647334929f2c8e2862289a6fff88e6b","amp;dn":"Roger+Love+-+The+Perfect+Voice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2402671647334929f2c8e2862289a6fff88e6b","infoHashBuffer":{"type":"Buffer","data":[110,36,2,103,22,71,51,73,41,242,200,226,134,34,137,166,255,248,142,107]},"announce":[],"urlList":[]}}