{"title":"El.Libro.Del.Masaje","uid":5486345,"size":22320722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ee543426e17cd2db28463e20548d89f2c3ca434&amp;dn=El.Libro.Del.Masaje&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"furtaperas","files":3,"time":1270741131,"description":"Todo el mundo necesita relajarse, escapar de la tiranÃƒÂ­a del tiempo. Escuchando mÃƒÂºsica, contemplando el movimiento de las nubes, o buscando piedras y conchas en la orilla del mar, serenamos nuestro espÃƒÂ­ritu y recobramos el sentido de nuestra propia integridad en la inocencia del momento. En nuestra infancia nos subÃƒÂ­amos a los ÃƒÂ¡rboles y correteÃƒÂ¡bamos descalzos: nos sentÃƒÂ­amos a gusto con nosotros mismos, al estar en contacto con nuestra naturaleza elemental. Sin embargo, cuando crecemos y nos hacemos adultos, pasamos cada vez mÃƒÂ¡s tiempo realizando actividades estrictamente intelectuales.\n\nAhora es el momento de restablecer el equilibrio y retornar al cuerpo, redescubriendo el agradable arte del tacto. Es un lenguaje comÃƒÂºn, que podemos emplear para curar y para tranquilizar, para transmitir el hecho de que queremos ayudar. Como un claro en el bosque nos otorga un momento de paz para orientarnos y relajarnos.\n\nEl masaje nos proporciona un medio de hacer frente a la continua oleada de trabajo y de presiones cotidianas. Para la gran mayorÃƒÂ­a de nosotros. la rigidez y el dolor son una forma de vida a la que nos hemos habituado, y con frecuencia no nos damos cuenta de que nuestros mÃƒÂºsculos estÃƒÂ¡n tensos, ni llegamos a ver cuÃƒÂ¡nta energÃƒÂ­a se consume por la tensiÃƒÂ³n hasta el momento en que damos o recibimos un masaje. El masaje puede significar un viaje hacia la comprensiÃƒÂ³n de nosotros mismos, en el que se nos revelarÃƒÂ¡ el sentimiento de estar relajados y en armonÃƒÂ­a con nosotros mismos, al tiempo que experimentaremos el placer de sentir que nuestro cuerpo puede respirar v moverse con libertad.\n","torrent":{"xt":"urn:btih:6ee543426e17cd2db28463e20548d89f2c3ca434","amp;dn":"El.Libro.Del.Masaje","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ee543426e17cd2db28463e20548d89f2c3ca434","infoHashBuffer":{"type":"Buffer","data":[110,229,67,66,110,23,205,45,178,132,99,226,5,72,216,159,44,60,164,52]},"announce":[],"urlList":[]}}