{"title":"The Fash (52 Universe) 0-33 + Annuals (Digital) (Shining Knight-","uid":10622721,"size":870687735,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6efc589f5f840c996d8ad606dc7b46dfadde923d&amp;dn=The+Fash+%2852+Universe%29+0-33+%2B+Annuals+%28Digital%29+%28Shining+Knight-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1406187169,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\nDC Comics relaunched The Flash with issue #1 in September 2011, with writing and art chores handled by Francis Manapul and Brian Buccellato as part of DC's company-wide title relaunch, The New 52. As with all of the books associated with the DC relaunch, Barry Allen appears to be about five years younger than the previous incarnation of the character. Superheroes at large have appeared only in the past five years, and are viewed with at best, suspicion, and at worst, outright hostility. In this new continuity, Barry's marriage to Iris West never took place, and he is instead in a relationship with longtime co-worker Patty Spivot. In this new series, the Flash draws deeper into the Speed Force, enhancing his mental abilities while still trying to get a full grasp on his powers, which he doesn't yet exert total control over.\n\nAs revealed in issue #0 of the current series, Barry Allen's father was placed in prison for the murder of his mother. While the evidence seems to indicate his father's guilt, Barry makes proving his father's innocence a priority. The murder occurred shortly after Barry returned victorious from a school spelling bee, and Barry placed the trophy he won on his mother's grave in her memory. Barry is also part of the main cast of the relaunched Justice League series, making his debut in the series' second issue.\n\n\n\n\n\nThanks goes to ShiningKnight and Avalon for this release.\n\n","torrent":{"xt":"urn:btih:6efc589f5f840c996d8ad606dc7b46dfadde923d","amp;dn":"The+Fash+%2852+Universe%29+0-33+%2B+Annuals+%28Digital%29+%28Shining+Knight-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6efc589f5f840c996d8ad606dc7b46dfadde923d","infoHashBuffer":{"type":"Buffer","data":[110,252,88,159,95,132,12,153,109,138,214,6,220,123,70,223,173,222,146,61]},"announce":[],"urlList":[]}}