{"title":"The Real Mrs. Brown, Brendan O'Carroll - Brian Beacom [Epub &amp;amp","uid":9869304,"size":2934605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f486e6149c2e430134cfa0b187a85e91023d4b7&amp;dn=The+Real+Mrs.+Brown%2C+Brendan+O%27Carroll+-+Brian+Beacom+%5BEpub+%26amp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"krystine","files":-1,"time":1396395066,"description":"Description\nThe Real Mrs. Brown: The Authorised Biography of Brendan O'Carroll\nAuthor: Brian Beacom\nPublished: 2013\nPublisher: Hodder &amp; Stoughton\nISBN: 9781444754548\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\nWho'd have thought a potty-mouthed Dublin mammy with a cream cardigan and elasticated tan tights could storm British TV screens and leave a nation helpless with laughter? Brendan O'Carroll performs to tens of thousands of people a night in packed-out stadiums across the country. In the last four Mrs Brown's Boys has become a number 1 ratings success and he's even making a movie. But Brendan has had to battle hard for success. The youngest of eleven children, his mother was Maureen O'Carroll, a former nun who went on to become the first woman to be elected to the Irish parliament. Brendan adored his strong, widowed mother - and she later became the inspiration for his indomitable character Agnes Brown. However, the family endured poverty reminiscent of Angela's Ashes and Brendan saw no option but to leave school at 12 to work. He married young and for decades struggled to make ends meet. Eventually, bankrupt and desperate, Brendan went to see a fortune teller who told him she could see his future achieving worldwide success as a comedian and actor. At first Brendan laughed at the notion, but then he thought of how much his friends loved his gags, and decided to give it a go... This is the magical story of how a loveable Irishman with a wig and a wit as caustic as battery acid surprised everyone - most of all himself - by becoming one of the best-loved comedians in the world. It is a story of hardship, heartbreak, and talent and will remind readers afresh that sometimes the facts can be even more extraordinary than the fiction. ","torrent":{"xt":"urn:btih:6f486e6149c2e430134cfa0b187a85e91023d4b7","amp;dn":"The+Real+Mrs.+Brown%2C+Brendan+O%27Carroll+-+Brian+Beacom+%5BEpub+%26amp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f486e6149c2e430134cfa0b187a85e91023d4b7","infoHashBuffer":{"type":"Buffer","data":[111,72,110,97,73,194,228,48,19,76,250,11,24,122,133,233,16,35,212,183]},"announce":[],"urlList":[]}}