{"title":"Malcolm in the Middle - Complete","uid":13361917,"size":28710971116,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6f87d3b89cf23fb43baa04f3e6664a814dfecddd&amp;dn=Malcolm+in+the+Middle+-+Complete&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"roflcopter2110","files":157,"time":1454137005,"description":"Complete series of Malcolm in the Middle, seasons 1-7 (2000-2006 on FOX)\r\n\r\n\r\n\r\nDVD AND HDTV/PDTV QUALITY\r\n\r\n\r\n\r\nSEASONS 2, 4, 5, 6, 7: Widescreen HDTV/PDTV rips (mostly on Sky One and FOX)\r\n\r\nSEASON 1: Fullscreen DVD-rip (currently only season on DVD, released October 29, 2002)\r\n\r\nSEASON 3: Fullscreen PDTV quality, but good.\r\n\r\n\r\n\r\nPLEASE SEED WHEN COMPLETED. I can't seed this forever, and there has been months where I have been the only seeder. If there are no seeders, send me a PM and I will start seeding it again.\r\n\r\n\r\n\r\nThis previously-private torrent is now publicly released by the largest Malcolm in the Middle fansite (and still incredibly active even 2 years after the show's ending):\r\n\r\nMalcolm in the Middle Voting Community http://www.malcolminthemiddle.co.uk/. Join us today! \r\n\r\n\r\n\r\nMalcolm in the Middle is a seven-time Emmy-winning, one-time Grammy-winning and seven-time Golden Globe-nominated critically-acclaimed American sitcom created by Linwood Boomer for the Fox Network. The show starred Frankie Muniz as Malcolm, the third-born of 4, then 5 later in the series, sons of Lois (Jane Kaczmarek) and Hal (Bryan Cranston). The eldest, Francis (Christopher Masterson), was shipped off to military school, leaving 3 brothers: Reese (Justin Berfield), Malcolm, Dewey (Erik Per Sullivan) and starting in season four Jamie (James and Lukas Rodriguez) living at home, Malcolm being the middle child still at home (hence the show's title). The show's early seasons centered on Malcolm and the rigors of being an adolescent genius and enduring an eccentric, although eerily normal, life. Later seasons gradually explored the other members of the family and their friends in more depth.\r\n\r\n\r\n\r\nThe series was different from many others in that Malcolm broke the fourth wall and talked directly to the viewer; it was shot using a single camera; and it used neither a laugh track nor a live studio audience, just sound effects. Emulating the style of hour-long dramas, this half-hour show was shot on film instead of video. Another unique aspect is that the cold open of every episode is unrelated to the main story. Exceptions were episodes which were the conclusions of &quot;two-parters&quot;; these episodes opened with a summary of part one and Bryan Cranston (Hal) saying &quot;Previously on Malcolm in the Middle&quot; in a humorous manner.\r\n\r\n\r\n\r\nIMDb (8.3/10): http://www.imdb.com/title/tt0212671/\r\n/&gt;\r\nWikipedia: http://en.wikipedia.org/wiki/Malcolm_in_the_Middle\r\n/&gt;\r\nTV.com (8.9/10): http://www.tv.com/malcolm-in...dle/show/248/summary.html\r\n/&gt;\r\nEpisode guide: http://www.malcolminthemiddle.co.uk/episodes/","torrent":{"xt":"urn:btih:6f87d3b89cf23fb43baa04f3e6664a814dfecddd","amp;dn":"Malcolm+in+the+Middle+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f87d3b89cf23fb43baa04f3e6664a814dfecddd","infoHashBuffer":{"type":"Buffer","data":[111,135,211,184,156,242,63,180,59,170,4,243,230,102,74,129,77,254,205,221]},"announce":[],"urlList":[]}}