{"title":"War God by Graham Hancock","uid":9238465,"size":750074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fb858305b5b97062e2900a37a58f61771ea2a6e&amp;dn=War+God+by+Graham+Hancock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":4,"time":1385226058,"description":"A young girl called Tozi stands at the bottom of a pyramid, waiting to be led to the top where her heart will be cut out... \nPepillo, a Spanish orphan who serves a sadistic Dominican friar, is aboard the Spanish fleet as it sails towards Mexico... \nThis is the epic story of the clash of two empires, two armies and two gods of war. Five hundred desperate adventurers are about to pit themselves against the most brutal armies of the ancient Americas, armies hundreds of thousands strong. \nThis is a war of gods and men. Dark powers that work behind the scenes of history show their hand as the prophecy of the return of Quetzalcoatl is fulfilled with the arrival of Cortes. The Aztec ruler Moctezuma fights to maintain the demands of the war god Huitzilopochtli for human sacrifice. The Spanish Inquisition is planning an even greater blood-letting. \nCaught up in the headlong collision between two gods of war are Tozi, Pepillo and the beautiful sex slave Malinal whose hatred of Moctezuma runs so deep she will sell out her own land and people to destroy him","torrent":{"xt":"urn:btih:6fb858305b5b97062e2900a37a58f61771ea2a6e","amp;dn":"War+God+by+Graham+Hancock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb858305b5b97062e2900a37a58f61771ea2a6e","infoHashBuffer":{"type":"Buffer","data":[111,184,88,48,91,91,151,6,46,41,0,163,122,88,246,23,113,234,42,110]},"announce":[],"urlList":[]}}