{"title":"Jorge Luis Borges &amp; Norman Thomas di Giovanni - Complete Wor","uid":8800257,"size":10664025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fe276cfd70a1b91d85876b96fea3992727e3568&amp;dn=Jorge+Luis+Borges+%26amp%3B+Norman+Thomas+di+Giovanni+-+Complete+Wor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"erasmophilus","files":12,"time":1376181435,"description":"Jorge Luis Borges &amp; Norman Thomas di Giovanni - The Complete Works in PDF\n\nGreat thanks to the original creator of these ebooks.\n\nHere are his words:\n\n===\n\nThis is part of a series of ebook conversions from print editions of the Norman Thomas di Giovanni translations of Jorge Luis Borges' books. Borges and di Giovanni worked in collaboration on the translations, enjoying a long and fruitful working relationship and friendship that resulted in a series of translations that captured the original Spanish intentions of Borges and that provided an additional dimension to the English translations with the help of di Giovanni. Borges, who spoke English fluently, said with characteristic humility that he had too much respect for the English language to translate the books himself.\n\nBecause of the amount of work involved on the part of di Giovanni, sometimes including working on the English translations of the stories at the same time as the Spanish was being written, Borges granted him a unique royalty arrangement where proceeds would be split between the two evenly.\n\nOn Borges' death, his estate was passed onto his wife of only a few months, Maria Kodama. Kodama reneged on the original deal struck by Borges and di Giovanni, barred publication of the di Giovanni translations and took a series of legal actions to prevent the translations being sold. She commissioned new translations by Andrew Hurley so the bulk of the money could go to Borges' estate - or, more bluntly, to her. Hurley's translations are deficient in a number of respects; but the area in which they lack most is that Hurley was not, like di Giovanni, a friend and colleague of Borges with an insight into his life or the ability to check the final translations with Borges.\n\nThese ebooks have been created with the aim of preserving the original translations di Giovanni was involved in. Unfortunately, because the books are old and in some cases library books, it was not possible to just simply use the images, as imperfections in the scans and sometimes considerable marks on the pages meant that they would not be legible. The decision was taken to create streamlined, smaller PDFs using text only.\n\n===\n\nList of titles:\nJorge Luis Borges translated by Norman Thomas di Giovanni - A Universal History of Infamy\nJorge Luis Borges translated by Norman Thomas di Giovanni - Doctor Brodie's Report\nJorge Luis Borges edited by Norman Thomas di Giovanni (various translators) - Selected Poems 1923 - 1967\nJorge Luis Borges translated by Norman Thomas di Giovanni - The Congress\nJorge Luis Borges translated by Norman Thomas di Giovanni - The Book of Imaginary Beings\nJorge Luis Borges translated by Norman Thomas di Giovanni - Evaristo Carriego: A Book About Old Time Buenos Aires\nJorge Luis Borges &amp; Adolfo Bioy-Casares translated by Norman Thomas di Giovanni - The Chronicles of Bustos Domecq\nJorge Luis Borges edited by Norman Thomas di Giovanni, Daniel Halpern and Frank MacShane - Borges on Writing\nJorge Luis Borges translated by Norman Thomas di Giovanni - In Praise of Darkness\nJorge Luis Borges &amp; Adolfo Bioy-Casares translated by Norman Thomas di Giovanni - Six Problems for Don Isidro Parodi\nJorge Luis Borges translated by Norman Thomas di Giovanni and Alastair Reid - The Book of Sand/The Gold of the Tigers\nJorge Luis Borges translated by Norman Thomas di Giovanni - The Aleph and Other Stories 1933-1969","torrent":{"xt":"urn:btih:6fe276cfd70a1b91d85876b96fea3992727e3568","amp;dn":"Jorge+Luis+Borges+%26amp%3B+Norman+Thomas+di+Giovanni+-+Complete+Wor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe276cfd70a1b91d85876b96fea3992727e3568","infoHashBuffer":{"type":"Buffer","data":[111,226,118,207,215,10,27,145,216,88,118,185,111,234,57,146,114,126,53,104]},"announce":[],"urlList":[]}}