{"title":"Huichol Shamanism","uid":4196287,"size":1220572202,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:703eb463180d52a2c651a65cc5e971c78a09430b&amp;dn=Huichol+Shamanism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"munaysonko","files":5,"time":1211235734,"description":"Peyote to LSD: A Psychedelic Odyssey &lt;a href=&quot;\nhttp://www.history.com/shows.do?episodeId=281380&amp;action=detail&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.history.com/shows.do?episodeId=281380&amp;action=detail&lt;/a&gt;\n\nVirarica &lt;a href=&quot;\nhttp://www.shamanism.com/video.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shamanism.com/video.htm&lt;/a&gt;\nshamanism.com\n\nThe Last of the Medicine Men (BBC, Peyote) 1/2 [28m:39s]\nThe Last of the Medicine Men (BBC, Peyote) 2/2 [28m:39s]\n\na BBC documentary in which Benedict Allen is allowed to join the Huichol on their spiritual journey through the state of Zacatecas to the place Wirikuta.\n\n\nThe Huichol Indians are an indigenous ethnic group that lives in the Sierra Madre Occidental in the Mexican states Jalisco and Nayarit. The population is around 20.000 people.\n\nHistory\nThe Huichol originate from the State of San Luis Potosi. A story tells that the Huichol had a prophecy that said that fake gods would once come. When the Spaniards arrived in the 16th century the Aztecs honoured the Spaniards believing they were gods. So the Aztecs were conquered quite easy. Unlike the Aztecs the Huichol survived by escaping to the West, into the safe hills of the Sierra Madre Occidental. The Huichol can still be found here. By keeping distance from society they were able to secure most of their ancient traditions for centuries. Even though the Aztec, Spaniards and Mexicas have been and are (in case of\n\nThe Huichol are still living quite autonomous. They have two governments: one is autonomous and one&amp;#039;s function is all about doing business with the Mexican government. In the past the Huichol didn&amp;#039;t want to have anything to do with politics, but recently this changed. Currently they have a mayor in a couple of communities.\n\nLocation\nThe three main Huichol communities in Jalisco are called Santa Maria Cuexcomatitlan, San Andres Cohamiata and San Sebastian Teponohuastlan. In their own language, &amp;#039;Huichol&amp;#039;, they call themselves &amp;#039;Wixarika&amp;#039;, which means wizard. Once a year the Huichol undertake a ceremonial pilgrimage, through the states of Durango and Zacatecas back to their roots in the state of San Luis Potosi. The journey used to take them about 4 months, since they would go all the way by foot. Nowadays there is a road through the sacred desert of Zacatecas so they will rent a bus for the first part of the trip.\n\nBefore undertaking the trip, a mini society is formed from the people that will go. Everybody in this society has a task. From cutting wood and making sure it has the right length, to cleaning the area from litter. The area is secred to the Huichol. So one should keep it clean. Unfortunately not all the people that visit this area respect Mother Nature as the Huichol and pollute. Once the region was a forest with lakes, now it is a desert that suffers on the human impact from agriculture. Huichol even have to negotiate to be able to travel through certain spaces of the desert, since the land is occupied by cattle and owned by individual farmers.\n\nSince the Huichol want to live as independent as possible, they have their own agriculture. They will for example grow their own maize, which has been and still is the most important crop for all indigenous people in Mexico. For their journey back to their original homeland the Huichol depend on the harvests of the maize. They can not travel if there is work to do. So they will travel in between the harvest. Now that they can rent a bus, the trip will take approximately a month. Three months less than it used to be.\n\nReligion\nLike the ancient civilizations, such as the Maya and Aztecs, they also believe that there is another world were the Gods live together with their ancestors. The Huichol are closely connected to nature. They believe that everything is made out of energy and try to live in harmony with nature. The deities and their ancestors can be found in the creations of Mother Nature, from animals to plants and rocks. The Huichol religion consists of four principal deities: The trinity of Corn-Blue Deer-Peyote and the Eagle, all descended from their Sun God, &amp;#039;Tao Jreeku&amp;#039;. Most Huichols retain the traditional beliefs and are resistant to change. The deer is one of the most important animals since it is their guide to the spirits. This spirit guide is called &amp;#039;Karuymahli&amp;#039;. It will lead shaman to the spirits by providing visionairy pathways.\n\nSymbolism\nBelow is the symbolism behind the animals:\n\n   * Deer (&amp;#039;Mahjrah&amp;#039;): Spirit guide or &amp;#039;Karuymahli&amp;#039;. The deer mother is called &amp;#039;Tah Tay Mahjrahlee&amp;#039;, guardian spirit. Most important animal in Huichol shamanism.\n   * Eagle (&amp;#039;Weilika&amp;#039;): Mother Eagle, mother of the sky. Most important bird. A symbol of a two-headed eagle represents the God of Duality, where opposites become one.\n   * Salamander: Rain Mother. Will stirr up clouds and make rain fall.\n   * Mountain lion (&amp;#039;Mayetze&amp;#039;): Messenger of &amp;#039;Tatewali&amp;#039;, the God of Fire.\n   * Snake: Intermediair between humans and spirit world. Instruct shamans to become healers. Rattle snakes are the tongue of the greatest shaman of all, the Fire God.\n   * Horned toads (&amp;#039;Teh-Kah&amp;#039;): Respected as shaman&amp;#039;s allies, as they can squirt blood from their eyes.\n   * Wolves (&amp;#039;Kumukite&amp;#039;): Carrier of spirits. Honored in all peyote ceremonies.\n   * Turtles: Assistants of the Rain Goddessess.\n   * Scorpions (&amp;#039;Terlukas&amp;#039;): Used to prevent evil and bad luck that might come on the way of the Huichol. A deadly scorpion lives in the Huichol homeland that causes numerous fatalties every year.\n\nHuichol_bracelet_2\n\nBracelet with Huichol symbolism. Given to me by Lolita, a Huichol lady in El Colomo, which sells souvenirs.\n\nPeyote\nPeyote, the divine cactus, gives shamans the power to enter a different realm and communicate with the spirits there. While eating Peyote the alcaloids from the cactus will cause a hallucinogenic effect. Peyote is illegal in Mexico. There is a special law that allows Huicholes to have and use it since this forms a key element in their religion. The ceremonial journey to San Luis Potosi is all about finding this sacred plant. The sacred plant will let the people enter a new world. To be able to enter the new world the travellers will have to leave the old world behind. Therefore they will rename everything in their environment. Living on a minimum of food is part of the journey, as well is a confession of (sexual) sins to purify the soul. One can not have any secrets, otherwise the Peyote will find out. Also one can not have any negative feelings towards other members of the minisociety. Before visiting the Peyote grounds some sacred places have to be visited and ceremonies will take place. The Huichol prepare their arrows with feathers and deer blood. Those arrows will have to carry their prayers to the gods when the enter the Peyote grounds.\n\nPeyote\n\nPeyote (Lophophora williamsii)\n\nEvery year there seems to be less Peyote in the desert, compared to the year before. Some people will take the Peyote to sell it in the States as a recreational drug. Peyote has a very heavy psychedelic effect and can if not taken under right circumstances there is a great risk of going crazy (bad trip). Another reason for a lack of Peyote are the ranchers taking over the land. They destroy the cactus. The Huichol themselves never cut the root of the cactus hoping there will be enough in the future. The amount of Peyote the Huichol tells if they have been doing good the past year. No Peyote means trouble.\n\nOnce the Peyote is found a ceremony will be held. The arrows with the messages of the prayers will be put in the ground. Everybody will eat Peyote. The people will form a circle, with the shaman in the middle. The shaman might wear the head of a deer as a mask and the skin of a deer on his back, to become able to interact with the spirits.\n\nAfter the ceremony the attendants will share there experiences and take their new understandings home to their families. For those who would like to visit San Sebastian: Vallarta Adventures offers a tour by land to this mountain village, leaving from Puerto Vallarta. The Huicholes can also be visited by air.","torrent":{"xt":"urn:btih:703eb463180d52a2c651a65cc5e971c78a09430b","amp;dn":"Huichol+Shamanism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"703eb463180d52a2c651a65cc5e971c78a09430b","infoHashBuffer":{"type":"Buffer","data":[112,62,180,99,24,13,82,162,198,81,166,92,197,233,113,199,138,9,67,11]},"announce":[],"urlList":[]}}