{"title":"COD Black Ops II ALL DLC","uid":8944948,"size":16159504384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:703f2752345bd4438dcfaef9612885fa82abcfe1&amp;dn=COD+Black+Ops+II+ALL+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"RYBI4","files":1,"time":1379752487,"description":"Call of Duty is a first-person and third-person shooter computer/video game franchise. The series began on the PC, and later expanded to consoles and handhelds. Several spin-off games have also been released. The earlier games in the series are set primarily in World War II, including Call of Duty, Call of Duty 2, and Call of Duty 3. Beginning with Modern Warfare, which is set in modern times, the series has shifted focus away from World War II. Call of Duty 4: Modern Warfare (released November 2007) was followed by Call of Duty: World at War and Call of Duty: Modern Warfare 2. Black Ops (released November 2010) takes place in the Cold War, while Modern Warfare 3 (released November 2011) takes place in the near-future setting. Black Ops 2 (released November 2012) takes place in the year 2025.\nThe Call of Duty games are published and owned by Activision. While the studio Infinity Ward primarily still develops them, Treyarch has also developed several of the titles with the release of the studios' games interlaced with each other. Some games have been developed by Gray Matter Interactive, Nokia, Exakt Entertainment, Spark Unlimited, Amaze Entertainment, n-Space, Aspyr, Rebellion Developments, Ideaworks Game Studio, Sledgehammer Games and nStigate Games. The games use a variety of engines, including the id Tech 3, the Treyarch NGL, and the IW 5.0. Other products in the franchise include a line of action figures designed by Plan-B Toys, a card game created by Upper Deck, and a comic book mini-series published by WildStorm. As of November 11, 2011, the Call of Duty series has sold over 100 million copies.[1] As of March 31, 2012 there are 40 million monthly active players across all of the Call of Duty titles, with 10 million Call of Duty: Elite users and 2 million paying annual members. Over 1.6 billion hours of online gameplay have been logged Modern Warfare 3 since its 2011 release.[2]","torrent":{"xt":"urn:btih:703f2752345bd4438dcfaef9612885fa82abcfe1","amp;dn":"COD+Black+Ops+II+ALL+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"703f2752345bd4438dcfaef9612885fa82abcfe1","infoHashBuffer":{"type":"Buffer","data":[112,63,39,82,52,91,212,67,141,207,174,249,97,40,133,250,130,171,207,225]},"announce":[],"urlList":[]}}