{"title":"Kate &amp; Anna McGarrigle - Tell My Sister - 3CD-BOX 2011","uid":6569740,"size":751433932,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7077e7402c9bf2cc59d749f877e844eb60359667&amp;dn=Kate+%26+Anna+McGarrigle+-+Tell+My+Sister+-+3CD-BOX+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"barber9","files":-1,"time":1311887080,"description":"Kate (February 6, 1946 - January 18, 2010) and Anna (born December 4, 1944) McGarrigle, were a pair of Canadian singer-songwriters from Quebec, who performed as a duo until Kate McGarrigle's death on January 18, 2010.\n\n- - -\n\nAnna McGarrigle and Kate McGarrigle were born in Montreal of mixed English and French-Canadian background, but lived their childhood in the Laurentian Mountains village of Saint-Sauveur-des-Monts, Quebec, northwest of Montreal, where they learned piano from village nuns. In the 1960s, in Montreal, while Kate was studying engineering at McGill University and Anna art at the Ecole des Beaux-Arts de Montreal, they began performing in public and then began writing their own songs. From 1963-1967 they teamed up Jack Nissenson and Peter Weldon to form the folk group Mountain City Four. Kate and Anna McGarrigle continued to write, and recorded and performed music into the twenty first century with assorted accompanying musicians including: Gerry Conway, Pat Donaldson, Ken Pearson, Michel Pepin, Chaim Tannenbaum, and Joel Zifkin.\n\nTheir songs have been covered by a variety of artists including Maria Muldaur, Nana Mouskouri, Linda Ronstadt, Emmylou Harris, Billy Bragg, Chloe Sainte-Marie, Judy Collins, Anne Sofie von Otter, and others. The covers of their songs by well known artists led to the McGarrigles getting their first recording contract in 1974. They created ten albums from 1975 through 2008.\n\nAlthough associated with Quebec's anglophone community, the McGarrigles also recorded and performed many songs in French. Two of their albums, Entre la jeunesse et la sagesse (also known as French Record) and La vache qui pleure, are entirely in French, but many of their other records include one or two French songs as well. Most of their French songs were co-written by Philippe Tatartcheff, with occasional input from Kate McGarrigle's son, Canadian-American solo artist Rufus Wainwright. Rufus and his sister Martha Wainwright, also a singer, are the children of Kate and her former husband (married 1971, separated 1976, divorced 1978), singer-songwriter Loudon Wainwright III.\n\nThey have performed or recorded with the Irish group The Chieftains, Nick Cave and the Bad Seeds on their No More Shall We Part album, Emmylou Harris on her albums Bluebird, Wrecking Ball, Western Wall: The Tucson Sessions, Light of the Stable, Stumble into Grace, and All I Intended to Be, Lou Reed on his concept album The Raven, Joan Baez on her live recording Ring Them Bells, Gilles Vigneault on Charlie-Jos on his album Cest ainsi que jarrive a toi, and Robin Holcomb on her 2002 album The Big Time.\n\nTheir version of Wade Hemsworth's song, The Log Driver's Waltz grew famous as the soundtrack for a 1979 animated film by the National Film Board. They provided backing vocals on Nick Cave and the Bad Seeds's 2001 album No More Shall We Part. They appeared on the children's TV show Sharon, Lois &amp; Bram's Elephant Show in Season 4, episode 50 titled Sibling Rivalry.\n\nThey were appointed Members of the Order of Canada in 1993 and received the Governor General's Performing Arts Award in 2004.\n\nAnother sister, Jane McGarrigle, is a film and television composer who wrote and performed several songs with the duo, but was not a regular collaborator.\n\nKate died January 18, 2010 after fighting a rare form of cancer. She was 63 years old. (wikipedia)\n\n- - -\n\n2011 three CD set comprising remastered versions of Kate and Anna McGarrigle's beloved 1975 self-titled debut, its equally praised 1977 follow-up, Dancer With Bruised Knees; and a collection of previously unreleased songs, including solo and duo demos. \n\nThis box set is a rare delight. I have been familiar with Kate and Anna's work since 1975 and their first two albums have been constant and much loved companions. The idea of getting the demo tapes was exciting, but I was unprepared for their excellence. The third CD on previously unreleased work is awesome and Kate and Anna at the top of their game. There are songs here that are unfamiliar and one has to ask why work of this quality was cast aside. I wasn't expecting to find much of interest in the first two remastered CDs, I was so wrong. These works have been remastered by Joe Boyd. The clarity is wonderful. I am hearing things for the first time in 36 years. Thanks Anna and the family for this project. Everthing about it is perfect. I hope it sells well enough to inspire more releases and more demo recordings ... 'Cool River' and '(Land of the) Shining Birch Tree' are still hidden in a vault. The acclaim this duo deserve is long overdue!  (Peter Clarkson)\n\n- - -\n\nKate &amp; Anna McGarrigle - Tell My Sister 1971-1977\n(3CD Toronto Warner 2011)\n\nCD1  Kate &amp; Anna McGarrigle 1975\n\n 1. Kiss and say goodbye \n 2. My town \n 3. Blues in D \n 4. Heart like a wheel \n 5. Foolish you \n 6. Talk to me of Mendocino \n 7. Complainte pour Ste-Catherine  \n 8. Tell my sister \n 9. Swimming song \n10. Jigsaw puzzle of life  \n11. Go leave \n12. Travellin' on for Jesus\n\nCD2  Dancer with bruised knees 1977\n\n 1. Dancer with bruised knees \n 2. Southern boys \n 3. No biscuit blues \n 4. First born \n 5. Blanche comme la neige \n 6. Perrine ÃƒÂ©tait servante \n 7. Be my baby  \n 8. Walking song \n 9. NaufragÃƒÂ©e du tendre (Shipwrecked)  \n10. Hommage ÃƒÂ  Grungie \n11. Kitty come home \n12. Come a long way\n\nCD3  Tell My Sister (Demos &amp; Unreleased Recordings 1971-74)\n\n 1. The work song \n 2. Come back baby  \n 3. Jigsaw puzzle of life \n 4. Saratoga summer song  \n 5. Annie \n 6. On my way to town \n 7. Roses blanches \n 8. Heart like a wheel  \n 9. Kiss and say goodbye \n10. Southern boys \n11. Willie Moore \n12. Oliver, remember me?  \n13. My town \n14. Blues in E \n15. Walking song \n16. Tell my sister \n17. Over the hill \n18. Come a long way \n19. (Talk to me of) Mendocino \n20. Heart like a wheel \n21. (Talk to me of) Mendocino.\n","torrent":{"xt":"urn:btih:7077e7402c9bf2cc59d749f877e844eb60359667","amp;dn":"Kate+%26+Anna+McGarrigle+-+Tell+My+Sister+-+3CD-BOX+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7077e7402c9bf2cc59d749f877e844eb60359667","infoHashBuffer":{"type":"Buffer","data":[112,119,231,64,44,155,242,204,89,215,73,248,119,232,68,235,96,53,150,103]},"announce":[],"urlList":[]}}