{"title":"100 Most Strangest Mysteries","uid":6820652,"size":26050904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7083718ac73905cfc48407a8d080fab423e3a179&amp;dn=100+Most+Strangest+Mysteries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"freaktorrent07","files":-1,"time":1321374906,"description":"\n\n100 Most Strangest Mysteries \n\n\nNo one can know everything, but that's no reason not to try, not to mention that the pursuit of ultimate knowledge sure can be fun. Matt Lamy covers a vast array of topics in the arena of the unknown in his book, 100 Strangest Mysteries. It reads like a general survey college course for everything you want to know about interesting and unexplainable history. An equally good title for the book would be Strangest Mysteries 101. \nIn like manner to a college 101 course, Lamy's book provides enough information on each of the one hundred topics he addresses to satisfy some degree of curiosity. Readers won't finish the book and be ready to sit for comprehensive exams, but they will certainly be prepared to hold a cocktail conversation on folklore like Big Foot and lost relics such as the Ark of the Covenant. \nThe real beauty of the Matt Lamy's work comes as it wets the reader's appetite for more. The concise sections lay solid groundwork for further independent study for those who want desperately to know everything about everything or at least take pleasure in having strong knowledge in quirky facts. \nLamy writes about Ley Lines in the book. He notes how some scientists and others believe the lines provide mysterious connections across the globe. In like manner, people, places and poltergeists come together under one cover in 100 Strangest Mysteries to help the &quot;lay&quot; reader to connect geography and other phenomena that link strange and mysterious oddities of time and space. The book makes you think and wonder. It's a fun read.\n\n\n\nAuthor(s):\tMatt Lamy\nPublisher: Metro Books\nFormat:\tpdf\nISBN-10: 0760791929\nISBN-13: 978-0760791929\n","torrent":{"xt":"urn:btih:7083718ac73905cfc48407a8d080fab423e3a179","amp;dn":"100+Most+Strangest+Mysteries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7083718ac73905cfc48407a8d080fab423e3a179","infoHashBuffer":{"type":"Buffer","data":[112,131,113,138,199,57,5,207,196,132,7,168,208,128,250,180,35,227,161,121]},"announce":[],"urlList":[]}}