{"title":"Sexually Broken--Big breasted Asian Gaia totally destroyed by di","uid":10079993,"size":511839437,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7140f13baaae1e2fa018ae60b06c598983889a5a&amp;dn=Sexually+Broken--Big+breasted+Asian+Gaia+totally+destroyed+by+di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"merzedes","files":-1,"time":1398987252,"description":"Big breasted Asian Gaia totally destroyed by dick, fucked silly, epic deepthroat on huge cock! | Gaia | Matt Williams\n\nApril 30, 2014\n\n\niPod and Low bitrate MP4 + Pics.\n\n\nGaia is a cock slut, she loves it. She is truly addicted to the dick. A nymphomaniac that got into the industry to have better access to the top shelf cock she so strongly craves, Gaia is here today to get completely destroyed as only Sexuallybroken can deliver. This Asian sex doll is going to get her brains fucked right out of her pretty little skull.\n\nThe set up is simple, but simple is all you need. Hands cuffed behind the back and a hood is all it takes to make someone completely helpless. Tottering on her heels, Gaia can not see or anticipate a thing. We walk right up with a hard dick and put those cuffed hands to use. Gaia eagerly grasps the cock, anxious to get her full lips wrapped around it. We are nothing if not generous, and we remove the hood and drop her to her slutty little knees. She knows her place and opens up wide, a gleam in her eyes.\n\nIt is on. We have free and unfettered access to both ends of this big titted sex addict, and we make full use of it. Gaia is skullfucked without mercy as the drool pours out of her mouth and runs down her body. Her love of deepthroat is not false advertising, she takes every inch to the base, nose on the belly and tongue on the balls, a greedy grin dancing on her face. Her makeup and hair is quickly destroyed, those porn star looks slide off to reveal the animal underneath. Back and forth we flip her, using her cunt and face as we so desire. She cums repeatedly, helplessly, uncontrollably. The cock owns every inch of her.\n\nAdding the vibrator in and fingerblasting yet more orgasms out of that pounded pussy, Gaia is destroyed. She is reduced to a mewling, drool covered undone puddle of flesh that can not even sit up straight. it is a good look on her. We leave her dazed and swooning, covered in her own cum. This is what getting hit by the cock truck looks like.  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_30gaia/SexuallyBroken-Gaia-Matt-Williams-Big-breasted-Asian-Gaia-totally-destroyed-by-dick-fucked-silly-epic-deepthroat-on-huge-cock.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_30gaia/SexuallyBroken-Gaia-Matt-Williams-Big-breasted-Asian-Gaia-totally-destroyed-by-dick-fucked-silly-epic-deepthroat-on-huge-cock.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:7140f13baaae1e2fa018ae60b06c598983889a5a","amp;dn":"Sexually+Broken--Big+breasted+Asian+Gaia+totally+destroyed+by+di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7140f13baaae1e2fa018ae60b06c598983889a5a","infoHashBuffer":{"type":"Buffer","data":[113,64,241,59,170,174,30,47,160,24,174,96,176,108,89,137,131,136,154,90]},"announce":[],"urlList":[]}}