{"title":"Where.The.Lilies.Bloom.1974.VHSRip.Xvid-CG.avi","uid":11037721,"size":1256161280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71cdcb10dcb6ad839ad6500eb621f4b0595339bc&amp;dn=Where.The.Lilies.Bloom.1974.VHSRip.Xvid-CG.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"interuniversal","files":-1,"time":1410813684,"description":"Thanks to Godzilla.\n\nFormat:avi\n\nDirected by:William A. Graham\nProduced by:Robert B. Radnitz\nWritten by:Bill and Vera Cleaver (novel)\nStarring:Julie Gholson, Harry Dean Stanton, Rance Howard, Jan Smithers, Matthew Burrill, Helen Harmon\n\nMusic by Barbara Mauritz\n\nProduction company:Radnitz/Mattel Productions\n\nDistributed by:United Artists\n\nRelease dates:1974\n\nRunning time:97 min.\n\nLanguage:English\n\nPlot summary\n\nThe Luther family are poor sharecroppers living in the mountains of North Carolina. The father, Roy Luther (played by Rance Howard) is sickly and asks the second eldest daughter, Mary Call (played by Julie Gholson) to take over his role of father when he passes on. He instructs her not to tell anyone when he dies as doctors, undertakers and preachers &quot;just take money.&quot; When the authorities discover he is dead, the children will be split up and put in foster homes since none of them are of legal age.\n\nTheir landlord Kiser Peace, (played by Harry Dean Stanton), is interested in marrying the eldest daughter Devola (played by Jan Smithers). Roy Luther won't allow the marriage and makes Mary Call promise she won't let it happen after he dies. Mary Call and younger brother Romy (played by Matthew Burrill) help Kiser when is sick with pneumonia and Kiser agrees to sign the land back over to the Luther family.\n\nWhen Roy Luther dies, the children bury him on a mountain side in an unmarked grave and then go to elaborate lengths to keep anyone from finding out he is dead. The children rehearse over and over about what to say if asked about their father. Kisser continues his courtship of Devola with Mary Call doing all that she can to thwart his pursuit of her.\n\nThe Luther children scrimp and do all they can to eke out a living for themselves and even sell roots and herbs gathered from their land to the local pharmacist to use in medicines. Mary Call takes refuge in her journal and the essays she writes for school assignments catch the eye of her teacher who urges her not to waste her talent with words by settling for &quot;a life in the hills.&quot;\n\nWhen Kiser lands in the hospital after having been hit by a car, his nosy sister Goldie comes to the Luther house and demands they vacate the property. She says the paper that Kiser signed giving the Luthers back their land is worthless and orders them out in 48 hours. With no options left, a desperate Mary Call visits Kiser in the hospital and offers herself to him in marriage. Kiser would rather marry Devola and a distraught Mary Call blurts out that Roy Luther is dead. She threatens to kill Kiser if he tells anyone and storms out.","torrent":{"xt":"urn:btih:71cdcb10dcb6ad839ad6500eb621f4b0595339bc","amp;dn":"Where.The.Lilies.Bloom.1974.VHSRip.Xvid-CG.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71cdcb10dcb6ad839ad6500eb621f4b0595339bc","infoHashBuffer":{"type":"Buffer","data":[113,205,203,16,220,182,173,131,154,214,80,14,182,33,244,176,89,83,57,188]},"announce":[],"urlList":[]}}