{"title":"Minions (2015) Cam.mp4","uid":12085298,"size":305177555,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7203e7087f63c744ecee293a7343efb579b95e10&amp;dn=Minions+%282015%29+Cam.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"globeplus","files":1,"time":1435886810,"description":"Plot\n\nMinions are small, yellow pill-like creatures who have existed since the beginning of time, evolving from single-celled organisms into beings who have only one purpose: to serve history's most despicable masters. But after accidentally destroying all their masters, including a T. Rex, a caveman, an Egyptian pharaoh, a medieval king, a pirate captain, Genghis Khan, Napoleon and Dracula, they decide to isolate themselves from the world and start a new life in Antarctica. By 1968, the lack of a master drives them into depression, so one Minion named Kevin comes up with a plan to find a new one for his people. The rebellious teenage Minion Stuart volunteers to join Kevin by accident, while the lovable kid Minion Bob joins by begging Kevin, who thought he was too young.\n\nAfter a long journey, the Minions arrive at New York 42 years B.G (Before Gru), where they learn that Villain-Con, a villain convention where supervillains from around the world gather to search for henchmen, was to be held in Orlando, Florida. They manage to hitch a ride to Orlando. Coincidentally, the family who drove them there were criminals heading to Villain-Con as well. The Minions were impressed by some of the villains, including a sumo wrestler and an aquatic supervillain called Frankie Fish Lips. In the end, they attempted to become the henchmen for Scarlet Overkill, the world's first female supervillain. Hundreds of audience members rush on stage to participate in Scarlet's challenge, but they are eliminated easily by the supervillain. Amidst the confusion, Bob wins the challenge by swapping Scarlet's ruby with his teddy bear, Tim. Scarlet declares the Minions her new henchmen","torrent":{"xt":"urn:btih:7203e7087f63c744ecee293a7343efb579b95e10","amp;dn":"Minions+%282015%29+Cam.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7203e7087f63c744ecee293a7343efb579b95e10","infoHashBuffer":{"type":"Buffer","data":[114,3,231,8,127,99,199,68,236,238,41,58,115,67,239,181,121,185,94,16]},"announce":[],"urlList":[]}}