{"title":"The Great Wall of China 221 BC-AD 1644","uid":11836100,"size":54091073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72565963aa9466bce89d3d0027adaa42d871b1fe&amp;dn=The+Great+Wall+of+China+221+BC-AD+1644&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429741418,"description":"The Great Wall of China is the most extensive and famous example of fortification in the world. Charting its development from construction in the 7th century BC through to the present day, this account reveals the true history of the wall, and explores the myths that surround it.\n\nStretching over 4,000 miles, the Great Wall began as a collection of defensive walls built by the northern vassal states under the Chou dynasty. With the unification of China in 221 BC the walls were interlinked and extended to fight off the invaders from the North. The wall as it is seen today is almost entirely the result of major renovations that started with the founding of the Ming Dynasty in 1368 AD and took 200 years to complete.\n\nIncluded are details of what it was like to live within the wall, the ideas behind the defensive systems, how it was garrisoned and patrolled, and a discussion of how effective it was against attack. Through extensive examination of both ancient and modern sources, color maps, artwork and photographs, this book illustrates why the wall is one of the great wonders of the world","torrent":{"xt":"urn:btih:72565963aa9466bce89d3d0027adaa42d871b1fe","amp;dn":"The+Great+Wall+of+China+221+BC-AD+1644","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72565963aa9466bce89d3d0027adaa42d871b1fe","infoHashBuffer":{"type":"Buffer","data":[114,86,89,99,170,148,102,188,232,157,61,0,39,173,170,66,216,113,177,254]},"announce":[],"urlList":[]}}