{"title":"The Ultimate boot DVD Windows XP PRO/HOME SP3 (8 in 1) (TPB)","uid":4383772,"size":2604036236,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:725ca44cb7f164a4950d0ccaef570775c562534c&amp;dn=The+Ultimate+boot+DVD+Windows+XP+PRO%2FHOME+SP3+%288+in+1%29+%28TPB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Double0Sneaks","files":63,"time":1220806287,"description":"The Ultimate boot DVD Windows XP Pro/Home Editions SP3 Retail/Corporate X86 (8 in 1)\n\nThis ultimate boot DVD contains 6 different combinations of XP and some handy boot applications. Every Windows XP Edition is integrated with all Microsoft and Windows updates up-to September 2008. Also, no CD key is required as they're pre-slipstreamed with each edition.\n\n==XP editions;\n\n=(1) Windows XP Professional SP3 Retail with drivers       \n=(2) Windows XP Professional SP3 Retail without drivers    \n=(3) Windows XP Professional SP3 Corporate with drivers    \n=(4) Windows XP Professional SP3 Corporate without drivers \n=(5) Windows XP Home Edition SP3 Retail with drivers       \n=(6) Windows XP Home Edition SP3 Retail without drivers    \n\nThe Retail XP keys are not genuine so I included a working crack in the 'APPS' folder on DVD to activate and genuineise the retail XP's. The corporate XP's however, do not require a crack because the keys are genuine and will activate automatically. I included this crack because a retail license key is only valid for 3-5 installs! In the 'APPS' folder you will also find some silent installers such as, COMODO Firewall pro and windows live messenger.\n\n\n==Applications;\n\n=(1). Winternals ERD Commander 2007 \n\nDescription: ( http://epaloids.com/showthread.php?t=9768 )\nWhen your server or workstation won't boot, you need ERD Commander 2007. ERD Commander 2007 boots dead systems directly from CD into a Windows-like repair environment. you'll have full access to the dead system's volumes, so you can diagnose and repair problems using tools located on the ERD Commander 2007 Start menu. \n   And you'll have built-in network access to safely move data off of, or on to, the dead system. With ERD Commander 2007 you can repair a system quickly and easily, saving you time and rescuing your critical data.\n\n=There are 2 ERD Commander 2007 combinations in the boot menu to choose from;\n\n(1) ERD Commander 2007 \n(2) ERD Commander 2007 /inram\n\n=The differences are;\n\n(1) ERD Commander 2007 is the original ERD Commander\n(2) ERD Commander 2007 /inram has been modified to run in RAM memory, enabling you to remove the DVD from drive. Therefore, allowing you to insert another disc to recieve data off of it.\n\n\n=(2). Active@ killDisk - Hard drive eraser\n\nDescription: ( http://www.killdisk.com/ )\nActive@ KillDisk - Hard Drive Eraser is powerful and compact software that allows you to destroy all data on hard and floppy drives completely, excluding any possibility of future recovery of deleted files and folders. It's a hard drive and partition eraser utility.\n\n\n==Themes applyed;\n\n=Windows XP Professional includes; \n-Royale Theme (Default)\n-Vista RTM Cursors (Default)\n\n=Windows XP Home Edition includes; \n-Zune Theme (Default)\n-Vista RTM Cursors (Default)\n\n\n==Drivers included (the XP's 'with drivers' in name only);\n=For more informations on drivers added, please visit: http://driverpacks.net/DriverPacks/\n-DriverPack Chipset\n-DriverPack CPU\n-DriverPack Graphics \n-DriverPack LAN\n-DriverPack MassStorage\n-DriverPack Sound \n-DriverPack WLAN \n\n\n==How to;\n1. Extract files,\n2. Burn GRTMPHPPVOL_EN.iso to DVD with an ISO burning software, or use iso-burner.exe in download folder,\n3. Turn off computer whilst leaving DVD in drive,\n4. Turn on computer and boot from DVD , making sure your BIOS settings are set to boot from CD/DVD drive first,\n5. Choose desired XP Edition or launch a utility by pressing corresponding key.  \n\n==File hashes;(Make sure your GRTMPHPPVOL_EN.iso file hashes match these!)\n\nSize: 2.67 GB (2,868,176,896 bytes)\nMD5 : AACE06E05087B77F74F5EB00E899FB41\n\nTo check the file hashes, install hashtab_setup.exe in download folder. Right click GRTMPHPPVOL_EN.iso, click properties, then file hashes. Lastly, compare them from there.\n\n\nEnjoy, :)\n\n\nPlease help seed.\n\n\nBONUS: I copied the unmodified XP ISO images which I started off with along with the license keys, in 'XPISOS' folder on DVD, including;\n\nWindows XP Professional SP3 Retail; (Size: 589.14 MB)\nEN_WINDOWS_XP_PROFESSIONAL_WITH_SERVICE_PACK_3_X86_CD_X14-80428.ISO\n\nWindows XP Home Edition SP3 Retail; (Size: 564.72 MB)\nEN_WINDOWS_XP_HOME_WITH_SERVICE_PACK_3_X86_CD_X14-92413.ISO\n\nWindows XP Professional SP3 Corporate; (Size: 589.14 MB)\nEN_WINDOWS_XP_PROFESSIONAL_WITH_SERVICE_PACK_3_X86_CD_VL_X14-73974.ISO\n\n\n==F.A.Q\n\n=(Q)Why don't you just provide me with a genuine retail product key like the corporate ones, instead of providing me with a crack?\n=(A)Retail licensing differs from Corporate licensing, A Retail key is used for home users and people buying XP directly from the retailer. A retail XP key can only be used to activate a retail XP 3-5 times, if that. So, if I provided a retail key with the retail XP's only a few people installing it will be able to activate their windows legally. However, Corporate licensing is used for businesses and schools etc. which enables you to activate Windows unlimited times. But -- Not all of the Corporate keys out there can be used to activate corporate XP's unlimited times, but the one provided with these corporate XP's can. :)\n\n=(Q)Is x86 - 32-bit ?\n=(A)Yes. More information about the different architectures can be found here;\nx86 ;\nhttp://en.wikipedia.org/wiki/X86\nx64 ;\nhttp://en.wikipedia.org/wiki/64-bit\n\n=(Q)How do I boot from the DVD once I have burned it?\n=(A)Please go here for a detailed tutorial on how to;\nhttp://www.hiren.info/pages/bios-boot-cdrom\n\n=(Q)How do I perform a clean install of XP?\n=(A)Firstly, you need to boot from the DVD and select your desired XP\ne.g select the key '1' for the Windows XP Professional SP3 Retail with drivers  \nThen look here for information on installing your chosen XP;\nhttp://www.winsupersite.com/showcase/windowsxp_sg_clean.asp\n\n\n","torrent":{"xt":"urn:btih:725ca44cb7f164a4950d0ccaef570775c562534c","amp;dn":"The+Ultimate+boot+DVD+Windows+XP+PRO%2FHOME+SP3+%288+in+1%29+%28TPB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725ca44cb7f164a4950d0ccaef570775c562534c","infoHashBuffer":{"type":"Buffer","data":[114,92,164,76,183,241,100,164,149,13,12,202,239,87,7,117,197,98,83,76]},"announce":[],"urlList":[]}}