{"title":"SensualPain - Double Header - Panty Tease and The New Fist  Abig","uid":15603706,"size":2107526373,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:72845da80be04d4972bf5a337c5d0a34bc79afa2&amp;dn=SensualPain+-+Double+Header+-+Panty+Tease+and+The+New+Fist++Abig&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"merzedes","files":1,"time":1471691177,"description":"Double Header - Panty Tease and The New Fist | Abigail Dupree\r\n\r\nJuly 29, 2016\r\n\r\n\r\nHigh MP4 only\r\n\r\n \r\nPanty Tease with JOI Orgasm and DirtyTalk - Nothing like a tight pair of panties riding up in between my pussy and ass. I know you have wanted me for so long and my teasing has gotten you so hard for me. Stroke that cock while I tease you a bit more by pulling and stretching my panties til they can be stretched anymore. Up in between my pierced cunt lips I pull them until out peak my perfect lips for you to get a peak. I've wanted you for so long too but didn't know how to tell you. Get that dick nice and hard for me.. show me what you are going to fuck me with you nasty boy. Now don't you dare cum until I do. That's right... 5....4.....3.....2...1 now cum with me and then watch me open up my wet pussy for you to see. So hungry she is for your cock. === A Candid Conversation Of Fears And Trying Out The New Fist - Quite a different flavor than most of my sessions in this intimate and playful exchange. I recieved a surprise in the mail from my adoring fan FabledGriff who frequents my live cam shows on MyFreeCams.com Griff wasn't present at the moment but I quickly found someone who wanted to accompany me while I attempted to use it for the first time. I knew it probably wasn't going to be the most graceful of tasks so we agreed to just shoot the breeze while I did my thing and the topic went to expanding on some of my worst fears and also where they may have stemmed from. Multitasking is one of my fortes and it's almost comical to see me struggle with the giant fist while casually talking about stories of my past. Luckily, I was successful in at least one of my holes and have yet to accomplish the other... in due time. Enjoy a look into the real and relaxed me. \r\n\r\nScreens \nhttp://www.sensualpain.com/sadomasochism/trailer.php?y=2016&amp;p=07_29adupree18&amp;u=SensualPain-Abigail-Dupree-Double-Header--Panty-Tease-and-The-New-Fist\r\n\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-) \r\n\r\nKAT RIP","torrent":{"xt":"urn:btih:72845da80be04d4972bf5a337c5d0a34bc79afa2","amp;dn":"SensualPain+-+Double+Header+-+Panty+Tease+and+The+New+Fist++Abig","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72845da80be04d4972bf5a337c5d0a34bc79afa2","infoHashBuffer":{"type":"Buffer","data":[114,132,93,168,11,224,77,73,114,191,90,51,124,93,10,52,188,121,175,162]},"announce":[],"urlList":[]}}