{"title":"ZOE PARKER, SHANE BLAIR - DaughterSwap - Poker Night Swap HD","uid":15244319,"size":5240043260,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7286e13b3fbefd45597277332b66e4475fd3c045&amp;dn=ZOE+PARKER%2C+SHANE+BLAIR+-+DaughterSwap+-+Poker+Night+Swap+HD+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ElitePorn","files":1,"time":1467988911,"description":"ZOE PARKER, SHANE BLAIR - DaughterSwap - Poker Night Swap HD 1080p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nI was just about to head out to my friends house when my dad called me into the living room. We don't talk much because I've been so busy with school lately, but I love catching up with him. It seems his gambling ways have gotten him into deep trouble again and hes going to need my help, but hey what are daughters for!? Anyways, he invited his friend over with his daughter Shane, this time to play at our house. Who knows, maybe home field advantage? A few rounds into the game and my dad is losing like there's no tomorrow and I just didn't know what to do because im terrible. He was giving me the eye the entire time and now I know I gotta take drastic measures so I decide to stick Shane's dads cock in my mouth. I knew that would get him going to where he would have to stop taking my dads money, but hey why stop there. Hes already taken so much money its only fair he gets a taste of his daughter too so I had him right where I wanted and that made me able to do the swap, now everyone is having fun and winning.\r\n\r\nMy dad doesn't usually invite me over to his friends house since he is always over there, but this time is different. He told me we are going to Tommy's house for some sort of bring your daughter to poker night kind of thing, I guess it's his way of trying to bond with me, but I don't mind. Plus I love hanging out with my dads older friends , they are all so hot. We show up to Tommy's house and I already got excited just being there. I've seen the way hes looked at me at my house before but I'm way to shy to ever say anything, but if I ever do get a chance I'd take it! A few rounds into the game and my dad is taking all of Tommy's chips as usual and I'm just sitting here quietly following along this boring game when all of a sudden Zoe starts to suck my dads cock! I was so shocked I completely ignored it until she said she would only fuck my dad if I fucked hers!! It's like she was reading my mind this whole time and how I could I ever pass up a chance like this!\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.com/x/clean/G87e\r\n \nhttp://picturescream.com/x/clean/G87i\r\n \nhttp://picturescream.com/x/clean/G87p\r\n \nhttp://picturescream.com/x/clean/G874\r\n \nhttp://picturescream.com/x/clean/G878\r\n \nhttp://picturescream.com/x/clean/G87D\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 4.87 GB\r\nDuration: 57:46 min \t\r\nResolution: 1920x1080\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:7286e13b3fbefd45597277332b66e4475fd3c045","amp;dn":"ZOE+PARKER%2C+SHANE+BLAIR+-+DaughterSwap+-+Poker+Night+Swap+HD+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7286e13b3fbefd45597277332b66e4475fd3c045","infoHashBuffer":{"type":"Buffer","data":[114,134,225,59,63,190,253,69,89,114,119,51,43,102,228,71,95,211,192,69]},"announce":[],"urlList":[]}}