{"title":"Grand Designs Collection 7 4of8 Penthouse DVDRip x264 AAC MVGrou","uid":8752122,"size":590589236,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:72b244fe8db5f3edadac3c31c5695a707d85dedb&amp;dn=Grand+Designs+Collection+7+4of8+Penthouse+DVDRip+x264+AAC+MVGrou&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1375054043,"description":"Grand Designs: Collection 7\n\nTechnology Documentary hosted by Kevin McCloud, published by Channel 4 in 2007 - English narration\n\n\nInformation\n------------------------------\n\nGrand Designs: Collection 7\nThe 7th series of Grand Designs features eight couples bravely embarking on the adventure of a lifetime - building their own homes. There are wrangles with planners and contractors, money runs out, nerves are tested and there is the ubiquitous battle with the elements. Presenter Kevin McCloud is there through it all, to offer words of encouragement and wisdom, and raise the occasional eyebrow... This new series features eight unique and extraordinary builds.\n\n\n1)  14th Century Castle \nEvery Englishman's home is his castle but for Francis Shaw this is quite literally true. He and his wife, Karen, and their two young daughters, bought the ruins of a 14th Century castle in North Yorkshire and took on the remarkable challenge of turning a pile of stones into a beautiful home. Surrounded by rolling green fields, the location is idyllic; however, the castle itself was little more than four crumbling walls.\n\n2)  The Thatched Cottage \nEight years ago Alex and Cheryl Reay left London for a new life in the New Forest. They bought a run down medieval thatched cottage and lovingly brought it back to life. Then just before Christmas, with Cheryl pregnant, disaster struck. A fault in the chimney caused a massive fire which destroyed the entire building. Overnight Alex and Cheryl had lost almost Â£400,000. Whilst most people would have walked away from this, Alex and Cheryl couldn't let go of their dream. Nine months after the fire, they decided to start all over again and rebuild the cottage, bigger and better than before.\n\n3)  Eco Barge \nChris Miller and his wife Sze Liu Lai lived in a tiny flat in East London with their two children Alexion and Tayszea. It was very tight for space and as the kids grew they really felt in need of more room. Chris and Sze are both social workers on low incomes and they have very little in the way of savings. They did however own a small narrow boat, which inspired a solution to their 'no money, no space' dilemma. They decided to build a houseboat which would give them more space for a fraction of the price of a home on land. They began with an 86ft steel barge moored in a boatyard on the River Medway...\n\n4)  Penthouse \nJames and Katrin Gray live in Bournemouth on the south coast. James runs his own book distribution business and Katrin works for an investment bank. They used to live in an apartment on the second floor of a former Victorian hotel. But three years ago, James bought the top floor flat. It was originally built as a solarium for the hotel in the 1920's where holiday-makers could soak up the sun. Now James and Katrin plan to convert it into a modern, luxury penthouse. The first project was to build a large rooftop extension which became the main living area of the new penthouse. This steel frame structure was cleverly knitted between all the obstructions on the roof and leads out onto a fabulous roof top terrace with exclusive views along the coast.\n\n5)  Church Conversion \nDean Marks has dreamt of living in a church for as long as he can remember. After searching for the right building for years, he came across St Martin's near Birmingham, a huge 18th century grade II listed church which looks more like a mausoleum. The church wanted Â£25,000 for it but Dean knocked them down to Â£12,500. Now, after fighting for planning permission for four years, Dean and his wife, Hilary, are about to transform this derelict monstrosity into a family home.\n\n6)  Art Deco House \nWhen Pilots Andrew Berry and his wife Helen bought their cottage near Guildford in Surrey 7 years ago they always planned to add a small extension. But over the last few years the modest extension has evolved so much that retaining any of the original cottage simply wasn't practical. Now it's being completely demolished to make way for a new five bedroom Art Deco style house.\n\n7)  Hexagonal Oak Framed House \nKelly and Masoko Neville set about building not just a spectacular oak frame and straw bale house, but a whole new way of life in the Cambridgeshire Fens. Kelly is a carpenter by trade and has always dreamed of building an eco friendly home with his own hands. This highly sustainable house, sitting in harmony with nature and its surroundings, will become the base for Kelly and Masokos new self-sufficient life where they will produce their own food and energy from the land.\n\n8)  Timber Eco House \nBill and Sarah Bradley are a couple whose dream of living mortgage-free rests on building not one, but two timber framed houses in south London. Building on the site of Bill's old wood workshop, the couple plan to sandwich the houses in between two existing rows, leaving them overlooking, and overlooked, by over twenty neighbours. To get around these difficulties Bill and Sarah's houses will use oblique windows, skylights and double height glazed courtyards to create two beautiful but private homes. But before long the budget is soaring and Bill's desire to go more luxurious and high spec leaves their dream of debt free living looking ever more remote.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img35.imageshack.us/img35/6029/xbza.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img35.imageshack.us/img35/6029/xbza.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img211.imageshack.us/img211/1254/5pb8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img211.imageshack.us/img211/1254/5pb8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img62.imageshack.us/img62/2351/1lvw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img62.imageshack.us/img62/2351/1lvw.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img585.imageshack.us/img585/1025/l51e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img585.imageshack.us/img585/1025/l51e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img560.imageshack.us/img560/6245/n468.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img560.imageshack.us/img560/6245/n468.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img802.imageshack.us/img802/3043/0q3f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img802.imageshack.us/img802/3043/0q3f.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img42.imageshack.us/img42/4260/q2wg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img42.imageshack.us/img42/4260/q2wg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img28.imageshack.us/img28/808/a3i2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img28.imageshack.us/img28/808/a3i2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img827.imageshack.us/img827/9639/azfu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img827.imageshack.us/img827/9639/azfu.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;054d6c626d4549312b35&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1680 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps CBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 49mins\n * Framerate: 25fps\n * Number of Parts: 8\n * Part Size: 579 MB\n * Container: mp4\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.channel4.com/programmes/grand-designs/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/programmes/grand-designs/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:72b244fe8db5f3edadac3c31c5695a707d85dedb","amp;dn":"Grand+Designs+Collection+7+4of8+Penthouse+DVDRip+x264+AAC+MVGrou","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72b244fe8db5f3edadac3c31c5695a707d85dedb","infoHashBuffer":{"type":"Buffer","data":[114,178,68,254,141,181,243,237,173,172,60,49,197,105,90,112,125,133,222,219]},"announce":[],"urlList":[]}}