{"title":"[Clips4Sale / Family-Therapy] Miss Bratt (Brat Big Sister Stalke","uid":13676817,"size":299104530,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:72cc71813634f4a26d38cf98028e80294fda1694&amp;dn=%5BClips4Sale+%2F+Family-Therapy%5D+Miss+Bratt+%28Brat+Big+Sister+Stalke&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1456429767,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/k8S\r\n \nhttp://imgsnaps.com/image/k8h\r\n\r\nI'm really quiet, and really, really shy. I play video games and study. I don't have any friends. People call me weird and other names that are pretty mean. But I don't really care, everyone else is stupid. I think I'm pretty cool, and I know I'm really smart. But whatever, the thing that's really important is I'm a fast learner - and I know how to get what I want. Lately I've become obsessed with taboo porn. Like brothers fucking their sisters. I think it's so hot, especially the really amateur stuff, sometimes I even think it's real. I know it's probably not but the good videos that make me believe the people are really related get me to cum so quick... The weird thing is I don't even have a sister. At least I didn't until two months ago. A while back my Dad sat me down and told me I had an older puerto rican sister from his first marriage, and that she was moving in with us. I was like WTF?! my Dad is crazy... My new big sister moved in a week later and she was a total brat, and a huge slut. She was always asking Dad for money for designer clothes and out partying all night with her new friends. But lucky me, I figured this was the perfect opportunity to live out my ultimate fantasy... I decided to wait till our parents went out of town for the weekend and just do some stuff I saw in my favorite videos... And fuck me if it didn't totally work, this guy is now officially the world's happiest creepy little brother.... ***Starring Miss Brat &amp; a REAL creampie from her weirdo little brother***","torrent":{"xt":"urn:btih:72cc71813634f4a26d38cf98028e80294fda1694","amp;dn":"%5BClips4Sale+%2F+Family-Therapy%5D+Miss+Bratt+%28Brat+Big+Sister+Stalke","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72cc71813634f4a26d38cf98028e80294fda1694","infoHashBuffer":{"type":"Buffer","data":[114,204,113,129,54,52,244,162,109,56,207,152,2,142,128,41,79,218,22,148]},"announce":[],"urlList":[]}}