{"title":"The Doors: A Lifetime of Listening - Greil Marcus (2011)","uid":9205760,"size":208491403,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:72d7be8274b1e715c2e103a605fb21fbc2120977&amp;dn=The+Doors%3A+A+Lifetime+of+Listening+-+Greil+Marcus+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":95,"time":1384648842,"description":"Audio Books : Educational : MP3/Variable : English\n\nThe Doors: A Lifetime of Listening to Five Mean Years (Audiobook) By Greil Marcus, read by Ray Porter\nUnabridged edition 2011 | 4 hours and 45 mins | ISBN: 1455122076 | MP3 96 kbps | 198 MB\n\nThe best critic of popular culture in America considers the attraction of the Doors, which has endured despite the band's short life, sampling the lasting songs and legendary performances that made Jim Morrison and his band rock 'n' roll legends.\n\nA fan from the moment the Doors' first album took over KMPX, the revolutionary FM rock 'n' roll station in San Francisco, Greil Marcus saw the band many times at the legendary Fillmore Auditorium and the Avalon Ballroom in 1967. Five years later it was all over. Forty years after singer Jim Morrison was found dead in Paris and the group disbanded, one could drive from here to there, changing from one FM pop station to another, and be all but guaranteed to hear two, three, four of the Doors' songs in an hour--every hour. Whatever the demands in the music, they remained unsatisfied, in the largest sense unfinished, and absolutely alive.\n\nThere have been many books on the Doors. This is the first to bypass their myth, their mystique, and the death cult of both Jim Morrison--and the era he was made to personify--and focus solely on the music. All these years later, it is a new story.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:72d7be8274b1e715c2e103a605fb21fbc2120977","amp;dn":"The+Doors%3A+A+Lifetime+of+Listening+-+Greil+Marcus+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72d7be8274b1e715c2e103a605fb21fbc2120977","infoHashBuffer":{"type":"Buffer","data":[114,215,190,130,116,177,231,21,194,225,3,166,5,251,33,251,194,18,9,119]},"announce":[],"urlList":[]}}