{"title":"Cisco Networking Essentials {BBS}","uid":7296566,"size":66254402,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72da526769ef87d7eb200e3e97143da1fc5123ef&amp;dn=Cisco+Networking+Essentials+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337900562,"description":"An engaging approach for anyone beginning a career in networking\n\nAs the world leader of networking products and services, Cisco products are constantly growing in demand. Yet, few books are aimed at those who are beginning a career in IT--until now. Cisco Networking Essentials provides a solid foundation on the Cisco networking products and services with thorough coverage of fundamental networking concepts. Author Troy McMillan applies his years of classroom instruction to effectively present high-level topics in easy-to-understand terms for beginners. With this indispensable full-color resource, you'll quickly learn the concepts, processes, and skills that are essential to administer Cisco routers and switches.\n\n    Begins with a clear breakdown of what you can expect to learn in each chapter, followed by a straightforward discussion of concepts on core topics\n    Includes suggested labs and review questions at the conclusion of each chapter, which encourage you to reinforce and measure your understanding of the topics discussed\n    Serves as an ideal starting point for learning Cisco networking products and services\n\nIf you are interested in a career in IT but have little or no knowledge of networking and are new to Cisco networking products, then this book is for you.\n\n\n\nPaperback: 400 pages\nPublisher: Sybex; 1 edition (November 29, 2011)\nLanguage: English\nISBN-10: 1118097599\nISBN-13: 978-1118097595","torrent":{"xt":"urn:btih:72da526769ef87d7eb200e3e97143da1fc5123ef","amp;dn":"Cisco+Networking+Essentials+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72da526769ef87d7eb200e3e97143da1fc5123ef","infoHashBuffer":{"type":"Buffer","data":[114,218,82,103,105,239,135,215,235,32,14,62,151,20,61,161,252,81,35,239]},"announce":[],"urlList":[]}}