{"title":"Tokyo Police Club - Forcefield (2014) [FLAC]","uid":9825842,"size":246439374,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:73056fe07aaf35c2dba2fbef61e725b5d48276eb&amp;dn=Tokyo+Police+Club+-+Forcefield+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1395775033,"description":"\n  Tokyo Police Club - Forcefield (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Argentina \n  02 Hot Tonight\n  03 Miserable \n  04 Gonna Be Ready \n  05 Beaches \n  06 Toy Guns \n  07 Tunnel Vision \n  08 Through the Wire \n  09 Feel the Effect \n\n  Tokyo Police Club took their time delivering the follow-up to their heart-on-sleeve second album, Champ. Though they began writing songs in 2011, Forcefield didn't arrive for another three years; during that time, they also recorded Ten Days, Ten Covers, Ten Years, which found them reworking a decade's worth of songs from artists ranging from Moby to Miley Cyrus in quick succession. That fondness for pop surfaces in these songs, which are among the band's most crafted in a number of ways. The ambitious &quot;Argentina (Parts I, II, III)&quot; begins Forcefield with a tale of wanting, having, and leaving as it moves from punchy to tender to purposeful over the course of nearly nine minutes. By contrast, &quot;Hot Tonight&quot; echoes the riff from Cyrus' &quot;Party in the USA&quot; and delivers Tokyo Police Club's version of a summertime hit. Both tracks are big changes from Champ's vulnerability and emphasize Forcefield's slick production, which takes some of the sting out of the album's darker tracks; &quot;Gonna Be Ready&quot;'s tumbling riffs are closer to Taylor Swift's insanely hooky &quot;I Knew You Were Trouble&quot; than the rawness of the band's previous album. Tokyo Police Club worked with co-producer Doug Boehm, who has also collaborated with the French Kicks, and Forcefield often recalls how that band managed to sound sophisticated and unpretentious at the same time. This is particularly true of &quot;Through the Wire&quot; and &quot;Feel the Effect,&quot; which glides along so prettily that it's easy to miss -- and forgive -- the fact that David Monks admits to his bad behavior but never apologizes for it.","torrent":{"xt":"urn:btih:73056fe07aaf35c2dba2fbef61e725b5d48276eb","amp;dn":"Tokyo+Police+Club+-+Forcefield+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73056fe07aaf35c2dba2fbef61e725b5d48276eb","infoHashBuffer":{"type":"Buffer","data":[115,5,111,224,122,175,53,194,219,162,251,239,97,231,37,181,212,130,118,235]},"announce":[],"urlList":[]}}