{"title":"Alan Dean Foster - Interlopers &amp; To the Vanishing Point","uid":10710291,"size":6142268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:731f51b0c96eb6ecbfbca9e7afcdc0efa9c97680&amp;dn=Alan+Dean+Foster+-+Interlopers+%26amp%3B+To+the+Vanishing+Point&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"geolittle","files":11,"time":1407345115,"description":"Alan Dean Foster (AZW3 EPub Mobi)\n\nInterlopers - 2001 Ace\nTo the Vanishing Point\n\n\nInterlopers\nA 2001 science fiction novel by Alan Dean Foster. The story centers on Cody Westcott, a young archeologist, who returns from a dig at Apachetarimac having studied the Chachapoyansthat race. In an attempt to reconstruct an ancient potion whose ingredients he discovers in the dig, his friend is murdered and he ends up drinking the only sample. He discovers that he can &quot;see&quot; strange creatures inhabiting the world, and that these creatures harm humans and cause feelings of hate and anger upon which they feed and multiply. These &quot;Interlopers&quot; or &quot;Those Who Abide&quot; also realize he can see them at the same time, and begin to conspire against him in order to stop his interruption of their feeding. They go so far as infesting his wife with numerous powerful Interlopers, and Cody must ally with an ancient society and visit several sites of mythical power in order to free her and bring a halt to the Interlopers' plans.\n\nTo the Vanishing Point\nChaos and Evil must be defeated lest the entire universe come unraveled. The Sonderbergs--hard-nosed businessman Frank, his earth-mother wife Alicia, teenage music-freak Wendy, and glum, overweight preteen Steven--are driving from L.A. to Las Vegas for their vacation when they stop to pick up a hitchhiker: Mouse, a weirdly clad and made-up woman, sings magically and claims to be 4,000 years old. Mouse eventually explains where she needs to go: the Vanishing Point, where all roads lead. It emerges that the Spinner--it weaves reality in various strands and knits them up as neatly as you please--is out of whack. Mouse must reach the Spinner and sing it back to health before the evil Anarchis can destroy it and usher in endless chaos. Where Mouse goes, so willy-nilly do the Sonderbergs, slipping into and out of different realities, some amusing, some horrifying, all threatening, in their efforts to reach the Spinner. They pick up a useful ally: huge, crazy supergenius Indian Burnfingers Begay. Incidents multiply pleasingly, but there's no narrative tension--we know exactly where the Sonderbergs are headed and what will happen when they get there. Inventive details, then, but a mediocre concept. One advantage: you can skip the bits that don't appeal without missing a thing.\n\n[img]http://www.fictionfactor.com/images/interlopers.jpg[/img]\n[img]http://d.gr-assets.com/books/1345059793l/2913966.jpg[/img]","torrent":{"xt":"urn:btih:731f51b0c96eb6ecbfbca9e7afcdc0efa9c97680","amp;dn":"Alan+Dean+Foster+-+Interlopers+%26amp%3B+To+the+Vanishing+Point","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"731f51b0c96eb6ecbfbca9e7afcdc0efa9c97680","infoHashBuffer":{"type":"Buffer","data":[115,31,81,176,201,110,182,236,191,188,169,231,175,205,192,239,169,201,118,128]},"announce":[],"urlList":[]}}