{"title":"HALOT - Hebrew And Aramaic Lexicon Of The Old Testament","uid":3577145,"size":171003951,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:73470fc86c9e8aefa91f6fdc0a027ddd365b4d49&amp;dn=HALOT+-+Hebrew+And+Aramaic+Lexicon+Of+The+Old+Testament&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"shenkeee","files":2,"time":1166141257,"description":"Hebrew and Aramaic Lexicon of the Old Testament\t\n\nKoehler, Baumgartner and Stamm&amp;#039;s The Hebrew and Aramaic Lexicon of the Old Testament (HAL/HALOT), is widely recognized as being the standard modern dictionary for Biblical Hebrew.\n\nIn combining scholarly thoroughness with easy accessibility, this dictionary meets the needs of a wide range of users.\n\nThe Electronic Edition\n\nThe CD-ROM edition of the dictionary published by Brill Academic Publishers, using the Logos Library System format, contains not only the information available in the print edition of HAL, but also provides additional features that enhance its usefulness considerably.\n\nThe functionality of the CD-ROM includes the exact reproduction of the character and paragraph formatting of the print edition. Additional functionality includes article-based navigation and extensive, language-aware, searching of Hebrew and related languages, e.g. full-text, Boolean, and proximity searches. Furthermore, every &amp;#039;see also&amp;#039; cross-reference to other articles in the dictionary has been made a hyperlink. Biblical references hyperlink to biblical texts. As an aid to the reader, all abbreviations are presented as hotspots, activating window pop-ups with the full expansion of the abbreviation. HAL is fully compatible with over 6,700 additional Bibles and reference books in both the Logos Library System and the new Libronix Digital Library System.\n\nReadership: The electronic version of HAL is an indispensable tool for scholars and students in the fields of Biblical Studies, Dead Sea Scrolls, Judaic Studies, Semitic Languages and Ancient Near East.\n\nThis is a Logos-Libronix software. For the best working, you should use Libronix DLS system. You can download it from here: \n &lt;a href=&quot;\nhttp://www.logos.com/support/downloads/ldls&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.logos.com/support/downloads/ldls&lt;/a&gt;","torrent":{"xt":"urn:btih:73470fc86c9e8aefa91f6fdc0a027ddd365b4d49","amp;dn":"HALOT+-+Hebrew+And+Aramaic+Lexicon+Of+The+Old+Testament","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73470fc86c9e8aefa91f6fdc0a027ddd365b4d49","infoHashBuffer":{"type":"Buffer","data":[115,71,15,200,108,158,138,239,169,31,111,220,10,2,125,221,54,91,77,73]},"announce":[],"urlList":[]}}