{"title":"Advances in Materials Technology for Fossil Power Plants","uid":15558930,"size":85521136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:742bcabb06e83dee400d819f0f4f7a6f2cfc99c2&amp;dn=Advances+in+Materials+Technology+for+Fossil+Power+Plants&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471101135,"description":"Advances in Materials Technology for Fossil Power Plants - D. Gandy, J. Shingledecker (EPRI, 2014).pdf\r\n\r\nAdvances in Materials Technology for Fossil Power Plants: Proceedings from the Seventh International Conference, October 22-25, 2013, Waikoloa, Hawaii, USA. \r\n\r\nOne hundred eighty-five participants representing 18 countries traveled from around the world to participate in the EPRI 7th International Conference on Advances in Materials Technology for Fossil Power Plants on the Big Island of Hawaii, USA. This conference built on the success of the previous 6 conferences originally started by Prof. R. (Vis) Viswanathan, EPRI (FASM) in 1995 in London, England and held every three years since that time in San Sebastian (Spain), Swansea (Wales), Hilton Head Island (USA), Marco Island (USA), and Santa Fe (USA). This proceedings contains the largest number of papers ever collected for this conference. Overwhelming response to the 2013 conference (over a 20% increase in number of papers and technical talks) prompted the organizers to hold the first ever poster session. EPRI and ASM have again partnered to publish this proceedings which is organized into 9 topical areas: technology overviews, nickel-based alloys for advanced ultrasupercritical power plants, materials for turbines, alloys T23/24, Grades 91/92, oxidation and corrosion, welding and weld performance, new alloys concepts, and creep and general topics","torrent":{"xt":"urn:btih:742bcabb06e83dee400d819f0f4f7a6f2cfc99c2","amp;dn":"Advances+in+Materials+Technology+for+Fossil+Power+Plants","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"742bcabb06e83dee400d819f0f4f7a6f2cfc99c2","infoHashBuffer":{"type":"Buffer","data":[116,43,202,187,6,232,61,238,64,13,129,159,15,79,122,111,44,252,153,194]},"announce":[],"urlList":[]}}