{"title":"Sharon Van Etten...Epic(2010)[FLAC]","uid":6028264,"size":203454775,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74a0742df6385a621ce7d988b744d05425b0278b&amp;dn=Sharon+Van+Etten...Epic%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":12,"time":1291988141,"description":"2010 Epic BING 072\n\n1. A Crime  \n2. Peace Signs  \n3. Save Yourself  \n4. Dsharpg  \n5. Don't Do It  \n6. One Day  \n7. Love More  \n\nSharon Van Etten came to Brooklyn via Jersey via Tennessee via Jersey. Along the way, she sang in choirs, rejected her school's music program, worked at an all-ages venue, trained as a sommelier and got a full time job at a record label. She also had a few bad experiences in relationships. More than a few. Epic, Van Etten's second album, lays a romantic melancholy lining over the gravel and dirt of heartbreak, without one honest thought or feeling spared. She sings of betrayal, obsession, egotism and all the other emotions we hate in others and recognize in ourselves. Van Etten's grounded and clenched vocals convey the sense of hope--the notion that beauty can come out of the worst of circumstances. Epic is indeed that beauty. The album was recorded at Miner Street Studios in Philadelphia with Brian McTear. Where Van Etten's first record, Because I Was in Love, explored her thoughts on love through minimalism and sparseness, Epic embellishes her music to grandiose luminosity. She supplements guitar and vocals with drums, piano, lap steel and a trio of backing vocalists--Meg Baird (Espers), Cat Martino and Jessica Larrabee (She Keeps Bees)--for a fully realized album that astounds as it elucidates, disturbs as it soothes. The final track, 'Love More,' has already been covered live in a collaborative effort by Bon Iver and The National. Since her last album, Van Etten has sung on The Antlers' Hospice and performed with them at Radio City Music Hall, sung improv on the Mike Reed Trio's upcoming album, recorded backup vocals for Swedish pop-star Anna Ternheim, appeared on the recent Esopus Magazine compilation and collaborated with Megafaun (check YouTube!); she will soon appear on a soundtrack for the film The Builder along with Bon Iver and Phosphorescent, and has a 7-inch coming out this summer. After years of playing repeatedly around New York, Van Etten is preparing for a series of tours that will take her through Europe and the United States. \n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/29/2091/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/29/2091/&lt;/a&gt;","torrent":{"xt":"urn:btih:74a0742df6385a621ce7d988b744d05425b0278b","amp;dn":"Sharon+Van+Etten...Epic%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74a0742df6385a621ce7d988b744d05425b0278b","infoHashBuffer":{"type":"Buffer","data":[116,160,116,45,246,56,90,98,28,231,217,136,183,68,208,84,37,176,39,139]},"announce":[],"urlList":[]}}