{"title":"Swindled - Dark History Of Food Fraud- [Qwerty80]","uid":7869993,"size":23026646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75a065daad7ff182377b4cd3ff601d3d9593710e&amp;dn=Swindled+-+Dark+History+Of+Food+Fraud-+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"KatQwerty80","files":3,"time":1354178633,"description":"Swindled - Dark History Of Food Fraud, From Poisoned Candy To Counterfeit Coffee - [Qwerty80]\n\nBad food has a history. Swindled tells it. Through a fascinating mixture of cultural and scientific history, food politics, and culinary detective work, Bee Wilson uncovers the many ways swindlers have cheapened, falsified, and even poisoned our food throughout history. In the hands of people and corporations who have prized profits above the health of consumers, food and drink have been tampered with in often horrifying ways--padded, diluted, contaminated, substituted, mislabeled, misnamed, or otherwise faked. Swindled gives a panoramic view of this history, from the leaded wine of the ancient Romans to today's food frauds--such as fake organics and the scandal of Chinese babies being fed bogus milk powder.\n\nWilson pays special attention to nineteenth- and twentieth-century America and England and their roles in developing both industrial-scale food adulteration and the scientific ability to combat it. As Swindled reveals, modern science has both helped and hindered food fraudsters--increasing the sophistication of scams but also the means to detect them. The big breakthrough came in Victorian England when a scientist first put food under the microscope and found that much of what was sold as genuine coffee was anything but--and that you couldn't buy pure mustard in all of London.\n\nArguing that industrialization, laissez-faire politics, and globalization have all hurt the quality of food, but also that food swindlers have always been helped by consumer ignorance, Swindled ultimately calls for both governments and individuals to be more vigilant. In fact, Wilson suggests, one of our best protections is simply to reeducate ourselves about the joys of food and cooking.\n\nAbout the Author\nBEE WILSON is the author of The Hive: The Story of the Honeybee and Us. She writes a weekly food column for London's Sunday Telegraph and is a former food critic for the New Statesman. She has been named Food Journalist of the Year by the Guild of Food Writers and Food Writer of the Year by BBC Radio 4.","torrent":{"xt":"urn:btih:75a065daad7ff182377b4cd3ff601d3d9593710e","amp;dn":"Swindled+-+Dark+History+Of+Food+Fraud-+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75a065daad7ff182377b4cd3ff601d3d9593710e","infoHashBuffer":{"type":"Buffer","data":[117,160,101,218,173,127,241,130,55,123,76,211,255,96,29,61,149,147,113,14]},"announce":[],"urlList":[]}}