{"title":"Value Focused Thinking, A Path to Creative Decision making 1992.","uid":8100073,"size":20239312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:764c30068d369ab905b97ebaf3c425811e7f0d22&amp;dn=Value+Focused+Thinking%2C+A+Path+to+Creative+Decision+making+1992.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"h714375","files":-1,"time":1359940696,"description":"\nThe standard way of thinking about decisions is backwards, says Ralph Keeney: people focus first on identifying alternatives rather than on articulating values. A problem arises and people react, placing the emphasis on mechanics and fixed choices instead of on the objectives that give decisionmaking its meaning. In this book, Keeney shows how recognizing and articulating fundamental values can lead to the identification of decision opportunities and the creation of better alternatives. The intent is to be proactive and to select more attractive decisions to ponder before attempting any solutions.\n\nKeeney describes specific procedures for articulating values by identifying and structuring objectives qualitatively, and he shows how to apply these procedures in various cases. He then explains how to quantify objectives using simple models of values. Such value analysis, Keeney demonstrates, can yield a full range of alternatives, thus converting decision problems into opportunities. This approach can be used to uncover hidden objectives, to direct the collection of information, to improve communication, to facilitate collective decisionmaking, and to guide strategic thinking. To illustrate these uses, Keeney shows how value-focused thinking works in many business contexts, such as designing an integrated circuit tester and managing a multibillion-dollar utility company; in government contexts, such as planning future NASA space missions and deciding how to transport nuclear waste to storage sites; and in personal contexts, such as choosing career moves and making wise health and safety decisions.\n\nAn incisive, applicable contribution to the art and science of decisionmaking, Value-Focused Thinking will be extremely useful to anyone from consultants and managers to systems analysts and students.\n","torrent":{"xt":"urn:btih:764c30068d369ab905b97ebaf3c425811e7f0d22","amp;dn":"Value+Focused+Thinking%2C+A+Path+to+Creative+Decision+making+1992.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"764c30068d369ab905b97ebaf3c425811e7f0d22","infoHashBuffer":{"type":"Buffer","data":[118,76,48,6,141,54,154,185,5,185,126,186,243,196,37,129,30,127,13,34]},"announce":[],"urlList":[]}}