{"title":"Rosa Luxemburg - 1913 - The Accumulation of Capital (497p) [Inua","uid":11380479,"size":2520557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7653eee15170eff75a4ac1a5dd21919dac7af145&amp;dn=Rosa+Luxemburg+-+1913+-+The+Accumulation+of+Capital+%28497p%29+%5BInua&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Inua1","files":1,"time":1415209091,"description":"Title: The Accumulation of Capital\nAuthor: Rosa Luxemburg \nISBN-10: 0415304458\nISBN-13: 978-0415304450\n\nThis is a classic of the early 20th Century Marxist tradition (the first important generation of Marxists after Marx). If you judge a book by its mistakes, you wouldn't bother with this one (also skip the Wealth of Nations by Adam Smith!). But with all her generally recognized technical mistakes on the reproduction schemes, this book is filled with insight and depth. Luxemburg had the right insight about how capitalism needs non-capitalist sectors and thus needs to expand, and her work inspired serious work by later generations of Marxists about the logic of imperialism, including recent work by people like David Harvey who have taken her insights and gone beyond them, just as she took the work of Marx but recognized a flaw (as the best in the Marxist tradition are willing to do, in the spirit of Marx himself) and moved the theory forward. Much has been written about this book, but it's worth reading the original, which is nicely written and has lots of interesting parts that don't make the summaries. You can gain more insight and direction from reading a brilliant thinker with important but interesting mistakes than from more careful but less insightful authors - that's why we should still read Adam Smith (the real thing, not the textbook distortions) and Rosa Luxemburg.\n\nRosa Luxemburg was a revolutionary socialist who fought and died for her beliefs. In January 1919, after being arrested for her involvement in a workers' uprising in Berlin, she was brutally murdered by a group of right-wing soldiers. Her body was recovered days later from a canal. Six years earlier she had published what was undoubtedly her finest achievement, The Accumulation of Capital - a book which remains one of the masterpieces of socialist literature. Taking Marx as her starting point, she offers an independent and fiercely critical explanation of the economic and political consequences of capitalism in the context of the turbulent times in which she lived, reinterpreting events in the United States, Europe, China, Russia and the British Empire. Many today believe there is no alternative to global capitalism. This book is a timely and forceful statement of an opposing view","torrent":{"xt":"urn:btih:7653eee15170eff75a4ac1a5dd21919dac7af145","amp;dn":"Rosa+Luxemburg+-+1913+-+The+Accumulation+of+Capital+%28497p%29+%5BInua","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7653eee15170eff75a4ac1a5dd21919dac7af145","infoHashBuffer":{"type":"Buffer","data":[118,83,238,225,81,112,239,247,90,74,193,165,221,33,145,157,172,122,241,69]},"announce":[],"urlList":[]}}