{"title":"FascismVsCaptitalism-L Rockwell 2013 pdf","uid":11165490,"size":928150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76d62e651d0c325539c457a49577952e76efc5ca&amp;dn=FascismVsCaptitalism-L+Rockwell+2013+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eboneezer","files":-1,"time":1412625199,"description":" Publisher: Ludwig von Mises Institute (November 25, 2013)\nLanguage: English\nISBN-10: 1610166248\nISBN-13: 978-1610166249\nPages-184\n\nFascism is a specific ideology based on the idea that the state is the ideal organization for realizing a society s and an individual s potential economically, socially, and even spiritually.\n\nThe state, for the fascist, is the instrument by which the people s common destiny is realized, and in which the potential for greatness is to be found. Individual rights, and the individual himself, are strictly subordinate to the state s great and glorious goals for the nation. In foreign affairs, the fascist attitude is reflected in a belligerent chauvinism, a contempt for other peoples, and a society-wide reverence for soldiers and the martial virtues.\n\nLew Rockwell, in this new volume, examines the starkly contrasting systems of capitalism and fascism, noting pro-fascist trends in recent decades as well as the larger historical trends in the United States and internationally.\n\nIn Section One, Rockwell focuses on the nature of fascism and its influence in Western society, with a focus on American political and economic institutions.\n\nIn Section Two, Rockwell examines capitalism as the enemy of, and antidote to fascism.\n\nCombining economics, history, and political philosophy, this book doesn t just provide a diagnosis of what ails American and Western society, but also sheds light on how we might repair the damage that has been done, and with the help of the intellectual work of great minds like Murray Rothbard and Ron Paul, we might as a society shed the fascism of our times and look to freedom instead.","torrent":{"xt":"urn:btih:76d62e651d0c325539c457a49577952e76efc5ca","amp;dn":"FascismVsCaptitalism-L+Rockwell+2013+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d62e651d0c325539c457a49577952e76efc5ca","infoHashBuffer":{"type":"Buffer","data":[118,214,46,101,29,12,50,85,57,196,87,164,149,119,149,46,118,239,197,202]},"announce":[],"urlList":[]}}