{"title":"Beginning R - The Statistical Programming Lang {BBS}","uid":7353586,"size":19331883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:773f969c6c564d14e734c66080403aa5f573aa81&amp;dn=Beginning+R+-+The+Statistical+Programming+Lang+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1339688732,"description":"Conquer the complexities of this open source statistical language\n\nR is fast becoming the de facto standard for statistical computing and analysis in science, business, engineering, and related fields. This book examines this complex language using simple statistical examples, showing how R operates in a user-friendly context. Both students and workers in fields that require extensive statistical analysis will find this book helpful as they learn to use R for simple summary statistics, hypothesis testing, creating graphs, regression, and much more. It covers formula notation, complex statistics, manipulating data and extracting components, and rudimentary programming.\n\n    R, the open source statistical language increasingly used to handle statistics and produces publication-quality graphs, is notoriously complex\n    This book makes R easier to understand through the use of simple statistical examples, teaching the necessary elements in the context in which R is actually used\n    Covers getting started with R and using it for simple summary statistics, hypothesis testing, and graphs\n    Shows how to use R for formula notation, complex statistics, manipulating data, extracting components, and regression\n    Provides beginning programming instruction for those who want to write their own scripts\n\nBeginning R offers anyone who needs to perform statistical analysis the information necessary to use R with confidence.\n\n\n\nPaperback: 504 pages\nPublisher: Wrox; 1 edition (June 5, 2012)\nLanguage: English\nISBN-10: 111816430X\nISBN-13: 978-1118164303","torrent":{"xt":"urn:btih:773f969c6c564d14e734c66080403aa5f573aa81","amp;dn":"Beginning+R+-+The+Statistical+Programming+Lang+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773f969c6c564d14e734c66080403aa5f573aa81","infoHashBuffer":{"type":"Buffer","data":[119,63,150,156,108,86,77,20,231,52,198,96,128,64,58,165,245,115,170,129]},"announce":[],"urlList":[]}}