{"title":"Make a Scene: Crafting a Powerful Story One Scene at a Time ","uid":9788718,"size":1721273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:775ba080ecaae2418f913c6af6b44f8eaff2d126&amp;dn=Make+a+Scene%3A+Crafting+a+Powerful+Story+One+Scene+at+a+Time+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1395210389,"description":"Write Scenes that Move Your Story Forward\nIn Make a Scene, author Jordan E. Rosenfeld takes you through the fundamentals of strong scene construction and explains how other essential fiction-writing techniques, such as character, plot, and dramatic tension, must function within the framework of individual scenes in order to provide substance and structure to the overall story. You'll learn how to:\n\nCraft an opening scene that hooks readers and foreshadows supporting scenes\nDevelop various scene types - from the suspenseful to the dramatic to the contemplative - that are distinct and layered\nTailor character and plot around specific scene types to better convey the nuances of your storyline\nCreate resonating climactic and final scenes that stay with readers long after they've finished your work.\n\nReview\nIn Make a Scene, Jordan E. Rosenfeld magnifies with intelligence and insight the underpinnings of powerful story making. Demonstrating in a step-by-step manner why a scene works, Rosenfeld shows how fiction writers can apply this knowledge to their own work. The astonishing depth and breadth of this guidebook, which utilizes a wide range of narrative styles to underscore a point, make it a vital tool for writers serious about their craft. -- --Jessica Keener, fiction editor of AGNI Magazine\n\nMake a Scene is one of the clearest, most pragmatic books about writing fiction I have ever come across. Refreshingly lacking in ego and full of useful examples and discussion. -- --Maryanne Stahl, author of The Opposite Shore and Forgive the Moon\n\nMake a Scene will answer all the questions you might ask--and some you won't think of asking--on the scene. In clear and concise language, using innumerable examples from James Joyce's &quot;The Dead&quot; through Joseph Conrad's The Secret Sharer and on to Harry Potter, with explanations of terms from &quot;the reveal&quot; to the epiphany, Jordan Rosenfeld explores all the secrets of the scene. For the beginning writer, as well as one who thinks he/she knows it all. -- --Sheila Kohler, award-winning author of Cracks, Crossways, and Bluebird: Or the Invention of Happiness\nAbout the Author\nJordan E. Rosenfeldis the creator and host of the literary radio program Word by Word: Conversations with Writers on NPR-affiliate KRCB radio. Her essays and stories have appeared in literary journals and magazines such as Night Train, Pedastal Magazine, the Summerset Review, the Red Hills Review, and the Dickens Literary Journal. Her articles and essays have appeared in such notable publications as Writer's Digest, The Writer, The St. Petersburg Times, and she contributes book reviews to KQED Radio's California Report.","torrent":{"xt":"urn:btih:775ba080ecaae2418f913c6af6b44f8eaff2d126","amp;dn":"Make+a+Scene%3A+Crafting+a+Powerful+Story+One+Scene+at+a+Time+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"775ba080ecaae2418f913c6af6b44f8eaff2d126","infoHashBuffer":{"type":"Buffer","data":[119,91,160,128,236,170,226,65,143,145,60,106,246,180,79,142,175,242,209,38]},"announce":[],"urlList":[]}}