{"title":"America's Next Top Model Cycle 21 Episode 2 S21E02 (The Guy Who","uid":11015145,"size":265687554,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:77c4c47f3c59da153d85c1ce0993373388982d93&amp;dn=America%27s+Next+Top+Model+Cycle+21+Episode+2+S21E02+%28The+Guy+Who+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"magisterjieko","files":1,"time":1410459910,"description":"The Guy Who Gets a Second Chance\nOriginal Airdate: August 25, 2014\n\nThe models take part in a competition themed subway challenge, overseen by photographer Franco Lacosta. The goal is to put together a season themed outfit (Spring, Summer, Fall, Winter) in each station, and hurry into the train before the doors close. Several contestants fail to board the train on time each round. Ultimately only two contestants, Danny and Matthew, remain by the fourth station. Franco declares Matthew as the winner of the challenge.\n\nThe following day, the contestants are taken to a beach. There, they are greeted by Kelly Cutrone and Yu Tsai. Kelly reveals that Yu Tsai will be the new creative director of the show. A few moments after, the models are whisked away for a photo shoot in the beach. Each contestant poses alone before gathering together for a massive group shot.\n\nAfter the photo shoot is over, Tyra and the judges deliberate and select the final fourteen. Unlike previous years, the models are not called forward individually for the final round of casting. Instead, they are called in pairs. Tyra reveals that from each pair, one contestant will be admitted, and the other will be asked to wait. The process is repeated until all the spots are filled. During one of the rounds Tyra accepts both Adam and Denzel, filling all the spots and eliminating the remaining eight semi-finalists","torrent":{"xt":"urn:btih:77c4c47f3c59da153d85c1ce0993373388982d93","amp;dn":"America%27s+Next+Top+Model+Cycle+21+Episode+2+S21E02+%28The+Guy+Who+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77c4c47f3c59da153d85c1ce0993373388982d93","infoHashBuffer":{"type":"Buffer","data":[119,196,196,127,60,89,218,21,61,133,193,206,9,147,55,51,136,152,45,147]},"announce":[],"urlList":[]}}