{"title":"[CCS-Speed]_One_Piece_588_[720p] [7A5C9310].mkv","uid":8296644,"size":544313576,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7874137fc9a6502a76601bf9b1e4a5979708b03b&amp;dn=%5BCCS-Speed%5D_One_Piece_588_%5B720p%5D+%5B7A5C9310%5D.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"k1ng_ruLz","files":1,"time":1364158762,"description":"One Piece - Episode 588 &quot;First Meeting in Two Years! Luffy and Law&quot;\n\n\nTwenty years have passed since Roger's execution, and Monkey D. Luffy, a young pirate inspired by the pirate known as &quot;Red-Haired&quot; Shanks, has since set off on a journey from the East Blue to succeed Roger and find the treasure. He organizes and leads a nine-member crew named the Straw Hat Pirates. Each crew member Luffy encounters eventually become his close friends, including the swordsman Roronoa Zoro, the navigator and thief Nami, the sniper Usopp, the womanizing chef and martial artist Sanji, the doctor and anthropomorphized reindeer Tony Tony Chopper, the archaeologist Nico Robin, the cybernetic shipwright Franky, and the musician skeleton Brook.\nThe crew crosses paths with diverse villains, such as Buggy the Clown, many of the Seven Warlords of the Sea, the Marines, who place bounties on Luffy's, Zoro's, and eventually the rest of the crew's heads, and Arlong, a fishman and member of the former Sun Pirates. They encounter Baroque Works, the crime syndicate responsible for a civil war in the desert kingdom of Alabasta, along with fellow pirate Blackbeard, whose dream is also to become the King of the Pirates. The crew also confronts Enel, the ruler of the floating island Skypiea. Later, the crew meets the Marine admiral Aokiji, who reveals that Robin was involved in searching for Poneglyphs, stones with markings left by an ancient civilization whom Roger himself was also able to read. The crew also encounters Cipher Pol No. 9, the intelligence agency responsible for the destruction of Robin's homeland, who causes the pirates to declare war on the World Government. After an epic battle at Enies Lobby, the crew defeats CP9 - saving Robin and avenging the lives lost in the destruction - and each member receives bounties on their heads.\nSome time later, the crew prepares to sail off to the New World, the second half of the Grand Line. The crew eventually gets separated during a battle at the Sabaody Archipelago. At the same time, the Marines sentence Luffy's older (adopted) brother who as it turns out is also Gol D. Roger's son Portgas D. Ace to be executed, and hold a war against a group of pirates led by Whitebeard. Luffy eventually rescues Ace, but both Whitebeard and Ace are killed in the ensuing chaos. Later, Luffy and the crew undergo rigorous training regimens, some under the tutelage of prominent figures. Two years later, the crew regroups and journeys to Fishman Island to enter the New World.","torrent":{"xt":"urn:btih:7874137fc9a6502a76601bf9b1e4a5979708b03b","amp;dn":"%5BCCS-Speed%5D_One_Piece_588_%5B720p%5D+%5B7A5C9310%5D.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7874137fc9a6502a76601bf9b1e4a5979708b03b","infoHashBuffer":{"type":"Buffer","data":[120,116,19,127,201,166,80,42,118,96,27,249,177,228,165,151,151,8,176,59]},"announce":[],"urlList":[]}}