{"title":"Adolf Hitler - Mein Kampf -The Ford Translation","uid":7207898,"size":392421770,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:78f6ae2da7364ee6348e418ee77631093a849f2c&amp;dn=Adolf+Hitler+-+Mein+Kampf+-The+Ford+Translation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Aesopian","files":-1,"time":1335150363,"description":"For the first time in 65 years, a modern, easy to understand, truly complete and uncensored edition of Mein Kampf has been released which reveals more than any past translation. This hardcover book is also the first translation available in an English language audio format.\n\nOlder translations altered passages, omitted passages, mistranslated Hitler's words, made some parts more sensational while concealing the true meaning in other parts of the book. If you have read one of these older translations of Mein Kampf, then you have not read the REAL Mein Kampf which is found only in the Ford Translation.\n\nMein Kampf is often portrayed as nothing more than an Anti-Semitic work, however only 6% of it even talks about the Jews. The rest contains Hitler's ideas and beliefs for a greater nation plus his plan on how to accomplish that goal. He outlines his plans for not only world conquest, but the conquest of the universe. The majority of the work involves Hitler's discussion of the German people's difficult times after the First World War, his political theories and his organization of the Nazi Party, as well as many attacks against his enemies which makes it a very interesting and moving story.\n\nMein Kampf offers an interesting interpretation of politics, people, and foreign policy matters. To characterize it as simply a racist work is to oversimplify its message. Germany did not follow Hitler because he was a racist, they followed him because he promised a great future, and Mein Kampf is where he promised that great future.\nThis edition is the only accurate and complete English translation of Mein Kampf ever made.\n\nThis Ford Translation offers:\n\n      * The most accurate translation ever produced.\n      * Phrases that are translated with precision and with no translator's bias.\n      * Uncommon words are replaced with more common and more meaningful terms.\n      * Any references to unfamiliar people, or places are explained in the text.\n      * This version is complete with all original passages and references restored, including passages omitted from other popular versions.\n\n\nThis translation has corrected over 1000 errors which were present in past translations.\n\nNo English reader has been able to appreciate these subtleties in any previous English translation, not until the Ford Translation.\n\nIncludes Photos and Illustrations of events and people in Mein Kampf Volume I and II\nClick the order button to receive the book so many people wish to disparage and see why they will do anything to have the printing of this book outlawed. They have already tried...\n\nThis is the only edition that was so thoroughly researched and verified that it required a separate book(Mein Kampf: A Translation Controversy) to document the changes and corrections made which prove the dynamic style of the Ford translation is superior to all past mechanical translations.\n\nRead the hardback version, then decide for yourself if he was a mad-man or a genius. ","torrent":{"xt":"urn:btih:78f6ae2da7364ee6348e418ee77631093a849f2c","amp;dn":"Adolf+Hitler+-+Mein+Kampf+-The+Ford+Translation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78f6ae2da7364ee6348e418ee77631093a849f2c","infoHashBuffer":{"type":"Buffer","data":[120,246,174,45,167,54,78,230,52,142,65,142,231,118,49,9,58,132,159,44]},"announce":[],"urlList":[]}}