{"title":"Encyclopedia of Adolescence - B. Bradford Brown, Mitchell J. Pri","uid":15570662,"size":11633059,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78f8a965e660999c1a6ce2d4e5900c5ea8976f13&amp;dn=Encyclopedia+of+Adolescence+-+B.+Bradford+Brown%2C+Mitchell+J.+Pri&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471257363,"description":"Encyclopedia of Adolescence - B. Bradford Brown, Mitchell J. Prinstein (AP, 2011).pdf\r\n\r\nThe period of adolescence involves growth, adaptation, and dramatic reorganization in almost every aspect of social and psychological development. The Encyclopedia of Adolescence offers an exhaustive and comprehensive review of current theory and research findings pertaining to this critical decade of life. Leading scientists offer accessible and easily readable reviews of biological, social, educational, occupational, and cultural factors that shape adolescent development. Issues in normative development, individual differences, and psychopathology/maladjustment are reviewed. Over 130 chapters are included, each covering a specific aspect or issue of adolescence. The chapters trace differences in the course of adolescence in different nations and among youth with different backgrounds.\r\n\r\nThe encyclopedia brings together cross-disciplinary contributors, including academic researchers, biologists, psychiatrists, sociologists, anthropologists and public policy experts, and will include authors from around the world. Each article features an in-depth analysis of current information on the topic, along with a glossary, suggested readings for further information, and cross-references to related encyclopedia articles. The volumes offer an unprecedented resource for all audiences, providing a more comprehensive understanding of general topics compared to other reference works on the subject.\r\n\r\nAvailable both in print and online via SciVerse Science Direct.\r\n\r\nWinner of the 2011 PROSE Award for Multivolume Reference in Humanities &amp; Social Science from the Association of American Publishers; and named a 2012 Outstanding Academic Title by the American Library Association's Choice publication\r\nBrings together cross-disciplinary contributors, including developmental psychologists, educational psychologists, clinical psychologists, biologists, psychiatrists, sociologists, anthropologists and public policy experts\r\nPublished both in print and via Elsevier's ScienceDirect™ online platform","torrent":{"xt":"urn:btih:78f8a965e660999c1a6ce2d4e5900c5ea8976f13","amp;dn":"Encyclopedia+of+Adolescence+-+B.+Bradford+Brown%2C+Mitchell+J.+Pri","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78f8a965e660999c1a6ce2d4e5900c5ea8976f13","infoHashBuffer":{"type":"Buffer","data":[120,248,169,101,230,96,153,156,26,108,226,212,229,144,12,94,168,151,111,19]},"announce":[],"urlList":[]}}