{"title":"The.Last.Days.Of.Series.1.5of6.Guy.Fawkes.PDTV.x264.AAC.MVGroup.","uid":11961400,"size":627277211,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:791c4c7f51ee57df8407acd04cd1d37b06a82fd2&amp;dn=The.Last.Days.Of.Series.1.5of6.Guy.Fawkes.PDTV.x264.AAC.MVGroup.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artistharry","files":1,"time":1432567292,"description":"The Last Days Of...\n\nHistory Documentary hosted by Toby Jones, published by Channel 5 in 2015 - English narration\n  &lt;a href=&quot;\nhttp://docuwiki.net/images/2/23/The-Last-Days-Of...-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/2/23/The-Last-Days-Of...-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nThe Last Days Of...\nHistory is peppered with men and women who changed the world, only to become more controversial in death than they were in life. Ê»The Last Days of...Ê¼ examines six giants of history who suffered bloody and brutal deaths, retelling their stories, which are packed with unexpected twists and turns.\nEach episode features a panel of writers, thinkers and historians who set about exploring the downfall and legacy of these characters. This is history as it should be - compelling, dramatic and highly contested. It makes us question everything we thought we knew about the lives and deaths of the heroes and villains who have shaped our world.\n\n\n1)  Mary Queen of Scots \nJohn Guy, Kate Williams and Robert Hutchinson are among those debating the legacy of one of Britain's most tragic monarchs as they examine whether Mary, Queen of Scots, was a victim of her cousin Elizabeth I's treachery or the author of her own destruction. They look at her claim to the English throne and the events that led to Mary being kept under house arrest for nearly 20 years before she was executed in 1587.\n\n2)  Rasputin \nHelen Rappaport and Dominic Lieven are among the writers, thinkers and historians exploring the downfall and legacy of Grigori Rasputin. The Siberian peasant and faith healer rose from obscurity to become an adviser to Tsar Nicholas II and his family, before being assassinated in December 1916, and the contributors examine whether he was motivated by sex addiction or was a seer who only wanted the best for Russia.\n\n3)  Charles 1 \nWriter and actor Mark Gatiss, academic Hannah Dawson and human rights barrister Geoffrey Robertson are among those giving their views on the life and death of Charles I, who ruled England, Scotland and Ireland for more than 20 years in the 17th century. The king was put on trial for treason in January 1649 in an unprecedented attempt to try the institution of the monarchy as well as Charles himself, who was found guilty of treason and executed.\n\n4)  Jesus Christ \nWas Jesus crucified because it was ordained, or because he was a threat to Roman rule? Retired Anglican bishop Tom Wright and writer Naomi Alderman are among the authors and historians considering the evidence and offering their interpretations of the man behind one of history's most powerful stories.\n\n5)  Guy Fawkes \nWas the Gunpowder Plot of 1605 a spectacular act of rebellion, or a fanatical act of terrorism? Retelling the last days in the life of Guy Fawkes, counter-extremism expert Haras Rafiq, Alice Hogge and Ronald Hutton make the case for and against the man whose actions continue to set the country ablaze every year over 400 years after his death.\n\n6)  Julias Caesar \nMore than 2,000 years after the event, the assassination of Roman dictator Julius Caesar still fascinates like no other act of political violence. Novelist Robert Harris, historian Neil Faulkner and classicist Maria Wyke are among the experts examining whether it was the necessary execution of a tyrant who would stop at nothing in his pursuit of power, or a cowardly murder.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0a476b63644a4639243b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1851 Kbps\n * Video: Resolution: 832 x 468\n * Video: Aspect Ratio: 1.778 (16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 45mins\n * Framerate: 25fps\n * Number of Parts: 6\n * Part Size: 595 MB average\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:791c4c7f51ee57df8407acd04cd1d37b06a82fd2","amp;dn":"The.Last.Days.Of.Series.1.5of6.Guy.Fawkes.PDTV.x264.AAC.MVGroup.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"791c4c7f51ee57df8407acd04cd1d37b06a82fd2","infoHashBuffer":{"type":"Buffer","data":[121,28,76,127,81,238,87,223,132,7,172,208,76,209,211,123,6,168,47,210]},"announce":[],"urlList":[]}}