{"title":"Post-Romantic Comedy: A Startup Comedy (PDF)","uid":15978535,"size":123880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:793ada98c0dfcbb323028cbad4316f82318a280e&amp;dn=Post-Romantic+Comedy%3A+A+Startup+Comedy+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"prcsc","files":1,"time":1475870939,"description":"From the prologue of Post-Romantic Comedy: A Startup Comedy (minus the web links and formatting in the PDF):\r\n\r\nThis serial novel showcases my BigCo-/VC-praised design of a next-gen variant of LinkedIn.\r\n\r\nVia equity crowdfunding, you'll be able to own part of my planned startup.\t\t\t\t\r\n\t\t\t\t\t\r\n--Praise for a previous version of said design--\r\n\r\nFrom a 2004 email sent to me byfirst Director of Personalization:\r\n\r\nFrank, I just spent about an hour surfing around your website with a bit of amazement. I run a little company . . . We are a team of folks who worked together atdeveloping that company's personalization and recommendations team and systems. We spent about 1.5 years thinking about what we wanted to build next. We thought a lot about online education tools. We thought a lot about classified ads and job networks. We thought a lot about reputation systems. We thought a bit about personalized advertising systems. We thought a lot about blogging and social networking systems [my emphasis]. . . . I guess I'm mostly just fascinated that we've been working a very similar vein to the one you describe, without having a solid name for it (we call it &quot;the age of the amateur&quot; or &quot;networks of shared experiences&quot; instead of CLLCS [i.e., customized lifelong learning and career services], but believe me, we are talking about the same patterns and markets, if not in exactly the same way). Thanks for sharing what you have—it's fascinating stuff.\r\n\r\n--FUN fact--\r\n\r\nPopularizing an implementation of said design will be foundational for establishing the most popular online market for customized education (CE).\r\n\r\n--Praise for my early work on CE--\r\n\r\nFrom a 1998 email sent to me by the then Manager of the Learning Sciences and Technology Group at Microsoft Research:\r\n\r\nFrank, you are a good man. Have you thought about joining this team? Your only alternative, of course, is venture capital. But their usual models require getting rid of the &quot;originator&quot; within the first eighteen months.\r\n\r\n--Re: the making of Post-Romantic Comedy (PRC)--\r\n\r\nSince 2006 my primary focus has been learning how to run marketing and site-user showcasing as a profit center. More precisely, how to manage an analytics-savvy variant of Alloy Entertainment, a book packager and television-programming producer that was acquired for $100M in 2012. In 2011 I became aware that the U.S. Congress was working to legalize equity crowdfunding.\r\n\r\n--Re: equity-crowdfunding laws enacted in 2015--\r\n\r\nKey laws (apply to 12-month periods):\r\n\r\nAny non-wealthy adult (i.e., non-accredited investor) can invest up to 10% of her annual income in startups, or up to 10% of her net worth.\r\n\r\nAny startup can raise up to $50M via equity crowdfunding.\r\n\r\n--Re: you receiving an email alert when I seek funding--\r\n\r\nThe postscript of chapter one provides a link to an email list you can join.\r\n\r\n--End of the excerpt from PRC--\r\n\r\nEnjoy!","torrent":{"xt":"urn:btih:793ada98c0dfcbb323028cbad4316f82318a280e","amp;dn":"Post-Romantic+Comedy%3A+A+Startup+Comedy+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"793ada98c0dfcbb323028cbad4316f82318a280e","infoHashBuffer":{"type":"Buffer","data":[121,58,218,152,192,223,203,179,35,2,140,186,212,49,111,130,49,138,40,14]},"announce":[],"urlList":[]}}