{"title":"Vanya on 42nd Street ( Chekhov)1994 with rus and eng audio","uid":5266381,"size":1456794485,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:794a51b5c60d9bdb509e45bbeb1a8d6bba1eb39e&amp;dn=Vanya+on+42nd+Street+%28+Chekhov%291994+with+rus+and+eng+audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"omdaru","files":4,"time":1262896773,"description":"choose in settings stream 1 - russian audio or stream 2- english audio &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Vanya_on_42nd_Street&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Vanya_on_42nd_Street&lt;/a&gt;\n\nVanya on 42nd Street is a 1994 film by Louis Malle and Andre Gregory. The film is an intimate, interpretive performance of the play Uncle Vanya by Anton Chekhov based on the English translation by David Mamet. The film starred Wallace Shawn and Julianne Moore.\n\nProduction\n\nOver the course of three years, director Andre Gregory and a group of actors came together on a voluntary basis in order to better understand Chekhov's work through performance workshops. Staged and filmed entirely within the vacant shell of the then-abandoned Amsterdam Theater on 42nd Street in New York City, they enacted the play rehearsal style on a bare stage with the actors in street clothes. Free from any commercial demands, their performances were for an invited audience only. Gregory and Malle decided to document the play as they had developed it. The film was the result of the collaborative process.\n\nLocation\n\nWorkshop rehearsals with Gregory and the cast originally took place at the abandoned Victory Theatre on 42nd Street in New York City. The filmed version was shot entirely within the New Amsterdam Theatre, also on 42nd Street. Built in 1903, the theatre was the original home of the Ziegfeld Follies, a historical tidbit mentioned in the film during some pre-show banter. In the late 1930s, the New Amersterdam Theatre was transformed into a movie palace. The theatre remained a movie palace until Ã‚Â«temporarilyÃ‚Â» closed in 1982.\n\nAt the time Vanya on 42nd Street was filmed, the theatre had been abandoned for over ten years and was in a state of severe disrepair. Rats had chewed through much of the stage rigging, thus making the stage unusable. For the film production, some rows of seats were removed and a small platform was built for the cast and film crew. Shortly after the production of Vanya, the New Amsterdam was leased to The Walt Disney Company. Disney restored the theatre to its grand original design and reopened it in 1997.\n\nCast and Crew\n\n    * Shawn, Gregory, and Malle had previously collaboratorated on the 1981 film My Dinner with Andre.\n    * The film would be the last of Malle's career.\n    * Julianne Moore, whose film career had recently been gaining notice from a critically acclaimed role in Short Cuts, was the actor predominantly featured in the advertising campaign for the film. The campaign didn't highlight the ensemble nature of the production, which led some confused movie-goers to think the film was about a woman named Vanya.\n    * Vanya on 42nd Street also features several actors known to the New York stage, including George Gaynes (also recognizable from the hit TV series Punky Brewster), Larry Pine, Phoebe Brand, Brooke Smith, and Lynn Cohen.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0111590/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0111590/&lt;/a&gt;\n\n24 out of 30 people found the following comment useful:-\nFour Layers, 30 August 2000\nAuthor: tedg (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3e4a5b5a597e785752534d7851525a5b5a105d5153&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Virginia Beach\n\nThere's no shortage of intelligent work in film. But here we have one of the most complexly referential things I've ever seen. Simple self-reference points to itself. Common self-reference points to the viewer defining the experience.\n\nBut Mingus used to say why have three threads when you can have seven? Here, some of the most adventurous thinkers in film give us four threads, actually four and a half.\n\nWe have the Chekhov play and the Mamet wrapping. Make no mistake that this is not an editing or a translation, but an annotation. We have two perspectives simultaneously. Add to that the notion of the play not as a play for an audience as intended, but an event conducted regularly by the performers for their own sake. This is a creation orchestrated by Gregory, the third thread. One can clearly see in some scenes neither Chekhov nor Mamet but artists collaborating in dialogs. The inner eyes and the outer eyes differ.\n\nFourth, we have Malle's creation which introduces us into the equation with deliberately shaky and sometimes misframed camerawork. We aren't part of any prior experience, but the actors do include the camera in their collaboration, as an independent thread. Watch how Andre works the camera.\n\nAnd finally, we have the framing of the artists in real life. This is not simultaneous with the others and in any case excludes the filmmaker.\n\nI recall seeing Paul Newman in the Color of Money in the first scene, acting on three levels simultaneously. It took my breath away. Here, the purpose of the whole contrivance is to challenge the actors (and the viewers!) to participate in a jazz ensemble of acting where the layer of reality is constantly shifting. They chose Uncle Vanya as the base for a reason, because his evershifting foci of love and hate in pairs provide cues for levelshifting.\n\nShawn really plays on this. His skill wasn't apparent to me on first viewing, especially in the first scenes, where all players are on stage and the non-focus actors have to be invisible. But on repeated viewings one can see his mastery, his shifting forehead! Maybe he could have been a Dostoyevsky. The two young women should be celebrated to the heavens for what they do together. I never believed so many giggles and gasps and stutters and excited silences could be so finely woven, tossed so lightly.\n\nThis is really, really good stuff, very smart. So far as an intelligent construction you won't see a superior. I never expect to see four levels at once again in film at least centered in the acting.","torrent":{"xt":"urn:btih:794a51b5c60d9bdb509e45bbeb1a8d6bba1eb39e","amp;dn":"Vanya+on+42nd+Street+%28+Chekhov%291994+with+rus+and+eng+audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"794a51b5c60d9bdb509e45bbeb1a8d6bba1eb39e","infoHashBuffer":{"type":"Buffer","data":[121,74,81,181,198,13,155,219,80,158,69,187,235,26,141,107,186,30,179,158]},"announce":[],"urlList":[]}}