{"title":"Scanner Radio Pro v4.0.1.1","uid":9078823,"size":1627678,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:7a65c349d821e0025fd4835e07fb3183aca0d2ee&amp;dn=Scanner+Radio+Pro+v4.0.1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Androider","files":-1,"time":1382350019,"description":"\nListen to live audio from over 4,100 police and fire scanners, weather radios, and amateur radio repeaters from around the world (primarily in the United States and Australia, with more being added daily) on your phone.\n\nFeatures:\n\n* View scanners that are located nearest you, sorted by distance.\n* View the top 50 scanners that have the most listeners (list updated every 5 minutes).\n* View list of scanners added most recently (new additions are being added all the time).\n* Add scanners you listen to the most to your Favorites list for quick access.\n* Browse the directory of scanners by location or genre (public safety, air traffic, weather, railroad, etc).\n* Enable notifications to be notified when lots of people (such as over 1000, for example) are listening to any scanner (indicating that something big is happening). You can also be notified when scanners located near you (or specific scanners of your choosing) have more than a certain number of listeners.\n* Add Scanner Radio Pro widgets and shortcuts to your phone's home screen for quick access (app cannot be installed on SD card to access them).\n* Add a &quot;Scanner Radio Pro Favorite&quot; shortcut to your home screen to launch a scanner feed via an alarm clock app or automation app.\n\nIn addition to the above features, you also get the following features with this version of the app:\n\n* The ads are removed.\n* The play button at the top of the directory screens and on the widgets can be used to start listening without having to go to the player screen.\n* With the &quot;Scanner Radio Pro Locale PlgIn&quot; plug-in is also installed you can have Locale/Tasker launch the app and have one of your Favorites automatically begin playing based on one or more conditions or have the app stop playing. One use for this feature is to have a scanner feed begin playing when your phone connects to a specific Bluetooth device and then have it stop when the connection to that Bluetooth device is no longer present.\n\nThe audio is provided by volunteers (primarily for Broadcastify.com) using real scanner radios.\n\nWhat's New:\n\nFixed a bug which resulted in the player screen not reporting when a scanner feed is offline.\nFixed a bug which resulted in the &quot;Repeat notification?&quot; notification setting to not have any effect.\nFixed some crashes.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.scannerradio_pro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.scannerradio_pro&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7a65c349d821e0025fd4835e07fb3183aca0d2ee","amp;dn":"Scanner+Radio+Pro+v4.0.1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a65c349d821e0025fd4835e07fb3183aca0d2ee","infoHashBuffer":{"type":"Buffer","data":[122,101,195,73,216,33,224,2,95,212,131,94,7,251,49,131,172,160,210,238]},"announce":[],"urlList":[]}}