{"title":"Social Network Analysis in Construction (PDF)","uid":8795662,"size":2946048,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a78c968ad4d377626a155b2eee4edb4d3d19f82&amp;dn=Social+Network+Analysis+in+Construction+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KaavaBoT","files":1,"time":1376072764,"description":"Social Network Analysis in Construction (PDF)\n\n\nAuthor: Stephen Pryke\nYear: 2012 \n284 Pages \nISBN: 1118343913 \nFormat: PDF \nSize: 3 MB\n\nThe objective of the book is to make accessible the ways in which social network analysis (SNA) may be used to observe, monitor and analyse systems and relationships in major construction project coalitions. Although this has been an established analytical technique in the US for some time, it is only now being developed in the UK.\n\nHaving spent nearly two decades investigating major project relationships using SNA, the author has brought together mathematical and sociological methods, and major project relationships in a manner that will inspire both academic interest and a desire to apply these concepts and techniques to live construction projects. Case studies include projects from two of the UKs largest property developers, the UK Ministry of Defence and a County Council.\nSNA is innovative - but potentially inaccessible to project management analysts and practitioners. This book will provide clear and relevant explanation and illustration of the possibilities of using SNA in a major project environment.\nIn addition to offering the potential; for sophisticated retrospective analysis of a wide range of systems associated with construction and engineering project coalitions, the author looks at how we might apply the network analysis findings to the design and management of project and supply chain networks.\n\nPlease Rate and Comment\n\nPlease Seed atleast upto 1:1 Ratio","torrent":{"xt":"urn:btih:7a78c968ad4d377626a155b2eee4edb4d3d19f82","amp;dn":"Social+Network+Analysis+in+Construction+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a78c968ad4d377626a155b2eee4edb4d3d19f82","infoHashBuffer":{"type":"Buffer","data":[122,120,201,104,173,77,55,118,38,161,85,178,238,228,237,180,211,209,159,130]},"announce":[],"urlList":[]}}