{"title":"Teagan Presley - Babysitters","uid":6938340,"size":183852841,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7aa9b2d64ed49986e50c2a80bb9edaf02e42b6e1&amp;dn=Teagan+Presley+-+Babysitters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":null,"files":2,"time":1325912769,"description":" &lt;a href=&quot;http://sharezones.biz/view.php?filename=2012/01/07/image_4f07c4021d8d2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://sharezones.biz/view.php?filename=2012/01/07/image_4f07c4021d8d2.jpg&lt;/a&gt;\n\n\nScene 4. After teasing Tyler about hurting his leg riding Motorcross when she arrives, Teagan later catches him jerking off with a warm wet washcloth. He tries getting rid of her, but she insists on him showing her how he does it and gives him the extra incentive of showing him her tits. Teagan orders him to get it hard for her before dropping down and working it into her throat while giving him plenty of eyes. Tyler reaches down to play with her holes before eating them as Teagan bends over the counter for him. He lays back so Teagan can ride him cowgirl style before standing up and fucking each of her holes cowgirl style. Teagan pops up a couple times to eagerly suck her ass off his cock before laying back for him to fuck her ass in missionary and cowgirl more, and finishes things up taking a nice pop over her ass. Tyler rubs the load in, and then Teagan turns around to suck out every last drop of his cum. This is another great scene. Teagan plays up the opening very well, and with every week that passes she seems to grow even more beautiful. There\\\\\\'s nice chemistry between her and Tyler, and she puts out some very nice vocals and energy to go with it. She takes it in the ass as well as she ever did, but I would have liked a few angles to show the ass off better than the short cowgirl fuck did. Even with that minor complaint, this is a darn hot scene that should please many Teagan fans. ","torrent":{"xt":"urn:btih:7aa9b2d64ed49986e50c2a80bb9edaf02e42b6e1","amp;dn":"Teagan+Presley+-+Babysitters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa9b2d64ed49986e50c2a80bb9edaf02e42b6e1","infoHashBuffer":{"type":"Buffer","data":[122,169,178,214,78,212,153,134,229,12,42,128,187,158,218,240,46,66,182,225]},"announce":[],"urlList":[]}}