{"title":"The Day in its Color - Charles Cushmans Photographic Journey Thr","uid":11193642,"size":29014519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ac0426c8dac0d4ad195c3f61d7a06f979e07127&amp;dn=The+Day+in+its+Color+-+Charles+Cushmans+Photographic+Journey+Thr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1413044395,"description":"The Day in Its Color: Charles Cushman's Photographic Journey Through a Vanishing America by Eric Sandweiss\nEnglish | 2012 | 240 pages | PDF | 28 MB\n\nCharles Cushman (1896-1972) photographed a disappearing world in living color. Cushman's midcentury America--a place normally seen only through a scrim of gray--reveals itself as a place as vivid and real as the view through our window.\n\nThe Day in Its Color introduces readers to Cushman's extraordinary work, a recently unearthed archive of photographs that is the largest known body of early color photographs by a single photographer, 14,500 in all, most shot on vivid, color-saturated Kodachrome stock. From 1938-1969, Cushman--a sometime businessman and amateur photographer with an uncanny eye for everyday detail--travelled constantly, shooting everything he encountered as he ventured from New York to New Orleans, Chicago to San Francisco, and everywhere in between. His photos include portraits, ethnographic studies, agricultural and industrial landscapes, movie sets and media events, children playing, laborers working, and thousands of street scenes, all precisely documented in time and place. The result is a chronicle of an era almost never seen, or even envisioned, in color. \n\nThis well-preserved collection is all the more remarkable for having gone undiscovered for decades. What makes the photos most valuable, however, is the wide range of subjects, landscapes, and moods it captures--snapshots of a lost America as yet untouched by a homogenizing overlay of interstate highways, urban renewal, chain stores, and suburban development--a world of hand-painted signs, state fairs, ramshackle shops, small town living and bustling urban scenes. The book also reveals the fascinating and startling life story of the man who stood, unseen, on the other side of the lens, surely one of America's most impressive amateur photographers and outsider artists. \n\nWith over 150 gorgeous color prints, The Day in Its Color gives us one of the most evocative visual histories of mid-20th century America that we have.","torrent":{"xt":"urn:btih:7ac0426c8dac0d4ad195c3f61d7a06f979e07127","amp;dn":"The+Day+in+its+Color+-+Charles+Cushmans+Photographic+Journey+Thr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac0426c8dac0d4ad195c3f61d7a06f979e07127","infoHashBuffer":{"type":"Buffer","data":[122,192,66,108,141,172,13,74,209,149,195,246,29,122,6,249,121,224,113,39]},"announce":[],"urlList":[]}}