{"title":"Plato The Apology of Socrates + Phaedo 4CD (Bruce Alexander)","uid":6834409,"size":135580419,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7ac4e9fbd0ea1a869cb475e56d9eb968335a81cb&amp;dn=Plato+The+Apology+of+Socrates+%2B+Phaedo+4CD+%28Bruce+Alexander%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"michaelrizzo","files":-1,"time":1321974751,"description":"4CD set in mp3 format\n\n&quot;The trial and death of Socrates&quot; - the apology of Socrates and Phaedo\n(Plato) read by Bruce Alexander et al\n\nThe unexamined life is not worth living says Socrates in this writing\nby Plato - and he goes on to discover whether &quot;to know what is right is\nto do what is right&quot; - or perhaps &quot;you don't really know what is right&quot; -\nbeing the argument as it were.\n\nThis is not the stuff of John Stuart Mill who argues with precision that is\nincredulously the stuff of brilliance and true genius.\n\nThere are too many self supported statements that seem as assertions dressed up\nwith rhetoric to seem self explanatory or self evident or in any event self\nsufficient perhaps, given the reputation of the speaker (Socrates) and the \nvernacular style of the relaxed manner of rhetorical banter of the time and place in question.\n\nThat all said, this is one of the great works of Classical Philosophy from\nancient times and is standard reading in all Universities dealing with western\nthought from this period and genre of material equally.\n\nAs such it should have been commissioned into the public domain a long time ago -\nbut for the universal lack of wisdom on this planet in respect of the Bill Gates\ntypes that are required to write the cheques more sensibly. the text itself as\ncertainly already in the public domain so it only requires a few hours of a\ncompetent enough speaker who is adequately to be compensated for his or her efforts I say.\n\nas it is this 4CD set is priced at fully twenty six pounds at some enterprising\nsites on the net as Bruce Alexander is well considered in his talented \nperformance here I gather, on the part of others too perhaps.In any event its\na nice British accent - and it beats the offerings of Michael Scott &quot;hands down&quot;\nas unacceptably boring by any measure of comparison whatever.\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7ac4e9fbd0ea1a869cb475e56d9eb968335a81cb","amp;dn":"Plato+The+Apology+of+Socrates+%2B+Phaedo+4CD+%28Bruce+Alexander%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac4e9fbd0ea1a869cb475e56d9eb968335a81cb","infoHashBuffer":{"type":"Buffer","data":[122,196,233,251,208,234,26,134,156,180,117,229,109,158,185,104,51,90,129,203]},"announce":[],"urlList":[]}}