{"title":"Irving Rapper - The Glass Menagerie (1950)","uid":4614198,"size":1466744832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7b378bd0e79a5f54e8a642b301499f40c9913569&amp;dn=Irving+Rapper+-+The+Glass+Menagerie+%281950%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1230750300,"description":"Irving Rapper - The Glass Menagerie (1950)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0042509/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0042509/&lt;/a&gt;\n\n-----not my rip--------\n\n\nThis filming of the lyrically superb Tennessee Williams play, one of the most popular in American theater revivals, is sensitive and wellconstructed but somewhat misdirected. The prosaic story involves a proud but dominating mother, Lawrence, her crippled, day-dreaming daughter, Wyman, and her disillusioned son, Kennedy. The three live in a run-down apartment in the tenement district of St. Louis. Lawrence's husband is long gone, a runaway &quot;telephone man who fell in love with long distance.&quot; She is forever telling her grown children that when she was a southern belle there was no end to the &quot;gentlemen callers&quot; knocking on her door. Her son, Kennedy, who writes poetry, is also a romantic but it is his hard reality to provide the financial support for the family by slaving in a warehouse. Lawrence incessantly nags her children to improve their lot, Kennedy to get a better job and Wyman to see young men and select a husband. Wyman, however, retreats to her room to clean and fondle her glass figurine collection, her &quot;glass menagerie.&quot; Concluding that Wyman will never make a move on her own, Lawrence goads Kennedy into bringing home a fellow warehouse worker, Douglas, a &quot;gentleman caller&quot; Lawrence comes to believe will sweep her daughter off her feet and into a wedding ceremony. Douglas is actually doing Kennedy a favor but he is gentle and kind toward the shy Wyman, drawing her out. This he has little trouble doing because Wyman remembers Douglas from high school where she had a secret crush on him. Douglas takes her to a dance hall and patiently encourages her to dance with him, which she does. Later, he tenderly kisses her but realizes that he has gone too far, quickly explaining that he is engaged. Yet Wyman is not devastated. Douglas has shown Wyman that even though she has a crippled foot, she can still enjoy life, that if she reaches out, someone will be there for her. Lawrence later blames Kennedy for bringing home a man almost married and falsely building up Wyman's hopes, the very thing she herself has been doing all along. Disgusted, Kennedy leaves home, taking a job as a merchant seaman but promising to send money home every month. At film's end Wyman is seen sitting on the apartment fire escape with her mother, waiting for another &quot;gentleman caller,&quot; believing that some day he will come.\n\nThis bittersweet, delicate story is handled with care by director Rapper, but the accent is placed more on laughs than on pensive study, which somewhat weakens the play's original intent. Burks' fluid camera, however, avoids a stagey look to the production. Lawrence overacts a bit but Kennedy and Wyman are both convincing and sympathetic as the young adults trapped by poverty. Douglas, who was then just starting to have an impact in films, is terrific as the kind-hearted, understanding &quot;gentleman caller.&quot; Wyman's part is similar to her Oscar-winning performance in JOHNNY BELINDA (1948), only here she has a deformed foot instead of being mute. At first it was thought to have her wear a leg brace but this proved too cumbersome, so a special shoe was made to give her the appearance of having a deformed foot. At 36 Wyman was too old for her part, which called for a young woman, but makeup artist Westmore gave Wyman a youthful appearance by removing all makeup. She was given a hairpiece to wear, but it made her head look too big. Westmore convinced Wyman to let him thin out her hair and cut it to what was later described as a &quot;short, fluffy bob she has worn ever since.&quot; The play was again filmed in 1987 with Paul Newman directing Joanne Woodward, Karen Allen, John Malkovich, and James Naughton.\n &lt;a href=&quot;\nhttp://img145.imageshack.us/img145/9339/000025lc2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img145.imageshack.us/img145/9339/000025lc2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img49.imageshack.us/img49/6906/011155la8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img49.imageshack.us/img49/6906/011155la8.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img67.imageshack.us/img67/7682/010000aw5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img67.imageshack.us/img67/7682/010000aw5.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img71.imageshack.us/img71/5255/004805pv9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img71.imageshack.us/img71/5255/004805pv9.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img126.imageshack.us/img126/6702/003141zk5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img126.imageshack.us/img126/6702/003141zk5.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img49.imageshack.us/img49/315/002415hk9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img49.imageshack.us/img49/315/002415hk9.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img67.imageshack.us/img67/7123/001220mh3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img67.imageshack.us/img67/7123/001220mh3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img242.imageshack.us/img242/3866/014650jc1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img242.imageshack.us/img242/3866/014650jc1.jpg&lt;/a&gt;\n\nFile Size (in bytes):...........................1,466,744,832                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:47:16                \nFrame Count:....................................154308             \nFrame Width (pixels):...........................640                  \nFrame Height (pixels):..........................480                  \nAspect Ratio:...................................1.333                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1432                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.194&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................384                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:7b378bd0e79a5f54e8a642b301499f40c9913569","amp;dn":"Irving+Rapper+-+The+Glass+Menagerie+%281950%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b378bd0e79a5f54e8a642b301499f40c9913569","infoHashBuffer":{"type":"Buffer","data":[123,55,139,208,231,154,95,84,232,166,66,179,1,73,159,64,201,145,53,105]},"announce":[],"urlList":[]}}