{"title":"Murdoch Mysteries - Season 05 (2012) - 13 Episodes","uid":10760159,"size":4538926175,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b8d87f6009a42ae0c709f72b4403a6a13d58a1e&amp;dn=Murdoch+Mysteries+-+Season+05+%282012%29+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"bnaron","files":-1,"time":1407968819,"description":"Murdoch Mysteries - Season 05 (2012) - 13 Episodes\n\n\nSeries Description Courtesy of:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Murdoch_Mysteries\n\nMurdoch Mysteries is a Canadian drama television series aired on both City and CBC Television, featuring Yannick Bisson as William Murdoch, a police detective working in Toronto, Ontario, around the turn of the twentieth century. The television series is based on the series of novels by Maureen Jennings.\n\nThe series takes place in Toronto starting in 1895 and follows Detective William Murdoch (Yannick Bisson) of the Toronto Constabulary, who solves many of his cases using methods of detection that were unusual at the time. These methods include fingerprinting (referred to as &quot;finger marks&quot; in the series), blood testing, surveillance, and trace evidence.\n\nSome episodes feature anachronistic technology whereby Murdoch sometimes uses the existing technology of his time to improvise a crude prototype of a technology that would be more readily recognizable to the show's 21st-century audience. In one episode, for instance, he creates a primitive version of sonar to locate a sunken ship in Lake Ontario. In another, he effectively invents wire-tapping. In still another, a foreign police officer has a photograph which Murdoch needs as evidence, so Murdoch asks the other officer to overlay the photograph with a grid which is numerically coded for the color in each square, and then to transmit the numerical data to Murdoch via telegraph, with the end result that the foreign officer has essentially sent Murdoch a bitmap image they call a &quot;facsimile&quot;, a telefax.\n\nSeason five was announced at the CityTV 'Summer in the Square' on May 31, 2011. Part of the festivities of the day included a Victorian era costume competition with the winner getting a role in an episode of Murdoch Mysteries.\n\n\nEpisode Synopses Courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2012-02-28 - Murdoch of the Klondike (Video:H264 720x404, 883kbps, 24fps - Audio:AAC 44.1kHz, 99kbps)\n\nMurdoch has left Toronto, and police work, for the Yukon. However, while in pursuit of fortune in the Klondike Gold Rush he is drawn into a murder investigation (with the help of Jack London) and realizes that his days as a detective are not yet behind him.  Recurring star: Nigel Bennett as Chief Constable Giles\n\n\n2012-03-06 - Back and to the Left (Video:H264 720x404, 881kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nDetective Murdoch must tread carefully when he pursues a Catholic suspect in the murder of an Alderman, killed during the attempted assassination of the city's Protestant mayor. Recurring star: Nigel Bennett as Chief Constable Giles\n\n\n2012-03-13 - Evil Eye of Egypt (Video:H264 720x404, 882kbps, 24fps - Audio:AAC 44.1kHz, 97kbps)\n\nWhen Detective Murdoch investigates a series of deaths linked to an exhibition of Egyptian antiquities, Constable Crabtree is convinced a Mummy's curse is to blame.\n\n\n2012-03-20 - War on Terror (Video:H264 720x404, 885kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nWhile investigating an explosion, Detective Murdoch infiltrates an anarchist group led by American labour organizer Emma Goldman. Recurring stars: Nigel Bennett as Chief Constable Giles, Peter Keleghan as Terrence Meyers and Matthew Bennett as Allen Clegg\n\n\n2012-03-27 - Murdoch at the Opera (Video:H264 720x404, 884kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nWhen Elvira Cummings (Alison Jantzie), a young opera singer, is poisoned during a rehearsal of La Boheme, Detective Murdoch suspects the intended victim was Madame Rosa Hamilton (Measha Brueggergosman), the diva who stormed off stage moments before her protege collapsed.\n\n\n2012-04-03 - Who Killed the Electric Carriage (Video:H264 848x480, 883kbps, 24fps - Audio:AAC 44.1kHz, 102kbps)\n\nDetective Murdoch suspects the ambitious inventor of an electric vehicle murdered an associate who stood in the way of his plans to compete with Henry Ford. Recurring star: Peter Stebbings as James Pendrick\n\n\n2012-04-10 - Stroll on the Wild Side (Part 1) (Video:H264 720x404, 883kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nWhen Detective Murdoch investigates the abduction of Lucille Messing (Tori Anderson) a shy, churchgoing librarian, he's stunned to discover his friend, Anna Fulford (Lisa Faulkner), working at the library under an alias. Murdoch has grave fears for her safety since the Black Hand, a criminal syndicate responsible for murdering her fiance, still has a price on her head.\n\n\n2012-04-17 - Stroll on the Wild Side (Part 2) (Video:H264 640x360, 885kbps, 24fps - Audio:AAC 44.1kHz, 104kbps)\n\nAfter saving his friend Anna (Lisa Faulkner) from the Black Hand, Detective Murdoch (Yannick Bisson) bargains for her life. During his investigation into the murder of a shy librarian with a secret life, he encounters another young woman behaving seductively.\n\n2012-04-24 - Invention Convention (Video:H264 640x360, 886kbps, 24fps - Audio:AAC 44.1kHz, 108kbps)\n\nMurdoch's investigation is assisted by Alexander Graham Bell when an inventor is killed by a rival at a convention.\n\n\n2012-05-01 - Staircase to Heaven (Video:H264 64x360, 887kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nA high stakes card game involving Dr. Grace ends with the death of a player in the party. Murdoch is shocked to learn the true cost of their wagers is the opportunity to die.\n\n\n2012-05-08 - Murdoch in Toyland (Video:H264 720x404, 885kbps, 24fps - Audio:AAC 44.1kHz, 97kbps)\n\nMurdoch is taunted by a deranged kidnapper who leaves talking dolls with personal messages directed at him at each crime scene. Recurring star: Michael Seater as James Gillies\n\n\n2012-05-15 - Murdoch Night in Canada (Video:H264 720x404, 887kbps, 24fps - Audio:AAC 44.1kHz, 96kbps)\n\nMurdoch investigates when the captain of the Toronto Wellingtons hockey team is found dead in the locker room, shortly after fighting with another player. Recurring star: Nigel Bennett as Chief Constable Giles\n\n\n2012-05-22 - Twentieth Century Murdoch (Video:H264 848x480, 882kbps, 24fps - Audio:AAC 44.1kHz, 101kbps)\n\nAs New Year's Eve and the twentieth century approaches, Detective Murdoch is suspicious of Gideon Turner, who claims he has knowledge of soon-to-be-committed crimes but refuses to say how or why. When Turner bolts from police custody and thwarts a murder attempt, Murdoch, Inspector Brackenreid and Constable Crabtree demand to know where he got his information. He calmly explains he saw the events happen when he travelled to the future.  Recurring star: Nigel Bennett as Chief Constable Giles\n\n","torrent":{"xt":"urn:btih:7b8d87f6009a42ae0c709f72b4403a6a13d58a1e","amp;dn":"Murdoch+Mysteries+-+Season+05+%282012%29+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b8d87f6009a42ae0c709f72b4403a6a13d58a1e","infoHashBuffer":{"type":"Buffer","data":[123,141,135,246,0,154,66,174,12,112,159,114,180,64,58,106,19,213,138,30]},"announce":[],"urlList":[]}}