{"title":"Brother against brother - The War begins (Time-Life The Civil Wa","uid":11543263,"size":35761610,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c169e45a96e0064a73b45423f6ed46e2192b1f5&amp;dn=Brother+against+brother+-+The+War+begins+%28Time-Life+The+Civil+Wa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1416693037,"description":"Pdf / English / ISBN-10\t0809447010 / 1983 Time-Life / 184 pages / 34.1 MB\n\n&quot;This first volume in the Time-Life series on The Civil War begins with at look at &quot;The Two Americas&quot; in a series of contemporary paintings of a nation about to tear itself apart. Chapter 1, &quot;One Nation, Divisible,&quot; sets up the slavery issue, from the establishment of the Mason-Dixon line to the Compromise of 1850, ending with a gallery of the noted abolitionists of the day. Chapter 2, &quot;The Avenging Angel,&quot; focuses on the life and legacy of John Brown. Chapter 3, &quot;Lincoln of Illinois,&quot; explains how Lincoln came to be the nominee of the Republican Party and won the Presidential election of 1860. Chapter 4, &quot;Storm over Sumter,&quot; details the first crisis of the Lincoln's new administration over the Federal fort in the middle of Charleston harbor. Chapter 5, &quot;The Guns Have Spoken,&quot; relates the actual attack that started the Civil War. In many regards this first volume by William C. Davis and the Editors of Time-Life Books is the most disappointing one in the series, simply because it necessarily glosses over the events leading to Fort Sumter. Trying to deal with Lincoln in a single chapter seems quite inadequate to the task, but then it is probably safe to assume the Civil War buffs reading these books know plenty on that particular subject. However, this book does set the tone for the series, including dozens of contemporary drawings, etchings, pamphlets, maps, photographs and the like to illustrate the text.&quot;\n\nAmazon","torrent":{"xt":"urn:btih:7c169e45a96e0064a73b45423f6ed46e2192b1f5","amp;dn":"Brother+against+brother+-+The+War+begins+%28Time-Life+The+Civil+Wa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c169e45a96e0064a73b45423f6ed46e2192b1f5","infoHashBuffer":{"type":"Buffer","data":[124,22,158,69,169,110,0,100,167,59,69,66,63,110,212,110,33,146,177,245]},"announce":[],"urlList":[]}}