{"title":"fs9 | Aerosoft menorca x(rip)","uid":5397512,"size":188604567,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7c2c0040a38093d0af81e441ae95134d56c1b1ad&amp;dn=fs9+%7C+Aerosoft+menorca+x%28rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jovi198","files":-1,"time":1267289496,"description":"Product description:\n\nFly to the holiday island of Menorca! This scenery by the Sim-wings team represents the next part of the Balearic Islands (Mallorca X is already available). Menorca is known as the jewel among the Balearic Islands for good reason. As you explore the island from the air you will see why it is so popular with tourists. While not as busy as the nearby Mallorca the main airport on Menorca handles an amazing amount of traffic in the vacation season.\n\nDetails:\n\nThe scenery features exact coastlines, mesh and a completely new designed airport (LEMH). This add-on also includes AESLite, bringing dynamic apron traffic as well as traffic to the surroundings of the airport. Static yachts and boats can be found in the bays and near the beaches of Menorca. This package features the complete island of Menorca with photorealistic ground textures in a resolution of 0.5m/pixel (in FSX only). A detailed AFCAD for AI traffic makes it a lively and highly realistic airport to fly to. This scenery is of course compatible with AES 2.06 in both FS2004 and FSX!\n\n\nFeatures:\n\n    * Completely new designed scenery\n    * International airport &quot;LEMH&quot; or MAH in extremely high detail with all buildings\n    * Numerous static objects\n    * Very busy dynamic apron traffic through AESLite\n    * Dynamic AESLite vehicle traffic on roads surrounding the airport LEMH \n    * Also includes San Luis Aerodrome in nice detail\n    * Highly detailed AFCAD files for AI traffic\n    * FS2004: Complete island (!) with photorealistic ground textures and new elevation model (Mesherrain) in 4,7m/pixel resolution. (airport at approx 0,5m/pixel)\n    * FSX: Complete island (!) complete island in a breathtaking 0,5m/pixel resolution\n    * Photorealistic night textures\n    * Dynamic ship and ferry traffic\n    * Complete autogen for the islands\n    * Older AI-aircraft can now be used with the &quot;shadow&quot; option\n    * FS2004 and FSX version compatible with AES 2.06\n\n","torrent":{"xt":"urn:btih:7c2c0040a38093d0af81e441ae95134d56c1b1ad","amp;dn":"fs9+%7C+Aerosoft+menorca+x%28rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2c0040a38093d0af81e441ae95134d56c1b1ad","infoHashBuffer":{"type":"Buffer","data":[124,44,0,64,163,128,147,208,175,129,228,65,174,149,19,77,86,193,177,173]},"announce":[],"urlList":[]}}