{"title":"The Grateful Dead, The Best of (Flac) [FrankFoo]","uid":10032437,"size":516490067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7c52591e22156e12b4cf656be5e244be64f83e45&amp;dn=The+Grateful+Dead%2C+The+Best+of+%28Flac%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1398354641,"description":"\nWhat A Long Strange Trip It's Been - The Best Of The Grateful Dead (flac)\n\n\nAudio CD (October 25, 1990)\nOriginal Release Date: 1977\nNumber of Discs: 2\nLabel: Warner Bros / Wea\nASIN: B000002KH8\n\nEAC Accurate Rip by FrankFoo\n\n\nLinage: CD &gt; EAC &gt; flac\nIncludes: Vorbis Tags &amp; Front.jpg (log &amp; cue)\n\nTrack Listings\n\nCD 1\n01. New, New Minglewood Blues\n02. Cosmic Charlie\n03. Truckin'\n04. Black Peter\n05. Born Crossed-Eyed\n06. Ripple\n07. Doin' That Rag\n08. Dark Star\n09. High Time\n10. New Speedway Boogie\n\nCD 2\n01. St. Stephen\n02. Jack Straw\n03. Me &amp; My Uncle\n04. Tennessee Jed\n05. Cumberland Blues\n06. Playing In The Band\n07. Brown-Eyed Woman\n08. Ramble On Rose\n\n  \t\nBy Anthony G Pizza\n\nThe Grateful Dead have not been well served by label compilations. \nTheir windblown, exhilirating, rootless roots rock hardly contains itself on the band's relatively few studio releases, let alone stands slicing into radio-friendly pieces. \nThis is why every Deadhead gathers his personal best-of from hundreds of worldwide concerts trapped on tapes.\n\nWarner's 1977's &quot;What A Long Strange Trip It's Been&quot; covers the group's 1967-72 period as well as expected being neither fish nor fowl. The 2 CD set (adding up to just over 86 minutes), compiled with the band and well-remastered by Joe Gastwirt, balances the disparate studio/live faces of this legendary American phenomenon. \nIt misses several FM hits (&quot;Skeletons From The Closet&quot; is your first stop other than the original LPs for &quot;Sugar Magnolia,&quot; &quot;Friend Of The Devil,&quot; etc., although &quot;Truckin'&quot; repeats here) but balances the Dead's first five years' studio and live releases.\n\nWhat &quot;Strange Trip&quot; does best is refocus attention on the band's first, most creative years: the band, still young; the studio, still suitable laboratory; the following, still new and gaining for music as for the social experience; the goal, to grow a body of original work rather than expand on familiar music and memories. \nIndeed, only Elvis Presley among American rockers drew so easily from as many influences as the Dead did in the years covered here.\n\nThe consistently strong Jerry Garcia-Robert Hunter compositions (among them the concert staples &quot;Ripple,&quot; &quot;Tennessee Jed,&quot; and a truncated &quot;Dark Star&quot;) merge the dusty, dry strength of Jimmy Rodgers, (train imagery shows up throughout the selections, even without &quot;Casey Jones&quot;) Robert Johnson (listen again to the intro of &quot;Cosmic Charlie&quot;), Bill Monroe, Buddy Holly and the South-Southwest's musical/lyrical imagery. Add Bob Weir's Bakersfield vocals on &quot;Me and Me Uncle&quot; and &quot;Playing In The Band,&quot; the late &quot;Pigpen&quot; McKernan's bluesy voice and keyboard on &quot;Ramble On Rose&quot; and the early &quot;New, New Minglewood Blues,&quot; and Phil Lesh's solid bass throughout (Gastwirt's remastering recasts him as the star of &quot;Truckin'&quot;). \nYou get a sound and style not so much created as organically harvested, then psychedelically frosted.\n\nWhether this set serves as time capsule or accessible musical portal depends on where and how far new fans retrace their long, strange trip. \nThe road is easiest back to 1970's beloved &quot;American Beauty&quot; and &quot;Workingman's Dead&quot; (four songs from that LP are featured here) or on to 1973's elegant &quot;Wake Of The Flood&quot; or &quot;Mars Hotel.&quot; \nEither way, &quot;What A Long Strange Trip It's Been&quot; provides a meatier, incomplete but still recommended musical supplement for casual or new fans. \n\nA FrankFoo Original Rip\n","torrent":{"xt":"urn:btih:7c52591e22156e12b4cf656be5e244be64f83e45","amp;dn":"The+Grateful+Dead%2C+The+Best+of+%28Flac%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c52591e22156e12b4cf656be5e244be64f83e45","infoHashBuffer":{"type":"Buffer","data":[124,82,89,30,34,21,110,18,180,207,101,107,229,226,68,190,100,248,62,69]},"announce":[],"urlList":[]}}