{"title":"Atmosphere When Life Gives You Lemons You Paint That Shit Gold","uid":4374206,"size":72032579,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c8a4c38c3085511b22b361c8cd01fcad609ba0b&amp;dn=Atmosphere+When+Life+Gives+You+Lemons+You+Paint+That+Shit+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bift55","files":15,"time":1220319776,"description":"\n\nWhen Life Gives You Lemons, You Paint That Shit Gold is the sixth proper full-length studio album by Minneapolis hip hop duo Atmosphere. It was released on Atmosphere's own Rhymesayers Entertainment label on April 22, 2008 to considerable critical acclaim. It was praised for Ant's synthesizer-based production and Slug's storytelling rap. Because of concerns over piracy, Rhymesayers decided not to send advance copies to critics; instead, the label invited critics to listening parties.\n\nThe album was released in two different packages: a standard digipak and a limited edition (25,000 copies) 36-page hard cover book featuring an illustrated children's story written by Slug and a bonus DVD entitled Sad Clown Bad Dub 13 containing over an hour of live footage and extras.\n\nWhen Life Gives You Lemons, You Paint That Shit Gold debuted at number 5 on the U.S. Billboard 200, selling about 36,000 copies in its first week. It is Atmosphere's first album to reach the top ten of the Billboard 200 and the highest charting release from the independent label Rhymesayers.\n\n","torrent":{"xt":"urn:btih:7c8a4c38c3085511b22b361c8cd01fcad609ba0b","amp;dn":"Atmosphere+When+Life+Gives+You+Lemons+You+Paint+That+Shit+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8a4c38c3085511b22b361c8cd01fcad609ba0b","infoHashBuffer":{"type":"Buffer","data":[124,138,76,56,195,8,85,17,178,43,54,28,140,208,31,202,214,9,186,11]},"announce":[],"urlList":[]}}