{"title":"The.Secret.Life.of.Dogs.HDTV.x264-CLDD","uid":10500812,"size":286753880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7cac2998698f5e87015b4980b234ac37b429e330&amp;dn=The.Secret.Life.of.Dogs.HDTV.x264-CLDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"duranie","files":1,"time":1404694862,"description":"The.Secret.Life.of.Dogs.HDTV.x264-CLDD.mp4\n\n\nThe Secret Life of Dogs (2013 Documentary)\n\nThere's no denying that we humans love our dogs. But why do dogs love humans? Man and canine have lived together for thousands of years. But how much do you really know about your best friend?\n\nSecret Life of Dogs uses spectacular and cutting-edge cinematography to really get under the fur of our most prized companions, from their super power senses to their extraordinary behaviour and unquestioning loyalty; but most of all this film really gets to grips with their relationship with us. Revealing spectacular new insights into the way dogs understand us, love us and in some cases, can dramatically save or enhance our lives, this film uncovers how the true success of their species is our mutually beneficial relationship.\n\nWhen Margaret Haverson got lost in the woods for three days, the police force, volunteers and even helicopters with heat seeking cameras were unable to locate her. Search and rescue dog Max was called in and did what humans had been unable to do, saving Margaret from hypothermia and certain death. Navy officer Allen Parton, who suffered a severe head injury during the Gulf War, was nursed back to health by his assistance dog Endal. Allan was saved by his canine companion a second time when he was hit by a car, and for that Endal won the Victoria cross for animal bravery. Maureen Burns also credits her dog Max for saving her life, when his odd behavior and powerful sense of smell detected a cancerous tumour.\n\nFollowing a puppy from birth to motherhood, this beautiful film also tells amazing stories of how dogs are transformed from being born blind and deaf into highly sophisticated animals, and explores the weird and completely wonderful ways of dogs.\n\nProduced and Directed by\nBARNY REVILL \n\n","torrent":{"xt":"urn:btih:7cac2998698f5e87015b4980b234ac37b429e330","amp;dn":"The.Secret.Life.of.Dogs.HDTV.x264-CLDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cac2998698f5e87015b4980b234ac37b429e330","infoHashBuffer":{"type":"Buffer","data":[124,172,41,152,105,143,94,135,1,91,73,128,178,52,172,55,180,41,227,48]},"announce":[],"urlList":[]}}