{"title":"Sketch Magazine","uid":8757263,"size":1251072958,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7cad3b4faeae34d62d2943802c01b105b4f2417e&amp;dn=Sketch+Magazine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1375173678,"description":"I've been debating whether or not to upload this one, A) because it's not quite complete, and B) because (to me) the scan/image quality is a little below my usual standards on some of the issues. I've decided that the interviews and text pieces alone are worth it, and since those don't really require a beautiful image quality to read, I'll let this one go.\n\n-----------------------------------------------------------------------------------------\n\nIssues 2-4, 6-14, 16-39 of 'Sketch Magazine' (missing issues 1, 5, 15 and 40-42, the last of which is the current issue as of the date this torrent was uploaded)\n\nFrom the Sketch Magazine website (which you should check out if this kind of thing frosts your pickle, because they also have podcasts)...\n\nFor the past 10 years and with over 40 issues published, Sketch Magazine has been a leading resource, both in print and online, in the subject of creating comics. From the writing of the story to the publishing of a comic and its promotion, Sketch has continued to provide comic book hopefuls and comic book professionals alike a forum to give and receive How To articles and tutorials, and Sketch will strive to continue to be that leader with more great information!\n\nEach issue is packed with articles, tutorials, how tos (how does one spell &quot;how tos&quot;?), interviews and more. But here's a list of the &quot;big name&quot; featured in each issue.\n\n2. Todd McFarlane, 3. Marc Silvestri, 4. Michael Turner, 6. Brian Michael Bendis, 7. Chuck Dixon, 8. Dave Dorman, 9. Ed McGuinness, 10. George Perez, 11. Adam and Andy Kubert, 12. Frank Cho, 13. David Michael Beck, 14. Neil Gaiman, 16. J. Scott Campbell, 17. Ron Garney, 18. Pat Lee, 19. Alan Moore, 20. J. Michael Straczynski, 21. Michael Avon Oeming, 22. John Romita Jr., 23. Ed McGuiness, 24. Mike Wieringo, 25. Greg Land, 26. Mitch Byrd, 27. Michael Turner, 28. Robert Kirkman, 29. Ethan Van Sciver, 30. Beau Smith, 31. Billy Tan, 32. Joseph Michael Linsner, 33. Mike Choi, 34. Steve Rude, 35. Tim Sale, 36. Skottie Young, 37. Ryan Ottley, 38. Geof Johns, 39. Adam Hughes\n","torrent":{"xt":"urn:btih:7cad3b4faeae34d62d2943802c01b105b4f2417e","amp;dn":"Sketch+Magazine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cad3b4faeae34d62d2943802c01b105b4f2417e","infoHashBuffer":{"type":"Buffer","data":[124,173,59,79,174,174,52,214,45,41,67,128,44,1,177,5,180,242,65,126]},"announce":[],"urlList":[]}}