{"title":"Through.the.Wormhole.Series.6.3of6.Are.We.Here.for.a.Reason.720p","uid":12011542,"size":1222284572,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7cb596410d982b2388e38d02f78f8a7746d4132f&amp;dn=Through.the.Wormhole.Series.6.3of6.Are.We.Here.for.a.Reason.720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artistharry","files":1,"time":1434160521,"description":"Through the Wormhole: Series 6\n\nScience Documentary hosted by Morgan Freeman, published by Discovery Channel in 2015 - English narration\n   &lt;a href=&quot;\nhttp://docuwiki.net/images/7/73/Through-the-Wormhole-Series-6-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/7/73/Through-the-Wormhole-Series-6-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nThrough The Wormhole: Series 6\nScience Channel's triple Emmy - nominated hit series Through The Wormhole With Morgan Freeman is back for its sixth and most provocative season to date In six all-new episodes that tackle such tough topics as race, religion and our future as a species, the series will challenge viewers as never before. This season has a whole new look with an inspired set design and interactive features. Now, viewers will have greater access to the conversation with the 360 degree Wormhole experience. Leading scientists, who lend their voices and research to the show, will participate live through our website and social feed and join in the debate. From the topics of bigotry to whether our reality is virtual to the human proclivity for lying, the new season will challenge everything you know about space, time and morality.\n\n\n1)  Are We All Bigots \nIf you had less than one second to make a life-or-death decision to shoot a man who might be armed with a lethal weapon, what would you do? Would the ethnicity of the man affect your decision? Are you sure? The outcome - whatever your race - will surprise you. Brain imaging studies are showing that negative cultural stereotypes hijack everyone's subconscious decision-making. But some science says we can overcome bigotry through exposure, self-awareness and flexible social networks... and, most controversially of all, ultra-violent video games!\n\n2)  Can Time Go Backwards \nWe move around in space, but we are stuck in a prison of time moving ever forwards. Einstein said, &quot;The distinction between past, present and future is only a stubbornly persistent illusion.&quot; Is our experience of the ticking clock merely a trick of the mind? Could science ever make the clock move backwards? Experiments in quantum physics are showing that the future influences the present: what happens later limits the choices we think we have now. The laws of physics say visiting or talking to ourselves in the past is possible - but changing history once we get there is not.\n\n3)  Are We Here for a Reason \nEvolution tells us that all life exists for only one purpose: to reproduce. But is that all there is? How could such a simple imperative lead us to create great art and civilizations? A new theory suggests that instead of passing on genes, our ultimate purpose is to process and pass on information. We are the universe figuring itself out. Scientists dig deep into DNA, chemistry, technology and engineering to find the meaning of life. One thing is certain: living is easier if you find a reason for living.\n\n4)  Do We Live in the Matrix \nOur universe seems real. But what if it's a videogame? Scientists in a variety of fields are taking seriously the possibility that we live in a virtual reality. Maybe the Big Bang was just the moment someone flipped the switch and turned on our universe. Maybe what looks random has already been programmed to happen. If some advanced civilization did design and program our universe, would we ever know? Scientists are looking for glitches in the laws of the universe that may uncover its hidden code.\n\n5)  Are Aliens Inside Us \nOdds are excellent that extraterrestrial life exists. So why haven't we found aliens out in the galaxy? Are we looking in the wrong places? New research shows we should look closer to home, even inside our bodies. It turns out that a lot of our DNA is from a mysterious, nonhuman source. Theoretically, alien microbial life can make the journey to Earth from distant worlds, and scientists are finding some unearthly microbes in our upper atmosphere. Could it be from outer space? Could we be part alien? It's even possible alien life is already here as digital life forms, hiding inside our technology.\n\n6)  Why Do We Lie \nWe all agree lying is shameful. Yet we still deliberately deceive each other constantly. Are our brains wired for lying from a young age? The brains of pathological liars may provide insights. Will technology make it easier for us to be dishonest, or could it someday instantly reveal someone is lying? Perhaps we are deceitful because our limited senses prevent us from seeing the real truth. Scientists say our own memories deceive us, and have managed to implant false memories. Other scientists look for ultimate truth in the subatomic world ... only to end up turning reality on its head.\n\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;450d2c222d0509716b74&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3789 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 kb/s VBR 48 KHz\n * Audio Channels: Stereo 2\n * Run-Time: 44mins\n * Framerate: 25 fps\n * Number of Parts: 6\n * Container Mp4\n * Part Size: 1.13 GB average\n * Source: HDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:7cb596410d982b2388e38d02f78f8a7746d4132f","amp;dn":"Through.the.Wormhole.Series.6.3of6.Are.We.Here.for.a.Reason.720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cb596410d982b2388e38d02f78f8a7746d4132f","infoHashBuffer":{"type":"Buffer","data":[124,181,150,65,13,152,43,35,136,227,141,2,247,143,138,119,70,212,19,47]},"announce":[],"urlList":[]}}