{"title":"Seeds of Destruction: The Hidden Agenda of Genetic Manipulation","uid":6446639,"size":5855534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d9a0e6a7821091731fbf070e94b9a8c06d36a27&amp;dn=Seeds+of+Destruction%3A+The+Hidden+Agenda+of+Genetic+Manipulation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":1,"time":1307292395,"description":"Review\nIf you want to learn why biotech corporations insist on spreading GMO seeds around the World you should read this carefully researched book. You will learn how these corporations want to achieve control over all mankind, and why we must resist... --Marijan Jost, Professor of Genetics, Krizevci, CroatiaIf you want to learn why biotech corporations insist on spreading GMO seeds around the World you should read this carefully researched book. You will learn how these corporations want to achieve control over all mankind, and why we must resist... --Marijan Jost, Professor of Genetics, Krizevci, CroatiaThe book reads like a murder mystery of an incredible dimension, in which four giant Anglo-American agribusiness conglomerates have no hesitation to use GMO to gain control over our very means of subsistence... --Anton Moser, Professor of Biotechnology, Graz, AustriaWhat is so frightening about Engdahl's vision of the world is that it is so real. In this new age of free markets, everything science, commerce, agriculture and even seeds have become weapons in the hands of a few global corporation barons and their political fellow travelers. --Dr. Arpad Pusztai, biochemist, formerly of the Rowett Research Institute, Scotland.The book reads like a murder mystery of an incredible dimension, in which four giant Anglo-American agribusiness conglomerates have no hesitation to use GMO to gain control over our very means of subsistence... --Anton Moser, Professor of Biotechnology, Graz, Austria\n\nIf you want to learn why biotech corporations insist on spreading GMO seeds around the World you should read this carefully researched book. You will learn how these corporations want to achieve control over all mankind, and why we must resist... --Marijan Jost, Professor of Genetics, Krizevci, Croatia\n\nThe book reads like a murder mystery of an incredible dimension, in which four giant Anglo-American agribusiness conglomerates have no hesitation to use GMO to gain control over our very means of subsistence... --Anton Moser, Professor of Biotechnology, Graz, Austria\nProduct Description\nThis skillfully researched book focuses on how a small socio-political American elite seeks to establish its control over the very basis of human survival, the provision of our daily bread. Control the food and you control the people. This is no ordinary book about the perils of GMO. Engdahl takes the reader inside the corridors of power, into the backrooms of the science labs, behind closed doors in the corporate boardrooms. The author reveals a World of profit-driven political intrigue, government corruption and coercion, where genetic manipulation and the patenting of life forms are used to gain worldwide control over food production. The book is an eye-opener, a must-read for all those committed to the causes of social justice and World peace. \n &lt;a href=&quot;\nhttp://www.amazon.com/Seeds-Destruction-Hidden-Genetic-Manipulation/dp/0973714727/ref=sr_1_1?ie=UTF8&amp;qid=1307285025&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Seeds-Destruction-Hidden-Genetic-Manipulation/dp/0973714727/ref=sr_1_1?ie=UTF8&amp;qid=1307285025&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:7d9a0e6a7821091731fbf070e94b9a8c06d36a27","amp;dn":"Seeds+of+Destruction%3A+The+Hidden+Agenda+of+Genetic+Manipulation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9a0e6a7821091731fbf070e94b9a8c06d36a27","infoHashBuffer":{"type":"Buffer","data":[125,154,14,106,120,33,9,23,49,251,240,112,233,75,154,140,6,211,106,39]},"announce":[],"urlList":[]}}