{"title":"Deer Hunter 4: World-Class Record Bucks","uid":9492245,"size":393529344,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7dd486bc9a264f3b5fcd1e08bd56d7f7adb9fef3&amp;dn=Deer+Hunter+4%3A+World-Class+Record+Bucks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twfh","files":-1,"time":1390018382,"description":"World-record-sized bucks and virtual versions of world-record locations await in Deer Hunter 4. Stalk whitetail, mule deer, and Columbia blacktail in such locales as Gold Bar, Washington; Lodgepole, Alberta, Canada; Wood Lake, Colorado; Festus, Missouri; Browns Mill, Oregon; and Springwater, Saskatchewan, Canada. Sixteen sporting arms will help you bring the deer down, including rifles, shotguns, handguns, and bows. Fill your bag with equipment such as tripods, tree stands, blinds, antler rattles, buck and doe calls, buck and doe scents, cover scents, GPS, binoculars, seeds, and decoys. Use your journal to record the best times and spots, then get there using ATVs, boats, snowmobiles, and trucks. Watch as bucks challenge one another in territorial disputes. Other lifelike behavior includes herding and scraping. After you have taken down some prize bucks, display them in your trophy room. Hunt during different seasons, times of day, and weather. Multiplayer hunting over the Internet includes competitive hunts, open hunts, and Play the Deer mode.","torrent":{"xt":"urn:btih:7dd486bc9a264f3b5fcd1e08bd56d7f7adb9fef3","amp;dn":"Deer+Hunter+4%3A+World-Class+Record+Bucks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd486bc9a264f3b5fcd1e08bd56d7f7adb9fef3","infoHashBuffer":{"type":"Buffer","data":[125,212,134,188,154,38,79,59,95,205,30,8,189,86,215,247,173,185,254,243]},"announce":[],"urlList":[]}}