{"title":"Jacques Ellul - sociologist, Christian anarchist (15 books)","uid":9260087,"size":27183681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e1d4be032f424652a29230a9a23a3488077a8f2&amp;dn=Jacques+Ellul+-+sociologist%2C+Christian+anarchist+%2815+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385611241,"description":"15 books (and one article) by/about Jacques Ellul; various formats.\n\nI've been promising this torrent for a long time, but kept hoping to be able to offer better quality files. For the present I'm unable to do it, so this is a dump of what I have. The zip files contain (I believe) rtf or html files, but won't convert properly to real ebooks in calibre. Many of the pdf files are double-page files, but the sources seem pretty good. The scanned versions range from decent to mediocre. There are also djvu and chm formats for some items. It's a bit of a mess, but better than nothing I guess.\n\nTitles:\n\nAnarchy and Christianity\nThe Betrayal of the West\nThe Humiliation of the Word\nMoney and Power\nThe New Demons\nThe Politics of God and the Politics of Man\nPropaganda\nThe Technological Bluff\nThe Technological System\nTo Will and to Do\nViolence\nWhat I Believe\n\nabout Ellul:\n\nJacques Ellul and the Technological Society in the 21st Century by Jeronimo et al\n\nTechnique, Discourse, and Consciousness - Intro to the Philosophy of Jacques Ellul by David Lovekin\n\nViolence, Anarchy and Scripture - Jacques Ellul and Rene Girard (article) by Matthew Pattillo\n\n\nfrom wikipedia:\n\nJacques Ellul (1912 - 1994) was a French philosopher, law professor, sociologist, lay theologian, and Christian anarchist. Ellul was a longtime Professor of History and the Sociology of Institutions on the Faculty of Law and Economic Sciences at the University of Bordeaux. A prolific writer, he authored 58 books and more than a thousand articles over his lifetime, many of which discussed propaganda, the impact of technology on society, and the interaction between religion and politics. The dominant theme of his work proved to be the threat to human freedom and religion created by modern technology. Among his most influential books are The Technological Society and Propaganda: The Formation of Men's Attitudes.\n\nConsidered by many a philosopher, Ellul was by training a sociologist who approached the question of technology and human action from a dialectical viewpoint. His constant concern was the emergence of a technological tyranny over humanity. As a philosopher and theologian, he further explored the religiosity of the technological society.","torrent":{"xt":"urn:btih:7e1d4be032f424652a29230a9a23a3488077a8f2","amp;dn":"Jacques+Ellul+-+sociologist%2C+Christian+anarchist+%2815+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1d4be032f424652a29230a9a23a3488077a8f2","infoHashBuffer":{"type":"Buffer","data":[126,29,75,224,50,244,36,101,42,41,35,10,154,35,163,72,128,119,168,242]},"announce":[],"urlList":[]}}