{"title":"J.J. Cale 24 Bit Vinyl Pack","uid":8748327,"size":6932402423,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e22fdcf64c11990c7bbf2170eeb2e2c334d6331&amp;dn=J.J.+Cale+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"politux","files":-1,"time":1374979357,"description":"  J.J. Cale 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Blues-Rock, Singer/Songwriter\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rates: 96,000 Hz, 192,000 Hz\n\n  Troubadour (Shelter LP, UK First Pressing)\n  Grasshopper\n  Naturally (Speakers Corner 180g Audiophile Pressing)\n  Okie (UK Original LP)\n  Really\n  Shades\n  Roll On (Because Music LP)\n\n  With his laid-back rootsy style, J.J. Cale is best known for writing &quot;After Midnight&quot; and &quot;Cocaine,&quot; songs that Eric Clapton later made into hits. But Cale's influence wasn't only through songwriting -- his distinctly loping sense of rhythm and shuffling boogie became the blueprint for the adult-oriented roots rock of Clapton and Mark Knopfler, among others. Cale's refusal to vary the sound of his music over the course of his career caused some critics to label him as a one-trick pony, but he managed to build a dedicated cult following with his sporadically released recordings.\n\n  Born in Oklahoma City but raised in Tulsa, OK, Cale played in a variety of rock &amp; roll bands and Western swing groups as a teenager, including one outfit that also featured Leon Russell. In 1959, at the age of 21, he moved to Nashville, where he was hired by the Grand Ole Opry's touring company. After a few years, he returned to Tulsa, where he reunited with Russell and began playing local clubs. In 1964, Cale and Russell moved to Los Angeles with another local Oklahoma musician, Carl Radle.\n\n  Shortly after he arrived in Los Angeles, Cale began playing with Delaney &amp; Bonnie. He only played with the duo for a brief time, beginning a solo career in 1965. That year, he cut the first version of &quot;After Midnight,&quot; which would become his most famous song. Around 1966, Cale formed the Leathercoated Minds with songwriter Roger Tillison. The group released a psychedelic album called A Trip Down Sunset Strip the same year.\n\n  Deciding that he wouldn't be able to forge a career in Los Angeles, Cale returned to Tulsa in 1967. Upon his return, he set about playing local clubs. Within a year, he had recorded a set of demos. Radle obtained a copy of the demos and forwarded it to Denny Cordell, who was founding a record label called Shelter with Leon Russell. Shelter signed Cale in 1969. The following year, Eric Clapton recorded &quot;After Midnight,&quot; taking it to the American Top 20 and thereby providing Cale with needed exposure and royalties. In December 1971, Cale released his debut album, Naturally, on Shelter Records; the album featured the Top 40 hit &quot;Crazy Mama,&quot; as well as a re-recorded version of &quot;After Midnight,&quot; which nearly reached the Top 40, and &quot;Call Me the Breeze,&quot; which Lynyrd Skynyrd later covered. Cale followed Naturally with Really, which featured the minor hit &quot;Lies,&quot; later that same year.\n\n  Following the release of Really, J.J. Cale adopted a slow work schedule, releasing an album every other year or so. Okie, his third album, appeared in 1974. Two years later, he released Troubadour, which yielded &quot;Hey Baby,&quot; his last minor hit, as well as the original version of &quot;Cocaine,&quot; a song that Clapton would later cover. By this point, Cale had settled into a comfortable career as a cult artist and he rarely made any attempt to break into the mainstream. One more album on Shelter Records, 5, appeared in 1979 and then he switched labels, signing with MCA in 1981. MCA only released one album (1981's Shades) and Cale moved to Mercury Records the following year, releasing Grasshopper.\n\n  In 1983, Cale released his eighth album, 8. The album became his first not to chart. Following its release, Cale left Mercury and entered a long period of seclusion, reappearing in late 1990 with Travel Log, which was released on the British independent label Silvertone; the album appeared in America the following year. 10 was released in 1992. The album failed to chart, but it re-established his power as a cult artist. He moved to the major label Virgin in 1994, releasing Close to You the same year. It was followed by Guitar Man in 1996. Cale returned to recording in 2003, releasing To Tulsa and Back in 2004 on the Sanctuary label and The Road to Escondido, a collaborative effort with Clapton, in 2006 on Reprise. Roll On appeared in 2009 on Rounder Records. A CD/DVD set drawn from sessions Cale recorded with Leon Russell on keyboards in 1979, In Session at Paradise Studio, appeared early in 2013.","torrent":{"xt":"urn:btih:7e22fdcf64c11990c7bbf2170eeb2e2c334d6331","amp;dn":"J.J.+Cale+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e22fdcf64c11990c7bbf2170eeb2e2c334d6331","infoHashBuffer":{"type":"Buffer","data":[126,34,253,207,100,193,25,144,199,187,242,23,14,235,46,44,51,77,99,49]},"announce":[],"urlList":[]}}