{"title":"Ch4 Bettany Hughes The Ancient Worlds 3of7 The Minoans PDTV XviD","uid":6995499,"size":1174441984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ea8ac7f9bd67c4b9142a12aa6b76b2772882e8f&amp;dn=Ch4+Bettany+Hughes+The+Ancient+Worlds+3of7+The+Minoans+PDTV+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":-1,"time":1327863843,"description":"The Ancient Worlds\n\nHistory Documentary hosted by Bettany Hughes and published by Channel 4 in 2004 - English narration\n\n\nInformation\n------------------------------\n\nThe Ancient Worlds with Bettany Hughes\n\nHistorian Bettany Hughes gives her personal take on the diverse cultures of the ancient world in this 2010 documentary series on More 4. The series begins with an examination of Alexandria, the city founded by Alexander the Great in 332 BC to become the world's first global centre of culture. The programme explores Alexandria's role as a powerhouse of science and learning, and focuses on the female mathematician, astronomer and philosopher Hypatia, the subject of the feature film Agora, starring Rachel Weisz.\n\nThe series also offers a chance to catch Hughes's previous ancient history titles, including the 2004 documentary The Minoans, and the 2005 film Helen of Troy, in which Hughes explores the true story of the woman whose face &quot;launched a thousand ships&quot;. Other programmes in the series are Engineering Ancient Egypt, the three-part documentary The Spartans (which inspired the Hollywood movie 300), Athens: The Truth about Democracy, and When the Moors Ruled in Europe, Hughes's survey of Islamic rule in Spain and Portugal.\nBettany Hughes studied History at Oxford and is currently a research fellow at King's College London. She has produced a series of critically acclaimed history documentaries for Channel 4 and PBS in America, and her 2005 book Helen of Troy was voted a book of the year by the Independent on Sunday. She makes regular appearances on radio and contributed the film The Daughters of Eve, about the female characters of The Bible.\nThe Ancient World Episodes and Broadcast Dates:\n&quot;\t24 March - Alexandria: The Greatest City Run-time 50mins \n&quot;\t31 March - Engineering Ancient Egypt Run-time 1hr 43mins\n&quot;\t7 April - The Minoans Run-time 1hr 41mins\n&quot;\t14 April - Helen of Troy Run-time 1hr 44mins\n&quot;\t21 April - The Spartans Run-time 2hrs 24mins\n&quot;\t28 April - Athens: The Truth About Democracy Run-time 1hr 35mins\n&quot;\t5 May - When the Moors Ruled in Europe Run-time 1hr 39mins\n\n\n1)  Alexandria The Greatest City \nThree cities dominated the ancient world: Athens, Rome and a third, now almost forgotten. It lies hidden beneath the waters of the Mediterranean and a sprawling modern metropolis. Alexandria was a city built on a dream; a place with a very modern mindset, where - as with the worldwide web - one man had a vision that all knowledge on earth could be stored in one place. Bettany Hughes goes in search of this lost civilisation, revealing the story of a city founded out of the desert by Alexander the Great in 331 BC to become the world's first global centre of culture, into which wealth and knowledge poured from across the world. Until its decline in the fourth and fifth Centuries AD, Alexandria became a crucible of learning; Hughes uncovers the incredible discoveries and the technical achievements of this culture. The film's cast of characters reads like a list of the greatest figures of ancient times: political figures like Alexander the Great, Julius Caesar and Cleopatra, and intellectuals including female mathematician, astronomer and philosopher Hypatia, Euclid, Archimedes, Eratosthenes and Ptolemy. At last, after 1,500 years squashed under a modern metropolis, new clues are emerging from the earth to the real nature of this grand experiment in human civilisation.\n\n2)  Engineering Ancient Egypt \nThrough their superlative buildings, the legacy of the Egyptian empire continues to enthrall people to this day. Yet these incredible structures were made over 4,000 years ago. Historian Bettany Hughes explores what drove the people of this ancient civilisation to build on such a massive scale. The story is told through the reigns of two pharaohs - Khufu and Ramesses II. Separated by 1,200 years, they both ruled during periods of incredible architectural ambition. Under Khufu, the Great Pyramid of Giza was constructed; while under Ramesses II the temples of Abu Simbel came into being. But what drove this ambition? This documentary attempts to get into the hearts and minds of these early Egyptians in their unstoppable pursuit of immortality via great feats of engineering.\n\n3)  The Minoans \nIn this fascinating feature-length documentary historian Bettany Hughes continues her history of the Ancient World with a visit to Crete to recount one of the greatest archaeological discoveries ever made. The story of the Minotaur and the Labyrinth is perhaps the most compelling of all Greek myths. Just over 100 years ago, English archaeologist Arthur Evans went to the 'Minotaur's Island' to explore the roots of this myth and discovered instead a sophisticated Bronze Age civilisation that had been lost to history for thousands of years. He called them The Minoans, and the riches of their culture astonished the world, prompting Evans to proclaim them the first civilisation of the Western World. But was this view unduly romantic? In the past decade, new archaeological discoveries have added fascinating layers of complexity to the picture originally painted by Evans.\n\n4)  Helen of Troy \nShe is 'the face that launched a thousand ships'; the woman blamed for the Trojan War - a conflict that caused countless deaths - but who was the real Helen of Troy? Bettany Hughes travels across the eastern Mediterranean to disentangle myth from reality and find the truth about the most beautiful woman on earth. Helen's story is a dark and very human drama, interweaving pleasure and pain, sex and violence, love and hate: a tale that started with a messy love affair and ended with a bloody and disastrous conflict. Hughes argues that many images of the mythic Helen, from Hollywood movies to romantic paintings, have got her all wrong: Helen was the original sex goddess. And the film reveals just how a pre-historic princess in Bronze Age Greece - a real Helen - would have looked. The feature-length documentary takes in some of the most beautiful scenery of the ancient world, from the magnificent citadel at Mycenae and the spectacular shrine to Helen in Sparta, to the archaeological site in modern Turkey that will be forever linked with the war fought in Helen's name: Troy.\n\n5)   \nBettany Hughes chronicles the rise and fall of one of the most extreme civilisations the world has ever seen, one founded on discipline, sacrifice and frugality where the onus was on the collective and the goal was to create the perfect state and the perfect warrior. Hughes reveals the secrets and complexities of everyday Spartan life; homosexuality was compulsory, money was outlawed, equality was enforced, weak boys were put to death and women enjoyed a level of social and sexual freedom that was unheard of in the ancient world. It was a nation of fearsome fighters where a glorious death was treasured. This is aptly demonstrated by the kamikaze last stand at Thermopylae, where King Leonidas and his warriors fought with swords, hands and teeth to fend off the Persians. But there was bitter rivalry between Sparta and Athens, two cities with totally opposed views of the 'good life'. When war finally came, it raged for decades and split the Greek world until, in a brutal and bloody climax, Sparta finally emerged victorious as the most powerful city-state in Greece. But under King Agesilaus, the dreams of the Spartan utopia come crashing down. By setting out to create a perfect society protected by perfect warriors, Sparta made an enemy of change. A collapsing birth rate, too few warriors, rebellious slaves and outdated attitudes to weaponry and warfare combined to sow the seeds of Sparta's destruction, until eventually the once great warrior state was reduced to being a destination for Roman tourists who came to view bizarre sado-masochistic rituals.\n\n6)  Athens the Truth about Democracy \nIf contemporary views of ancient Athens, Greece emphasize the peaceful and harmonious nature of that polis's democratic system, historian Bettany Hughes begs to differ. Hughes asserts that the West's establishment of Athens as the platonic ideal of democracy is hugely ironic, for that classical society in fact employed rules, regulations and traditions deemed unthinkable, even barbaric, in our modern age - from the widespread practice of black magic; to the view of women as demonic, fourth or fifth-class citizens forced to wear public veils; to the proliferation of slavery. Most incredibly, Athens relied on inner bloodshed, tumult and strife to perpetuate its existence and strength, declaring war every two years or so. Such practices were commonplace, even as the community soared to new intellectual heights and created wondrous sociopolitical ideals for itself that it strove to live up to and that would later form the basis of contemporary political thought.\n\n7)  When the Moors Ruled in Europe \nBettany Hughes traces the story of the mysterious and misunderstood Moors, the Islamic society that ruled in Spain for 700 years, but whose legacy was virtually erased from Western history. In 711 AD, a tribe of newly converted Muslims from North Africa crossed the straits of Gibraltar and invaded Spain. Known as The Moors, they went on to build a rich and powerful society. Its capital, Cordoba, was the largest and most civilised city in Europe, with hospitals, libraries and a public infrastructure light year ahead of anything in England at the time. Amongst the many things that were introduced to Europe by Muslims at this time were: a huge body of classical Greek texts that had been lost to the rest of Europe for centuries (kick-starting the Renaissance); mathematics and the numbers we use today; advanced astronomy and medical practices; fine dining; the concept of romantic love; paper; deodorant; and even erection creams. This wasn't the rigid, fundamentalist Islam of some people's imaginations, but a progressive, sensuous and intellectually curious culture. But when the society collapsed, Spain was fanatically re-Christianised; almost every trace of seven centuries of Islamic rule was ruthlessly removed. It is only now, six centuries later, that The Moors' influences on European life and culture are finally beginning to be fully understood.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img101.imageshack.us/img101/8292/theancientworldsscreen0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img101.imageshack.us/img101/8292/theancientworldsscreen0.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/7574/theancientworldsscreen1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/7574/theancientworldsscreen1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/7153/theancientworldsscreen2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/7153/theancientworldsscreen2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img101.imageshack.us/img101/1905/theancientworldsscreen3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img101.imageshack.us/img101/1905/theancientworldsscreen3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/3715/theancientworldsscreen4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/3715/theancientworldsscreen4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/5306/theancientworldsscreen5v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/5306/theancientworldsscreen5v.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/1082/theancientworldsscreen6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/1082/theancientworldsscreen6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img413.imageshack.us/img413/7822/theancientworldsscreen7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img413.imageshack.us/img413/7822/theancientworldsscreen7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/3016/theancientworldsscreen8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/3016/theancientworldsscreen8.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1898 kbps\n * Video Resolution: 704x400\n * Video Aspect Ratio: 1.760:1\n * Frames Per Second: 25\n * Audio Codec: 0x0055 MPEG-1 Layer 3\n * Audio Bitrate: 128 kb/s CBR 48000 Hz\n * Audio Streams: 2ch\n * Audio Languages: English\n * RunTime Per Part: 50:43.mins - 2hrs 24mins\n * Number Of Parts: 7\n * Part Size: 746MB - 1.45 GB\n * Subtitles: None\n * Source: DVB-rip\n * Ripped by: artistharry\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.channel4.com/programmes/the-ancient-world-with-bettany-hughes/4od#3067733&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/programmes/the-ancient-world-with-bettany-hughes/4od#3067733&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Greek%20Odyssey&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Greek%20Odyssey&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Medieval%20FightBook&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Medieval%20FightBook&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Lost%20Legions%20of%20Varus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Lost%20Legions%20of%20Varus&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters%20-%20Homers%20Odyssey%20%28BBC%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters%20-%20Homers%20Odyssey%20%28BBC%29&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Greeks%20-%20Crucible%20of%20Civilization&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Greeks%20-%20Crucible%20of%20Civilization&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Ancient%20Worlds&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Ancient%20Worlds&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Delphi%3A%20The%20Bellybutton%20of%20the%20Ancient%20World&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Delphi%3A%20The%20Bellybutton%20of%20the%20Ancient%20World&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters%20-%20Homer%27s%20Odyssey&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Gods%20and%20Monsters%20-%20Homer%27s%20Odyssey&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Greek%20Myths%3A%20Tales%20of%20Travelling%20Heroes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Greek%20Myths%3A%20Tales%20of%20Travelling%20Heroes&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Cleopatra%3A%20Portrait%20of%20a%20Killer&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Cleopatra%3A%20Portrait%20of%20a%20Killer&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Alexander%20the%20Great%20-%20The%20man%20behind%20the%20Legend&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Alexander%20the%20Great%20-%20The%20man%20behind%20the%20Legend&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Ancient%20Egypt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Ancient%20Egypt&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Rise%20and%20Fall%20of%20the%20Spartans&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Rise%20and%20Fall%20of%20the%20Spartans&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=In%20Search%20of%20the%20Trojan%20War&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=In%20Search%20of%20the%20Trojan%20War&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Helen%20of%20Troy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Helen%20of%20Troy&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Lost%20Cities%20of%20the%20Ancients&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Lost%20Cities%20of%20the%20Ancients&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3Aartistharry&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3Aartistharry&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=The_Ancient_Worlds&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=The_Ancient_Worlds&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7ea8ac7f9bd67c4b9142a12aa6b76b2772882e8f","amp;dn":"Ch4+Bettany+Hughes+The+Ancient+Worlds+3of7+The+Minoans+PDTV+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea8ac7f9bd67c4b9142a12aa6b76b2772882e8f","infoHashBuffer":{"type":"Buffer","data":[126,168,172,127,155,214,124,75,145,66,161,42,166,183,107,39,114,136,46,143]},"announce":[],"urlList":[]}}