{"title":"Clare In The Community - S01 to 06 - Audio Comedy - 128Kbps - Mp","uid":5670918,"size":962900635,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7eb2361edf9bf7011cd8e70c888b878cd4baf49f&amp;dn=Clare+In+The+Community+-+S01+to+06+-+Audio+Comedy+-+128Kbps+-+Mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"_Slimoo_","files":36,"time":1278345213,"description":"Clare In The Community - Series 01 to 06 - Audio Comedy - BBC7 &amp; 4\n36 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\n\n\nRadio sitcom set around the professional and personal life of the social worker Clare Barker. \n\nClare Barker has entered a caring profession so that she can sort out other peoples problems rather than deal with her own. \n\nA control freak, Clare likes nothing better than interfering in other people's lives on both a professional and personal basis. \n\nSecretly regarding herself as a cross between Mother Theresa and Wonder Woman, Clare tends towards self-importance and considers most other professions as trivial.\n\nShe is in her early thirties, white, middle class and heterosexual, all of which are occasional causes of discomfort to her.\n\nEach week we join Clare in her continued struggle to control both her professional and private life.\n\n\n\nCast:\nClare ...... Sally Phillips\nMegan ...... Nina Conti\nHelen ...... Gemma Craven (Liza Tarbuck Series 05)\nBrian ...... Alex Lowe\nRay ........ Richard Lumsden\nIrene ...... Ellen Thomas\nSimon ...... Andrew Wincott\n &lt;a href=&quot;\nhttp://www.comedy.co.uk/guide/radio/clare_in_the_community/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.comedy.co.uk/guide/radio/clare_in_the_community/&lt;/a&gt;\n\n\nClare In The Community - S01 - E01 - Babysitter\nClare In The Community - S01 - E02 - Adoption\nClare In The Community - S01 - E03 - Glad To Be Ray\nClare In The Community - S01 - E04 - Last Words\nClare In The Community - S01 - E05 - Combat Zone\nClare In The Community - S01 - E06 - Stage Fright\n\nClare In The Community - S02 - E01 - Past Caring\nClare In The Community - S02 - E02 - Relax\nClare In The Community - S02 - E03 - Meet The Press\nClare In The Community - S02 - E04 - Brian Come Home\nClare In The Community - S02 - E05 - Mean Streets\nClare In The Community - S02 - E06 - Doolah's Choice\n\nClare In The Community - S03 - E01 - Letter From America\nClare In The Community - S03 - E02 - Merry Christmas Mrs Lawrance\nClare In The Community - S03 - E03 - Brenda's Birthday\nClare In The Community - S03 - E04 - We Need To Talk About Brian\nClare In The Community - S03 - E05 - The Redcap\nClare In The Community - S03 - E06 - Clare's Last Stand\n\nClare In The Community - S04 - E01 - Mother Of All Mothers\nClare In The Community - S04 - E02 - A Game Of Two Slavs\nClare In The Community - S04 - E03 - And The Winner Is\nClare In The Community - S04 - E04 - Carry On Up The Amazon\nClare In The Community - S04 - E05 - My Funny Valentine\nClare In The Community - S04 - E06 - The Long Goodbye\n\nClare In The Community - S05 - E01 - Name Calling\nClare In The Community - S05 - E02 - Too Cool For School\nClare In The Community - S05 - E03 - Girls On Film\nClare In The Community - S05 - E04 - It's Good To Talk\nClare In The Community - S05 - E05 - Garden Party\nClare In The Community - S05 - E06 - The 1864 Mining Disaster\n\nClare In The Community - S06 -  E01 - Liar, Liar, Pants On Fire\nClare In The Community - S06 -  E02 - Luck Of The Irish\nClare In The Community - S06 -  E03 - Some Others Do 'Ave 'Em\nClare In The Community - S06 -  E04 - Clare v God\nClare In The Community - S06 -  E05 - In The Dog House\nClare In The Community - S06 -  E06 - The Crush\n\n\n\n\n\n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n\n\n\n\n \n","torrent":{"xt":"urn:btih:7eb2361edf9bf7011cd8e70c888b878cd4baf49f","amp;dn":"Clare+In+The+Community+-+S01+to+06+-+Audio+Comedy+-+128Kbps+-+Mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb2361edf9bf7011cd8e70c888b878cd4baf49f","infoHashBuffer":{"type":"Buffer","data":[126,178,54,30,223,155,247,1,28,216,231,12,136,139,135,140,212,186,244,159]},"announce":[],"urlList":[]}}