{"title":"English for Journalists (Media Skills) 3rd ed.","uid":4648754,"size":2227679,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ee82b4a5b4cdcea997236d31d04867ca18c1dc4&amp;dn=English+for+Journalists+%28Media+Skills%29+3rd+ed.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Megan00","files":2,"time":1231971534,"description":"English for Journalists is a jolly useful book. Its short. Its accessible. Its cheap. And it tells you what you want to know. - The Journalist --This text refers to the Paperback edition. \n\nProduct Description\nFully revised and updated, this new edition of &quot;English for Journalists&quot; is an invaluable guide not only to the basics of English, but to those aspects of writing, such as reporting speech, house style and jargon, which are specific to the language of journalism. Written in an accessible style, &quot;English for Journalists&quot; covers the fundamentals of grammar, the use of spelling, punctuation and journalistic writing; with each point illustrated by concise examples. This new edition features a brand new introductory chapter which includes: a discussion as to why &quot;good English&quot; is now such a hotly debated subject; an introduction to the anti-correctness arguments of academics; a look at the increasing informality of journalistic writing in general, and in particular, the growth of personal columns and other fun features written in a colloquial - therefore sometimes ungrammatical - style; the role of house style; and, fully up to date examples of mistakes published by magazines and newspapers. Other chapters include examples of common grammatical errors and how to avoid them; lists of problem words and a discussion of spelling rules; notes on style; and information on reporting speech. \n\n--------------------------------------------------------------------------------\nProduct Details\nHardcover: 184 pages \nPublisher: Routledge; 3 edition (December 21, 2006) \nLanguage: English ","torrent":{"xt":"urn:btih:7ee82b4a5b4cdcea997236d31d04867ca18c1dc4","amp;dn":"English+for+Journalists+%28Media+Skills%29+3rd+ed.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee82b4a5b4cdcea997236d31d04867ca18c1dc4","infoHashBuffer":{"type":"Buffer","data":[126,232,43,74,91,76,220,234,153,114,54,211,29,4,134,124,161,140,29,196]},"announce":[],"urlList":[]}}