{"title":"Future Files -  A Brief History of the Next 50 Years  by Richard","uid":7942635,"size":4408332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f0072a52c74fb8cebf1654d36523b25df90d3e9&amp;dn=Future+Files+-++A+Brief+History+of+the+Next+50+Years++by+Richard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KatQwerty","files":3,"time":1356031940,"description":"\n \n \n \nFilled with provocative forecasts, Future Files examines emerging patterns and developments in society, technology, economy and business and makes educated speculations and entertaining extrapolations about where these trends may take us. In addition to being a fun ride through the possible future, Future Files will be indispensable to business analysts, strategic planners and other thinkers who need to stay ahead of the curve.\n \nCheaper than a crystal ball and twice as fun, this book by futurist and web creator Watson examines what &quot;someday&quot; could be like, based on the five key trends of ageing; power shift to the East; global connectivity; the &quot;GRIN&quot; technologies of Genetics, Robotics, Internet, and Nanotechnology; environmental concerns, and 50 less general but equally influential developments that will radically alter human life by the year 2050. \n \n \nWatson gently scoffs at Jetsons-like wishful-thinking technology and flying cars; instead he predicts the fanciful (mindwipes, stress-control clothing, napcaps that induce sleep) and the useful (devices to harness the sea to generate energy; self-repairing car paint; retail technology that helps us shop, based on past buying habits; hospital plasters that monitor vital signs). \n \n \n In between the fun and frivolity, he prognosticates the frightening: the &quot;extinction&quot; of individual ugliness and free public spaces; the creation of hybrid humans; a society made of people who are incapable of the tiniest tasks; and insects that carry wireless cameras to monitor our lives. [b]Part Jules Verne, part Malcolm Gladwell, Watson has a puckish sense of humor and his book is a thought-provoking, laughter-inducing delight.[/b]\n \n  \n \n ","torrent":{"xt":"urn:btih:7f0072a52c74fb8cebf1654d36523b25df90d3e9","amp;dn":"Future+Files+-++A+Brief+History+of+the+Next+50+Years++by+Richard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0072a52c74fb8cebf1654d36523b25df90d3e9","infoHashBuffer":{"type":"Buffer","data":[127,0,114,165,44,116,251,140,235,241,101,77,54,82,59,37,223,144,211,233]},"announce":[],"urlList":[]}}