{"title":"The Legend of Three Trees (Animated Christian Movie)","uid":4495357,"size":369659950,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7f854ec527638da01e61e3c2ff873620b054aab2&amp;dn=The+Legend+of+Three+Trees+%28Animated+Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"IndianChristian","files":3,"time":1226170256,"description":"The Legend of Three Trees (Animated Christian Movie)\n\nThoughtfully written and beautifully animated, The Legend of The Three Trees teaches children and adults alike the significance of their role in God&amp;#039;s plan for the world.\n\nThe Legend of The Three Trees is a timeless retelling of the classic folktale of three distinct trees, each with its own hopes, dreams and aspirations. We follow a beautiful olive tree blossoming in the valley, a knotty oak tree clinging to the shore and a strong pine standing high on the mountainside. They each dreamed of becoming great - a majestic treasure chest, a magnificent sailing ship and the tallest tree in the forest which would draw people to God.\n\nBut their dreams didn&amp;#039;t seem to come true. Disappointed and dejected, the trees despair about their existence until they each finally interact, in their own unique ways, with Jesus Christ in His birth, ministry and ultimate sacrifice. In these experiences, they learn that God has a special purpose for each of them in His kingdom.\n\nThe central theme of this movie is God has a purpose for each one of us. &quot;Don&amp;#039;t ever give up on God for he will never ever give up on you&quot;.  \n\nLanguage: English\nSubtitles: None\nRun Time: 24 minutes\nMy Rating: 10/10\nQuality: 9.5/10 (Dvdrip)\n\nIf financially possible, please buy this CD/DVD to keep Christian films in business ......\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God&amp;#039;s word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don&amp;#039;t ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t\n","torrent":{"xt":"urn:btih:7f854ec527638da01e61e3c2ff873620b054aab2","amp;dn":"The+Legend+of+Three+Trees+%28Animated+Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f854ec527638da01e61e3c2ff873620b054aab2","infoHashBuffer":{"type":"Buffer","data":[127,133,78,197,39,99,141,160,30,97,227,194,255,135,54,32,176,84,170,178]},"announce":[],"urlList":[]}}