{"title":"GRIP (Pre-Alpha v1.0.6.0)","uid":13478710,"size":1013575345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fb257223fb978aae3b753c354d01c97c48c8779&amp;dn=GRIP+%28Pre-Alpha+v1.0.6.0%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dauphong","files":1,"time":1455035602,"description":"\nAbout This Game\r\nGRIP is bringing old-school style combat racing back with a bang. Inspired by the Rollcage games and developed by some of the original team, GRIP is a true tribute to the explosive fun had in a past gaming era.\r\n\r\n    Intense Racing: Hit speeds of up to 700 kmph, driving on floors, ceilings and walls. GRIP's car designs allow for driving on both sides, so flipping the car no longer means game over\r\n\r\n\r\n    Awesome Pick-ups: Use an array of power-ups and weapons to get the edge on your opponents. Ranging from missiles and guns to shields and turbos, we plan to have a wide array of exciting pick-ups to use\r\n\r\n\r\n    Exotic Planets: Race on a variety of planets, from hostile icy worlds to alien jungle to sprawling non-terrestrial cities. Use destruction as a tool to win, crashing your surroundings down on your opponents, or lose your tail by heading through an alternate track route\r\n\r\n\r\n    Badass Rides: Choose from a roster of armoured cars, manufactured by different companies from around the galaxy. Each car has different specs - some swift and agile, others brutish and heavily armoured. There's a killer car for every taste\r\n\r\n\r\n    Bangin' Tunes: Race to a thumping soundtrack from some of the best electronic music artists. Drum n Bass is our main kick","torrent":{"xt":"urn:btih:7fb257223fb978aae3b753c354d01c97c48c8779","amp;dn":"GRIP+%28Pre-Alpha+v1.0.6.0%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb257223fb978aae3b753c354d01c97c48c8779","infoHashBuffer":{"type":"Buffer","data":[127,178,87,34,63,185,120,170,227,183,83,195,84,208,28,151,196,140,135,121]},"announce":[],"urlList":[]}}