{"title":"Snakes in Suits: When Psychopaths Go to Work","uid":6449402,"size":1415950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:809fef003aa5a13b0b467846ffe0c945feda47a1&amp;dn=Snakes+in+Suits%3A+When+Psychopaths+Go+to+Work&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bookzilla","files":1,"time":1307368128,"description":"We'd like to think that if we met someone who was completely without conscience -- someone who was capable of doing anything at all if it served his or her purposes -- we would recognize it. In popular culture, the image of the psychopath is of someone like Hannibal Lecter or the BTK Killer. But in reality, many psychopaths just want money, or power, or fame, or simply a nice car. Where do these psychopaths go? Often, it's to the corporate world. \n\nResearchers Paul Babiak and Robert Hare have long studied psychopaths. Hare, the author of Without Conscience, is a world-renowned expert on psychopathy, and Babiak is an industrial-organizational psychologist. Recently the two came together to study how psychopaths operate in corporations, and the results were surprising. They found that it's exactly the modern, open, more flexible corporate world, in which high risks can equal high profits, that attracts psychopaths. They may enter as rising stars and corporate saviors, but all too soon they're abusing the trust of colleagues, manipulating supervisors, and leaving the workplace in shambles. \n\nSnakes in Suits is a compelling, frightening, and scientifically sound look at exactly how psychopaths work in the corporate environment: what kind of companies attract them, how they negotiate the hiring process, and how they function day by day. You'll learn how they apply their &quot;instinctive&quot; manipulation techniques -- assessing potential targets, controlling influential victims, and abandoning those no longer useful -- to business processes such as hiring, political command and control, and executive succession, all while hiding within the corporate culture. It's a must read for anyone in the business world, because whatever level you're at, you'll learn the subtle warning signs of psychopathic behavior and be able to protect yourself and your company -- before it's too late. \n\n352 pages \nPublisher: Harper Paperbacks (May 8, 2007) \nLanguage: English ","torrent":{"xt":"urn:btih:809fef003aa5a13b0b467846ffe0c945feda47a1","amp;dn":"Snakes+in+Suits%3A+When+Psychopaths+Go+to+Work","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809fef003aa5a13b0b467846ffe0c945feda47a1","infoHashBuffer":{"type":"Buffer","data":[128,159,239,0,58,165,161,59,11,70,120,70,255,224,201,69,254,218,71,161]},"announce":[],"urlList":[]}}