{"title":"Andrew Nagorski - The Greatest Battle","uid":8949009,"size":987148567,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:81749b7f4e888fb55c9cc454c99433f2770cf1bb&amp;dn=Andrew+Nagorski+-+The+Greatest+Battle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":14,"time":1379842740,"description":"The Greatest Battle: Stalin, Hitler, and the Desperate Struggle for Moscow That Changed the Course of World War II \n\nBy Andrew Nagorski\nPublished by Simon &amp; Schuster in 2008\nTags: history, war\nMP3, Unabridged, English (074328111X)\n\nThe battle for Moscow was the biggest battle of World War II -- the biggest battle of all time. And yet it is far less known than Stalingrad, which involved about half the number of troops. From the time Hitler launched his assault on Moscow on September 30, 1941, to April 20, 1942, seven million troops were engaged in this titanic struggle. The combined losses of both sides -- those killed, taken prisoner or severely wounded -- were 2.5 million, of which nearly 2 million were on the Soviet side. But the Soviet capital narrowly survived, and for the first time the German Blitzkrieg ended in failure. This shattered Hitler's dream of a swift victory over the Soviet Union and radically changed the course of the war. \n\nThe full story of this epic battle has never been told because it undermines the sanitized Soviet accounts of the war, which portray Stalin as a military genius and his people as heroically united against the German invader. Stalin's blunders, incompetence and brutality made it possible for German troops to approach the outskirts of Moscow. This triggered panic in the city -- with looting, strikes and outbreaks of previously unimaginable violence. About half the city's population fled. But Hitler's blunders would soon loom even larger: sending his troops to attack the Soviet Union without winter uniforms, insisting on an immediate German reign of terror and refusing to heed his generals' pleas that he allow them to attack Moscow as quickly as possible. In the end, Hitler's mistakes trumped Stalin's mistakes. \n\nDrawing on recently declassified documents from Soviet archives, including files of the dreaded NKVD; on accounts of survivors and of children of top Soviet military and government officials; and on reports of Western diplomats and correspondents, The Greatest Battle finally illuminates the full story of a clash between two systems based on sheer terror and relentless slaughter. \n\nEven as Moscow's fate hung in the balance, the United States and Britain were discovering how wily a partner Stalin would turn out to be in the fight against Hitler -- and how eager he was to push his demands for a postwar empire in Eastern Europe. In addition to chronicling the bloodshed, Andrew Nagorski takes the reader behind the scenes of the early negotiations between Hitler and Stalin, and then between Stalin, Roosevelt and Churchill. \n\nThis is a remarkable addition to the history of World War II.","torrent":{"xt":"urn:btih:81749b7f4e888fb55c9cc454c99433f2770cf1bb","amp;dn":"Andrew+Nagorski+-+The+Greatest+Battle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81749b7f4e888fb55c9cc454c99433f2770cf1bb","infoHashBuffer":{"type":"Buffer","data":[129,116,155,127,78,136,143,181,92,156,196,84,201,148,51,242,119,12,241,187]},"announce":[],"urlList":[]}}