{"title":"Martina Coles The Runaway S01 Completen (Xvid)","uid":7452169,"size":2409927820,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:819841f71673e863836ef4db71bb1198ffbda765&amp;dn=Martina+Coles+The+Runaway+S01+Completen+%28Xvid%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Wldsthrnboy","files":-1,"time":1342547917,"description":"Cathy Connor and Eamonn Docherty are brought up together in the East End. As the daughter of a prostitute, Madge, Cathy's life is difficult, especially when everyone assumes that she will be following in her mother's footsteps. But when Cathy is forced to protect Madge from a violent attack by a punter it changes her life forever. Cathy is taken into care but she suffers institutional abuse which leaves her with no choice but to run away. She ends up destitute, on the streets of Soho. Desrae, a transvestite, unexpectedly comes to her rescue. Meanwhile, Eamonn joins Dixon's firm and rises up the ranks of the East End criminal underworld. He gets involved with his boss's daughter but in a moment of violent rage, kills her. Eamonn flees to New York to escape retribution where he gains a reputation as a ruthless villain with a specialism for sourcing weaponry. Adapted from Martina Cole's best-selling novel this is an explosive action-packed thriller with two star crossed lovers at its centre.","torrent":{"xt":"urn:btih:819841f71673e863836ef4db71bb1198ffbda765","amp;dn":"Martina+Coles+The+Runaway+S01+Completen+%28Xvid%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"819841f71673e863836ef4db71bb1198ffbda765","infoHashBuffer":{"type":"Buffer","data":[129,152,65,247,22,115,232,99,131,110,244,219,113,187,17,152,255,189,167,101]},"announce":[],"urlList":[]}}