{"title":"Rome - HBO -  Seasons 1 and 2","uid":14972213,"size":10435841497,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82ea1890bd0f48c3fa719b0b3c34f22fadcafbdf&amp;dn=Rome+-+HBO+-++Seasons+1+and+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"POtHS11","files":49,"time":1466209156,"description":"Rome - Seasons 1 and 2 - HBO (Size: 8.85 GB)\r\n \t\r\nRome - Season 1\r\n \t\r\nRome - Season 2\r\n \t\r\nRome Today - TRUTH\r\nDescription\r\nIt is 52 BC. Four hundred years after the founding of the Republic, Rome is the wealthiest city in the world, a cosmopolitan metropolis of one million people and epicenter of a sprawling empire. The Republic was founded on principles of shared power and fierce personal competition, never allowing one man to seize absolute control.\r\n\r\nGaius Julius Caesar (Ciarán Hinds, Munich) is ending a years long campaign conquering Gaul. In the process of conquest, he has become rich and has honed a lethal army led by the thirteenth legion, a group of men willing to follow his every command. Two members of the fighting thirteenth, Lucious Vorenus (Kevin McKidd, Kingdom of Heaven) and Titus Pullo (Ray Stevenson, King Arthur), are the central characters of the show.\r\n\r\nVorenus is a dutiful soldier and family man. He is respected by the men and by Caesar himself. Pullo is a womanizing, hard-drinking enlisted man. His fierce fighting skills and his rebellious streak make him popular as well. An uneasy relationship between Vorenus and Pullo begins when they are forced by circumstance to cooperate on a mission of great importance to Caesar.\r\n\r\nBack in Rome, Casesar's niece, Atia (Polly Walker, Sliver), is a fiercely ambitious and cunning player in the Roman nobility. Along with Caesar's lover Servilla, we have two women who rival any man in the empire in shrewdness and ruthlessness. Atia's son (and future emperor of Rome) Octavian (Max Pirkis, Master and Commander: The Far Side of the World) is a preternaturally astute teenager with a keen understanding of Roman politics.\r\n\r\nCaesar's main rivals are Brutus (Tobias Menzies, The Lowdown) and Pompey Magnus (Kenneth Cranham, Layer Cake). Pompey is Co-Consul of Rome along with Caesar. The battle between Caesar and Pompey is one of wills and wits at first. Eventually, it comes to swords. Brutus's relationship with Caesar is much more complex. Caesar needs Brutus and his influential family to legitimize his reign but Brutus is a Republican who abhors Caesar's imperial ambitions. Their father-and-son relationship is a source of great internal conflict for both.\r\n\r\nCaesar's power grab and its consequences for Rome are the backdrop against which all of the character conflicts occur. Politics, personal rivalries, friendship, and a couple of very Oedipal relationships are cleverly combined with historical fact to tell a unique tale of Rome at one of its most eventful periods. Rest assured, I have just scratched the surface here. There are plenty of characters and plot threads in this sprawling story that I have left for the viewer to discover.\r\n\r\nThis six-DVD set contains the twelve-episode run of Season One. Episode titles and original airdates are listed below:\r\n\r\n• &quot;The Stolen Eagle&quot; (8/28/05)\r\n• &quot;How Titus Pullo Brought Down the Republic&quot; (9/4/05)\r\n• &quot;An Owl In a Thornbush&quot; (9/11/05)\r\n• &quot;Stealing From Saturn&quot; (9/18/05)\r\n• &quot;The Ram Has Touched The Wall&quot; (9/25/05)\r\n• &quot;Egeria&quot; (10/2/05)\r\n• &quot;Pharsalus&quot; (10/9/05)\r\n• &quot;Caesarion&quot; (10/16/05)\r\n• &quot;Utica&quot; (10/30/05)\r\n• &quot;Triumph&quot; (11/6/05)\r\n• &quot;The Spoils&quot; (11/13/05)\r\n• &quot;Kalends of February&quot; (11/20/05)","torrent":{"xt":"urn:btih:82ea1890bd0f48c3fa719b0b3c34f22fadcafbdf","amp;dn":"Rome+-+HBO+-++Seasons+1+and+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ea1890bd0f48c3fa719b0b3c34f22fadcafbdf","infoHashBuffer":{"type":"Buffer","data":[130,234,24,144,189,15,72,195,250,113,155,11,60,52,242,47,173,202,251,223]},"announce":[],"urlList":[]}}