{"title":"Gardens of a Chinese Emperor - Imperial Creations of the Qianlon","uid":11356936,"size":12494534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83d251dffbd96c8ada467de09c7d48fef009a32e&amp;dn=Gardens+of+a+Chinese+Emperor+-+Imperial+Creations+of+the+Qianlon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1414957180,"description":"Victoria M. Siu, &quot;Gardens of a Chinese Emperor: Imperial Creations of the Qianlong Era, 1736-1796&quot; \nEnglish | ISBN: 1611461286 | 2013 | 300 pages | PDF | 11.9 MB\n\nThe Garden of Perfect Brightness (Yuanming Yuan) in the western suburbs of the Qing capital, Beijing, was begun by the great Kangxi (r. 1661-1722) and expanded by his son, Yongzheng (r. 1722-1735) and brought to its greatest glory by his grandson, Qianlong (r. 1736-1796). A lover of literature and art, Qinglong sought an earthly reflection of his greatness in his Yuanming Yuan. For many years he designed and directed an elaborate program of garden arrangements. Representing two generations of painstaking research, this book follows the emperor as he ruled his empire from within his garden. In a landscape of lush plants, artificial mountains and lakes, and colorful buildings, he sought to represent his wealth and power to his diverse subjects and to the world at large. Having been looted and burned in the mid-nineteenth century by western forces, it now lies mostly in ruins, but it was the world's most elaborate garden in the eighteenth century. The garden suggested a whole set of concepts-religious, philosophical, political, artistic, and popular-represented in landscape and architecture. Just as bonsai portrays a garden in miniature, the imperial Yuanming Yuan at the height of its splendor represented the Qing Empire in microcosm.\n\nIncludes 62 color plates and 35 black &amp; white photographs","torrent":{"xt":"urn:btih:83d251dffbd96c8ada467de09c7d48fef009a32e","amp;dn":"Gardens+of+a+Chinese+Emperor+-+Imperial+Creations+of+the+Qianlon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d251dffbd96c8ada467de09c7d48fef009a32e","infoHashBuffer":{"type":"Buffer","data":[131,210,81,223,251,217,108,138,218,70,125,224,156,125,72,254,240,9,163,46]},"announce":[],"urlList":[]}}