{"title":"Q5 - Steel The Light (320kbps)","uid":5489679,"size":89221785,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:841c182916222a37a8005b18a143a20e10b93e72&amp;dn=Q5+-+Steel+The+Light+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mjabba","files":-1,"time":1270918869,"description":"CD rip at 320kbps\n\n1. Missing in Action\n2. Lonely Lady\n3. Steel the Light\n4. Pull the Trigger\n5. Ain't No Way to Treat a Lady\n6. In the Night\n7. Come and Gone\n8. Rock On\n9. Teenage Runaway\n\nThere's a 192kbps torrent that has the extra demo tracks from the reissue. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5291816/Q5_-_Steel_The_Light_%281984%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5291816/Q5_-_Steel_The_Light_%281984%29&lt;/a&gt;\n\n\n&quot;Sometime in the early 80's in the city of Seattle, long before it was fashionable to wear check shirts, look miserable &amp; pull shotgun triggers with your big toe, there existed a band which was led by the inventor of the Floyd Rose whammy thingy (Hey I just listen to guitars, I don't fix the things) so beloved of plank spankers the world over named coincidentally, Floyd Rose. Now Floyd had a plan &quot;I want to show off this whammy thingy I've invented &amp; the best way to do it would be to form a loud, hard rockin', kick ass rock band&quot; he probably didn't think to himself, but that's exactly what he did anyway &amp; let me tell you brothers &amp; sisters they were a loud, hard rockin, kick ass rock band, at least for one album anyway, but more on that later.\n\nQ5 were actually formed after guitarist Floyd &amp; vocalist Jonathan Scott Palmerston (Jonathan K.) left their previous band C.O.R.E., they were soon joined by Rick Pierce (guitar), Evan Sheeley (bass) &amp; Gary Thompson (drums) all of whom had deserted fellow Seattle band TKO to complete the line up.\n\nThe fledgling band entered the studio in early 1983 to record a seven track album quality demo which brought them to the attention of Heart's then management team. The band then set about recording a full album but decided to only include three songs from the demo along with six new tunes. 'Steel The Light' as the album was christened was picked up by Albatross records but it was only when 'Music For Nations' in Europe released it with a new cover that it came to the attention of the Metal community, and what an album.\n\nAccording to Rick Pierce the rest of the band decided that it would be wiser to stay in the studio &quot;indefinitely&quot; as opposed to touring Europe when the album was &quot;climbing the charts&quot; &amp; a third album was rejected by their American record company who wanted the band to return to the studio &quot;to do something more commercial&quot;. Pierce &amp; Jonathan K subsequently left the ban to form the much heavier Nightshade. This basically ended the band &amp; nothing more was heard from Q5. And so the story ends.&quot; &lt;a href=&quot;\nhttp://www.imarocker.com/reviews/Q5/steel%20the%20light.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imarocker.com/reviews/Q5/steel%20the%20light.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:841c182916222a37a8005b18a143a20e10b93e72","amp;dn":"Q5+-+Steel+The+Light+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"841c182916222a37a8005b18a143a20e10b93e72","infoHashBuffer":{"type":"Buffer","data":[132,28,24,41,22,34,42,55,168,0,91,24,161,67,162,14,16,185,62,114]},"announce":[],"urlList":[]}}