{"title":"DUNGEON SIEGE 3 - COMPLEX - XBOX360 - REGION FREE","uid":6459085,"size":6547870839,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:84b37fd43a82961538c79136d5f270e7826a5d44&amp;dn=DUNGEON+SIEGE+3+-+COMPLEX+-+XBOX360+-+REGION+FREE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"boobsman","files":68,"time":1307694306,"description":"Dungeon Siege III seamlessly blends intuitive action gameplay, a robust RPG system featuring a large selection of abilities, an extensive multiplayer component and the depth of story Square Enix and Obsidian Entertainment are known for creating.\n\nIn Dungeon Siege III, players assume the role of one of four legionnaires in the crumbling kingdom of Ehb.\nDo battle as a lone hero or fight alongside up to three friends and, thanks to robust AI, Dungeon Siege III's co-op multiplayer mode allows players to seamlessly drop in and out of battle without interrupting the action or impacting the campaign.\n\n\nStoryline:\nTorn asunder, the delicate balance of power between the kingdom of Ehb's powerful factions has fallen apart. As one of the few remaining members of the disgraced protectors of the land, the 10th Legion, it is up to you to rebuild the once great Legion and stop Ehb from falling into darkness. Joined by a group of unique companions, you will travel through the striking land of Ehb defeating all manner of villains and beasts through a combination of heroic abilities, screen shaking magic and fearsome weapons.\n","torrent":{"xt":"urn:btih:84b37fd43a82961538c79136d5f270e7826a5d44","amp;dn":"DUNGEON+SIEGE+3+-+COMPLEX+-+XBOX360+-+REGION+FREE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b37fd43a82961538c79136d5f270e7826a5d44","infoHashBuffer":{"type":"Buffer","data":[132,179,127,212,58,130,150,21,56,199,145,54,213,242,112,231,130,106,93,68]},"announce":[],"urlList":[]}}