{"title":"The Walking Dead - Season 2","uid":14540343,"size":6588566785,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:84c2932084f204c660e6d83a1266382689aa79cf&amp;dn=The+Walking+Dead+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"POtHS11","files":27,"time":1462514724,"description":"The Walking Dead - Season 2\r\n\r\nPlot\r\nThe second season begins with Rick and his group of survivors leaving Atlanta. They decide Fort Benning will be their next destination. Along the way, they encounter a traffic jam of abandoned vehicles on I-85. The group loots several vehicles and as a large horde of walkers approaches, is forced to hide under the vehicles. Carol's daughter, Sophia, chased away from the highway by two of the remaining walkers, runs off into the woods. Carl is accidentally shot during a search for the missing girl, and Rick and the others take him to a large, isolated farm owned by a veterinarian named Hershel Greene and his family, who reluctantly removes the bullet from Carl. The remainder of Rick's group moves to the farm while Carl recovers. The group tries to co-exist alongside Hershel's family, but dangerous secrets and disagreements over leadership cause tensions to rise. Daryl leads the initiative to search for Sophia and becomes close to Carol as a result. Glenn builds a romantic relationship with Hershel's daughter Maggie and discovers that Hershel's barn is full of walkers, many of whom in life had been Hershel's friends and relatives; Hershel maintains that the infection that plagues the walkers is treatable and refuses to kill them. When Shane forces the walkers out of the barn, and the group opens fire, Sophia appears as one of the undead, and Rick shoots her.\r\n\r\nThe bonds of the group are tested in the aftermath of the showdown at the barn. Carol, in her grief, withdraws, as does Daryl, who claims that the group is &quot;broken&quot;. Hershel, reacting to what has happened, orders Rick and his group to leave immediately, before disappearing to grieve for his family. Rick and Glenn find Hershel drinking at a local tavern, but in trying to convince him to return, discover that they have been found by members of another group of survivors, intent on locating their camp as Fort Benning is overrun with walkers. They kill two of their members, the rest fleeing and leaving one of their own, Randall, behind. Rick cannot consciously leave Randall to die, so they blindfold him and return with Hershel to the farm. With their location potentially threatened, the group struggles with what to do with Randall, with Shane and Rick having strong differences of opinion. After one botched attempt to abandon Randall, they decide to restrain him in the barn until they come to a decision. Carol overcomes her mourning and rejoins the group with new resolve, coaxing Daryl to come back into the folds. Hershel's daughter Beth attempts to commit suicide over the hopeless situation but regains the will to live.\r\n\r\nRick decides he needs to execute Randall for the protection of the group, unaware Carl is watching. However, at that moment, Dale screams for help as he is attacked by a walker, one that Carl had the opportunity to kill but did not. Daryl euthanizes Dale, who was disemboweled by the walker, and after his funeral the group realizes they must regain their humanity. Rick goes to deal with Randall and finds him missing, unaware Shane had released him and taken him out into the woods to kill him. They discover Randall's reanimated corpse nearby, neck broken instead of bitten; they discover that the dead can reanimate even if not bitten by walkers. Shane attempts to use the distraction of the search to kill Rick, but Rick kills him first. Carl, watching from a distance, shoots the reanimated corpse of Shane when it tries to attack Rick.\r\n\r\nThe gunfire attracts a large horde of walkers that begin to swarm the farmstead. Hershel and his family are forced to abandon the farm and join with Rick's group as they scatter and flee; Andrea ends up on her own, separated from the others, until she is rescued by a mysterious hooded person with a sword, leading chained, armless, walkers. The others regroup back on I-85 at the traffic jam. As they camp that night, Rick reveals what Dr. Jenner told him at the CDC: that each and every one of them is already infected with the plague that has ravaged the world, and that dying for any reason will cause them to reanimate as a walker. A large prison looms in the distance","torrent":{"xt":"urn:btih:84c2932084f204c660e6d83a1266382689aa79cf","amp;dn":"The+Walking+Dead+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84c2932084f204c660e6d83a1266382689aa79cf","infoHashBuffer":{"type":"Buffer","data":[132,194,147,32,132,242,4,198,96,230,216,58,18,102,56,38,137,170,121,207]},"announce":[],"urlList":[]}}