{"title":"DvdReMake Pro 3.6.3 (The Joker)","uid":3960055,"size":5169157,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:85dd885106ab4ebd7bd67585f6921a9428231524&amp;dn=DvdReMake+Pro+3.6.3+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jokeri1971","files":2,"time":1199394961,"description":"DvdReMake Pro is a powerful, yet intuitive DVD editor that will let you change content, appearance and navigation of a DVD disk without the need for complete disk re-authoring. Using unique editing features of the DvdReMake Pro you can completely customize your DVD backups, fix authoring errors, merge DVDs or even compile a new DVD from bits and pieces of other DVD disks. DvdReMake Pro will even fix incorrectly authored/edited disks. If mismatch between information in ifo and vob files is found program will try to fix the problem. \n\nMain DvdReMake Pro features: \n- Put multiple DVDs together preserving original menus; \n- Replace menu background with still; \n- Move and insert new chapters on an existing dvd; \n- Edit VM commands (all commands and valid combinations are supported); \n- Edit and create new TitleSets, Titles, Chapters, ProgramChains, Programs; \n- Delete TitleSets, Titles, Chapters, ProgramChains, Programs; \n- Move TitleSets, ProgramChains, commands within the disk or between different DVDs; \n- Find DVD navigation errors; \n- Reorder menu buttons; \n- Easily follow DVD navigation using &quot;Goto Destination&quot; and History pane; \n- Change properties of the video, audio and subpicture tracks; \n- Modify buttons and color schemes in either still or motion menus; \n- Easily change highlights colors. \n\nChanges in Version 3.6.3 - 17 Dec 2007:\n- title operations is not greyd out in VTS titles pop-up menu when no title is selected\n- &quot;move program up/down&quot; action in &quot;PGC programs&quot; pane pop-up menu\n- all but first angles are stripped on export in some cases\n- font size in &quot;button set&quot; tabs\n- &quot;Open Destination&quot; and &quot;Open Destination in new window&quot; are disabled for some commands in Cell Commands pane\n- focus jumps back to the source copied PGC, after editing a PGC which was created using &quot;Duplicate&quot; or Copy and Add copied PGC\n- &quot;Assign to Title&quot; creates record in history log with index of PGC which is off by -1\n- Data Pool dialog is closed when hover over the button with the mouse pointer\n- start X/Y is reset to 0 after editing\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:85dd885106ab4ebd7bd67585f6921a9428231524","amp;dn":"DvdReMake+Pro+3.6.3+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85dd885106ab4ebd7bd67585f6921a9428231524","infoHashBuffer":{"type":"Buffer","data":[133,221,136,81,6,171,78,189,123,214,117,133,246,146,26,148,40,35,21,36]},"announce":[],"urlList":[]}}