{"title":"SpellForce 2: Dragon Storm GOG","uid":8280054,"size":2889836265,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8616f87647da9186a0e4abc01886589469f952c5&amp;dn=SpellForce+2%3A+Dragon+Storm+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1363811567,"description":"    genre    rpg / strategy / fantasy\n    download size    2.7 GB     \n    release date    March 23, 2007 \n    compatible with    Windows (XP, Vista, 7, 8)\n    languages      English\n    developer / publisher    Phenomic / Nordic Games\n    game modes    single-player\n\n    Bonus content included for FREE with purchase:\n    manual\n    wallpaper\n    soundtrack\n    2 avatars\n    12 artworks\n\n    Standalone expansion that continues the legendary SpellForce 2 storyline\n    New Shaikan faction, new special items, expanded crafting system, new spells, items to summon pet companions, and much more\n    Test your might in the ultimate challenge: The Arena Quest that takes you across dozens of maps to create the ultimate weapon and face the most powerful of foes\n\nOverview:\n\nAfter the convocation, the world was shattered and split into islands. The stones of gods saved it from total destruction. Rohen, once a powerful mage of the circle, dedicated his life to linking these islands together with portals. He used the power of the archfire, a dangerous arcane force discovered by the circle in the ruins of the Shapers. The force which had driven both the circle and the world to the edge of destruction should have helped him to create a new world. Through the portals, food and water was delivered into the devastated and barren realms, new empires were forged and a rejuvenated Eo began to rise. Rohen even sacrificed his life for that cause.\n\nThe Eo civilization is falling apart and with it, the magical portals that connect the islands. The Shaikans try to stop this but in doing so they only make things worse by waking up the Creator - an ancient evil god. The world is on the edge of destruction and you are the only one who can save it. To do so, you must gather all what remains of once great civilizations and lead your armies against the coming darkness.\n\nMultiplayer notice: The game's multiplayer servers have been taken offline and the only multiplayer option available is LAN.\n\nAge requirements: ESRB Rating: MATURE with Violence, Blood. PEGI Rating: 12+ with Violence.\n\nMinimum system requirements: Windows XP, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 4GB HDD, Mouse, Keyboard.\n\nInstall and Play.","torrent":{"xt":"urn:btih:8616f87647da9186a0e4abc01886589469f952c5","amp;dn":"SpellForce+2%3A+Dragon+Storm+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8616f87647da9186a0e4abc01886589469f952c5","infoHashBuffer":{"type":"Buffer","data":[134,22,248,118,71,218,145,134,160,228,171,192,24,134,88,148,105,249,82,197]},"announce":[],"urlList":[]}}