{"title":"Ben Webster - Soulville (1957) [Jazz][mp3 320][h33t][schon55]","uid":4750047,"size":118940311,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8624c7ccb0e6c884eed507a71a0358a39f6a069b&amp;dn=Ben+Webster+-+Soulville+%281957%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"schon55","files":17,"time":1236127141,"description":"Ben Webster - Soulville\nOriginal Release Date: October 15, 1957 \nLabel: Verve \nAudio CD: October 25, 1990 \nLabel: Polygram Records \nTotal time: 49:11\nBitrate: 320 kbps\n\nThe by turns grizzled and vaporous-toned Webster really hit his stride on the Verve label.  During a stretch from roughly 1953-1959, the Ellington alumnus showcased his supreme playing with both combos and string sections, swingers and ballads -- and lurking beneath his blustery and hulking sound were solo lines brimming with sophistication and wit.  This 1957 date with the Oscar Peterson Trio is one of the highlights of that golden '50s run.  After starting off with two bluesy originals -- the slow burning title track and gutsy 'Late Date' -- Webster gets to the heart of things on five wistful ballads: Here, his exquisitely sly 'Makin' Whoopee' is only outdone by an incredibly nuanced 'Where Are You.'  Providing sympathetic counterpoint, Peterson forgoes his usual pyrotechnics for some leisurely compact solos; his cohorts -- guitarist Herb Ellis, bassist Ray Brown, and drummer Stan Levey -- are equally assured and splendid.  And ending the set with flair, Webster takes over the piano for three somewhat middling yet still impressive stride and boogie-woogie-styled numbers (these are his only piano recordings).  Newcomers shouldn't hesitate to start here. ~ Stephen Cook, AMG\n\nAbsolutely beautiful music.  Webster's tenor sax in his greatest decade.  One of his best albums.  What more can you ask for? Wonderful support from Oscar Peterson, Ray Brown and company.  Ten songs, four gorgeous ballads.  The CD has three previously unreleased tracks not included on the original LP of Webster playing a fierce, nerve-jangling boogie-woogie style piano.  They're of interest because it's Webster pounding the heck out of the keys but they don't really contribute to the otherwise sumptious beauty of the proceedings.  The contents of the original LP is what you'd be buying this for, the first seven songs - Ben Webster at the summit of his art or one of the summits I should say for he attained this level of artistic achievement a number of times throughout the 50s. ~ nostrilbone\n\nThis was the first Ben Webser LP I bought - at a used record store in Berkeley, CA in the early 1970's.  I had no idea who Ben Webster was at the time - was just discovering jazz and I liked the album cover.  Thirty years later there is not a week that goes by that I don't have Soulville on the turntable or in the CD player of my car.  It might not be Ben Webster's best LP (King of the Tenors, maybe?) or his best playing (1939/40 with the Ellington band), but this record has more grit and tender, loving SOUL than any album I've ever owned.  Sit back in your favorite chair, pour a snifter of your favorite libation, turn out all the lights, make sure nobody is home and prepare to get kicked right in the guts.  One warning - don't play this LP if your wife or girlfriend has just walked out on you - it will bring you to tears.  And Stan Levey, by the way, was Charlie Parker's regular drummer after Max Roach left and, along with Roy McCurdy is the best drummer I've heard live on a REGULAR basis.  And the rest of the rythym section speaks for itself. ~ Elmo's Firetruck\n\nPersonnel:\nBen Webster (Tenor Saxophone and Piano) \nRay Brown (Double Bass) \nHerb Ellis (Guitar) \nStan Levey (Drums) \nOscar Peterson (Piano) - 1-7 \n\nBen Webster - Soulville Tracks:\n01  Soulville (Ben Webster) 8:06 \n02  Late Date (Ben Webster) 7:15 \n03  Time On My Hands (Harold Adamson/Mack Gordon/Vincent Youmans) 4:19 \n04  Lover Come Back To Me (Oscar Hammerstein II/Sigmund Romberg) 8:28 \n05  Where Are You (Harold Adamson/Jimmy McHugh) 4:43 \n06  Makin' Whoopee (Gus Kahn/Walter Donaldson) 4:32 \n07  Ill Wind (Harold Arlen/Ted Koehler) 3:34 \n08  Who (Oscar Hammerstein II/Jerome Kern) 2:59 *\n09  Boogie-Woogie (Ben Webster) 3:08 *\n10  Roses Of Picardy (Frederick Edward Weatherly/Haydn Wood) 2:07 *\n* Bonus tracks\n","torrent":{"xt":"urn:btih:8624c7ccb0e6c884eed507a71a0358a39f6a069b","amp;dn":"Ben+Webster+-+Soulville+%281957%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8624c7ccb0e6c884eed507a71a0358a39f6a069b","infoHashBuffer":{"type":"Buffer","data":[134,36,199,204,176,230,200,132,238,213,7,167,26,3,88,163,159,106,6,155]},"announce":[],"urlList":[]}}