{"title":"How to Win Games and Beat People (2016) epub","uid":13730339,"size":5479995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86952876a8f3e1ece183fcd6b982fcd0c2524e80&amp;dn=How+to+Win+Games+and+Beat+People+%282016%29+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1457007751,"description":"How to Win Games and Beat People: Demolish Your Family and Friends at over 30 Classic Games with Advice from an International Array of Experts\r\n\r\n\r\n\r\nDestroy the competition on game night with this seriously funny guide packed with handy strategy, tricks, and tips from the experts\r\n\r\nGames are way more fun to play when you win—especially when you crush your friends and family! In How to Win Games and Beat People, Times science editor Tom Whipple explores inside tips, strategy, and advice from a ridiculously overqualified array of experts that will help you dominate the competition when playing a wide range of classic games—from Hangman to Risk to Trivial Pursuit and more.\r\n\r\nA mathematician explains how to approach Connect 4; a racecar driver guides you through the corners in slot car racing; a mime shares trade secrets for performing the best Charades; a Scrabble champion reveals his secret strategies; and a game theorist teaches you to become a real estate magnate, recommending the Monopoly properties to acquire that will bankrupt and embarrass your opponents (sorry, Mom and Dad).\r\n\r\nFunny, smart, and endlessly useful, this is a must-read for anyone who takes games too seriously, and the bible for sore losers everywhere","torrent":{"xt":"urn:btih:86952876a8f3e1ece183fcd6b982fcd0c2524e80","amp;dn":"How+to+Win+Games+and+Beat+People+%282016%29+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86952876a8f3e1ece183fcd6b982fcd0c2524e80","infoHashBuffer":{"type":"Buffer","data":[134,149,40,118,168,243,225,236,225,131,252,214,185,130,252,208,194,82,78,128]},"announce":[],"urlList":[]}}