{"title":"Rolling Stones - Exile on Main St. (Deluxe 2010) [FLAC] Kitlope","uid":6019608,"size":740916506,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86e49b25c3138e5b7a4557afe91b460b558ee428&amp;dn=Rolling+Stones+-+Exile+on+Main+St.+%28Deluxe+2010%29+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Kitlope","files":33,"time":1291757192,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: 86E49B25C3138E5B7A4557AFE91B460B558EE428\nFile Size: 706.59 MB\nYear: 1972 (Reissued 2010)\nLabel: Universal\nCatalog #: B001418002\n\n\n* This is the 2010 2 CD Deluxe version that has been remastered with 10 bonus tracks on Disc 2. \n\n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\n\n\nFrom Wiki:\n\n\nThe Rolling Stones are a prominent English rock band formed in April 1962 by guitarist and harmonica player Brian Jones, pianist Ian Stewart, vocalist Mick Jagger and guitarist Keith Richards. Bassist Bill Wyman and drummer Charlie Watts completed the early lineup. Rhythm and blues cover songs dominated The Rolling Stones' early material; they are credited for raising the international regard for the earlier styles of blues typified by Chess Records' artists such as Muddy Waters who wrote &quot;Rollin' Stone&quot;, the song after which the band is named. Unconcerned with being seen as authentic blues stylists, from the start the Rolling Stones have played rock and roll, and have written and recorded in many genres.[1]\n\nJones led the band until Jagger and Richards teamed to write hit songs for the band while assuming band leadership. By 1969 Jones' contributions were minimal, and he was unable to tour the United States for legal reasons. By mutual agreement he left the band. Weeks later Jones drowned, while Mick Taylor had already joined the Rolling Stones on guitar. Taylor left in 1974 and was replaced by Ronnie Wood. Wyman left in 1990, and his replacement Darryl Jones became the primary bassist, but he has not been made a full member. Stewart was taken from the official lineup in 1963 to continue as the band's road manager and occasional keyboardist until his death in 1985. Chuck Leavell is the current primary keyboardist for the band.\n\nAfter gaining popularity in Europe, The Rolling Stones became successful in North America during the so-called British Invasion of the mid 1960s. They have released 22 studio albums in the United Kingdom (24 in the United States), eight concert albums (nine in the US) and numerous compilations; their worldwide sales are estimated at more than 200 million albums.[2] Sticky Fingers (1971) began a string of eight consecutive studio albums reaching number one in the United States. Their most recent album of entirely new material, A Bigger Bang, was released in 2005. In 1989 the Rolling Stones were inducted into the Rock and Roll Hall of Fame, and in 2004 they ranked number 4 in Rolling Stone magazine's 100 Greatest Artists of All Time.[3] In 2008, Billboard magazine ranked the Rolling Stones at number ten on &quot;The Billboard Hot 100 Top All-Time Artists&quot;, and as the second most successful group in the Billboard Hot 100 chart. \n\n\n\n\n\n\n\nExile on Main St. 1972 (2010)\n\n\nExile on Main St. is the tenth British and twelfth American studio album by The Rolling Stones. Released as a double LP in May 1972, it draws on many genres including rock &amp; roll, blues, country and soul and calypso. Exile on Main St. was initially greeted with mixed reviews, but it has since become almost universally regarded as a masterpiece.[1] In 2003, the album was ranked number 7 on Rolling Stone magazine's list of the 500 greatest albums of all time.[2]\n\nA remastered version of the album was released in Europe on 17 May 2010 and in the United States on 18 May 2010, featuring 10 new tracks, including &quot;Plundered My Soul&quot;, &quot;Dancing in the Light&quot;, &quot;Following the River&quot; and &quot;Pass the Wine&quot; as well as alternate versions of &quot;Soul Survivor&quot; and &quot;Loving Cup&quot;.[3] Also available as a fan pack with a guitar pick and a t-shirt (size large).\n\nExile on Main St. (Rarities Edition) is a bonus CD made of previously (officially) unreleased studio material available on the 2010 re-release of their 1972 album Exile on Main St.. The album was released on May 18, 2010 in the United States, exclusively in Target stores and debuted at #27 on The Billboard 200.\n\n\n\nTracks: \n\n\nDisc 1\n\n\nRocks Off\nRip This Joint\nShake Your Hips\nCasino Boogie\nTumbling Dice\nSweet Virginia\nTorn and Frayed\nSweet Black Angel\nLoving Cup\nHappy\nTurn on the Run\nVentilator Blues\nI Just Want to See His Face\nLet It Loose\nAll Down The Line\nStop Breaking Down\nShine a Light\nSoul Survivor\n\n\n\n\nDisc 2 \n\n\nPass The Wine (Sophia Loren)\nPlundered My Soul\nI'm Not Signifying\nFollowing the River\nDancing in the Light\nSo Divine (Aladdin Story)\nLoving Cup (Alternate Cup)\nSoul Survivor (Alternate Take)\nGood Time Women\nTitle 5\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:86e49b25c3138e5b7a4557afe91b460b558ee428","amp;dn":"Rolling+Stones+-+Exile+on+Main+St.+%28Deluxe+2010%29+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e49b25c3138e5b7a4557afe91b460b558ee428","infoHashBuffer":{"type":"Buffer","data":[134,228,155,37,195,19,142,91,122,69,87,175,233,27,70,11,85,142,228,40]},"announce":[],"urlList":[]}}