{"title":"Sniper.Elite.3.DLC.Unlocker-RELOADED","uid":10773510,"size":17390,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:87464f681eb0ef534aa51e186456a6f1e95d572a&amp;dn=Sniper.Elite.3.DLC.Unlocker-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":3,"time":1408060885,"description":"\nnERv\n\nSniper Elite 3 DLC Unlocker (c) Rebellion\n\n08/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n- :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nPatchnotes: See included whatsnew.txt\n\nWield iconic guns from the Eastern Front in this weapons pack for Sniper\nElite 3 that combines power with speed, and a re-tuned variant of the\nMosin-Nagant. All weapons are usable in all game modes\n\nThis DLC pack includes\n\n- Mosin-Nagant rifle\n- Blyskawica submachine gun\n- Tokarev TT-33 pistol\n\nDLCs which are included\n- Target Hitler: Hunt the Grey Wolf\n- Camouflage Weapons Pack\n- Hunter Weapons Pack\n- Patriot Weapons Pack\n- Allied Reinforcement Outfits Pack\n- Save Churchill Part 1: In Shadows\n- Sniper Rifles Pack\n\nObserve. Plan. Execute. ADAPT.\n\nThe latest chapter in the award-winning series, SNIPER ELITE 3 takes players\nto the unforgiving yet exotic terrain of North Africa in a savage conflict\nagainst Germany's infamous Afrika Korps.\n\nStalk your targets through the twisting canyons, lush oases and ancient\ncities of the Western Desert in the deadly rush to sabotage a Nazi\nsuper-weapons programme that could end Allied resistance for good.\n\nUse stealth, planning and execution to hunt your targets  whether human or\nmachine. From signature long distance kills, to melee takedowns, distractions\nand explosive traps, you are as deadly up close as you are from afar.\n\nIt must end here. You are the turning point. Because one bullet can change\nhistory...\n\nKey Features\n\nAward-winning gunplay  Experience celebrated rifle ballistics honed to\nperfection. Take account of distance, gravity, wind, even your heart rate for\nintensely satisfying third person combat.\nExpansive new environments  Stalk huge multi-route levels with multiple\nprimary and secondary objectives than can be tackled in any order. Never play\nthe same way twice.\nReal tactical choice  Adapt to any situation. Use stealth, distraction,\ntraps and sound masking . If things go hot, use the new Relocate mechanic to\nslip into the shadows and start the hunt again on your own terms.\nRevamped human X-Ray Kill cam  The acclaimed X-Ray kill-cam is back and\nbolder than ever, including a detailed muscle layers, 3D mesh particles and\nthe complete human circulatory system.\nNew X-Ray vehicle takedowns  See vehicles disintegrate in intricate detail\nwith X-Ray vehicle takedowns. Multi-stage destruction allows you to take out\narmoured cars, trucks and Tiger tanks piece-by-piece.\nTense adversarial multiplayer  Five unique modes of online competitive\naction. Earn Medals and Ribbons as you play. Gain XP across all game modes,\ncustomise your character, weapons and loadout. Become a true Sniper Elite\nExplosive co-op play  Play the entire campaign in two player online co-op,\nor put your teamwork to the ultimate test in two dedicated co-op modes,\nOverwatch and Survival.\nCustomise your experience  Veteran or Rookie, play your way. Turn off all\nassistance and turn up the AI, or customise the experience to your preferred\nplaystyle. Tweak the regularity of X-Ray kill cams, or turn them off all\ntogether.\n\nExtra features\nSupports Steam Big Picture Mode\nSupports Stereoscopic 3D  Ultra Widescreen  Eyefinity screens\n\nWe suggest boycutting games with this greedy DLC bullshit\n\n1. Unrar\n2. Sniper.Elite.3.Update.v1.07.incl.DLC-RELOADED have to be installed\n3. Copy files into your game install directory\n4. Play the game\n5. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:87464f681eb0ef534aa51e186456a6f1e95d572a","amp;dn":"Sniper.Elite.3.DLC.Unlocker-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87464f681eb0ef534aa51e186456a6f1e95d572a","infoHashBuffer":{"type":"Buffer","data":[135,70,79,104,30,176,239,83,74,165,30,24,100,86,166,241,233,93,87,42]},"announce":[],"urlList":[]}}