{"title":"Cliff Hardy Series - Peter Corris (Mystery, Thriller)","uid":9891121,"size":9935234,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:875d44123e82d856468489ac05e2c3d7a681ece4&amp;dn=Cliff+Hardy+Series+-+Peter+Corris+%28Mystery%2C+Thriller%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1396646494,"description":"Peter Corris was born in country Victoria and educated at Melbourne High School and the University of Melbourne. After taking a MasterÂ¹s degree at Monash University and a PhD (both in history) at the ANU, he worked as an academic at several universities before turning to journalism. He was Literary Editor of The National Times from 1980-1 and has been a professional writer for the past 20 years. He is best known for his novels showcasing Sydney private detective Cliff Hardy. \n\nCliff Hardy, born and raised in working class Maroubra, ex-army, law student dropout, insurance company investigator turned Private Eye, has a love-hate relationship with his time and place. He embraces the best aspects of Australian life - the tolerance, the classlessness, the vigorous urban and rural culture - while despising the greed and the conservatism that are constantly threatening to undercut what he sees as &quot;real Australia&quot;.\n\nInevitably drawn into the ambit of the people he deplores, Hardy struggles to resolve his cases while remaining true to his own threatened values. The professional challenges spill over into his personal life where he is never on firm ground.","torrent":{"xt":"urn:btih:875d44123e82d856468489ac05e2c3d7a681ece4","amp;dn":"Cliff+Hardy+Series+-+Peter+Corris+%28Mystery%2C+Thriller%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"875d44123e82d856468489ac05e2c3d7a681ece4","infoHashBuffer":{"type":"Buffer","data":[135,93,68,18,62,130,216,86,70,132,137,172,5,226,195,215,166,129,236,228]},"announce":[],"urlList":[]}}