{"title":"VIGILANTE 001-012 (2009-2010) (DC Comics) COMPLETE","uid":8068325,"size":188552732,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:875e79612159ccba672293a1ef04dd812b0b7c6e&amp;dn=VIGILANTE+001-012+%282009-2010%29+%28DC+Comics%29+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1359222833,"description":"This torrent contains:\n\nVIGILANTE 01-12 (2009-2010)\n\n------\n\nFrom Wikipedia:\n\nThe most recent Vigilante appeared in Nightwing #133-137. While he wears a costume similar to the second Vigilante (Adrian Chase), it is a new vigilante under the mask.\n\nThis Vigilante also appears in Gotham Underground, set after his initial encounter with Nightwing. He is shown to be a formidable fighter, but is defeated easily by Batman.\n\nFollowing the events of Vigilante #1 (February 2009), the new Vigilante is seen out of costume for the first time and is referred to by his ally JJ as &quot;Dorian.&quot; He initially operates under the identity of Joe Flynn, a small time criminal with a rap sheet, but it is later revealed that the real Joe Flynn is dead. Little is known about Dorian's past, but his wife is dead and he served time in prison for his work with the mob.\n\nAt one point, JJ warns Vigilante about the dangers of pushing himself to the point of destruction, commenting that he &quot;saw it happen&quot; with Adrian Chase. Vigilante describes his predecessor as a fool.\n\nThis Vigilante plays an important role in the &quot;Deathtrap&quot; crossover with the Teen Titans and the Titans. He targets the unbalanced Jericho for assassination, bringing him into conflict with the various heroes. Vigilante succeeds in tracking down Jericho but, having promised Rose Wilson not to kill him, instead gouges Jericho's eyes out to stop him from using his powers.\n","torrent":{"xt":"urn:btih:875e79612159ccba672293a1ef04dd812b0b7c6e","amp;dn":"VIGILANTE+001-012+%282009-2010%29+%28DC+Comics%29+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"875e79612159ccba672293a1ef04dd812b0b7c6e","infoHashBuffer":{"type":"Buffer","data":[135,94,121,97,33,89,204,186,103,34,147,161,239,4,221,129,43,11,124,110]},"announce":[],"urlList":[]}}