{"title":"Digital Tutors - Quick Start to After Effects Volume 1","uid":10742304,"size":1716690487,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:879de3a5b48640f0b39ed377876b9ff4693d7ee9&amp;dn=Digital+Tutors+-+Quick+Start+to+After+Effects+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"NepsterJay","files":13,"time":1407770249,"description":"Welcome to the Quick Start to After Effects. Quick Starts are a series of specially-constructed courses meant to be followed in sequence and include valuable exercises to reinforce learned concepts. The lesson format for these Quick Starts will be similar to other Digital Tutors introductory training. We'll go through After Effects in a very methodical, step-by-step, way, making sure to cover the tools and techniques that are most important in enabling you to get up and running quickly. Each volume of a Quick Start will build upon the skills you learned in the previous volumes, enabling us to progressively build and create more complex projects or projects with other objectives. In this initial volume, we'll cover the basics of getting started working in After Effects. We'll discuss navigation and the interface. We'll cover methods of working with outside sources for assets and how to import them to After Effects. We'll also learn how to work with layers on the Timeline and how to start editing and adding effects to them to create a story. In the end we'll end up with a finished commercial style ad that will teach you the basics of getting started with After Effects as well as give you a few editorial pointers. While following along with these lessons and building a project together will provide you with valuable knowledge, the real power comes from being able to take the techniques you've learned and apply them in a different way to your own work. With this in mind, you'll be presented with an assignment immediately following each volume. These assignments will challenge you to take the skills that you've learned in a particular volume and apply them to a different set of assets.\n\nThese courses are designed to be taken in sequence so we really encourage you to start with this volume and proceed all the way through to Volume 5, and take advantage of the periodic assignments along the way to get the full learning experience.","torrent":{"xt":"urn:btih:879de3a5b48640f0b39ed377876b9ff4693d7ee9","amp;dn":"Digital+Tutors+-+Quick+Start+to+After+Effects+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879de3a5b48640f0b39ed377876b9ff4693d7ee9","infoHashBuffer":{"type":"Buffer","data":[135,157,227,165,180,134,64,240,179,158,211,119,135,107,159,244,105,61,126,233]},"announce":[],"urlList":[]}}