{"title":"Shadow Warriors-Inside the Special Forces[EPUB+PDF][Team Nanban]","uid":6988076,"size":4653842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8886b85d731d5ec0e988218ae3051eb6450eb6ac&amp;dn=Shadow+Warriors-Inside+the+Special+Forces%5BEPUB%2BPDF%5D%5BTeam+Nanban%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"594mgnav","files":4,"time":1327631230,"description":"Shadow Warriors -  Inside the Special Forces[EPUB+PDF][Team Nanban][TPB]\n\nTom Clancy, Carl Stiner, Tony Koltz | 2002 | EPUB+PDF |\n\n\nDESCRIPTION:\n\n\nIn his first two Commanders books, Tom Clancy teamed with armor and \ninfantry General Fred Franks, Jr., and Air Force General Chuck Horner to provide \nmasterful blends of history, biography, you-are-there narrative, insight into the \npractice of leadership, and plain old-fashioned storytelling. \n\nShadow Warriors is all of that, and more, for in the words of \nLieutenant General Bill Yarborough, &quot;There are itches that only Special Forces can scratch.\n\nThe training, resourcefulness, and creativity of the SF soldier make him capable of jobs \nthat few other soldiers could handle, in situations where traditional arms and \nmovement don't apply. \n\nCarl Stiner was only the second commander of SOCOM, the U.S. Special Operations Command, \nresponsible for the readiness of all the Special Operations forces of the Army, Navy, and \nAir Force, including the Green Berets, Navy SEALS, Rangers, Delta Force, \nAir Force Special Operations, PsyOps, and Civil Affairs. \n\nTogether, he and Clancy trace the transformation of the Special Forces from the \nsmall core of outsiders of the 1950s through the cauldron of Vietnam and to the \nrebirth of the SF in the late 1980s and 1990s as the bearer of the largest, most mixed, and \nmost complex set of missions in the U.S. military. \n\nFrom Vietnam and Laos to Panama and El Salvador to Lebanon, Saudi Arabia, Kuwait, and \nIraq, these are stories of raids, counterterrorism, hostage rescues, reconaissance, \ncounterinsurgency and psychological operations-and also of building settlements, \nteaching civilians, cleaning up water supplies, and saving lives. \n\nIt is a front-row seat to a man, an institution, and a way both of war and \npeace that together make this an instant classic of military history.\n\nPLZ SEED AFTER DOWNLOADING..\n\n&quot;LIVE AND LET LIVE&quot;","torrent":{"xt":"urn:btih:8886b85d731d5ec0e988218ae3051eb6450eb6ac","amp;dn":"Shadow+Warriors-Inside+the+Special+Forces%5BEPUB%2BPDF%5D%5BTeam+Nanban%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8886b85d731d5ec0e988218ae3051eb6450eb6ac","infoHashBuffer":{"type":"Buffer","data":[136,134,184,93,115,29,94,192,233,136,33,138,227,5,30,182,69,14,182,172]},"announce":[],"urlList":[]}}