{"title":"ALICE SEBOLD-THE LOVELY BONES","uid":5387742,"size":955725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88a355b2126f3116cfe500970e075ba84147f16c&amp;dn=ALICE+SEBOLD-THE+LOVELY+BONES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"m8raid","files":2,"time":1266945971,"description":"ALICE SEBOLD The lovely bones PDF\nThis is a great book, i tried to get this from my local library for a few months so when i finaly got it, i decided to help you by uploading it for you. enjoy...... and please seed for the next person please\n[M8raid]\n\nOn her way home from school on a snowy December day in 1973, 14-year-old Susie Salmon (&quot;like the fish&quot;) is lured into a makeshift underground den in a cornfield and brutally raped and murdered, the latest victim of a serial killer--the man she knew as her neighbor, Mr. Harvey.\n\nAlice Sebold's haunting and heartbreaking debut novel, The Lovely Bones, unfolds from heaven, where &quot;life is a perpetual yesterday&quot; and where Susie narrates and keeps watch over her grieving family and friends, as well as her brazen killer and the sad detective working on her case. As Sebold fashions it, everyone has his or her own version of heaven. Susie's resembles the athletic fields and landscape of a suburban high school: a heaven of her &quot;simplest dreams,&quot; where &quot;there were no teachers.... We never had to go inside except for art class.... The boys did not pinch our backsides or tell us we smelled; our textbooks were Seventeen and Glamour and Vogue.&quot;\n\nThe Lovely Bones works as an odd yet affecting coming-of-age story. Susie struggles to accept her death while still clinging to the lost world of the living, following her family's dramas over the years like an episode of My So-Called Afterlife. Her family disintegrates in their grief: her father becomes determined to find her killer, her mother withdraws, her little brother Buckley attempts to make sense of the new hole in his family, and her younger sister Lindsey moves through the milestone events of her teenage and young adult years with Susie riding spiritual shotgun. Random acts and missed opportunities run throughout the book--Susie recalls her sole kiss with a boy on Earth as &quot;like an accident--a beautiful gasoline rainbow.&quot; Though sentimental at times, The Lovely Bones is a moving exploration of loss and mourning that ultimately puts its faith in the living and that is made even more powerful by a cast of convincing characters. Sebold orchestrates a big finish, and though things tend to wrap up a little too well for everyone in the end, one can only imagine (or hope) that heaven is indeed a place filled with such happy endings. --Brad Thomas Parsons \n\nLinks &lt;a href=&quot;\nhttp://www.amazon.com/Lovely-Bones-Novel-Alice-Sebold/dp/0316666343&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Lovely-Bones-Novel-Alice-Sebold/dp/0316666343&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Lovely_Bones&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Lovely_Bones&lt;/a&gt;\n","torrent":{"xt":"urn:btih:88a355b2126f3116cfe500970e075ba84147f16c","amp;dn":"ALICE+SEBOLD-THE+LOVELY+BONES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88a355b2126f3116cfe500970e075ba84147f16c","infoHashBuffer":{"type":"Buffer","data":[136,163,85,178,18,111,49,22,207,229,0,151,14,7,91,168,65,71,241,108]},"announce":[],"urlList":[]}}