{"title":"Wolverine v4 01-20, 300-317 + Ex (2010-2013|Digital|MM+TG+Z-E)","uid":9642199,"size":1700384940,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:894cc74e60d8015f224628289d5f246f4b66759e&amp;dn=Wolverine+v4+01-20%2C+300-317+%2B+Ex+%282010-2013%7CDigital%7CMM%2BTG%2BZ-E%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1392942353,"description":"This torrent collects every issue of the 4th volume of Wolverine, including several extras. After the first 20 issues, the title was numbered to issue 300 till the end of the series in 317, after which v5 was launched under the Marvel Now banner (plus a million other Wolverine series, lol). Jason Aaron and Cullen Bunn are the primary writers for this run, and they put Logan through hell - literally and figuratively. Wolverine also returns to Japan during this run, with unexpected (and expected) results. \n\nEvery issue of the main title is Digital, thanks to TheGroup, Minutemen-PhD, and Zone-Empire. The Annual is digital courtesy of Cypher-Empire. I have added two nice sets of extras relevant to this era/date: the first, Digital Exclusives, are a set of 5 short MDCE comics webripped by PeteThePIPster. Those are: Carni-Brawl, Development Hell, One Night Only, The Dust From Above, and Worst There Is. The Second set of extras are 5 different One-Shots (some significant, some not) and issues 900 + 1000. The One-Shots are Road To Hell (which kicks off this title), Mr. X, Under The Boardwalk, Savage, and Wolverine/Deadpool - The Decoy. All are by various listed Minutemen scanners except RtH, which is digital by Cypher-Empire. The Decoy is also digital. Thanks to all the scanner groups for their hard work - please seed and enjoy! :-)","torrent":{"xt":"urn:btih:894cc74e60d8015f224628289d5f246f4b66759e","amp;dn":"Wolverine+v4+01-20%2C+300-317+%2B+Ex+%282010-2013%7CDigital%7CMM%2BTG%2BZ-E%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894cc74e60d8015f224628289d5f246f4b66759e","infoHashBuffer":{"type":"Buffer","data":[137,76,199,78,96,216,1,95,34,70,40,40,157,95,36,111,75,102,117,158]},"announce":[],"urlList":[]}}