{"title":"ConvertXtoDVD v5.0.0.45 (2-click run)(registred)","uid":8693792,"size":35154130,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:894fd73b067d5c71e790e4f86b997b1dd3be20fa&amp;dn=ConvertXtoDVD+v5.0.0.45+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1373925565,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDescription:\nConvertXtoDVD, video conversion software, you can convert and burn all your videos and convert Avi to DVD! Backup and transfer your movies to DVD and enjoy watching them on any home DVD player. All in one conversion and burning software. This award-winning divx to dvd video converter software supports most video and audio formats for video conversion (avi, mpg, mov, wmv, mkv, ogm and more) and even handles DVD to DVD copy! Backup and transfer your movies to DVD and enjoy watching them on any home DVD player.\n\nKey Features:\n\n- Video formats supported: avi, divx, xvid, mov, mkv, flv , mpeg1, mpeg2, mpeg-, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download\n- Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n- Conversion advisor wizard, control of the conversion speed vs. quality\n- Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n- Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n- Custom and or automatic chapter creation with markers and preview window\n- Advanced file merging possibilities\n- Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more... Select audio output format.\n- Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA, opensubtitles, dvbsub with color and font selection, and supports tags like italic, bold, turn on/off with DVD player remote control\n- Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Broadcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n- Video post processing settings like video resize-pad/cropping and de-interlacing options\n- Multilingual support\n- Optimized for Windows XP / Vista 32bits and 64bits\n\nConvertXtoDVD - 5.0.0.45 (Not Yet Released) [ View Issues ]\n\n- 0005956: [Feature Request] show preview of 16:9 menus too (felicia) - resolved.\n- 0006235: [Feature Request] setting to display or not hints (felicia) - resolved.\n- 0006476: [Feature Request] change color of background in preview editor window (felicia) - resolved.\n- 0005575: [Bug] can't drag and drop subtitles into subtitles tab (felicia) - resolved.\n- 0006464: [Bug] no audio on Video_TS with discriminator in flat mode (felicia) - resolved.\n[5 issues]\n\nSystem Requirements:\n\nHardware\n\nProcessor Intel Pentium III / AMD Athlon \n(Intel Pentium 4 / AMD Athlon XP or equivalent recommended)\n512 MB RAM with Windows XP \n1 GB RAM with Windows Vista\nHard disk drive with at least 4.3 Gbytes free\nDVD Burner\n\nOperating System\n\nWindows XP SP2/SP3, Windows Vista, Windows 7 &amp; 8\n\nHomepage: http://www.vso-software.fr/products/convert_x_to_dvd/\n\nInstallation instructions:\n1. Execute the ConvertXtoDVD v5.0.0.45 (2-click run)(registred).exe file.\n2. Click next.\n3. Enjoy the program.\n4. When you have the time take a look at the included torrent &quot;My Wallpaper Gallery v1.4.torrent&quot;. Great tool to change you wallpaper in a few clicks with many updates from time to time. ","torrent":{"xt":"urn:btih:894fd73b067d5c71e790e4f86b997b1dd3be20fa","amp;dn":"ConvertXtoDVD+v5.0.0.45+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894fd73b067d5c71e790e4f86b997b1dd3be20fa","infoHashBuffer":{"type":"Buffer","data":[137,79,215,59,6,125,92,113,231,144,228,248,107,153,123,29,211,190,32,250]},"announce":[],"urlList":[]}}