{"title":"Baaghi (2016) - HEVC - x265.AAC.Esubs - DDR","uid":15086896,"size":733428366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8967abb67f9d9dafc6157059d7bfa4906e251f33&amp;dn=Baaghi+%282016%29+-+HEVC+-+x265.AAC.Esubs+-+DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SaM","files":2,"time":1466889982,"description":"Presenting a DDR Anniversary Upload\r\n\r\n\r\nBaaghi -(2016)\r\n(A film by Sabbir Khan)\r\n\r\nHindi - DVD Rip - 720x304 (2.35:1)- 699 MB - x.265.AAC.Esubs - 2 Hrs:13 Min\r\n\r\nA HIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/a5RM \nhttp://extraimago.com/image/a5R9 \nhttp://extraimago.com/image/a5R3 \nhttp://extraimago.com/image/a5Rb \nhttp://extraimago.com/image/a5Rh \nhttp://extraimago.com/image/a5Rd \nhttp://extraimago.com/image/a5RI \nhttp://extraimago.com/image/a5Rl \nhttp://extraimago.com/image/a5Ri \nhttp://extraimago.com/image/a5Rm \nhttp://extraimago.com/image/a5RR \nhttp://extraimago.com/image/a5RQ \nhttp://extraimago.com/image/a5RL\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/a5Ry\r\n\r\nSynopsis:\r\nRonny (Tiger Shroff) &amp; Siya (Sharddha Kapoor) meet on a train and are immediately attracted to each other. They meet again in Kerala, fall in love and exchange vows of eternal loyalty - together with a valuable ring from Siya to Ronny. They naturally have misunderstandings thereafter and part company. Siya's father (Sunil Grover) though has other ideas. He's taken oodles of money from Raghav (Sudheer Babu), the son of the teacher of Kalarpayattu Guruswamy (Shifuji Shaurya Bharadwaj), who also happens to be Raghav's father. With his connivance Raghav kidnaps Siya who by now is a film actress. He takes her to his fortress in Bangkok.\r\n\r\nThe producer hires Ronnie to rescue Siya. Ronnie goes to Bangkok and beats up a large number of local goons until he finds out where Raghav (and Siya) is. After a few more fights, Raghav &amp; Siya are reunited and go cavorting on the beaches of Thailand. Raghav catches up with them and Ronnie is ostensibly shot dead by his henchman Vijju.\r\n\r\nBut Vijju has played foul. He knows that Ronnie is a good man and has fired blanks at him. So Ronnie reappears and there are more fights until there is a climactic fight between Raghav and Ronnie..\r\n\r\nDoen't make any sense? Well you aren't alone!\r\n\r\n\r\nComments:\r\nDo you have 2 hours and 13 minutes during which you can simply allow your brain to go numb and let only your eyes do all the work? Then this movie is for you. Its two hours plus of non-stop fights, interspaced with some very insipid romance. No don't look for a credible story. There isn't one. Its not meant to tell a tale. Its meant to show off Tiger Shroffs abs and Shraddha Kapoors curves. That being the limited aim, it succeeds. And since we know that both Kerala and Thailand have heavy rainfall, we can perhaps forgive the raingods for drenching Shraddha Kapoor at every concievable opportunity. If it isn't the rain, its the sea!\r\n\r\nYou get some awesome photography of Thailand and Kerala. There is a smattering of breathtaking choreography in the action and fight scenes. The Heroine looks gorgeous at times. There is some underwater photography, (but not that impressive) and of course there is Kalaripayattu - the martial art of Kerala.\r\n\r\nYou don't get logic or any real emotions - eberything is and seems fake. You don't get any reasonable acting - even the best of them, Sudheer Babu is wooden. You don't get any music that you will remember.\r\n\r\nThat is about all I can say after two hours of watching Baaghi!\r\n\r\nUploader's Notes:\r\n\r\nA reasonably good DVD which had too much of an yellow tint. Removing that was a pain but otherwise there is a wealth of detail. Since the film is fast-moving, it is to the credit of the DVD authoring that the motion is captured fluidly with little or no blocking. There is a slight amount of banding, which we have been able to reduce.\r\n\r\nAs this is a HEVC rip, we were able to use the extra compressibility to reduce the size to just 700 MB. The quality can be seen from the fast and action scenes which have been captured to near perfection..\r\n\r\nBe aware that this rip (and all HEVC rips) will not play on many standalone players. You need a compatible standalone video player. You can of course stream it to the large screen TV using a streaming device. On your PC please be sure to use the latest version of video players (VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0) will work. Earlier versions may not).\r\n\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4864932/","torrent":{"xt":"urn:btih:8967abb67f9d9dafc6157059d7bfa4906e251f33","amp;dn":"Baaghi+%282016%29+-+HEVC+-+x265.AAC.Esubs+-+DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8967abb67f9d9dafc6157059d7bfa4906e251f33","infoHashBuffer":{"type":"Buffer","data":[137,103,171,182,127,157,157,175,198,21,112,89,215,191,164,144,110,37,31,51]},"announce":[],"urlList":[]}}