{"title":"Amsterdam: A History of the World's Most Liberal City by Russell","uid":9419219,"size":12539449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a5e7bfbe19560d6e76af1b741000a9c2dd07984&amp;dn=Amsterdam%3A+A+History+of+the+World%27s+Most+Liberal+City+by+Russell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":-1,"time":1388526357,"description":"An endlessly entertaining portrait of the city of Amsterdam and the ideas that make it unique, by the author of the acclaimed Island at the Center of the World\nTourists know Amsterdam as a picturesque city of low-slung brick houses lining tidy canals; student travelers know it for its legal brothels and hash bars; art lovers know it for Rembrandt's glorious portraits.\nBut the deeper history of Amsterdam, what makes it one of the most fascinating places on earth, is bound up in its unique geography-the constant battle of its citizens to keep the sea at bay and the democratic philosophy that this enduring struggle fostered. Amsterdam is the font of liberalism, in both its senses. Tolerance for free thinking and free love make it a place where, in the words of one of its mayors, &quot;craziness is a value.&quot; But the city also fostered the deeper meaning of liberalism, one that profoundly influenced America: political and economic freedom. Amsterdam was home not only to religious dissidents and radical thinkers but to the world's first great global corporation.\nIn this effortlessly erudite account, Russell Shorto traces the idiosyncratic evolution of Amsterdam, showing how such disparate elements as herring anatomy, naked Anabaptists parading through the streets, and an intimate gathering in a sixteenth-century wine-tasting room had a profound effect on Dutch-and world-history. Weaving in his own experiences of his adopted home, Shorto provides an ever-surprising, intellectually engaging story of Amsterdam from the building of its first canals in the 1300s, through its brutal struggle for independence, its golden age as a vast empire, to its complex present in which its cherished ideals of liberalism are under siege","torrent":{"xt":"urn:btih:8a5e7bfbe19560d6e76af1b741000a9c2dd07984","amp;dn":"Amsterdam%3A+A+History+of+the+World%27s+Most+Liberal+City+by+Russell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a5e7bfbe19560d6e76af1b741000a9c2dd07984","infoHashBuffer":{"type":"Buffer","data":[138,94,123,251,225,149,96,214,231,106,241,183,65,0,10,156,45,208,121,132]},"announce":[],"urlList":[]}}