{"title":"The Amazing Screw on Head","uid":8358457,"size":219503723,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a60d1613abd396a335b718ce80caceb655bc98e&amp;dn=The+Amazing+Screw+on+Head&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DubKingdom","files":-1,"time":1365548942,"description":"Animated: The Amazing Screw on Head\nEpisode: Pilot\nLanguage: English\n\nThe 22-minute pilot differs from the comic mainly in that the characters are fleshed out with backstories. Rather than a master of languages, Emperor Zombie (David Hyde Pierce) is the first of Screw-On Head's (Paul Giamatti) manservants, who has turned to evil despite Screw-On Head's advice. Out of revenge for his first defeat, Zombie developed what he refers to as a &quot;petty vengeance fetish&quot;, killing the seven replacement servants after him, and before Mr. Groin (Patton Oswalt), in gruesome ways. Zombie's vampire mistress, now named Patience (Molly Shannon), is much more talkative; a flashback reveals she was Screw-On Head's former love, until snatched from him by a vampire servant of Zombie. Instead of Dr. Snap, Emperor Zombie's other servants are a monkey named Ricky and two horrible old women named Aggie and Geraldine (both voiced by Mindy Sterling), one a werewolf and the other a cannibal who apparently takes over Dr. Snap's role as scientist as well.\n\nThe pilot begins with the theft of the Kalakistan fragment and Professor Fruen (the only man who can translate it), by Zombie's henchmen. Emperor Zombie smokes Fruen in a giant hookah to gain the knowledge to read the fragment pertaining to Gung's temple. An interlude has Screw-On Head track down Patience in Marrakesh, then torture her to try to find Zombie's whereabouts.\n\nAt the conclusion Zombie sinks to the bottom of the Mississippi River while his henchmen kidnap Mr. Dog by impaling him with an anchor from an air balloon. President Lincoln gives Screw-On Head permission to deal with whatever supernatural things lurk in the western frontier after signing the Homestead Act.\n\nOn July 12, 2006, The Amazing Screw-On Head TV pilot was aired online at scifi.com with a survey to decide whether or not the show goes to series. According to Mike Mignola on the November 29, 2006 Fanboy Radio podcast, the series was not picked up by the Sci-Fi Channel.[1] The pilot was released on DVD on February 6, 2007.\n\n\n","torrent":{"xt":"urn:btih:8a60d1613abd396a335b718ce80caceb655bc98e","amp;dn":"The+Amazing+Screw+on+Head","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a60d1613abd396a335b718ce80caceb655bc98e","infoHashBuffer":{"type":"Buffer","data":[138,96,209,97,58,189,57,106,51,91,113,140,232,12,172,235,101,91,201,142]},"announce":[],"urlList":[]}}