{"title":"Hungry Shark World v1.3.0 (Mod Money) APK + OBB [SadeemPC]","uid":15454737,"size":270329018,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8a965f8a9d0054157d7febaf008d0e69aab38cb3&amp;dn=Hungry+Shark+World+v1.3.0+%28Mod+Money%29+APK+%2B+OBB+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"SadeemPC","files":1,"time":1469974971,"description":"Hungry Shark World v1.3.0 (Mod Money)\r\nRequirements: Android 4.2+\r\n\r\nThe Sharks are back, and this time they are taking on the entire Earth! Take control of a very Hungry Shark in this action packed aquatic adventure. Survive as long as possible by eating everything that gets in your way! Hungry Shark World opens up a brand new adventure with addictive fast-pace gameplay, console quality graphics, multiple massive levels to explore and epic enemies to chomp down! Loads of sharks to control and more of our own special blend of FGOL humour than ever before, Hungry Shark World is the ground breaking new game that you will play until the end of time! Hope you brought your charger!\t\r\n\r\nFEATURES:\r\n- EXPLORE THE WORLD’S OCEANS!\r\nWhere there’s sea, there’s sharks: breath-taking levels filled with gorgeous environments, a massive array of prey, dastardly enemies to outwit and cunning strategies to overcome every challenge you face in your sharky life! They say humans have only explored 2% of the ocean; now’s your chance to find out what else is out there and be hailed the captain of discovery and adventure! \r\n\r\n- ALL OF THE SHARKS!\r\nYou’ve never seen sharks like this before! With 7 different strengths, sizes and skills, each tier of shark has its own special abilities! Each shark, big or small, has its own unique personality and quirky animations. From d’aww to ARGH, discover your inner shark and let it DOMINATE! And you can challenge the rest of your sharky shiver of friends to beat your hi-score with theLeaderboards!\r\n\r\n- YOUR MISSION, IF YOU CHOOSE TO ACCEPT IT… \r\nHow can a shark get any cooler, I mean, really? Well, there are limitless missions you will have to master in order to plan, advance and conquer! There are loads of missions to complete with great rewards and re-playability. Rise through the ranks of the food chain and level up your jawsome pal to bite harder, swim faster and grow HUNGRY…er!\r\n\r\n- SHARKY SWAGALICIOUS! \r\nNo one said being a shark would be easy, eh? But they got swag! In this world, a passion for fashion has more than the obvious benefits of looking FABULOUS. Make sure to pimp your aquatic gastronome in only the finest in fin and tail accessories before going to dinner. Each finely crafted item of apparel will power up your shark in weird and wonderful ways!\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.ubisoft.hungrysharkworld\r\n\r\n\r\nOBB: copy to SDCardAndroidobb.\r\n\r\nMod:\r\n- Unlimited Coins &quot;increase&quot;.\r\n- Unlimited Gems &quot;increase&quot;.\r\n- Cheat detection removed.\r\n- Unlocked\r\n- Ads-Free","torrent":{"xt":"urn:btih:8a965f8a9d0054157d7febaf008d0e69aab38cb3","amp;dn":"Hungry+Shark+World+v1.3.0+%28Mod+Money%29+APK+%2B+OBB+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a965f8a9d0054157d7febaf008d0e69aab38cb3","infoHashBuffer":{"type":"Buffer","data":[138,150,95,138,157,0,84,21,125,127,235,175,0,141,14,105,170,179,140,179]},"announce":[],"urlList":[]}}