{"title":"American_Top_40_1974_June_8th","uid":10335007,"size":362038104,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8b92b907946cb85315675353eab34122c313a0e5&amp;dn=American_Top_40_1974_June_8th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1402458531,"description":"&quot;Once a week with American Top 40 and you know where your favorite songs are on the national music scene. My name is Casey Kasem. On with the countdown on the way to a brand new number one.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nYou might notice Casey doesn't introduce &quot;Rikki, Don't Lose That Number&quot; by Steely Dan (which debuts at number 38). That is the way it was broadcast.\n\nCasey reads a letter that asks &quot;What artist in the rock era has had the most top 10 hits?&quot; Then one song later, he says the letter writer knows that artist is Elvis, but really wants to know who is in second and third place. The Beatles rank second, and a famous all-girl group holds third. Casey tells who.\n\nIn the history of Warner Brothers Records, only one group has ever been signed to a contract just on the basis of an audition tape sent in the mail, no negotiations, live auditions, or any other hoops to jump through. That band is has a hit in this countdown.\n\nThere is the &quot;current smash&quot; by an artist whose success was blocked for seven long years by wealth and social status. No one thought she could have any talent because she was from a wealthy and prominent publishing family. If I had that kind of talent, I wouldn't be doing this.\n\nThere is a new song by the female recording star that has made more new hits out of old hit songs than any other female recording artist. Casey says he found at least 17, &quot;R-E-S-P-E-C-T&quot; being one of them.\n\nBefore this countdown, Paul, George, and Ringo stood tied for most solo hits since the Beatles break-up. Well, one of them has the new number one hit in the USA for June 8th, 1974.\n\n40:    Sideshow - Blue Magic\n39:    No Charge - Melba Montgomery\n38:    Rikki, Don't Lose That Number - Steely Dan        \n37:    If You Wanna Get To Heaven - Ozark Mountain Daredevils     \n36:    The Payback (Part 1) - James Brown     \n35:    The Air That I Breathe - The Hollies    \n34:    Come And Get Your Love - Redbone\n33:    Mighty Mighty - Earth, Wind &amp; Fire\n32:    Another Park, Another Sunday - The Doobie Brothers\n31:    Son Of Sagittaruis - Eddie Kendricks\n30:    I'm Coming Home - Spinners\n29:    On And On - Gladys Knight &amp; The Pips\n28:    One Hell Of A Woman - Mac Davis\n27:    TSOP - MFSB\n26:    Bennie &amp; The Jets - Elton John\n25:    Just Don't Want To Be Lonely - The Main Ingredient\n24:    Save The Last Dance For Me - The DeFranco Family featuring Tony DeFranco\n23:    (I've Been) Searchin' So Long - Chicago\n22:    Don't You Worry 'Bout A Thing - Stevie Wonder\n21:    Haven't Got Time For The Pain - Carly Simon\n20:    You Won't See Me - Anne Murray\n19:    I'm In Love - Aretha Franklin\n18:    I Won't Last A Day Without You - The Carpenters\n17:    Hollywood Swinging - Kool &amp; The Gang\n16:    The Show Must Go On - Three Dog Night\n15:    If You Love Me (Let Me Know) - Olivia Newton-John\n14:    The Loco-Motion - Grand Funk\n13:    Oh Very Young - Cat Stevens\n12:    My Girl Bill - Jim Stafford\n11:    Be Thankful For What You Got - William De Vaughn\n10:    For The Love Of Money - The O'Jays\n9:    Midnight At The Oasis - Maria Muldaur\n8:    The Entertainer - Marvin Hamlisch\n7:    Help Me - Joni Mitchell\n6:    Billy, Don't Be A Hero - Bo Donaldson &amp; The Heywoods\n5:    Sundown - Gordon Lightfoot\n4:    Dancing Machine - The Jackson 5\n3:    You Make Me Feel Brand New - The Stylistics\n2:    The Streak - Ray Stevens\n1:    Band On The Run - Paul McCartney &amp; Wings","torrent":{"xt":"urn:btih:8b92b907946cb85315675353eab34122c313a0e5","amp;dn":"American_Top_40_1974_June_8th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b92b907946cb85315675353eab34122c313a0e5","infoHashBuffer":{"type":"Buffer","data":[139,146,185,7,148,108,184,83,21,103,83,83,234,179,65,34,195,19,160,229]},"announce":[],"urlList":[]}}