{"title":"Port.Royale.3.Steam.Edition.Repack.READNFO-CPY","uid":7880504,"size":5558768995,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8bb77a03bcb1cf910e759963bf7269891e309d17&amp;dn=Port.Royale.3.Steam.Edition.Repack.READNFO-CPY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1354479062,"description":"\nU PRESENTA U\n\nRelease Name....... Port.Royale.3.Steam.Edition.Repack.READNFO-CPY\nRelease Date....... 2/12/2012\nShop Release Date..\nFormat............. Iso\nRelease............ Gioco\nGenre.............. Strategy\nProtection......... Steam\nFiles N............ 45x100MB\n\nU INFORMAZIONI U\n\nThe Caribbean, in the turbulent 17th Century. The mighty kingdoms of\nSpain, England, France and the Netherlands fight over the colonies\nAnd there you are, a young sea captain whose only goal is to become\nthe most powerful man in the New World. To achieve that goal, you may\nchoose one of the two available campaigns: will you become an Adventurer\nor a Trader? If you chose the way of the Adventurer, lead an unforgiving\ncampaign for the conquest of the seas: invasion, piracy, bounty hunting,\nraiding do whatever it takes to build your own empire in the Caribbean\nAnd of course, trade will have a less important role to play in your rise\nThe way of the Trader is, on the opposite, mostly about developing your\nriches and your economic power. To be the most powerful Trader of the\nNew World, you have to create trade routes, build industries and develop\nthe economy of the colonies\nOf course, in Free Play mode, you can mix both of those in any way you\nwant, letting you create your own unique and exciting story\nFor the first time in the acclaimed Port Royale series, you are not alone\nin the beautiful and seemingly so peaceful seas of the Caribbean\nThe Multiplayer mode allows up to 4 players to play through LAN or over\nthe Internet. Develop a successful trading company, lead your ships in\nbeautiful 3D naval battles and force your opponents to their knees\n\nInstructions:\n\n- Burn or mount the image\n- Install the game\n- Copy the crack\n- Enjoy\n\nThis release is intended as an update, it just wasn't worth the trouble to\nmake a DOX for the size of it.\nThis release includes patch 1.3.1 5 DLCs and 3 Skins\n\n- Pirate\n- Ivory\n- Adventure\n- Party Time\n- New Adventures\n- Dawn of Pirates\n- Harbour Master\n- Ghost Ship\n\nSorry, we forgot to include the crack..shit happens\n\nMany thanks to all our supporters -- you know who you are\n\nU GRUPPO U\n\nEstablished in 1999, we are possibly the oldest Italian-based\nrelease group still in activity.  We express a big THANK YOU to\nall those friends who helped us in various forms throughout these\nyears  Don't forget to support the companies and to keep the\nScene about FUN.\n\nFondato nel 1999, CPY e' probabilmente il piu' vecchio gruppo\nrelease in Italia ancora in attivita'.  Ringraziamo DI CUORE tutti\ngli amici che ci hanno aiutati in ogni maniera in questi anni\nRicordate di supportare le compagnie cinematografiche e di\nsoftware, e che la Scena dev'essere basata sul DIVERTIMENTO.\n\nContact: cpyhushmail.com\n\nUU\n\n","torrent":{"xt":"urn:btih:8bb77a03bcb1cf910e759963bf7269891e309d17","amp;dn":"Port.Royale.3.Steam.Edition.Repack.READNFO-CPY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bb77a03bcb1cf910e759963bf7269891e309d17","infoHashBuffer":{"type":"Buffer","data":[139,183,122,3,188,177,207,145,14,117,153,99,191,114,105,137,30,48,157,23]},"announce":[],"urlList":[]}}