{"title":"Animal Collective - Merriweather Post Pavilion (2009) [FLAC]","uid":5225394,"size":399424337,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c3cb80a6021059eb6cedc26128b8f2171e951ba&amp;dn=Animal+Collective+-+Merriweather+Post+Pavilion+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"js1972","files":-1,"time":1261095706,"description":"Lossless/FLAC\nIncludes: Log/Cue/M3u\n\nMerriweather Post Pavilion is the ninth studio album from Animal Collective, recorded with Ben Allen in Oxford, Mississippi. After listening to this record, however, it's clear that Animal Collective have transcended the everyday realities of numbers, locations and people and arrived at a spectacular, unique place. Animal Collective have made a universal record that makes the same beautiful sense on headphones by day, or soundtracking the small hours of the morning / night, or, you suspect, stretched out in a field on your back. Whether a state of mind, or a rest stop somewhere along the way, Merriweather Post Pavilion magnificently redefines your sense of direction.\n\nLocated in different continents, Avey Tare, Panda Bear, Deakin (who is absent from this record) and Geologist, having operated in their unique way since their inception, have now arrived at a point where their inner logic makes perfect sense on the wide screen. Throughout Merriweather Post Pavilion, Panda Bear and Avey Tare sing in a newfound clarity, enraptured by the possibilities of the sound they're making. Immediate and blissful, the songs ring out with questions and declarations. Who needs choruses when you can find your own answers in the kaleidoscopic exhilaration of these tracks.\n\nAnimal Collective are now something of a talismanic force among both their peers and the bands their working methods have influenced. Listening to Merriweather Post Pavilion you'll hear echoes of everything they've recorded to date, especially the mesmeric and melodic repetition of Panda Bear's last solo opus Person Pitch. The whoops and hollers that have previously held together the sublime, chaotic urgency of their earlier work, now signal the calm sense of euphoria and wonder that ripples through this wide eyed record. As if, by stopping for a moment, the band have caught up with themselves, looked around, smiled, and cut seriously loose.\n\nFrom the opening echoes and drum roll of &quot;In The Flowers&quot; to the crazy-happy rhythms of the closing &quot;Brother Sport,&quot; Merriweather Post Pavilion is, in every sense, a classic album. This record feels like a defining moment for Animal Collective, their generation and these times. Linear, wild and beautiful it's the sound of a band waiting, with arms open wide, to tell you about what they've found. And it's something pretty special.\n\nTracklist:\n\n1. In the Flowers\n2. My Girls\n3. Also Frightened\n4. Summertime Clothes\n5. Daily Routine\n6. Bluish\n7. Guys Eyes\n8. Taste\n9. Lion in a Coma (Animal Collective, Lathozi Mpahleni Manquin Madosini)\n10. No More Runnin\n11. Brother Sport","torrent":{"xt":"urn:btih:8c3cb80a6021059eb6cedc26128b8f2171e951ba","amp;dn":"Animal+Collective+-+Merriweather+Post+Pavilion+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c3cb80a6021059eb6cedc26128b8f2171e951ba","infoHashBuffer":{"type":"Buffer","data":[140,60,184,10,96,33,5,158,182,206,220,38,18,139,143,33,113,233,81,186]},"announce":[],"urlList":[]}}