{"title":"Gay- [MEN] Fuckemon Go","uid":15981757,"size":537021093,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8cb0ebe79ad5aa56081e2b2144aebdd77875a21c&amp;dn=Gay-+%5BMEN%5D+Fuckemon+Go&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"toepica","files":1,"time":1475906880,"description":"Ash and Brock go out Pokemon hunting so that Ash can continue his quest to be a Pokemon Master. Along the way, they catch several badly named pokemon (My favorite is ButtPlugasaur). Eventually, they spot a huge Pikachu costume standing next to a rock. Naturally, Ash must catch said Pikachu. For some ungodly reason, when the ball hits Pikachu, and out pops Adam Bryant wearing a yellow speedo. That's it. like not even ears or some goddamn body paint to make it seem somewhat convincing. Just Adam Bryant in a yellow fucking speedo. Like with Men's budget, you'd think they could spring for like some cheap Pikachu ear headband or something. Like I could run down to Spencer's right now an get some for like $8. Sorry, that's the rum talking. ANYWAYS, so of course, the first thing Ash and Brock thing of is &quot;Hey that Pikachu turned into a dude! WE HAVE to have sex with it!&quot; Cuz, ya know, porn logic, right?\r\nOf course Pickachu is all for it and gestures them to come over. First Brock gets fucked telling ASh &quot;This is how you become a real trainer!&quot; Then it's Ash's turn to ride Pikachu. I mean after this, it's fairly standard porn. Like you've watched porn before it's no different. Although I'm happy that this is a MEN porn parody where the character actually kept on a costume reminding you what the situation is (I'm looking right at you X-Men and Captain America. The straights figured it out, so can you)","torrent":{"xt":"urn:btih:8cb0ebe79ad5aa56081e2b2144aebdd77875a21c","amp;dn":"Gay-+%5BMEN%5D+Fuckemon+Go","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb0ebe79ad5aa56081e2b2144aebdd77875a21c","infoHashBuffer":{"type":"Buffer","data":[140,176,235,231,154,213,170,86,8,30,43,33,68,174,189,215,120,117,162,28]},"announce":[],"urlList":[]}}