{"title":"The Search for Santa Paws 720p Greek Audio","uid":9402038,"size":672521238,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d57a551daeae266583b3880243e8144e68e0a4e&amp;dn=The+Search+for+Santa+Paws+720p+Greek+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gazakias1970","files":-1,"time":1388090316,"description":"When Santa Claus travels to New York City and gets hit by a cab, loses his memory and gets the crystal that keeps him eternal is stolen, it's up to his new friend, his puppy named Paws to save him. Meanwhile, a young orphan named Quinn arrives at a foster home run by a strict and no-nonsense woman named Ms. Stout who does not approve of anything that children love: toys, Christmas decorations, singing, and even pets. She has a furnace which she uses to burn all the toys she confiscates from the girls. Despite the harsh rules that she has to respect while staying at the foster home, Quinn eventually befriends the girls, including Janie (G. Hannelius) and Willamina &quot;Will&quot;. In order to save Christmas, Eli and Eddy the uncanny elf dog have to go to New York City to save Santa and Paws. But when Santa is in the hospital, it takes the help of Quinn and Will to save Santa. When Kate and James take Bud from the hospital, Paws tells Eli to put his crystal next to Santa, but then he wakes up to find that Paws is a stuffed animal. They rush back to the North Pole and Paws turns into a full-grown dog named Santa Paws and Christmas is back on. Ms. Stout is fired from her job taking care of the orphan girls at the foster home, much to the excitement of the girls, and Will and Quinn are both adopted by James and Kate Hucklebuckle.","torrent":{"xt":"urn:btih:8d57a551daeae266583b3880243e8144e68e0a4e","amp;dn":"The+Search+for+Santa+Paws+720p+Greek+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d57a551daeae266583b3880243e8144e68e0a4e","infoHashBuffer":{"type":"Buffer","data":[141,87,165,81,218,234,226,102,88,59,56,128,36,62,129,68,230,142,10,78]},"announce":[],"urlList":[]}}