{"title":"CreativeLIVE - Duct Tape Marketing with John Jantsch","uid":9275857,"size":8424926163,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8d77ce8d0a4603af25ae77c6e11c1c14f6104bec&amp;dn=CreativeLIVE+-+Duct+Tape+Marketing+with+John+Jantsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":7,"uploader":"kr33","files":3,"time":1385853455,"description":"Duct Tape Marketing with John Jantsch\n\nJoin consultant and bestselling author of Duct Tape Marketing John Jantsch to learn how to create an easy-to-follow marketing blueprint tailored to your small business's needs. This three-day course takes the mystery and guesswork out of connecting to clients, translating leads into sales, and communicating the value of your company. Behind every strong small business is a strong marketing system, but many business owners lack the resources and skills required to build a marketing plan that makes their business stand out in the crowd. John will cover building a marketing system, creating a framework for company growth, and building your company's online presence. From spotting ideal clients to using social media strategically to gauging the effectiveness of your marketing choices, this course will give you the tools you need to feel confident implementing a marketing plan unique to your company's needs and goals. If you want a strong foundation in these essential tools, John Jantsch and this three-day course will give you a practical, proven approach to creating and implementing the marketing plan your small business needs to succeed. ","torrent":{"xt":"urn:btih:8d77ce8d0a4603af25ae77c6e11c1c14f6104bec","amp;dn":"CreativeLIVE+-+Duct+Tape+Marketing+with+John+Jantsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d77ce8d0a4603af25ae77c6e11c1c14f6104bec","infoHashBuffer":{"type":"Buffer","data":[141,119,206,141,10,70,3,175,37,174,119,198,225,28,28,20,246,16,75,236]},"announce":[],"urlList":[]}}