{"title":"Age of Spirituality-Late Antique and Early Christian Art","uid":11796146,"size":97829708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8de41eaeb5d70bf1578ee2803d60d8a78abaec09&amp;dn=Age+of+Spirituality-Late+Antique+and+Early+Christian+Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1428178337,"description":"Weitzmann, Kurt\nAge of Spirituality - Late Antique and Early Christian Art, Third to Seventh Century\n\nMetropolitan | 1979 | PDF | 786 pages | English | 93,3 Mb\n\nThe first centuries of the Christian Era were ones of extraordinary upheaval: the great traditions of the classical world were transformed by dramatic changes in the political and social structure, by continual warfare against invaders, and by the growing influence of the nascent religion Christianity. The trend of this period has been interpreted by some historians as the decline of civilization, but it is represented by its art as a time of cultural experimentation. Although they abandoned some of the realism of the classical mode, artists of the post-antique world continued to borrow from the repertoire of images of pagan and imperial Rome, ultimately creating works distinguished by spiritual grace and an abstraction of form. The innovative style that resulted from the coexistence of the Eastern and Western Empires, of the pagan, mystery, Jewish, and Christian religions, and of the urban and provincial societies was to determine the development of the Byzantine, and then the medieval, artistic traditions","torrent":{"xt":"urn:btih:8de41eaeb5d70bf1578ee2803d60d8a78abaec09","amp;dn":"Age+of+Spirituality-Late+Antique+and+Early+Christian+Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de41eaeb5d70bf1578ee2803d60d8a78abaec09","infoHashBuffer":{"type":"Buffer","data":[141,228,30,174,181,215,11,241,87,142,226,128,61,96,216,167,138,186,236,9]},"announce":[],"urlList":[]}}