{"title":"Gun (GOG)","uid":15057205,"size":1604546494,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e72e0ca0ae3cdbbe9339b910ce180468077dfd4&amp;dn=Gun+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mercs215","files":3,"time":1466701702,"description":"Install instructions:\r\n- Run &quot;setup_gun_2.0.0.3.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: GUN™\r\nGenre: Action - Adventure - Open World\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English. Text only: Deutsch, español, français, italiano\r\nFeatures: single-player\r\nReleased: November 17, 2005\r\nSize: 1.5 GB\r\nCompany: Neversoft / Activision\r\nRating:\tESRB Rating: Mature (with Blood and Gore, Intense Violence, Sexual Themes, Strong Language, Use of Alcohol)\r\nStore page: https://www.gog.com/game/gun\r\n\r\nAbout:\r\nWhen life robs Colton White of all that matters, the only thing left he can trust is his GUN. From award-winning developer, Neversoft, and accomplished screenwriter, Randall Jahnson (The Mask of Zorro, The Doors), GUN follows Colton on his quest for discovery as he seeks to exact vengeful justice on those who have wronged him. GUN is a realistic epic action/adventure that lets gamers experience the brutality of the lawless West.\r\nNew and savage ways to punish: Stealthily sneak up and attack your enemies, use them as cover, stab and shoot them. Blast away and watch the aftermath, shoot guns out of enemy hands, or destroy with dynamite.\r\nExtensive variety of missions and game play: Wage war on horseback, commandeer trains, protect prostitutes, collect bounties, play poker, hunt buffalo, and more. Multiple game play styles include: precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions that allow you to master gun slinging and horse riding. Unlock secret weapons and upgrade your skills and abilities to improve your weapon and equipment performance.\r\nBrutal realism: Act as a gunslinger protecting righteousness, or seek retribution as you face corrupt lawmen, warring tribes, cold-blooded outlaws, and ruthless renegades. Encounter legendary gunfighters such as JJ Webb. Employ a multitude of authentic weapons including: Six shooters, shotguns, Gatling guns, flaming arrows, hatchets, dynamite, and more.\r\nExpansive interactive world: Play an extensive variety of exciting missions as you journey west across the new frontier. Ride on horseback through the scenic, yet dangerous Western terrain of canyons, mountains, plains, forests, gold mines and towns.\r\n\r\nMinimum system requirements - Windows: XP / Vista / 7 / 8 / 10\r\nProcessor: 2.4 GHz processor\r\nMemory: 1 GB RAM\r\nGraphics: 3D graphics card compatible with DirectX 9.0c\r\nSound: DirectX 9.0c-compatible sound card\r\nStorage: 5 GB available hard drive space\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:8e72e0ca0ae3cdbbe9339b910ce180468077dfd4","amp;dn":"Gun+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e72e0ca0ae3cdbbe9339b910ce180468077dfd4","infoHashBuffer":{"type":"Buffer","data":[142,114,224,202,10,227,205,187,233,51,155,145,12,225,128,70,128,119,223,212]},"announce":[],"urlList":[]}}