{"title":"[FSX] Aerosoft - US Cities X: Chicago","uid":7035117,"size":596016446,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e90860de68a1f88d9050a8b54eca50785083d6e&amp;dn=%5BFSX%5D+Aerosoft+-+US+Cities+X%3A+Chicago&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"_SnakEye","files":1,"time":1329347921,"description":"Remember the good old days when MS Flight Simulator dropped you in Meigs Field for your first flight lessons? Meigs was sadly closed a few years ago but now it's back in FS(X)! Together with the fourth, largest city and windiest in the US Cities range so far: Chicago!\nThis scenery will bring you Chicago with as much detail as you never seen before. In this scenery there are hints to the past as it includes Merrill C Meigs fiels and (optional) a glimpse of the future as you are able to see the Chicago Spire, a skyscraper in development that will put Chicago back at the top of skyscraper cities.\nUS Cities X is a series of city scenery for FSX that covers US cities created by LimeSim. Based on an extensive aerial image it will have all the major buildings and landmarks plus all the airports and heliports that are inside the covered areas.\nIt is clearly intended to fill the gap between the default scenery and very high dense city scenery such as Manhattan X, London VFR or Venice X. Because the file size is rather large due to the ground image it only includes one season (in most cases this is not a real issue) and no night textures. The VFR flights over these cities are mostly a day time affair anyway.\nFeatures:\n Aerial image coverage (see attached Google Earth file)\n More than 2,000 major buildings included\n About 210,000 (!) autogen buildings placed realistically\n &quot;Retro style&quot; version of Meigs Field that was sadly demolished in 2003\n Major airports in and around the city are covered with new high res ground images (no new building structures added)\n Chicago O'Hare (including new runway layout)\n Chicago Midway\n Chicago Executive (formerly known as Palwaukee Mun)\n Schaumburg Regional\n Brookeridge Airpark (where homes are next to the runway)\n 9 heliports as start locations\n Sound effects like downtown- and highway traffic, gulls...\n Traffic on most major roads\n Low price, very good value for money\n Includes a separate Scenery Density tool\n Manual as a .pdf-File (English)\nView aerial coverage &gt;&gt; Download KMZ-file &lt;&lt;\nGoogle Earth is required for viewing this file. Download it for free here: http://earth.google.com/ \nSystem requirements:\n Microsoft Flight Simulator X (Acceleration or SP2)\n Windows XP, Windows VISTA, Windows 7 (fully updated)\n Intel Core 2 Duo E6850 CPU (Core 2 Quad advised)\n 2 GB RAM\n Direct X 9 compatible Graphics Card with minimal 512 MB\n Adobe Acrobat Reader 8 minimal to read and print the manual","torrent":{"xt":"urn:btih:8e90860de68a1f88d9050a8b54eca50785083d6e","amp;dn":"%5BFSX%5D+Aerosoft+-+US+Cities+X%3A+Chicago","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e90860de68a1f88d9050a8b54eca50785083d6e","infoHashBuffer":{"type":"Buffer","data":[142,144,134,13,230,138,31,136,217,5,10,139,84,236,165,7,133,8,61,110]},"announce":[],"urlList":[]}}