{"title":"Downton.Abbey.S01.BDRip.XviD-HAGGiS","uid":7345427,"size":2975897646,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8e93527a427164e7c0af75de2b062e8da327709a&amp;dn=Downton.Abbey.S01.BDRip.XviD-HAGGiS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"TheDarkIsRising","files":8,"time":1339414162,"description":"Sumptuous costume drama Downton Abbey, written and created by Academy Award winner Julian Fellowes (Gosford Park, The Young Victoria) boasts an all-star cast featuring Hugh Bonneville, Maggie Smith, Elizabeth McGovern, Michelle Dockery, Dan Stevens, PenelopeWilton, Jim Carter, Phyllis Logan, Siobhan Finneran, Joanne Froggatt, Rob James-Collier and Brendan Coyle. This prestigious ensemble brings the world of Downton to life with splendour and passion.\n\nSet in England in the years leading up to the First World War, Downton Abbey tells the story of a complicated community. The house has been home to the Crawley family for many generations, but it is also where their servants live, and plan, and dream, and they are as fiercely jealous of their rank as anyone. Some of them are loyal to the family and committed to Downton as a way of life, others are moving through, on the look out for betterment or love or just adventure. The difference is that they know so many of the secrets of the family, while the family know so few of theirs.\n\nBut for all the passions that rage beneath the surface, this is a secure world, serene and ordered, and, at first glance, it seems it will last forever. Little do they know, family or staff, that the clouds of the conflict that will change everything are already gathering over their heads.\n\n\nDownton.Abbey.S01.BDRip.XviD-HAGGiS\n\n[Tech]\nRetail date     :       2010-11-29\nRelease date    :       2010-12-03\nGenre           :       Drama\nAiryear         :       2010\nVideo           :       624x352 25fps XviD ~1000kbit\nAudio           :       MP3 128kBit/s, English\nLength          :       ~60mins\nSize            :       550MB\n","torrent":{"xt":"urn:btih:8e93527a427164e7c0af75de2b062e8da327709a","amp;dn":"Downton.Abbey.S01.BDRip.XviD-HAGGiS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e93527a427164e7c0af75de2b062e8da327709a","infoHashBuffer":{"type":"Buffer","data":[142,147,82,122,66,113,100,231,192,175,117,222,43,6,46,141,163,39,112,154]},"announce":[],"urlList":[]}}