{"title":"Miles Kane - Don't Forget Who You Are (2013) [FLAC]","uid":8534842,"size":253689059,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ee0bb4b5b6b2c1545ca316283e8a454394d937a&amp;dn=Miles+Kane+-+Don%27t+Forget+Who+You+Are+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1370239849,"description":"\n  Miles Kane - Don't Forget Who You Are (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Indie Rock, Alternative\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz  \n\n  01 Taking Over\n  02 Don't Forget Who You Are\n  03 Better Than That\n  04 Out of Control\n  05 Bombshells\n  06 Tonight\n  07 What Condition Am I In?\n  08 Fire In My Heart\n  09 You're Gonna Get It\n  10 Give Up\n  11 Darkness In Our Hearts\n\n  An indie pop veteran by his early twenties, singer/songwriter and young Paul McCartney look-alike Miles Kane has played a key role in the late-noughties alternative scene, as both a member of three bands and a solo artist. Born in 1986 in Merseyside, guitarist Kane formed the Little Flames with childhood friends at the age of 18, but after Eva Petersen and Mat Gregory left the band due to creative differences, he, along with bassist Joe Edwards and drummer Greg Mighall, continued as a three-piece under the new name of the Rascals. In 2007, with Kane now on vocals, they released their debut album, Rascalize, and appeared in the British hooligan film Away Days, performing an Echo &amp; the Bunnymen cover. After supporting Arctic Monkeys on their U.K. tour, Kane became friends with lead singer Alex Turner, and due to a mutual appreciation of Scott Walker, they decided to record an album together. The Last Shadow Puppets reached number one with their debut, The Age of the Understatement, scored a Top Ten single with the title track, and received a 2008 Mercury Music Prize nomination. After Turner returned to his day job, Kane decided to leave the Rascals and pursue a solo career. In 2010 he worked with Super Furry Animals' Gruff Rhys on material influenced by Serge Gainsbourg and John Lennon. His first single, &quot;Inhaler,&quot; was released the same year. In 2011 Kane released his full-length debut, Colour of the Trap, featuring production from both Dan Carey and Dan the Automator.","torrent":{"xt":"urn:btih:8ee0bb4b5b6b2c1545ca316283e8a454394d937a","amp;dn":"Miles+Kane+-+Don%27t+Forget+Who+You+Are+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee0bb4b5b6b2c1545ca316283e8a454394d937a","infoHashBuffer":{"type":"Buffer","data":[142,224,187,75,91,107,44,21,69,202,49,98,131,232,164,84,57,77,147,122]},"announce":[],"urlList":[]}}