{"title":"Men_Behind_The_Sun (xvid110-sickboy88)","uid":3417085,"size":732395554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8f464060109f70b885fb6e8f94366d43e00fb60d&amp;dn=Men_Behind_The_Sun+%28xvid110-sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"sickboy88","files":2,"time":1133651552,"description":"Man Behind the Sun (1988)\n\nIMDB Link:\n\nhttp://www.imdb.com/title/tt0093170/\n\n----\n\nThis movie is ranked as one of the 5 most disturbing/vile films of all time (Salo, Cannibal Holocau$t, etc).  There were no subs on the DVD, nor are there on any release that I am aware of.  Thus being said, the soundtrack is an &quot;English Dub&quot;.  This is the full 100min version...nothing is cut away, and yes, it contains the &quot;cat scene&quot;.  \n\nThe funny thing about this movie, is that, well, it's true.  The Japanese never considered the Chinese as human, and actually DID experiment on them.  This is one of the only REAL holocau$ts, and yet, do you know what the best part is?  You never hear about a SINGLE Chinese citizen asking for &quot;reparations&quot; from the Japanese govornment.  Why is that?  Additionally, there were no Japanese tried at Nuremberg...why is that?  What about Japanese American citizens in the USA during WWII?  Do THEY ask for reparations for being held in internment camps?  NO, they don't.  Unless they are retarded, I am sure that even the most brainwashed of sheeple out there, will be able to put 2 and 2 together, and come up with the truth, instead of relying on what the media shoves down their throat. \n\nFun stuff...I wish I could have been involved somehow, you know?\n\n\n----\n\nMini Plot:\n\nAs World War II draws to a close, Japanese army officers are cooking up biological weapons to deploy as a last-ditch effort. They test their prototypes on Chinese and Russian war prisoners at an underground facility called Squadron 731, conducting horrific experiments. A gory Chinese polemic, considered a cult classic for its sheer shock value. Followed by a sequel, &quot;Laboratory of the Devil.&quot;\n\n----\n\nWhat Others Have Said:\n\n1.   I thought I was going ot be sick and I can watch just about anything. This movie, however, is not a &quot;fun&quot; gore movie by any stretch of the imagination. We all know the horrible stories about the Nazis performing medical experiments on the Jews and other minorities during WW2, but many people do not realize the Japanese did these things also. This is about as grim as a movie can be, although that is because of the subject matter that it takes very seriously. The story is about a group of young Japanese Army Youth who are sent to a camp in Manchuria during the end of WW2 and witness atrocities performed against Chinese and Russian POW's by Japanese militarty doctors in an effort to develop bilogical warfare agents for the war effort against the U.S. There are many gruesome images, including people being blown up, put into pressure chambers, skinned alive, gassed, autopsied while still living, and infected with disease. Tone-wise this film reminded me of the Ilsa movies' more serious elements, but this film lacks any camp value that makes the previously mentioned films slightly more tolerable. I had wanted to see this movie for quite some time based on its sordid reputation. It lived up to it, but I will probably never watch it again. \n\n\n2.   I have seen a &quot;clip&quot; of the famous cat scene in this movie. They actually take a tame house cat and thrown her in with thousands of starving rats and film her being eaten alive. It was the sickest thing I have ever seen, and YES IT'S true - look it up. There is much outrage about this movie, and I can see why. I didn't sleep for 2 nights after seeing that happen. It's horrific.\n\n\n3.  T.F.Mous' 1987 film &quot;Man Behind the Sun&quot; has to be one of the most disturbing and unpleasant movies ever made.It tells us about the atrocities committed by Japanese scientist during the Second World War in China.The acting is pretty good and I think that some of the actors did an outstanding job.The film offers also some of the most revolting gore I have ever seen.Some scenes are truly sickening for example a man is put into decompression chamber and the pressure is steadily increased until he shoots intestines out of his anus-actually Mous used a real corpse to make this scene.There is also incredibly graphic autopsy of a young mute boy-a real cadaver was used for this sequence as well.The scene where a real cat is attacked and consumed by literally thousands of starving rats is incredibly vile and unnecessary.Overall,&quot;Man Behind the Sun&quot; is pretty hard to find,but if you liked &quot;Cannibal Holocaust&quot; or &quot;Bunman:The Untold Story&quot;,then give it a look.However fans of cute American horror should avoid it like the plague!\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 836 kb/s AVG\nAspect: 640x352 = 1.82:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: None\nRuntime: 01:40:52\nFPS: 23.976\n\n----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nNow at Beta 2!\n\nhttp://www.koepi.org/XviD-1.1.0-Beta2-04042005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn\non (Y) and (UV) deblocking, and the new feature of\nXviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, please turn off pre-processing. I don't want\nanother stupid motherfucker telling me that my movies are out of sync\nbecause they are totally computer illiterate.","torrent":{"xt":"urn:btih:8f464060109f70b885fb6e8f94366d43e00fb60d","amp;dn":"Men_Behind_The_Sun+%28xvid110-sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f464060109f70b885fb6e8f94366d43e00fb60d","infoHashBuffer":{"type":"Buffer","data":[143,70,64,96,16,159,112,184,133,251,110,143,148,54,109,67,224,15,182,13]},"announce":[],"urlList":[]}}