{"title":"Detective Conan - Season 2 Complete [DVDrip Jap Mux ITA] No Cens","uid":5638455,"size":11319859182,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8fe3234c1706aed629cc9a742c8bb376baa29c67&amp;dn=Detective+Conan+-+Season+2+Complete+%5BDVDrip+Jap+Mux+ITA%5D+No+Cens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"l.diliberto","files":46,"time":1276982991,"description":" &lt;a href=&quot;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=213966&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=213966&lt;/a&gt;\n\nCOVER\n &lt;a href=&quot;\nhttp://img127.imageshack.us/img127/8021/fun07830bfo6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img127.imageshack.us/img127/8021/fun07830bfo6.jpg&lt;/a&gt;\n\n.: Trama :.\n\nShinichi Kudo ÃƒÂ¨ un giovane &quot;detective autodidatta&quot;. Nonostante sia solo uno studente di 2Ã‚Â° superiore affianca costantemente le indagini della polizia, aiutandola a risolvere i casi piÃƒÂ¹ difficili in maniera talmente brillante da aver acquisito giÃƒÂ  una discreta fama a livello nazionale. Shinichi ÃƒÂ¨ un fan sfegatato di Sherlock Holmes, vive in una enorme casa da solo e gioca benissimo a calcio. Shinichi ha una capacitÃƒÂ  di deduzione fuori dal comune: da pochi indizi riesce a risalire perfettamente alla matrice che li ha creati. Dopo un ennesimo caso risolto al luna park, mentre ÃƒÂ¨ ad un appuntamento con la sua cara amica Ran Mohri, Shinichi ficca disgraziatamente il naso negli affari di un grosso &quot;Sindacato&quot;, invischiato in traffici illegali piuttosto scottanti. Scoperto da 2 dei sicari del sindacato, Shinichi viene &quot;ucciso&quot; tramite l'ingerimento di un particolare veleno, prodotto dallo stesso sindacato. Ma il veleno, evidentemente, non ha avuto sul ragazzo lo stesso effetto che i due sicari si aspettavano: Shinichi viene ritrovato dalla polizia vivo e vegeto, ma regredito fino all'etÃƒÂ  di 10 anni!!\nAssunto lo pseudonimo di Conan Edogawa, Shinichi si rivolge ad uno scienziato suo vicino e caro amico, il prof. Agasa, per la ricerca di un composto che possa farlo tornare normale. In ogni episodio risolverÃƒÂ  uno specifico caso.\n\n.: Plot :.\n\nShinichi Kudo, a seventeen year old master detective, had it all. He could solve any case brought to his attention and in record time. His girlfriend, Ran, is a karate expert, and her father is a bumbling P.I. who is driven crazy by the fact that Shinichi gets all of the great cases. One day, while Shinichi and Ran are at an amusement park, the pair become separated. Shinichi catches wind of a dirty deal going down, and spies on a pair of men in dark trenchcoats. He's caught and the men use an experimental poison on him, intending to kill him. However, things don't work exactly as planned. When Shinichi comes to, he finds he's shrunken down to the size of a fourth grader. He goes to the goofball inventor that lives next door to him for help, and the inventor agrees to give him a hand. When Ran comes looking for Shinichi, he and the inventor come up with a story saying that Shinichi is a child named Conan Edogawa (Conan as in Sir Arthur Conan Doyle). In each episode, Conan solves a different case in the style of all good detective shows, giving hints to help the viewer try to guess who the villain is, while trying to keep his true identity a secret.\n","torrent":{"xt":"urn:btih:8fe3234c1706aed629cc9a742c8bb376baa29c67","amp;dn":"Detective+Conan+-+Season+2+Complete+%5BDVDrip+Jap+Mux+ITA%5D+No+Cens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fe3234c1706aed629cc9a742c8bb376baa29c67","infoHashBuffer":{"type":"Buffer","data":[143,227,35,76,23,6,174,214,41,204,154,116,44,139,179,118,186,162,156,103]},"announce":[],"urlList":[]}}