{"title":"Alex Grey - Chapel of Sacred Mirrors","uid":4321553,"size":660081650,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:904f1e72c7dfc3b3381544496ea67f553cd21283&amp;dn=Alex+Grey+-+Chapel+of+Sacred+Mirrors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"kisps","files":1,"time":1217511976,"description":"Alex Grey&amp;#039;s Chapel of Sacred Mirrors\n\nMy Comments\n\nA good addition to psychedelic video collections.\n\nFrom Amazon.com\nFollowing Alex Grey&amp;#039;s first film, Artmind, CoSM is a documentary that further defines Grey&amp;#039;s lofty spiritual ideals by walking the viewer through a series of works made for Grey&amp;#039;s masterpiece, The Chapel of Sacred Mirrors. Grey, known for his cosmic, anatomically detailed paintings of humans connecting with the universe, takes the viewer on a journey from birth to death in this non-profit gallery/gathering space created for community gatherings. Starting with artworks depicting the physical body, Grey&amp;#039;s work branches out into an exploration of various stages in a person&amp;#039;s psychic and spiritual development, culled from a complex mix of Eastern and Western philosophical and religious perspectives. One potent example is a painting of humans dissolved into pure light, rendered in a series of hyperbolic curves and light beams bouncing off one another. Filmmaker Nick Krasnic does a fine job of allowing Grey&amp;#039;s narration, as he explains the concepts and inspirations behind each piece, to be the focus of each scene, though CoSM&amp;#039;s rave-era trance music soundtrack adds unnecessary melodrama. Watching CoSM is a meditation not only on art viewing but also on an artist who believes in unlimited human potential. ?-Trinie Dalton","torrent":{"xt":"urn:btih:904f1e72c7dfc3b3381544496ea67f553cd21283","amp;dn":"Alex+Grey+-+Chapel+of+Sacred+Mirrors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"904f1e72c7dfc3b3381544496ea67f553cd21283","infoHashBuffer":{"type":"Buffer","data":[144,79,30,114,199,223,195,179,56,21,68,73,110,166,127,85,60,210,18,131]},"announce":[],"urlList":[]}}