{"title":"BBC What Do Artists Do All Day 06of12 Edmund de Waal 2013 PDTV x","uid":10870726,"size":365867693,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:905def2d08fe0bb2aac43a1d8e7c6019f033b150&amp;dn=BBC+What+Do+Artists+Do+All+Day+06of12+Edmund+de+Waal+2013+PDTV+x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1408928260,"description":"What Do Artists Do All Day?\n\nArts Documentary hosted by Morag Tinto, published by BBC in 2013 - English narration\n\n\nInformation\n------------------------------\n\nWhat Do Artists Do All Day?\nA collection of intimate, observational portraits of leading artists, revealing unique insights into their working lives and creative process. From Norman Ackroyd's etchings of the British landscape to Frank Quitely's superhero creations, and from Polly Morgan's explorations in taxidermy to Antony Gormley's new work Tanker Field, this series of films explores what it means to be an artist working today. Featuring additional films and exclusive BBC Arts Online interviews and features.\n\n\n1)  Norman Ackroyd 2013 \n&quot;The first in the series paints an intimate portrait of one of Britain's finest landscape artist, Norman Ackroyd. Beginning with his morning bowl of porridge, we spend a day with him in his south London studio as he makes one of his trademark monochrome prints. As he works, delicately etching acid into copper plate, Ackroyd reflects on how a working class lad from Leeds found himself at the Royal College of Art in the Swinging Sixties. This is a short but perfectly formed documentary, with a stirring piano soundtrack to complement the artist's atmospheric landscapes.&quot;\n\n2)  Polly Morgan 2013 \nTaxidermist Polly Morgan, described by Banksy as 'Britain's hottest bird stuffer', is one of Britain's most high profile young artists. Her macabre and unsettling works, including a coffin bursting with open-mouthed chicks and a rat asleep in a champagne glass, have won her celebrity fans including Kate Moss and considerable media coverage. In the second of this series of artist profiles, this film offers an intimate peek at the strange and wonderful art of Polly Morgan and asks what her reputation reveals about the relationship between art and celebrity.\n\n3)  Jack Vettriano 2013 \nJack Vettriano is arguably Britain's most popular artist, with his nostalgic paintings of a lost age of glamour being instantly recognisable and his most famous work, The Singing Butler, the country's bestselling image, reproduced on everything from calendars to jigsaws. But despite his popularity, the self-taught miner's son from Fife has never been fully accepted by the art establishment. This film offers an intimate and revealing portrait of Vettriano, as he creates his latest painting, featuring actress Kara Tointon, and sees him talk with brutal honesty about his critics and how he deals with fame.\n\n4)  Cornelia Parker 2013 \nWith a new exhibition of her work opening in London in June, this film follows artist Cornelia Parker as she prepares for the show, working on several new pieces including her latest project - bronze sculptures of cracks in the pavement. In the past, Cornelia has blown up a shed, squashed a brass band and famously collaborated with Tilda Swinton, who was exhibited sleeping in a glass case. One of Britain's most original and acclaimed contemporary artists, her work encourages us to look differently at the world, transforming familiar objects into extraordinary and surprising art.\n\n5)  John Byrne 2013 \nThis documentary offers a snapshot of the life of artist and writer John Byrne as he completes a large mural for the dome of the King's Theatre in Edinburgh. The film follows Byrne from the intimacy of his Edinburgh home and studio - with a wealth of anecdotes and memories - to the theatre, where he oversees the completion of his latest work. Born and brought up in Paisley, John Byrne now lives in Edinburgh; the cameras follow him as he cycles and walks its streets, meeting people and reflecting on the buzz of the festival city.\n\n6)  Edmund de Waal 2013 \nEdmund de Waal is widely known as the author of bestselling family memoir The Hare with Amber Eyes. He is also an internationally acclaimed artist. He trained as a potter, studying ceramics in Japan and his works are in the collections of over forty international museums. Filmed mainly in de Waal's South London studio, this film gives a fascinating insight into his working methods; following him prepare eleven ceramic installations for 2012's exhibition A Thousand Hours.\n\n7)  Shani Rhys James 2013 \nA past winner of the Jerwood Painting Prize, Shani Rhys James is one of Wales's leading artists. She lives and works in a renovated 17th-century house and barn in Llangadfan, mid-Wales and her studio space is filled with striking paintings which combine domestic scenes with intense self-portraits often depicting powerful childhood memories. 'I paint because it is my way to express something. I'm trying to capture my own personal mythology in paint, so I paint what I feel and what effects me'. This intimate film follows Shani as she prepares for her exhibition in Aberystwyth in November and captures her deep in concentration working on a new large oil painting.\n\n8)  Tom Wood 2014 \nProfile of acclaimed photographer Tom Wood. Tom has taken photographs almost every day for the past 40 years, mainly around the streets, workplaces and nightspots of Merseyside. Hugely respected in the photography world, his work is a unique record of British working class life and in recent years he has gained increasing recognition. In summer 2013 Tom visited Mayo in the west of Ireland, where he was born, and the film documents his encounters whilst photographing the landscape and the people for a new book. Supported by the Arts Council of Wales, an exhibition of Tom's work is currently on at the Mostyn Gallery, North Wales until April 6th.\n\n9)  Frank Quitely 2014 \nFrank Quitely is the alter ego of Glaswegian comic-book artist Vincent Deighan. As one of a group of British writers and artists who have reinvented the superhero genre, Frank's depictions of iconic characters like Superman, Batman and the X-Men have provided inspiration for some of Hollywood's biggest movie franchises. In this film, we follow Frank over the course of a day and night as he works on a single page from his latest work, the epic superhero saga Jupiter's Legacy.\n\n10)  Marvin Gaye Chetwynd 2014 \nProfile of Marvin Gaye Chetwynd, one of the best-known performance artists in Britain. Nominated for the Turner Prize in 2012 (when she was known as Spartacus Chetwynd), she stages exuberant, anarchic performances in which everything from Dante and Karl Marx to drag acts and Stars Wars are drawn together to explore issues including gender politics and personal debt. The film follows Chetwynd as her first solo UK show opens in Nottingham and she stages a new performance - The Green Room.\n\n11)  Albert Watson 2014 \nDocumentary following Albert Watson over the course of a day photographing the barren, beautiful landscape of the Isle of Skye. Edinburgh-born Albert Watson is one of the world's most successful commercial and fashion photographers. He has lived in the US for over 30 years, where he has photographed more than 100 Vogue covers and created some of the most iconic celebrity images of the 20th century, from Albert Hitchcock to Naomi Campbell. In recent years he has turned to landscape photography, and in this film he comes back to Scotland for his latest project. Albert reflects on his past work and discusses the challenges of transferring his unique style to landscape photography.\n\n12)  Antony Gormley 2014 \nSir Antony Gormley is one of the world's most popular artists. His iconic Angel of the North is a universally-admired work of public art and his sculptures have been seen by millions in cities all over the world. In this film we follow the recently-knighted Gormley and his team in their busy Kings Cross studio, preparing a new work called Tanker Field - a group of 60 enormous steel figures that will be shown together at the Paul Klee museum in Bern. Reflecting on the ideas behind his sculptures, the collaborative nature of his studio and the excitement he still feels as new projects come together, the film offers an intimate and fascinating insight into one of the great artists of our time.\n\nScreenshots\n------------------------------\nclick on the thumbnails below to get full-size images &lt;a href=&quot;\nhttp://image.bayimg.com/d13a7c5086c952a388cee279ad1e530a23fe5b9e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/d13a7c5086c952a388cee279ad1e530a23fe5b9e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/937492b9f2dad23e158c69ba8c4b22bb4c9d28aa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/937492b9f2dad23e158c69ba8c4b22bb4c9d28aa.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/bd62c7bed4f12ebb5efef1cb67c0e9729bf478c1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/bd62c7bed4f12ebb5efef1cb67c0e9729bf478c1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/3c3297d3bab867367081e713c3ba37b98986464d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3c3297d3bab867367081e713c3ba37b98986464d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/fd14eef55c0a7ba76196bc028ab92f0ed06e8bf1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/fd14eef55c0a7ba76196bc028ab92f0ed06e8bf1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/833e1885a5c568524920b35f75da2a699788736c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/833e1885a5c568524920b35f75da2a699788736c.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/5bb3369ab71b33835966787442b73200ca186751.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/5bb3369ab71b33835966787442b73200ca186751.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/6879d400f187d1e1bf07463601061d05ab764e7d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6879d400f187d1e1bf07463601061d05ab764e7d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/611011a54b8f9d37c043a6b68ed2dce142344346.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/611011a54b8f9d37c043a6b68ed2dce142344346.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/3144ab88d9c5fbc53bd3d99f96790e0534710404.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3144ab88d9c5fbc53bd3d99f96790e0534710404.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/7ace31faf58cd10fac4903ca69644806a7f48380.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/7ace31faf58cd10fac4903ca69644806a7f48380.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/f4953e40e1b5ed11c7789a5d1efebec6c8aa0826.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/f4953e40e1b5ed11c7789a5d1efebec6c8aa0826.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ade0ccc4c3ede19e839c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1612 Kbps\n * Video: Resolution: 832 x 468\n * Video: Aspect Ratio: 1.778 (16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 29mins\n * Framerate: 25fps\n * Number of Parts: 12\n * Part Size: average 360 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n * Thanks to llamabert\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b01rjr1d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b01rjr1d&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:905def2d08fe0bb2aac43a1d8e7c6019f033b150","amp;dn":"BBC+What+Do+Artists+Do+All+Day+06of12+Edmund+de+Waal+2013+PDTV+x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"905def2d08fe0bb2aac43a1d8e7c6019f033b150","infoHashBuffer":{"type":"Buffer","data":[144,93,239,45,8,254,11,178,170,196,58,29,142,124,96,25,240,51,177,80]},"announce":[],"urlList":[]}}