{"title":"Dark.Victory.1939.DVDRip.XviD-rmrocha912","uid":4820001,"size":1461155840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90ee9768021df2e91a6605593477ec92d9c7a635&amp;dn=Dark.Victory.1939.DVDRip.XviD-rmrocha912&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rmrocha","files":2,"time":1238729034,"description":"Dark Victory is a 1939 American drama film directed by Edmund Goulding. The screenplay by Casey Robinson was based on the unsuccessful 1934 play of the same title by George Brewer and Bertram Bloch.\n\n\nPlot synopsis\n\nJudith Traherne is a young, carefree, hedonistic Long Island socialite/heiress with a passion for horses, fast cars, and too much smoking and drinking. She initially ignores severe headaches and brief episodes of dizziness and double vision, but when she uncharacteristically takes a spill while riding, and then tumbles down a flight of stairs, her secretary/best friend Ann King insists she see the family doctor, who refers her to a specialist.\nDr. Frederick Steele is in the midst of closing his New York City office in preparation of a move to Brattleboro, Vermont, where he plans to devote his time to brain cell research and scientific study on their growth. He reluctantly agrees to see Judith, who is cold and openly antagonistic toward him. She shows signs of short-term memory loss, but dismisses her symptoms. Steele convinces her the ailments she's experiencing are serious and potentially life-threatening, and puts his career plans on hold to tend to her.\nWhen diagnostic tests confirm his suspicions, Judith agrees to surgery to remove a malignant brain tumor. Steele discovers the tumor is inoperable, and realizes she has less than a year to live. The end will be painless but swift - shortly after experiencing total blindness, Judith will pass away.\nIn order to allow her a few more months of happiness, Steele opts to keep the diagnosis a secret and assures Judith and Ann the surgery was a success. Ann is suspicious and confronts Steele, who admits the truth. She agrees to remain silent.\n\n\nRonald Reagan and Bette Davis (center, left to right) in the film's trailer\nJudith and Steele become involved romantically and eventually engaged. While helping his assistant pack the office prior to their departure for Vermont, Judith discovers her case history file containing letters from several doctors, all of them confirming a negative prognosis. Assuming Steele was marrying her out of pity, Judith breaks off the engagement and reverts to her former lifestyle. One day, her stablehand Michael O'Leary, who for years has loved her from afar, confronts her about her unruly behavior and she confesses she's dying. Their conversation convinces her she should spend her final months happy, dignified, and with the man she loves. She apologizes to Steele, and the two marry and move to Vermont. (Throughout the film Judith and O'Leary engage in arguments about the prospects of a colt, Challenger. O'Leary insists Challenger will never make a racehorse while Judith sees him as a future champion, and just before her death O'Leary admits she was correct.)\nThree months later, Ann comes to visit. She and Judith are in the garden planting bulbs when Judith comments on how odd it is she still feels the heat of the sun under the rapidly darkening skies. She realizes she actually is losing her vision and approaching the end. Steele is scheduled to present his most recent medical findings (which hold out the long-term prospect of a cure for this type of cancer) in New York, and Judith, making an excuse to remain home, helps him pack and sends him off. Then, after bidding Ann, her housekeeper Martha, and her dogs farewell, she climbs the stairs, gets into bed, and nestles under a comforter as the screen slowly fades to black.\n\n\nDirected by............Edmund Goulding\n\nWritten by.............Casey Robinson\n\nBased on the play by...George Brewer and Bertram Bloch\n\nStarring...............Bette Davis\n                       George Brent\n                       Humphrey Bogart\n                       Ronald Reagan\n                       Geraldine Fitzgerald\n","torrent":{"xt":"urn:btih:90ee9768021df2e91a6605593477ec92d9c7a635","amp;dn":"Dark.Victory.1939.DVDRip.XviD-rmrocha912","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90ee9768021df2e91a6605593477ec92d9c7a635","infoHashBuffer":{"type":"Buffer","data":[144,238,151,104,2,29,242,233,26,102,5,89,52,119,236,146,217,199,166,53]},"announce":[],"urlList":[]}}