{"title":"Ex-Heroes - Peter Clines [EPUB]","uid":6570208,"size":311281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:912bd965d2795a0932d4b676fa2370f2cf3c66c2&amp;dn=+Ex-Heroes+-+Peter+Clines+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Dax58","files":4,"time":1311911124,"description":"Ex-Heroes by Peter Clines\n\nI really recommend this book!\n\n[plot]\nStealth. Gorgon. Regenerator. Cerberus. Zzzap. The Mighty Dragon. They were heroes. Vigilantes. Crusaders for justice, using their superhuman abilites to make Los Angeles a better place. Then the plague of living death spread around the globe. Despite the best efforts of the superheroes, the police, and the military, the hungry corpses rose up and overwhelmed the country. The population was decimated, heroes fell, and the city of angels was left a desolate zombie wasteland like so many others. Now, a year later, the Mighty Dragon and his companions must overcome their differences and recover from their own scars to protect the thousands of survivors sheltered in their film studio-turned-fortress, the Mount. The heroes lead teams out to scavenge supplies, keep the peace within the walls of their home, and try to be the symbols the survivors so desperately need. For while the ex-humans walk the streets night and day, they are not the only threat left in the world, and the people of the Mount are not the only survivors left in Los Angeles. Across the city, another group has grown and gained power. And they are not heroes.","torrent":{"xt":"urn:btih:912bd965d2795a0932d4b676fa2370f2cf3c66c2","amp;dn":"+Ex-Heroes+-+Peter+Clines+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912bd965d2795a0932d4b676fa2370f2cf3c66c2","infoHashBuffer":{"type":"Buffer","data":[145,43,217,101,210,121,90,9,50,212,182,118,250,35,112,242,207,60,102,194]},"announce":[],"urlList":[]}}