{"title":"Futurama - Season 4 - Audio Commentary - DVDRip - AAC","uid":7509256,"size":218135985,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:914763c3e71c409f04869ae040563a86b01efcfb&amp;dn=Futurama+-+Season+4+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schleicher","files":20,"time":1344265297,"description":"A Taste Of Freedom (4ACV05) (Audio Commentary by Matt Groening, David X. Cohen, Eric Horsted, Rich Moore, James Purdum, John DiMaggio and Billy West)\n\nBend Her (4ACV13) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Michael Rowe, James Purdum, John DiMaggio, Billy West and Maurice LaMarche)\n\nBender Should Not Be Allowed On TV (4ACV06) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Brian Sheesley, John DiMaggio, Billy West and Maurice LaMarche)\n\nCrimes Of The Hot (4ACV08) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ron Weiner, Ken Keeler, David A. Goodman, Peter Avanzino, Billy West and Maurice LaMarche)\n\nJurassic Bark (4ACV07) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Swinton O. Scott III. and Billy West)\n\nJurassic Bark (4ACV07) (Additional Audio Commentary by Matt Groening, David X. Cohen, Eric Kaplan, Ken Keeler, Bill Odenkirk, Patric M. Verrone, Ron Weiner and Jeff Westbrook)\n\nKif Gets Knocked Up A Notch (4ACV01) (Audio Commentary by Matt Groening, David X. Cohen, Bill Odenkirk, Wes Archer, Billy West and Maurice LaMarche)\n\nLeela's Homeworld (4ACV02) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Kristin Gore, Swinton O. Scott III. and Billy West)\n\nLess Than Hero (4ACV04) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ron Weiner, Susan Dietter, Billy West and Maurice LaMarche)\n\nLove And Rocket (4ACV03) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Dan Vebber, Brian Sheesley, Billy West and Maurice LaMarche)\n\nObsoletely Fabulous (4ACV14) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Dan Vebber, Dwayne Carey-Hill, Billy West and Maurice LaMarche)\n\nSpanish Fry (4ACV17) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ron Weiner, Peter Avanzino, John DiMaggio and Maurice LaMarche)\n\nTeenage Mutant Leela's Hurdles (4ACV09) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Jeff Westbrook, Bret Haaland, John DiMaggio and Maurice LaMarche)\n\nThe Devil's Hands Are Idle Playthings (4ACV18) (Audio Commentary by Matt Groening, David X. Cohen, Ken Keeler, Bret Haaland, Billy West, Maurice LaMarche and Dan Castellaneta)\n\nThe Farnsworth Parabox (4ACV15) (Audio Commentary by Matt Groening, David X. Cohen, Bill Odenkirk, Ron Hughart, Billy West and Maurice LaMarche)\n\nThe Sting (4ACV12) (Audio Commentary by Matt Groening, David X. Cohen, Patric M. Verrone, Rich Moore, Brian Sheesley, Billy West, John DiMaggio and Maurice LaMarche)\n\nThe Why Of Fry (4ACV10) (Audio Commentary by Matt Groening, David X. Cohen, Wes Archer, Billy West and Maurice LaMarche)\n\nThree Hundred Big Boys (4ACV16) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Swinton O. Scott III. and Billy West)\n\nWhere No Fan Has Gone Before (4ACV11) (Audio Commentary by Matt Groening, David X. Cohen, David A. Goodman, Pat Shinagawa, Billy West and Maurice LaMarche)","torrent":{"xt":"urn:btih:914763c3e71c409f04869ae040563a86b01efcfb","amp;dn":"Futurama+-+Season+4+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914763c3e71c409f04869ae040563a86b01efcfb","infoHashBuffer":{"type":"Buffer","data":[145,71,99,195,231,28,64,159,4,134,154,224,64,86,58,134,176,30,252,251]},"announce":[],"urlList":[]}}