{"title":"Religulous by Bill Maher","uid":4607507,"size":735123456,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:914c15df9a6464cf0d22df8f1fccc6d7c81ca945&amp;dn=Religulous+by+Bill+Maher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FreedomLover","files":1,"time":1230520366,"description":"Religulous by Bill Maher\n\nIn this film Bill Maher pokes fun at religion. He interviews various nutcases such as a priest, rabbi and imman and asks them about their beliefs. On one occasion he speaks to a religious ignoramus at the Holy Land Experience (a biblical theme park in Florida) and points out to her that there isn't much difference between the story of Jack the Beanstalk, on the one hand, and Adam and Eve, the virgin birth and the biblical story of Jonas and the fish, on the other. All, of course, are completely ridiculous! Bill Maher then goes on to say that if there had been some divine mixup people would now be defending the absolute and literal truth of Jack the Beanstalk instead of the Garden of Eden! And, of course, all the hateful religious wars, which resulted from this hogwash would then have been fought in the name of Jack the Beanstalk instead of Jesus of Nazareth! Even the official astronomer at the Holy See, who Bill Maher also interviews, clearly regards American fundamentalist Christians as dangerous morons(not quite his words, but surely his meaning). However, this doesn't stop these people from building a Creation Museum in Kentucky where humans walk alongside dinosaurs! In summary, Bill Maher's film shows just how ridiculous religion is! A great laugh for all intelligent, sane human beings and a wake-up call for religious people who are steeped in deep ignorance and whose inability to think has caused untold suffering.\n\nAlso, check out my other torrents: 'The God Delusion by Richard Dawkins', 'Enemies of Reason by Richard Dawkins','A War on Science by Richard Dawkins' and 'Debunking Christianity by Derren Brown'. And don't miss famous British comedian, Pat Condell's hard hitting commentaries on all three Semitic religions! They will have you rolling on the ground laughing your head off!\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4441200/Pat_Condell_-_Critic_of_Religion_Par_Excellence_(all_videos)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4441200/Pat_Condell_-_Critic_of_Religion_Par_Excellence_(all_videos)&lt;/a&gt;\n\n\nFurthermore, check out my other torrents to find out what happens when dangerous religious fanatics like George W. Bush get into positions of power (Bush claims: &quot;God told me to invade Iraq.&quot;): 'Breaking the Silence by John Pilger' and 'The War on Democracy by John Pilger'.","torrent":{"xt":"urn:btih:914c15df9a6464cf0d22df8f1fccc6d7c81ca945","amp;dn":"Religulous+by+Bill+Maher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914c15df9a6464cf0d22df8f1fccc6d7c81ca945","infoHashBuffer":{"type":"Buffer","data":[145,76,21,223,154,100,100,207,13,34,223,143,31,204,198,215,200,28,169,69]},"announce":[],"urlList":[]}}