{"title":"Roy Hargrove - 2008 - Earfood FLAC","uid":8925991,"size":427087824,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:914e4e0af79d3c90ca9bd61343f7b654a851d28f&amp;dn=Roy+Hargrove+-+2008+-+Earfood+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"eika256","files":-1,"time":1379368488,"description":"Roy Hargrove - 2008 - Earfood\n\nThe now mature jazz trumpeter/composer/bandleader Roy Hargrove, who has been utterly masterful since the beginning of his career, has been involved with various all-star bands, neo-fusion outfits, and made a very good living playing modern instrumental music. Now he is reaching a new and elevated level of pure jazz artistry with Earfood. A studio recording of his live touring repertoire with his working quintet, Hargrove presents several ballads, favorites from jazz veterans, and well rendered originals, all in the spirit of the famed trumpeters who preceded him. Alto saxophonist Justin Robinson and pianist Gerald Clayton are not only rising stars and standout soloists, but also players perfectly compatible to play this contemporary and mainstream modern jazz. Add young bassist Danton Bolder and the excellent drummer Montez Coleman, and you have a band that can bring Hargrove's music fully to life. It is said that everyone learns from their mistakes, but if that is true, Hargrove has gone far beyond the pale, and is flawless here, in terms of both concept and execution. The CD comes out of the box with four home runs -- an ultra hip contemporary version of the Cedar Walton tune &quot;I Am Not So Sure,&quot; a sweet 7/8 beat for &quot;Brown&quot; with outstanding piano from Clayton, &quot;Strasbourg/St. Denis&quot; sporting an infectiously happy aura, clever staccato unison and chatty counterpoint from the horns, and the sleek, breezy and soulful &quot;Starmaker&quot; which sounds like it could have come from the book of the late pianist James Williams. There's also a remake of the great Weldon Irvine original blues-funk-soul classic &quot;Mr. Clean&quot; that is well done but not overcooked, an excellent version showcasing varying subtleties and dynamics during the Larry Willis composition &quot;To Wisdom the Prize,&quot; and the good swinger &quot;The Stinger,&quot; soaked in harmonic colors and good vibes. The four salt-and-pepper ballads all show Hargrove's expert ability to play slow and soulfully, still unfortunately becoming a lost art, with &quot;Joy Is Sorrow Unmasked&quot; and &quot;Rouge&quot; particularly poignant. The CD concludes with an in-concert gospel-soul version of Sam Cooke's &quot;Bring It on Home to Me,&quot; as good a coda to this set as could be. There are no missteps on this program, no filler tunes, the trumpeter simply playing as precisely -- if not better -- than he ever has, and a band who fully understands how to make his music come alive. This comes with the highest of recommendations, a zenith watermark for Hargrove, and has to be a candidate for Best Jazz CD of 2008. (AllMusic)\n\nTrack list:\n01 - I'm Not So Sure\n02 - Brown\n03 - Strasbourg-st. Denis\n04 - Starmaker\n05 - Joy Is Sorrow Unmasked\n06 - The Stinger\n07 - Rouge\n08 - Mr. Clean\n09 - Style\n10 - Divine\n11 - Do Wisdom The Prize\n12 - Speak Low\n13 - Bring It On Home To Me\n\nSplit with Medieval!\nEnjoy and share! ","torrent":{"xt":"urn:btih:914e4e0af79d3c90ca9bd61343f7b654a851d28f","amp;dn":"Roy+Hargrove+-+2008+-+Earfood+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914e4e0af79d3c90ca9bd61343f7b654a851d28f","infoHashBuffer":{"type":"Buffer","data":[145,78,78,10,247,157,60,144,202,155,214,19,67,247,182,84,168,81,210,143]},"announce":[],"urlList":[]}}