{"title":"Wolverine","uid":4215351,"size":2166234879,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:915ccd84075021bcd281b64eda474d32a185e3d0&amp;dn=Wolverine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Rishab","files":264,"time":1212311613,"description":"Wolverine (born James Howlett and commonly known as Logan) is a fictional character, a Marvel Comics superhero who has been a member of several teams, including the X-Men and the New Avengers. He was created by writer Len Wein and Marvel art director John Romita Sr., who designed the character, and was first drawn for publication by Herb Trimpe.\n\nWolverine had a cameo appearance on the last page of Incredible Hulk #180 (October 1974) and his first \\\\\\&quot;full\\\\\\&quot; appearance in Incredible Hulk #181 (November 1974). X-Men writer Chris Claremont played a significant role in the character\\\\\\&amp;#039;s subsequent development as well as artist/writer John Byrne, who insisted on making the character older than the other X-Men. Frank Miller also helped to revise the character in the early 1980s with the eponymous limited series in which Wolverine\\\\\\&amp;#039;s catch phrase, \\\\\\&quot;I\\\\\\&amp;#039;m the best there is at what I do, but what I do isn\\\\\\&amp;#039;t very nice\\\\\\&quot;, was first written.\n\nA mutant, Wolverine possesses animal-keen senses, enhanced physical capabilities, and a healing factor that allows him to recover from virtually any wound. This healing ability enabled the supersoldier program Weapon X to bond the near indestructible metal alloy adamantium to his skeletal system. He is also a master of hand-to-hand combat and martial arts.\n\nThis is a request from them forum. Request was for v3 but I decided to put all v1, v2 along with v3 in this torrent. Enjoy and Seed.","torrent":{"xt":"urn:btih:915ccd84075021bcd281b64eda474d32a185e3d0","amp;dn":"Wolverine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915ccd84075021bcd281b64eda474d32a185e3d0","infoHashBuffer":{"type":"Buffer","data":[145,92,205,132,7,80,33,188,210,129,182,78,218,71,77,50,161,133,227,208]},"announce":[],"urlList":[]}}