{"title":"911: The Big Bamboozle 9/11 and the War on Terror Philip Marshal","uid":11207395,"size":40589850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9199a17ccb2ab254a178346d2196f73378a18e48&amp;dn=911%3A+The+Big+Bamboozle+9%2F11+and+the+War+on+Terror+Philip+Marshal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"cathy007","files":2,"time":1413238807,"description":"The Big Bamboozle 9/11 and the War on Terror Philip Marshal\n\nThis is a game changer that will finally set the record straight on the most horrific crime in US. The best book on 9/11 and the false terrorism created in the Post 9/11 World. Philip Marshall explains Saudi Arabian Intelligence agents role in 9/11, false flag operations, false reports of Weapons of Mass Destruction, false flag terrorism, false Anthrax threats, media created and al Qaeda disinformation on the 9/11 attack.\n\nFrom the perspective of a Boeing 767 captain and former &quot;special activities&quot; contract pilot, Philip Marshall straps the reader into the cockpits of hijacked commercial airliners to tell the story of the most sophisticated terrorist attack in history. Based on a comprehensive ten-year study into the murders of his fellow pilots on 9/11, he explains how hijackers, novice pilots at the controls of massive guided missiles, were able to beat United States Air Force fighters to iconic targets with advanced maneuvering, daring speeds and a kamikaze finish. But, as Marshall explains, the tactical plan was so precise that it rules out car-bombers and shoe-bombers known as al Qaeda, KSM and Osama bin Laden. So then, who was it? That's what you are about learn. Backed by official NTSB, FAA and black box recordings, Marshall finds the most capable and most documented group of conspirators buried deep within a Congressional Inquiry's report and retraces their work in gripping detail. Fasten your seatbelt--- the sad truth is that all of the solid evidence points to a dark collaboration between members of the Bush Administration and a covert group of Saudi government officials. \n\nThis file is pdf - convert to other format here \n\nebook.online-convert.com/convert-to-epub","torrent":{"xt":"urn:btih:9199a17ccb2ab254a178346d2196f73378a18e48","amp;dn":"911%3A+The+Big+Bamboozle+9%2F11+and+the+War+on+Terror+Philip+Marshal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9199a17ccb2ab254a178346d2196f73378a18e48","infoHashBuffer":{"type":"Buffer","data":[145,153,161,124,203,42,178,84,161,120,52,109,33,150,247,51,120,161,142,72]},"announce":[],"urlList":[]}}