{"title":"The decline and fall of Nazi Germany and Imperial Japan (History","uid":11207157,"size":55077355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91995ded64705a47b9c4bff535e129411de02ecc&amp;dn=The+decline+and+fall+of+Nazi+Germany+and+Imperial+Japan+%28History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1413235869,"description":"Pdf / English / 1968 / 431 pages / 52.5 MB\n\nA Pictorial History of the Final Days of World War II by Hans Dollinger\n\nWith a Foreword by Lt. Gen. Ira C. Eaker (Ret.)\n\n880 Illustrations, Maps, etc.\n\nHere is a completely objective account in picture and prose of the deciding final days of World War II in Europe and the Pacific. First-hand accounts, messages, diary entries, letters and other papers by Eisenhower, Bradley, Patton, Ridgway,\nMontgomery, Alanbrooke, Roosevelt, Churchill, De Gaulle, Stalin, Truman, Halsey and many other leaders, together with eye-witness reports, serve to enhance and document the narrative and analysis.\n\nOn the German side we see the unbelievable destruction accomplished by Allied bombing; the shortages of men, food, and weapons; the calling up of boys and women to active combat. There are the desperate last-minute measures to prevent individuals from surrendering or deserting, such as holding the families of soldiers as hostages.\nAt top level, there is the account of Hitler's self-delusions, leading to his dismissal of one after another of the general staff. All of this is documented by witnesses' accounts of high-level conferences and conversations","torrent":{"xt":"urn:btih:91995ded64705a47b9c4bff535e129411de02ecc","amp;dn":"The+decline+and+fall+of+Nazi+Germany+and+Imperial+Japan+%28History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91995ded64705a47b9c4bff535e129411de02ecc","infoHashBuffer":{"type":"Buffer","data":[145,153,93,237,100,112,90,71,185,196,191,245,53,225,41,65,29,224,46,204]},"announce":[],"urlList":[]}}