{"title":"The Illustrated Foxe's Book of Martyrs - John Foxe","uid":11773413,"size":3962450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92708fbb8e74f43527580dd5c73144e94574abd9&amp;dn=+The+Illustrated+Foxe%27s+Book+of+Martyrs+-+John+Foxe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1427167085,"description":"\nFoxe's Book of Martyrs has been an invaluable addition to the libraries of faithful Christians for almost five centuries. Chronicling the suffering and brutal deaths of those who have sacrificed their lives for the sake of the Gospel of Jesus Christ, John Foxe captured the God-given, Spirit-inspired courage of these noble souls. Though sometimes difficult to read because of the inhumane cruelty depicted in its pages, the images which truly endure are the ones which portray the victorious faith, through the grace of God, of these Christian martyrs.\n\nWhy should you read this book? The stories within these pages are supremely inspiring accounts of those who gave their lives defending the truth of the Gospel. Much can be learned not only of their fortitude but also of an apostate false church that persecuted them. The powerful witness of these martyred saints will stir your hearts, as it has the true church through the centuries, to be that loyal bride of Christ, strong and pure.\n\n\nAbout the author:\nJohn Foxe (1516/17 ? 18 April 1587) was an English historian and martyrologist, the author of Actes and Monuments (popularly known as Foxe's Book of Martyrs), an account of Christian martyrs throughout Western history but emphasizing the sufferings of English Protestants and proto-Protestants from the fourteenth century through the reign of Mary I. Widely owned and read by English Puritans, the book helped mould British popular opinion about the Catholic Church for several centuries.\n\nFoxe took his bachelor's degree on 17 July 1537, his master's degree in July 1543, and was lecturer of logic, 1539?40. A series of letters in Foxe's handwriting dated to 1544?45, shows Foxe to be &quot;a man of friendly disposition and warm sympathies, deeply religious, an ardent student, zealous in making acquaintance with scholars.&quot; By the time he was twenty-five, he had read the Latin and Greek fathers, the schoolmen, the canon law, and had &quot;acquired no mean skill in the Hebrew language.&quot;\n\nFoxe died on 18 April 1587 and was buried at St. Giles's, Cripplegate. His widow, Agnes, probably died in 1605. Foxe's son, Samuel Foxe (1560?1630) prospered after his father's death and &quot;accumulated a substantial estate.&quot; Fortunately for posterity, he also preserved his father's manuscripts, and they are now in the British Library","torrent":{"xt":"urn:btih:92708fbb8e74f43527580dd5c73144e94574abd9","amp;dn":"+The+Illustrated+Foxe%27s+Book+of+Martyrs+-+John+Foxe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92708fbb8e74f43527580dd5c73144e94574abd9","infoHashBuffer":{"type":"Buffer","data":[146,112,143,187,142,116,244,53,39,88,13,213,199,49,68,233,69,116,171,217]},"announce":[],"urlList":[]}}