{"title":"X-FORCE by Warren Ellis (2000-2001) Complete 102-109","uid":8819379,"size":77351684,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9289d836161c70aec773d93ee321a7bfdf333877&amp;dn=X-FORCE+by+Warren+Ellis+%282000-2001%29+Complete+102-109&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1376663610,"description":"This is probably the polar opposite of that Chuck Austen torrent from earlier in the week, lol.  --STF\n\n------\n\n&quot;Revolution&quot; was the name given to the May 2000 revamp of Marvel Comics' X-Men-related titles, to coincide with the publication of X-Men vol. 2 #100.\n\nIn each series, the &quot;Revolution&quot; issue represented a jump of six months after the previous issue's events. In most cases, &quot;Revolution&quot; also marked an attempt to send each title in a new creative direction, and to this end new creative teams were assigned to the titles. Many characters' costumes were redesigned, and a &quot;Revolution&quot; logo was printed along the right-hand side of each issue.\n\nThe most publicized of the changes was the return of writer Chris Claremont to the flagship titles X-Men vol. 2 and Uncanny X-Men, after nearly a decade's absence.\n\nThree of the titles involved in the event -- X-Man, X-Force, and Generation X -- were rebranded as &quot;Counter X&quot;. Writer Warren Ellis plotted the general direction for each of the books, and co-wrote each title with Steven Grant on X-Man, Ian Edginton on X-Force, and Brian Wood on Generation X.\n\nThe &quot;Revolution&quot; event was poorly received by fans and critics, leading to Claremont leaving X-Men and Uncanny X-Men after nine months. The X-Men line of books were revamped again in July 2001 with Grant Morrison writing New X-Men, Joe Casey writing Uncanny X-Men, and Claremont writing the new title X-Treme X-Men.\n\nThe &quot;Revolution&quot; debut issues, in order of publication, were:\n\nCable #79, with new writer Robert Weinberg and recently-arrived penciller Michael Ryan and inker Andrew Pepoy.\nGambit #16, with recently-arrived penciller Yanick Paquette and inker Sean Parsons.\nGeneration X #63, with new co-writers Warren Ellis and Brian Wood, new penciller Steve Pugh, and new inker Sandu Florea.\nX-Men #100, with returning writer Chris Claremont, new penciller Leinil Francis Yu, and new inker Mark Morales.\nWolverine #150, with new writer/penciller Steve Skroce and new inker Lary Stucker (with &quot;special thanks to&quot; Larry Wachowski).\nX-Force #102, with new co-writers Warren Ellis and Ian Edginton, new penciller Whilce Portacio, and new inker Gerry Alanguilan.\nX-Man #63, with new co-writers Warren Ellis and Steven Grant and new artist Ariel Olivetti.\nUncanny X-Men #381, with returning writer Chris Claremont, new penciller Adam Kubert, and new inker Tim Townsend.\nMagneto: Dark Seduction #1, the first issue of a mini-series by Fabian Nicieza, Roger Cruz, and Andy Owens.\n","torrent":{"xt":"urn:btih:9289d836161c70aec773d93ee321a7bfdf333877","amp;dn":"X-FORCE+by+Warren+Ellis+%282000-2001%29+Complete+102-109","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9289d836161c70aec773d93ee321a7bfdf333877","infoHashBuffer":{"type":"Buffer","data":[146,137,216,54,22,28,112,174,199,115,217,62,227,33,167,191,223,51,56,119]},"announce":[],"urlList":[]}}