{"title":"Villagers - Awayland (2013) [FLAC]","uid":8366119,"size":271052451,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:92a52e40ccc686485994842f10229bf05cea1eee&amp;dn=Villagers+-+Awayland+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1365772544,"description":"\n  Villagers - {Awayland} (2013) [FLAC]\n\n  Released: 2013\n  Duration: 43:00\n  Genre: Pop/Rock\n  Style: Alternative, Singer/Songwriter, Indie Folk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 My Lighthouse\n  02 Earthly Pleasure\n  03 The Waves\n  04 Judgement Call\n  05 Nothing Arrived\n  06 The Bell\n  07  {Awayland}\n  08  Passing a Message\n  09  Grateful Song\n  10 In a Newfound Land You Are Free\n  11 Rhythm Composer\n\n  The second album of any artist's career is always a difficult one to deliver and possibly more so if your debut reaped critical praise, a Mercury Prize nomination, and an Ivor Novello Award for Best Song Musically and Lyrically. This was the situation Conor J. O'Brien and his band Villagers found themselves in when writing their sophomore record, wayland. The Irishman had hit a wall after two years of touring debut Becoming a Jackal and found creativity hard to come by. It was at this point that O'Brien turned his mind away from the confessional, brooding folk-pop of his first effort and purchased a synthesizer, drum machine, and sampler. Over the period of a year he taught himself to create basic electronic music that slowly evolved into the soundscapes and noises that went on to form the framework of the second record. The textures and layers that these electronic influences have created give a wonderful depth to otherwise folk-pop tracks &quot;Judgment Call&quot; and string-laden album ender &quot;Rhythm Composer,&quot; while the frantic verses and melodic chorus of &quot;Earthly Pleasure&quot; wouldn't sound out of place on a Bright Eyes record. \n\n  Album highlight &quot;The Waves&quot; unfolds gently from a Morse code-like bleep and eventually flourishes into the more familiar sound of horns, piano, and gently plucked guitars, until it ends in a noisy swell of feedback, crunching guitars, and synths. Another audible change is brought by the fact that O'Brien collaborated with his band for the recording of this second Villagers album. The songs feel fuller as a result, and without the burden of playing every instrument, the Irishman has concentrated his efforts into his lyrics. These are influenced by literary luminaries such as Slaughterhouse 5 author Kurt Vonnegut alongside songwriters Nick Drake and Curtis Mayfield. The creative progression O'Brien exhibits here leaves no lingering questions of doubt whether he would succumb to the dreaded second album syndrome, and regardless of awards, wayland sees the Irishman at his best, both musically and lyrically.","torrent":{"xt":"urn:btih:92a52e40ccc686485994842f10229bf05cea1eee","amp;dn":"Villagers+-+Awayland+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a52e40ccc686485994842f10229bf05cea1eee","infoHashBuffer":{"type":"Buffer","data":[146,165,46,64,204,198,134,72,89,148,132,47,16,34,155,240,92,234,30,238]},"announce":[],"urlList":[]}}