{"title":"Yann Tiersen - Good bye Lenin! (OST) [FLAC] TQMP","uid":4711470,"size":244969092,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:93703f2181c93c8ad5fc860b7fcdfae2dc37a4f0&amp;dn=Yann+Tiersen+-+Good+bye+Lenin%21+%28OST%29+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pastafari","files":-1,"time":1234037905,"description":"Yann Tiersen - Good bye Lenin! (OST)\n2003\n\nBrought to you by TQMP\nThe Quality Music Project\n\nMore somber and subdued than his usual work, Yann Tiersen's score for Good Bye Lenin! makes the perfect audio counterpart for the film's bittersweet but often funny story, which revolves around a family living in Communist Germany and is told from the viewpoint of the son, Alex. The family undergoes a number of hardships, including the father's escape to the West and the mother's subsequent breakdown. After she recovers, she becomes a fanatic for the Communist regime, until she sees the police beat up Alex at a pro-democracy rally. The shock gives her a heart attack, after which she lapses into a coma; when she revives, the Berlin Wall has fallen. A doctor warns Alex that any more stress could kill her, so he and the rest of the family pretend that they are still living under Communist rule. While no score could convey all of that, Tiersen's music does reflect the hesitancy and delicacy of the family's plight should their illusion be broken, as well as the comedy and the drama that ensue when it seems close to falling apart. Most of the score is dominated by thoughtful, rippling pianos that conjure up rainy days, as well as strings, woodwinds, and brass that add to the airs of urgency and madcap humor that dominate the film and its music. &quot;Summer 78&quot; introduces the score's main theme, a winding melody that is as lovely as it is sad. The version of &quot;Summer 78&quot; that is graced by Claire Pichet's ice water-pure vocals, &quot;Watching Lara,&quot; &quot;First Rendez-Vous,&quot; &quot;Lara's Castle,&quot; and &quot;Good Bye Lenin&quot; itself all return to this theme in various ways, lending more warmth or more coolness as necessary. &quot;Dishes,&quot; on the other hand, is the first of the sharply quirky, nearly chaotic pieces that inject some humor into the score. &quot;The Decant Session,&quot; &quot;The Deutsch Mark Is Coming,&quot; and &quot;Preparations for the Last TV Fake&quot; follow suit, with the emphasis on brass and woodwinds changing from track to track. Still other pieces, such as &quot;Childhood 2,&quot; &quot;Letters,&quot; and &quot;Mother Will Die&quot; -- which uses shimmering vibes and excerpts of hushed dialogue in a particularly striking way -- aim at a deeper level of memories and sorrow; Tiersen's subtly but significantly shifting compositions are almost always quite moving, and Good Bye Lenin! is no exception. Despite being a rather lengthy score, some of the cues are so short that it's a little difficult to enjoy them fully. This is a minor complaint, though; Good Bye Lenin! is one of those rare scores that is just as affecting and cohesive outside of the movie theater as it is inside of it.\n-- allmusic.com\n\nTracks\n01- Summer 78 (instrumental)\n02- Come\n03- Childhood (1)\n04- From prison to hospital\n05- Mother\n06- Watching Lara\n07- Dishes\n08- First rendez-vous\n09- The decant session\n10- Lara's castle\n11- The Deutsch Mark is coming\n12- I saw daddy today\n13- Birthday preparations\n14- Good bye Lenin\n15- Childhood (2)\n16- Letters\n17- Mother's journey\n18- Preparations for the last tv fake\n19- Mother will die\n20- Father is late\n21- Father and mother\n22- Finding the money\n23- Summer 78\n\nArtwork (200dpi scan), EAC log and CUE sheet included.\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;\n\nYou too can search for evidence the Flying Spaghetti Monster is the Lord and Master of the Universe  &lt;a href=&quot;\nhttp://setiathome.berkeley.edu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://setiathome.berkeley.edu&lt;/a&gt;","torrent":{"xt":"urn:btih:93703f2181c93c8ad5fc860b7fcdfae2dc37a4f0","amp;dn":"Yann+Tiersen+-+Good+bye+Lenin%21+%28OST%29+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93703f2181c93c8ad5fc860b7fcdfae2dc37a4f0","infoHashBuffer":{"type":"Buffer","data":[147,112,63,33,129,201,60,138,213,252,134,11,127,205,250,226,220,55,164,240]},"announce":[],"urlList":[]}}