{"title":"We Are Our Brains: A Neurobiography... (2014) D F Swaab (multi)","uid":9506035,"size":16509108,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:937017da30ce10079dce11d97697a5134cffbc91&amp;dn=We+Are+Our+Brains%3A+A+Neurobiography...+%282014%29+D+F+Swaab+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"7","files":-1,"time":1390319269,"description":"We Are Our Brains: A Neurobiography of the Brain, from the Womb to Alzheimer's (2014) D F Swaab (multi) \n\n\nWe Are Our Brains: A Neurobiography of the Brain, from the Womb to Alzheimer's by D F Swaab\n\n\nFormat: mobi/epub/azw3\nLength: 448 pages\nGenre: Non-Fiction/Psychology\nDate: 7 January 2014\n\nA vivid account of what makes us human.\n\nBased groundbreaking new research, We Are Our Brains is a sweeping biography of the human brain, from infancy to adulthood to old age. Renowned neuroscientist D. F. Swaab takes us on a guided tour of the intricate inner workings that determine our potential, our limitations, and our desires, with each chapter serving as an eye-opening window on a different stage of brain development: the gender differences that develop in the embryonic brain, what goes on in the heads of adolescents, how parenthood permanently changes the brain.\n\nMoving beyond pure biological understanding, Swaab presents a controversial and multilayered ethical argument surrounding the brain. Far from possessing true free will, Swaab argues, we have very little control over our everyday decisions, or who we will become, because our brains predetermine everything about us, long before we are born, from our moral character to our religious leanings to whom we fall in love with.\n\nDid you know?\n\n* The father's brain is affected in pregnancy as well as the mother's.\n* The withdrawal symptoms we experience at the end of a love affair mirror chemical addiction.\n* Growing up bilingual reduces the likelihood of Alzheimer's.\n* Parental religion is imprinted on our brains during early development, like our native language is.\n\nAuthor:\n\nD. F. Swaab is an internationally renowned researcher in neuroscience and a professor of neurobiology at the University of Amsterdam. He is the founder of the Netherlands Brain Bank, which supplies the international research community with clinical and neuropathological brain tissue, and he currently leads the Neuropsychiatric Disorders research team at the Netherlands Institute for Neuroscience.\n","torrent":{"xt":"urn:btih:937017da30ce10079dce11d97697a5134cffbc91","amp;dn":"We+Are+Our+Brains%3A+A+Neurobiography...+%282014%29+D+F+Swaab+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"937017da30ce10079dce11d97697a5134cffbc91","infoHashBuffer":{"type":"Buffer","data":[147,112,23,218,48,206,16,7,157,206,17,217,118,151,165,19,76,255,188,145]},"announce":[],"urlList":[]}}