{"title":"Grand Central - How a Train Station Transformed America (History","uid":10073281,"size":21541345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93957c486f8197110d987ccd24709ade061a3f34&amp;dn=Grand+Central+-+How+a+Train+Station+Transformed+America+%28History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1398880986,"description":"Sam Roberts, &quot;Grand Central: How a Train Station Transformed America&quot; \nEnglish | ISBN: 1455525960 | 2013 | EPUB | 320 pages | 20,5 MB\n\nA rich, illustrated - and entertaining -- history of the iconic Grand Central Terminal, from one of New York City's favorite writers, just in time to celebrate the train station's 100th fabulous anniversary.\n\nIn the winter of 1913, Grand Central Station was officially opened and immediately became one of the most beautiful and recognizable Manhattan landmarks. In this celebration of the one hundred year old terminal, Sam Roberts of The New York Times looks back at Grand Central's conception, amazing history, and the far-reaching cultural effects of the station that continues to amaze tourists and shuttle busy commuters. \n\nAlong the way, Roberts will explore how the Manhattan transit hub truly foreshadowed the evolution of suburban expansion in the country, and fostered the nation's westward expansion and growth via the railroad.\n\nFeaturing quirky anecdotes and behind-the-scenes information, this book will allow readers to peek into the secret and unseen areas of Grand Central -- from the tunnels, to the command center, to the hidden passageways. \n\nWith stories about everything from the famous movies that have used Grand Central as a location to the celestial ceiling in the main lobby (including its stunning mistake) to the homeless denizens who reside in the building's catacombs, this is a fascinating and, exciting look at a true American institution.","torrent":{"xt":"urn:btih:93957c486f8197110d987ccd24709ade061a3f34","amp;dn":"Grand+Central+-+How+a+Train+Station+Transformed+America+%28History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93957c486f8197110d987ccd24709ade061a3f34","infoHashBuffer":{"type":"Buffer","data":[147,149,124,72,111,129,151,17,13,152,124,205,36,112,154,222,6,26,63,52]},"announce":[],"urlList":[]}}