{"title":"Microsoft Office 2010 Bible  (1344 Pages)  (.PDF)","uid":7244553,"size":20647483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93d24da18058f4c7e8a9eb67575682bda2dd7196&amp;dn=Microsoft+Office+2010+Bible++%281344+Pages%29++%28.PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Spetses","files":-1,"time":1336235449,"description":"                (9-2010) | PDF | 1344 pages | 0470591854 | 19.5Mb\n\n\nOffice 2010 Bible /by John Walkenbach, Herb Tyson, Michael R. Groh, Faithe Wempen, Lisa A. Bucki. \n\n\nTake your pick of applications from the Office 2010 suite and your choice of leading experts to show you how to use them. This Office 2010 Bible features the best-of-the-best content from the Excel 2010 Bible, by &quot;Mr. Spreadsheet&quot; John Walkenbach; the Word 2010 Bible by Microsoft MVP Herb Tyson; the PowerPoint 2010 Bible, by PowerPoint expert Faithe Wempen; and coverage of Access 2010 from Microsoft MVP Michael Alexander.\nIf you want to quickly and effectively begin using Office 2010, start in the experts' corner with this must-have book.\nGives you the best-of-the-best content on Office 2010 from the leading experts, authors, and contributors to our Excel, Word, PowerPoint, and Access Bibles\nIncludes content from John Walkenbach, aka &quot;Mr. Spreadsheet&quot;; Word expert and Microsoft MVP Herb Tyson; PowerPoint expert Faithe Wempen; and Excel and Access expert and Microsoft MVP Michael Alexander\nTakes you beyond creating simple text documents, spreadsheets, and presentations to help you use multiple Office applications at once to conquer critical business tasks\nHones in with expert coverage of the topics within each application that you need to know most\nCovers even more from Outlook and other key Office topics\nGet the best of four books in one with this power-packed reference!","torrent":{"xt":"urn:btih:93d24da18058f4c7e8a9eb67575682bda2dd7196","amp;dn":"Microsoft+Office+2010+Bible++%281344+Pages%29++%28.PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93d24da18058f4c7e8a9eb67575682bda2dd7196","infoHashBuffer":{"type":"Buffer","data":[147,210,77,161,128,88,244,199,232,169,235,103,87,86,130,189,162,221,113,150]},"announce":[],"urlList":[]}}