{"title":"Jim Croce &amp; Don McLean - Back To Back Hits (1995) [FLAC]","uid":6446594,"size":203528521,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:93de3f8c8ac0d03f8ebc5c8d31ab9bc9592977e9&amp;dn=Jim+Croce+%26+Don+McLean+-+Back+To+Back+Hits+%281995%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1307291846,"description":"Jim Croce &amp; Don McLean\nBack To Back Hits (1995)\n\n\n\n\n\nJim Croce:\n\nIn the music industry, arguably the worst tragedy that can befall an artist is to die in their prime, when he or she is just beginning to break through to the mainstream and reach people on a national level. One such artist was Jim Croce, a songwriter with a knack for both upbeat, catchy singles and empathetic, melancholy ballads. Though Croce only recorded a few studio albums before an untimely plane crash, he continues to be remembered posthumously. Croce appealed to fans as a common man, and it was not a gimmick -- he was a father and husband who went through a series of blue-collar jobs. And whether he used dry wit, gentle emotions, or sorrow, Croce sang with a rare form of honesty and power. Few artists have ever been able to pull off such down-to-earth storytelling as convincingly as he was. \n\n\n\n\nDon McLean:\n\nFamed for -- and ultimately defined by -- his perennial 'American Pie', singer/songwriter Don McLean was born October 2, 1945, in New Rochelle, NY. After getting his start in the folk clubs of New York City during the mid-'60s, McLean struggled for a number of years, building a small following through his work with Pete Seeger on the Clearwater, a sloop that sailed up and down the eastern seaboard to promote environmental causes. Still, McLean was primarily singing in elementary schools and the like when in 1970 he wrote a musical tribute to painter Vincent Van Gogh; the project was roundly rejected by a number of labels, although MediaArts did offer him a contract to record a number of his other songs under the title Tapestry. The album fared poorly, but Perry Como earned a hit with a cover of the track 'And I Love Her So,' prompting United Artists to pick up McLean's contract. He returned in 1971 with American Pie; the title track, an elegiac eight-and-a-half-minute folk-pop epic inspired by the tragic death of Buddy Holly, became a number one hit, and the LP soon reached the top of the charts as well. \n\n\n\n\nFormat:\t\t\tFlac Perfect (Lossless)\nContains:\t\tAlbum Art &amp; ID Tags\nLabel:\t\t\tCEMA Special Markets\nCatalog:\t\tS21-18677\n\n\n\nAudio-Info:\n\n\n01.American Pie, Part 1 - Don McLean\n02.I Got A Name - Jim Croce\n03.Castles In The Air - Don McLean\n04.You Don't Mess Around With Jim - Jim Croce\n05.Everyday - Don McLean\n06.Operator (That's Not The Way It Feels) - Jim Croce\n07.Vincent - Don McLean\n08.Time In A Bottle - Jim Croce\n09.Dreidel - Don McLean\n10.Workin' At The Car Wash Blues - Jim Croce\n\n\n\n\n\n\n\n\n\n             ****Support the artists &amp; buy it if you like it.****\n\n\n                 ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:93de3f8c8ac0d03f8ebc5c8d31ab9bc9592977e9","amp;dn":"Jim+Croce+%26+Don+McLean+-+Back+To+Back+Hits+%281995%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93de3f8c8ac0d03f8ebc5c8d31ab9bc9592977e9","infoHashBuffer":{"type":"Buffer","data":[147,222,63,140,138,192,208,63,142,188,92,141,49,171,155,201,89,41,119,233]},"announce":[],"urlList":[]}}