{"title":"OUTLAST-RELOADED","uid":8883671,"size":3743026910,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93e080d17f70599b2d308295e76f95e0f1f91cc7&amp;dn=OUTLAST-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"Taker009","files":2,"time":1378397419,"description":"  OUTLAST-RELOADED\n\n\n        09/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n              1 :.......... DISC(S) .. GAME.TYPE ........: Action, Indie\n\n  Note:\n  ~~~~~\n  We're not wasting a proper-label on something so obviously not tested. This\n  release works, is already updated (v1.0.11771.0), and includes cracks for\n  both the 32- and 64-bit versions of the game. Enjoy!\n\n  --\n\n  Hell is an experiment you can't survive in Outlast, a first-person survival\n  horror game developed by veterans of some of the biggest game franchises in\n  history. As investigative journalist Miles Upshur, explore Mount Massive\n  Asylum and try to survive long enough to discover its terrible secret...\n  if you dare.\n\n  Synopsis:\n\n  In the remote mountains of Colorado, horrors wait inside Mount Massive\n  Asylum. A long-abandoned home for the mentally ill, recently re-opened by\n  the &quot;research and charity&quot; branch of the transnational Murkoff Corporation,\n  the asylum has been operating in strict secrecy. until now.\n\n  Acting on a tip from an anonymous source, independent journalist Miles\n  Upshur breaks into the facility, and what he discovers walks a terrifying\n  line between science and religion, nature and something else entirely.\n  Once inside, his only hope of escape lies with the terrible truth at the\n  heart of Mount Massive.\n\n  Outlast is a true survival horror experience which aims to show that the\n  most terrifying monsters of all come from the human mind.\n\n  Features:\n\n  True Survival Horror Experience: You are no fighter - if you want to survive\n  the horrors of the asylum, your only chance is to run... or hide\n  Immersive Graphics: AAA-quality graphics give players a detailed, terrifying\n  world to explore\n  Hide and Sneak: Stealth-based gameplay, with parkour-inspired platforming\n  elements\n  Unpredictable Enemies: Players cannot know when - and from where - one of\n  the asylum's terrifying inhabitants will finally catch up to them\n  Real Horror: Outlast's setting and characters are inspired by real asylums\n  and cases of criminal insanity\n\n  Warning:\n\n  Outlast contains intense violence, gore, graphic sexual content, and\n  strong language. Please enjoy.\n\n\n  1. Unrar\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy over the cracked content from the /Crack directory on the image to\n     your game install directory.\n  5. If you want to play 64 bit version change your shortcut to Win64 folder.\n  6. Play the game.\n  7. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:93e080d17f70599b2d308295e76f95e0f1f91cc7","amp;dn":"OUTLAST-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93e080d17f70599b2d308295e76f95e0f1f91cc7","infoHashBuffer":{"type":"Buffer","data":[147,224,128,209,127,112,89,155,45,48,130,149,231,111,149,224,241,249,28,199]},"announce":[],"urlList":[]}}