{"title":"Zero,The Biography of a Dangerous Idea","uid":4781273,"size":82150422,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9422334da7da2ac7fe694e56fe49581881b228a7&amp;dn=Zero%2CThe+Biography+of+a+Dangerous+Idea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"philmccrevice","files":10,"time":1237393705,"description":"The seemingly impossible Zen task--writing a book about nothing--has a loophole: people have been chatting, learning, and even fighting about nothing for millennia. Zero: The Biography of a Dangerous Idea, by noted science writer Charles Seife, starts with the story of a modern battleship stopped dead in the water by a loose zero, then rewinds back to several hundred years BCE. Some empty-headed genius improved the traditional Eastern counting methods immeasurably by adding zero as a placeholder, which allowed the genesis of our still-used decimal system. It's all been uphill from there, but Seife is enthusiastic about his subject; his synthesis of math, history, and anthropology seduces the reader into a new fascination with the most troubling number.\nWhy did the Church reject the use of zero? How did mystics of all stripes get bent out of shape over it? Is it true that science as we know it depends on this mysterious round digit? Zero opens up these questions and lets us explore the answers and their ramifications for our oh-so-modern lives. Seife has fun with his format, too, starting with chapter 0 and finishing with an appendix titled &quot;Make Your Own Wormhole Time Machine.&quot; (Warning: don't get your hopes up too much.) There are enough graphs and equations to scare off serious numerophobes, but the real story is in the interactions between artists, scientists, mathematicians, religious and political leaders, and the rest of us--it seems we really do have nothing in common. --Rob Lightner --This text refers to an out of print or unavailable edition of this title. \n\nIn a lively and literate first book, science journalist Seife takes readers on a historical, mathematical and scientific journey from the infinitesimal to the infinite. With clever devices such as humorously titled and subtitled chapters numbered from zero to infinity, Seife keeps the tone as light as his subject matter is deep. By book's end, no reader will dispute Seife's claim that zero is among the most fertile--and therefore most dangerous--ideas that humanity has devised. Equally powerful and dangerous is its inseparable counterpart, infinity, for both it and zero invoke to many the divine power that created an infinite universe from the void. The power of zero lies in such a contradiction, and civilization has struggled with it, alternatively seeking to ban and to embrace zero and infinity. The clash has led to holy wars and persecutions, philosophical disputes and profound scientific discoveries. In addition to offering fascinating historical perspectives, Seife's prose provides readers who struggled through math and science courses a clear window for seeing both the powerful techniques of calculus and the conundrums of modern physics: general relativity, quantum mechanics and their marriage in string theory. In doing so, Seife, this entertaining and enlightening book reveals one of the roots of humanity's deepest uncertainties and greatest insights. \n","torrent":{"xt":"urn:btih:9422334da7da2ac7fe694e56fe49581881b228a7","amp;dn":"Zero%2CThe+Biography+of+a+Dangerous+Idea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9422334da7da2ac7fe694e56fe49581881b228a7","infoHashBuffer":{"type":"Buffer","data":[148,34,51,77,167,218,42,199,254,105,78,86,254,73,88,24,129,178,40,167]},"announce":[],"urlList":[]}}