{"title":"Treasure Island Media - SPERM BANK - Bareback - GAY","uid":5188068,"size":2046373110,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9425cb977437b64347497392fe0829c408b8a2f5&amp;dn=Treasure+Island+Media+-+SPERM+BANK+-+Bareback+-+GAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":4,"uploader":"shareallnwo","files":-1,"time":1259553868,"description":"NOTE:\n\nA lot of this stuff is on eMule, using their client software to connect to a server and search for the videos. Most of their videos are there. To get eMule client go here:\n--------------------\n\n\nTreasure Island Media - Sperm Bank - Bareback - (PAUL MORRIS)\n\nCodec: DivX\n\nPRIMAL GROUPS of rutting men, crowded together to seed a bottom's hole. It's a ritual, a passion, a need. The camaraderie of being in a gang of topmen shines through in every scene in MAX SOHL's newest and hottest pornvid yet: SPERM BANK\n\nYeah, the scenes are filled with big-dicked studs dripping hot spooge. And yeah, we got the hungry insatiable holes, bent over and begging for it. But the STAR of Max's new video is SEMEN, and lots of it. Gobs of it dripping out of jizz-filled holes. Men live for it, worship it, hunger for it. And in SPERM BANK you get scene after scene of begging, willing bottoms getting what they need from the studs they depend on.\n\nYou asked for more internal cumshots and Max came through BIGTIME - with some of the most breathtaking internal cumshots ever caught by a camera.\n\nInfo: http://www.treasureislandmedia.com/TreasureIslandMedia_2007/xcart/product.php?productid=16201\n\n\n------------------------\n\nNOTE:\nBy viewing this torrent page I agree that I am of legal age and not with any local, state, or federal law enforcement agencies whatsoever and that I am not a reporter, writer, or agent for any news or media organization. I am viewing this material at my sole discretion on my own behalf and will not report/disclose my findings and/or comments regarding this material. I subscribe to the principles of the First Amendment of the Constitution of the United States of America which holds that free adult Americans have the right to decide for themselves what they will read and view without governmental interference. ADULT XXX CONTENT FOR ADULT VIEWING ONLY.\t\n\n","torrent":{"xt":"urn:btih:9425cb977437b64347497392fe0829c408b8a2f5","amp;dn":"Treasure+Island+Media+-+SPERM+BANK+-+Bareback+-+GAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9425cb977437b64347497392fe0829c408b8a2f5","infoHashBuffer":{"type":"Buffer","data":[148,37,203,151,116,55,182,67,71,73,115,146,254,8,41,196,8,184,162,245]},"announce":[],"urlList":[]}}