{"title":"Will I Ever Be Good Enough_ - Karyl McBride [Epub &amp; Mobi] [S","uid":10888427,"size":925748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:942956ee864c7c63020e8615a95b1535f663c661&amp;dn=Will+I+Ever+Be+Good+Enough_+-+Karyl+McBride+%5BEpub+%26amp%3B+Mobi%5D+%5BS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"krystine","files":-1,"time":1409085651,"description":"Will I Ever Be Good Enough?: Healing the Daughters of Narcissistic Mothers\nAuthor: Karyl McBride\nPublished: 2008\nPublisher: Atria Books\nISBN: 9781416551324\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\nThe first book specifically for daughters suffering from the emotional abuse of selfish, self-involved mothers, Will I Ever Be Good Enough? provides the expert assistance you need in order to overcome this debilitating history and reclaim your life for yourself. Drawing on over two decades of experience as a therapist specializing in women's psychology and health, psychotherapist Dr. Karyl McBride helpsyou recognize the widespread effects of this maternal emotional abuse and guides you as you create an individualized program for self-protection, resolution, and complete recovery. \n\nAn estimated 1.5 million American women have narcissistic personality disorder, which makes them so insecure and overbearing, insensitive and domineering that they can psychologically damage their daughters for life. Daughters of narcissistic mothers learn that maternal love is not unconditional, and that it is given only when they behave in accordance with their mothers' often unreasonable expectations and whims. As adults, these daughters consequently have difficulty overcoming their insecurities and feelings of inadequacy, disappointment, sadness, and emotional emptiness. They may also have a terrible fear of abandonment that leads them to form unhealthy love relationships, as well as a tendency to perfectionism and unrelenting self-criticism, or to self-sabotage and frustration. \n\nHerself the recovering daughter of a narcissistic mother, Dr. McBride includes her personal struggle, which adds a profound level of authority to her work, along with the perspectives of the hundreds of suffering daughters she's interviewed over the years. Their stories of how maternal abuse has manifested in their lives -- as well as how they have successfully overcome its effects -- show you that you're not alone and that you can take back your life and have the control you want. \n\nDr. McBride's step-by-step program will enable you to: \n\n(1) Recognize your own experience with maternal narcissism and its effects on all aspects of your life\n(2) Discover how you have internalized verbal and nonverbal messages from your mother and how these have translated into a strong desire to overachieve or a tendency to self-sabotage\n(3) Construct a step-by-step program to reclaim your life and enhance your sense of self, a process that includes creating a psychological separation from your mother and breaking the legacy of abuse. You will also learn how not to repeat your mother's mistakes with your own daughter. \n\nWarm and sympathetic, filled with the examples of women who have established healthy boundaries with their hurtful mothers, Will I Ever Be Good Enough? encourages and inspires you as it aids your recovery.","torrent":{"xt":"urn:btih:942956ee864c7c63020e8615a95b1535f663c661","amp;dn":"Will+I+Ever+Be+Good+Enough_+-+Karyl+McBride+%5BEpub+%26amp%3B+Mobi%5D+%5BS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"942956ee864c7c63020e8615a95b1535f663c661","infoHashBuffer":{"type":"Buffer","data":[148,41,86,238,134,76,124,99,2,14,134,21,169,91,21,53,246,99,198,97]},"announce":[],"urlList":[]}}