{"title":"david barison + daniel ross - the ister (2004)","uid":3772127,"size":2305434666,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9450b7c92c6fed4546a39a92c90afe1e2eb31d08&amp;dn=david+barison+%2B+daniel+ross+-+the+ister+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"antwerp1","files":3,"time":1187048480,"description":"The Ister is a 3000km journey to the heart of Europe, from the mouth of the Danube river on the Black Sea, to its source in the German Black Forest. Hailed by Scott Foundas of Variety as \\&quot;a philosophical feastÃƒÂ¢??at which it is possible to gorge oneself yet leave feeling elated,ÃƒÂ¢?? the film is based on the work of the most influential and controversial philosopher of the 20th century, Martin Heidegger, who in 1933 swore allegiance to the National Socialists. By joining a vast philosophical narrative with an epic voyage along EuropeÃƒÂ¢??s greatest waterway, The Ister invites you to unravel the extraordinary past and future of ÃƒÂ¢??the West.ÃƒÂ¢??\n\nAwarded the National Research Cinemas Association (GNCR) Prize at the Marseille International Documentary Festival in 2004, and the Quebec Film CriticÃƒÂ¢??s Association Documentary Prize at the Festival du Nouveau CinÃƒ?Ã‚Â©ma MontrÃƒ?Ã‚Â©al, 2004.\n\nIMDB Review:\n\nWarning: this is not a popcorn movie! A lot of people like to talk about how The Matrix is about philosophical ideas. It is, but of the \\&quot;beginners\\&quot; variety. If you want more depth and breadth to your ideas, you must see this film. It does take a while to get going and there is no way to understand the whole thing in one viewing (over three hours long!). For some this will be a liability, but if you like films that reveal their pleasures over multiple viewings then this is one for you. There is a lot going on; a trip up the Danube river, interviews with archeologists, engineers and ecologists along the river, festivals, ruins, marches, and that\\&amp;#039;s just the simple stuff. A narration sits on top of all of this, provided by three philosophers and a white-haired German filmmaker I had not heard of at the end. They discuss technology, politics and ethics, and it\\&amp;#039;s all woven together in a way that means that you always feel like you are heading somewhere important. Where you end up, well, I found it quite moving. There a lot of layers to this film and if you make an effort to dig you\\&amp;#039;ll be rewarded. NB I saw this at the ICA Cinemas in London last year. \n\nSpecs\n\nVIDEO: XVID \n       720x544 \n       25.000 fps\n       1373.9 kbps\n\nAUDIO: AC3\n\nSpoken Languages: French and English\nTexted Languages: Hardsubbed English\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\&amp;#039;","torrent":{"xt":"urn:btih:9450b7c92c6fed4546a39a92c90afe1e2eb31d08","amp;dn":"david+barison+%2B+daniel+ross+-+the+ister+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9450b7c92c6fed4546a39a92c90afe1e2eb31d08","infoHashBuffer":{"type":"Buffer","data":[148,80,183,201,44,111,237,69,70,163,154,146,201,10,254,30,46,179,29,8]},"announce":[],"urlList":[]}}