{"title":"(1984) John Lennon &amp; Yoko Ono - Milk and Honey [VinylRip 24-","uid":9838350,"size":1380427319,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9453bd4e10cb46e326b85fc1436b8e9550130ee5&amp;dn=%281984%29+John+Lennon+%26amp%3B+Yoko+Ono+-+Milk+and+Honey+%5BVinylRip+24-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"100.XY","files":-1,"time":1395947863,"description":"(1984) John Lennon and Yoko Ono - Milk and Honey\n\n\n\nReview:\nThe sessions for 1980's Double Fantasy were supposed to yield two albums, the second to be released at a future time, but Lennon's assassination tragically halted the project in its tracks. A bit over three years later, Yoko Ono issued tapes of many of the songs planned for that album under the title Milk and Honey, laid out in the same John-Yoko-John-Yoko dialogue fashion as its predecessor. Not unexpectedly, it's a rougher, less polished product, lacking the finishing touches and additional takes that Lennon most likely would have called for. Nevertheless, Lennon's songs at this point in their development were often quite strong, tougher than those on Double Fantasy in general, and the ad libs and studio chatter that might not have made the final cut give us more of a glimpse of Lennon's delightfully quirky personality. &quot;Nobody Told Me,&quot; the advance single off the album, is a rollicking, quizzical piece of work, maybe the best thing to come out of John's 1980 sessions, despite the unfinished-sounding transition to the chorus. &quot;Borrowed Time,&quot; another single, is a thoughtful, sparely worded meditation on growing older attached to a Caribbean beat. Yoko's contributions, while not as strong as John's, are surprisingly listenable -- the reggae-based &quot;Don't Be Scared,&quot; in particular -- and more current in texture, and her lyrics do tend to answer John's songs. As the album comes toward the close, the tone turns sentimental, culminating with one of John's loveliest tunes, &quot;Grow Old With Me,&quot; as presented on a home-recorded cassette in lieu of a studio recording. The ironies of this song and some of the other Lennon material are obviously poignant in the light of the cruel events of December 8, 1980; that and the fact that these songs haven't been as exposed as much as those on Double Fantasy lead some to prefer this sequel.\nReview by Richard S. Ginell\n\n\nimage\n\n\n\nTrack List:\n\nSide 1:\n1. I'm stepping Out\n2. Sleepless Night\n3. I Don't Wanna Face It\n4. don't Be Scared\n5. Nobody Told Me\n6. O'sanity\n\nSide 2:\n1. Borrowed Time\n2. Your Hands\n3. (Forgive Me) My Little Flower Princess\n4. Let Me Count The Ways\n5. Grow old With Me\n6. You're The One\n\n\nSummary:\nCountry: USA\nGenre: Rock\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : ~ 5 Mbps\nChannel(s) : 2 channels\nSampling rate : 192 KHz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:9453bd4e10cb46e326b85fc1436b8e9550130ee5","amp;dn":"%281984%29+John+Lennon+%26amp%3B+Yoko+Ono+-+Milk+and+Honey+%5BVinylRip+24-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9453bd4e10cb46e326b85fc1436b8e9550130ee5","infoHashBuffer":{"type":"Buffer","data":[148,83,189,78,16,203,70,227,38,184,95,193,67,107,142,149,80,19,14,229]},"announce":[],"urlList":[]}}