{"title":"Tragically Hip - Fully Completely (1992)","uid":3599660,"size":78628864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94842187270db8e757f62bb077918a978ea35a4b&amp;dn=Tragically+Hip+-+Fully+Completely+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Kitlope","files":12,"time":1169298575,"description":"Tragically Hip - Fully Completely \n\nAudio: Mp3 224 VBR\nfile Size: 75 Mb\nyear: 1992\nlabel: MCA\n\nFrom Wiki:\n[quote]\n\nFully Completely is the third full-length album by Canadian rock band The Tragically Hip.\n\nIt was released in October 1992, and the cover art was designed by Italian artist Lieve Prins. Prins, an &quot;electrographer&quot; who makes art with photocopiers, had the band photocopy various parts of their bodies and then made a collage with the results. The original wall-sized piece is currently on display at The Bathouse Recording Studio.\n\nThe album was produced by Chris Tsangarides, who has also worked with Black Sabbath, Depeche Mode and Judas Priest, among many others.\n\nLike their 1989 album Up to Here, Fully Completely is considered by the Hip&amp;#039;s fans as one of The Tragically Hip&amp;#039;s best albums, and a classic Canadian album. Also like Up to Here, many of the songs are still played in regular rotation on various formats of Canadian radio. Fully Completely represented a large step away from the band&amp;#039;s originally blues-inspired sound. Lyrically the album alternates between pessimism and despair: &quot;Locked in the Trunk of a Car&quot; is written from the perspective of a serial killer, and &quot;Courage,&quot; perhaps the album&amp;#039;s most popular cut is inspired by a chapter in Hugh MacLennan&amp;#039;s book The Watch That Ends the Night. It seems to detail the thoughts of a person who cannot decide whether or not to commit suicide. In the music video, Gordon Downie wears a Boston Bruins jersey that was made by his mother.\n\n\nSome of the songs are inspired by real, predominantly Canadian, events - &quot;Fifty Mission Cap&quot; is about Bill Barilko, who played for the Toronto Maple Leafs before he disappeared in 1951, and also cites imagery related to Canadian bomber crews in the Second World War. &quot;Wheat Kings&quot; is about David Milgaard, who was wrongfully convicted of murder in the 1960s. The title of &quot;Pigeon Camera,&quot; amazingly enough, literally refers to pigeons with cameras attached to their legs that were used (mostly unsuccessfully) in the First World War as tools for aerial observation.\n\nThe album, however, does have a reputation for sounding technically poor, a problem that worsens as the quality of the machine it is being played on increases; most tracks seems muted and quiet. It is unclear if this problem originated in production or manufacturing.\nAll songs were written by The Tragically Hip.[/quote]\n\n[URL=http://imageshack.us][IMG]http://img440.imageshack.us/img440/8185/tragicallyhipfullycompl4vj.jpg[/IMG][/URL]\n\n\nTrack listing\n&quot;Courage (for Hugh MacLennan)&quot; ? 4:27 \n&quot;Looking for a Place to Happen&quot; ? 4:18 \n&quot;At the Hundredth Meridian&quot; ? 3:20 \n&quot;Pigeon Camera&quot; ? 4:34 \n&quot;Lionized&quot; ? 3:20 \n&quot;Locked in the Trunk of a Car&quot; ? 4:42 \n&quot;We&amp;#039;ll Go, Too&quot; ? 3:24 \n&quot;Fully Completely&quot; ? 3:30 \n&quot;Fifty Mission Cap&quot; ? 4:10 \n&quot;Wheat Kings&quot; ? 4:19 \n&quot;The Wherewithal&quot; ? 2:55 \n&quot;Eldorado&quot; ? 3:46 \n\nEnjoy :)","torrent":{"xt":"urn:btih:94842187270db8e757f62bb077918a978ea35a4b","amp;dn":"Tragically+Hip+-+Fully+Completely+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94842187270db8e757f62bb077918a978ea35a4b","infoHashBuffer":{"type":"Buffer","data":[148,132,33,135,39,13,184,231,87,246,43,176,119,145,138,151,142,163,90,75]},"announce":[],"urlList":[]}}