{"title":"Fuel - 3 Disc - Natural Selection - Sunburn - Something Like Hum","uid":3596600,"size":304113357,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94b76c68c0ac04dd42b0e7f62be06c688c453a4b&amp;dn=Fuel+-+3+Disc+-+Natural+Selection+-+Sunburn+-+Something+Like+Hum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"soxnation85xx","files":36,"time":1168881825,"description":"The band Fuel was originally formed in 1989 in Kenton, Tennessee, but moved to Harrisburg, Pennsylvania, in 1994 where they played local Pennsylvania bars and nightclubs. Their first EP Porcelin was released in 1996, and sold well locally, spawning a small radio hit with &quot;Shimmer.&quot; The popularity of the EP brought them to the attention of Sony&amp;#039;s 550 imprint, which released their second EP, Hazelton, the following year.\n\nThe band&amp;#039;s full length debut, Sunburn, came out in 1998. &quot;Shimmer&quot; was again included, and almost became a Top 40 hit, while the other singles (&quot;Bittersweet,&quot; &quot;Jesus or a Gun,&quot; &quot;Sunburn&quot;) received some airplay. The songs &quot;Shimmer&quot; and &quot;Sunburn&quot; are also featured on the charitable album, Live in the X Lounge.\n\nAfter laying low for two and a half years, Fuel came back with their second album, Something Like Human, in 2000 and scored a Top 40 hit with &quot;Hemorrhage (In My Hands)&quot; (#30), as well as going platinum with the album.\n\nA third album, Natural Selection, came out in 2003, which spawned the hit single &quot;Falls On Me&quot;, and was another big seller.\n\nFuel released its greatest hits album, The Best of Fuel on December 13, 2005.\n\nOn February 7, 2006, Fuel announced through their website that singer Brett Scallions had left the band. The band (now just Carl Bell and Jeff Abercrombie) said that he left on friendly terms. &quot;We will all miss him and we wish him the best&quot;, Bell wrote in a letter on their website.\n\nFuel had already laid down the instrumental tracks for their fourth album and soon started auditioning singers so the band could move forward. Abercrombie and Bell took notice of American Idol contestant Chris Daughtry, after he performed &quot;Hemorrhage (In My Hands)&quot; on the show and the single shot up to the Top 10 download list on iTunes and stayed there for a number of days. This also sparked interest in other Fuel songs, which began to appear in the Top 100 download chart on iTunes. On March 3, 2006, judge Randy Jackson stated in an interview that Daughtry had been offered the opportunity to become Fuel&amp;#039;s new lead singer.[1] Fuel confirmed their interest on their official website, on which they called the show &quot;Am Idol&quot;. On May 11, 2006, Abercrombie and Bell appeared on the TV show Extra to officially offer Daughtry the job.[2] However, though flattered, Daughtry has turned down this offer.[3]\n\nTommy Stewart, formerly of Godsmack, was named as Fuel&amp;#039;s drummer on Fuel&amp;#039;s Myspace page. [4]\n\nOn June 8, 2006, Carl announced that the band has found a new lead singer and is only awaiting approval from their record label before they could publicly announce who they have brought in. [5]\n\nOn July 25, 2006, Carl Bell posted on Fuel&amp;#039;s official website that they have entered the studio to record a track. They officially entered the studio in mid-August with producer Scott Humphrey to record their fourth album. Tommy Lee and Josh Freese has helped with additional drums on the new album. The band have posted photos from within the studio fairly often on the band&amp;#039;s website and Myspace.","torrent":{"xt":"urn:btih:94b76c68c0ac04dd42b0e7f62be06c688c453a4b","amp;dn":"Fuel+-+3+Disc+-+Natural+Selection+-+Sunburn+-+Something+Like+Hum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94b76c68c0ac04dd42b0e7f62be06c688c453a4b","infoHashBuffer":{"type":"Buffer","data":[148,183,108,104,192,172,4,221,66,176,231,246,43,224,108,104,140,69,58,75]},"announce":[],"urlList":[]}}