{"title":"Rosa Luxemburg - Reform or Revolution + The Mass Strike (2 page","uid":11380488,"size":4987686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94d9026a1e03ed5feca9b516a74ea968a8de9de2&amp;dn=Rosa+Luxemburg+-+Reform+or+Revolution+%2B+The+Mass+Strike+%282+page+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Inua1","files":1,"time":1415209263,"description":"Title: The Essential Rosa Luxemburg: Reform or Revolution and the Mass Strike \nAuthor: Rosa Luxemburg \nEditor: Helen Scott\nISBN-10: 1931859361\nISBN-13: 978-1931859363\n\nRosa Luxemburg was a Marxist revolutionary and a member of the SPD in Germany in the early 20th century. She became actively involved in Socialist politics early in her life, and was one of the few radical left-wing figures that opposed Lenin's and Trotsky's Bolshevik dictatorship and their political and terror practises in the Russian Revolution. Her brand of Marxism, which was much closer to Marx's historical analysis than the Communists' which followed the 1917 Revolution, focused on democracy and a belief in mass participation of the working class in the revolution and political life of the society. Although influential in the early 20th century, after her murder in 1919 and the creation of the Soviet Union, she has been largely forgotten as Leninism, or its sub-branches, took over the ideological line of the radical left until the Soviet collapse in 1991.\nIn this collection, two of the most important and accessible works of Luxembourg are represented. The first, titled &quot;Reform or Revolution?&quot; is a classic Marxist defence to the idea that a proletariat revolution is necessary to accomplish Socialism. The passage is mostly a response to Eduard Bernstein, an important Revisionist Socialist of the time, and clearly outlines where Orthodox Marxism and Revisionist Socialism differ and oppose each other. Luxemburg's argument is sharp and to the point, making it a great read even if you disagree with her opinion and approach.\nThe second text is titled &quot;The Mass Strike&quot; and it deals with the idea of the mass strike, and its relation to Socialism. Luxemburg discusses the Russian Revolution of 1905, and how the mass strike developed spontaneously by the workers, giving a Marxist interpretation to the event. This work is more technical and a bit outdated, but shows again a classic Marxist approach.\n\nIn conclusion, Luxemburg is still a delight to read, and an important thinker in the history and tradition of Socialism. Her work expresses the political and social tensions of her times, giving this work, apart from an ideological, a historical significance.\n\n \nHelen Scott is a professor of postcolonial literature at the University of Vermont","torrent":{"xt":"urn:btih:94d9026a1e03ed5feca9b516a74ea968a8de9de2","amp;dn":"Rosa+Luxemburg+-+Reform+or+Revolution+%2B+The+Mass+Strike+%282+page+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d9026a1e03ed5feca9b516a74ea968a8de9de2","infoHashBuffer":{"type":"Buffer","data":[148,217,2,106,30,3,237,95,236,169,181,22,167,78,169,104,168,222,157,226]},"announce":[],"urlList":[]}}