{"title":"Color &amp; Draw for kids v4.0 apk android {ms5d} [AMRG]","uid":8850452,"size":30973584,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:95344e6f78f12c30398bf03c4539dc8007c5644c&amp;dn=Color+%26amp%3B+Draw+for+kids+v4.0+apk+android+%7Bms5d%7D+%5BAMRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ms5d","files":4,"time":1377507943,"description":"\n             ms5d and Android Mafia Releaser Group AMRG  PROUDLY PRESENTS\n                                                                                   _____________________________________\n\nColor &amp; Draw for kids v4.0 {ms5d} [AMRG] for Android\n                                                                                   _____________________________________\n\n                                                                                                         File Details:\n                                                                                  ______________________________________\n\nVersion: 4.0\nSize: 29.5 MB\nRequired: Android 2.2 and up\nPrice: $1.99\nGoogle Play Review: 4.2 out of 5\nRelease time: 2013-August 12\nDevelopers: Tipitap \n                                   \n                                                                               ________________________________________\n     \nDescription:\n\nColor &amp; Draw is a complete artistic solution for kids. As always, NO banner ads. Google Play Editor's Choice and Featured in Google Play 2011.\nIt invites kids to draw and color. It has coloring pages with recorded voice invitations, custom backgrounds to draw on and more.\nThis version now supports tablets and phones.\n\nNEW in this version:\n- 4 new coloring tools.\n- the ability to draw on photos.\n- new art store with more coloring pages.\nTipitap pushes the limits of traditional coloring apps harnessing the possibilities of the touch screen environments. Color &amp; Draw boasts beautifully crafted, specially designed springboard drawings, voice recorded invitations for all drawing for children to add to or complete the drawings, a lovely color palette, multiple stroke sizes and erasers, and stickers. Kids or their parents can share their creations via email or save them to the device's gallery.\n\nAPP FEATURES\n* 4 Drawing Tools: crayons, brushes, pencils and air brush.\n* 50 cute and smart, custom illustrations by our professional art department\n* Fun, age-appropriate themes: animals, professions and natural settings\n* Save drawings to the in-app Art Gallery, your device photo album or share them via email\n* 50 custom voice over invitations\n* multitouch support\n* zoom\n* undos\n* Real finger painting. Not the classic &quot;the-machine-fills-it-for-you&quot; app engine! Kids develop and improve their fine motor skills and creativity.\n* Support for multitouch\n* Limited curated color palette. Enough colors choices for a full spectrum of artistic expression yet restricted so kids are not overwhelmed by too many options. \n* Multiple eraser options\n\nIt is really 3 apps in 1:\n1. A drawing and sketching app with white and black backgrounds.\n2. A coloring book app with 50 exquisite drawings of fun topics including animals, professions and landscapes. It's an Artistic Springboard where some drawings are &quot;incomplete&quot; so children, guided by voice over instructions, can creatively interact with the drawing.\n3. a photo decorator.\n\nReal finger painting!\nDigital coloring books can be entertaining, but they can instill passivity in kids. Tap and fill coloring or a paint engine that keeps your strokes within the lines take all the fun and effort and can scarcely be called coloring. This gets boring fast. Apps that only offer blank pages for 'free drawing' can be a little intimidating for the youngest children. And many so-called activity books are too ambiguous or too difficult for little children to decode on their own, leaving them asking: &quot;Dad, what do I draw now?&quot; and &quot;Mom, what am I supposed to do here?&quot;\n\nInstructions:\n\nInstall the apk,\nEnjoy.\n\n\nDon't forget to seed.If you like this then support the developers by buying.","torrent":{"xt":"urn:btih:95344e6f78f12c30398bf03c4539dc8007c5644c","amp;dn":"Color+%26amp%3B+Draw+for+kids+v4.0+apk+android+%7Bms5d%7D+%5BAMRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95344e6f78f12c30398bf03c4539dc8007c5644c","infoHashBuffer":{"type":"Buffer","data":[149,52,78,111,120,241,44,48,57,139,240,60,69,57,220,128,7,197,100,76]},"announce":[],"urlList":[]}}