{"title":"Ma Mere Prefere Les Jeunes / My Mother Prefers Young Men (2016/W","uid":15710404,"size":2023834085,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:954d5109b1e133a8edf8eb19cbfd156d818719ad&amp;dn=Ma+Mere+Prefere+Les+Jeunes+%2F+My+Mother+Prefers+Young+Men+%282016%2FW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":7,"uploader":"ImgSnaps","files":1,"time":1472562298,"description":"Ma Mere Prefere Les Jeunes / My Mother Prefers Young Men (2016/WEBRip/HD)\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57c56874c2227.html\r\n \nhttp://imgsnaps.com/img2-57c56874c6b5a.html\r\n\r\n\r\nFrench description: Jane, la quarantaine, occupe ses journees en donnant des cours d’art a domicile. Clara, sa fille, vient juste de feter ses 18 ans et doit partir a l’autre bout du pays pour ses etudes. Voila qui laisse le champ libre a Jane pour assouvir ses pulsions sexuelles. Bien qu’elle ait un copain de son age, Jane prefere de loin baiser avec ses jeunes etudiants ou des inconnus rencontres dans des bars. Il faut dire qu’avec son corps aux formes genereuses, ses gros seins naturels et une libido tres developpee, les hommes qu’elle rencontre ne resistent jamais bien longtemps avant de tomber sous son charme. Clara, de son cote est attiree par les hommes plus ages et Eric, son nouveau beau-pere est plutot a son gout. Pour se venger de sa mere qui a profite de son absence pour se taper son petit copain, Clara fera tout pour seduire Eric et verifier si il est aussi bon amant que le pretend sa mere.\r\n\r\nEnglish description: Jane, a 40 something woman works at home giving art classes. Clara, her daughter just turned 18 and has to go across the country to go to college. That leaves Jane plenty of time to fulfill her sex fantasies. Although she has a boyfriend her age, Jane prefers to fuck her young male students or strangers met in bars. With her curvaceous body, her natural tits and an impressive libido, the men she meets never say no before getting in between her legs. Clara on the other hand is attracted by older guys and she likes Eric, her new step-father, a lot. Recently, her mother took advantage of her boyfriend while Clara was away. To make things even, Clara will do anything to see if Eric is such a good fuck","torrent":{"xt":"urn:btih:954d5109b1e133a8edf8eb19cbfd156d818719ad","amp;dn":"Ma+Mere+Prefere+Les+Jeunes+%2F+My+Mother+Prefers+Young+Men+%282016%2FW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"954d5109b1e133a8edf8eb19cbfd156d818719ad","infoHashBuffer":{"type":"Buffer","data":[149,77,81,9,177,225,51,168,237,248,235,25,203,253,21,109,129,135,25,173]},"announce":[],"urlList":[]}}