{"title":"Blowing Up Russia: The Secret Plot to Bring Back KGB Terror","uid":5623484,"size":1518053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9654b819b7a618d49d7258d198f6bccbdd6af919&amp;dn=Blowing+Up+Russia%3A+The+Secret+Plot+to+Bring+Back+KGB+Terror&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Djofullinn","files":1,"time":1276374133,"description":"Editorial Reviews\nProduct Description\nBlowing Up Russia contains the allegations of ex-spy Alexander Litvinenko against his former spymasters in Moscow which led to his being murdered in London in November 2006. In the book he and historian Yuri Felshtinsky detail how since 1999 the Russian secret service has been hatching a plot to return to the terror that was the hallmark of the KGB. Vividly written and based on Litvinenko's 20 years of insider knowledge of Russian spy campaigns, Blowing Up Russia describes how the successor of the KGB fabricated terrorist attacks and launched a war. Writing about Litvinenko, the surviving co-author recounts how the banning of the book in Russia led to three earlier deaths.\nAbout the Author\nYuri Felshinsky studied history at the Moscow State Pedagogical Institute. In 1978 he immigrated to the US and studied history at Brandeis University and Rutgers, where he received his Ph.D. He was the first citizen of a foreign state to be awarded a doctoral degree in Russia.\n\nHis previous books include: &quot;Towards a History of Isolation &quot; (London 1988; Moscow 1991);&quot;The Failure of World Revolution&quot; (London 1991; Moscow 1992); &quot;Big Bosses&quot; (Moscow 1999).\n\nAlexander Litvinenko served in the Russian military for more than 20 years achieving the ranks of Lieutenant-Colonel. In 1988 he served in the counterintelligence agencies of the Soviet KGB and from 1991 in the Central Staff of the MB-FSK-FSB, specializing in counter-terrorist activities and organized crime.\n\nHe worked in the most secret areas of the KGB, the Department for the Analysis of Criminal Organizations, as a senior operational officer and deputy head of the Seventh Section.\n\nIn 1988, at a Moscow press conference, he publicly criticized the leadership of the FSB and disclosed a number if illegal orders which he had received. In 1999 he was arrested on trumped-up charges and imprisoned. After winning his case, he was arrested again and charged with added crimes against the state.\n\nHe escaped from Russia, and was granted political asylum in May 2001 by Great Britian where he lived until he was poisoned in November 2006. ","torrent":{"xt":"urn:btih:9654b819b7a618d49d7258d198f6bccbdd6af919","amp;dn":"Blowing+Up+Russia%3A+The+Secret+Plot+to+Bring+Back+KGB+Terror","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9654b819b7a618d49d7258d198f6bccbdd6af919","infoHashBuffer":{"type":"Buffer","data":[150,84,184,25,183,166,24,212,157,114,88,209,152,246,188,203,221,106,249,25]},"announce":[],"urlList":[]}}