{"title":"Business Continuity Management Building an Effective Incident Ma","uid":6233061,"size":14619780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96f3a639f7ae4911a27ec4c6d389fb1fdcea3fb4&amp;dn=Business+Continuity+Management+Building+an+Effective+Incident+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"daemonx0x","files":1,"time":1299774535,"description":"Written by Michael Blyth-one of the world's foremost consultants in the field of business contingency management-this book provides cost-conscious executives with a structured, sustainable, and time-tested blueprint toward developing an individualized strategic business continuity program. This timely book urges security managers, HR directors, program managers, and CEOs to manage nonfinancial crises to protect your company and its employees.\n\nDeveloping and utilizing a business continuity plan protects your company, its personnel, facilities, materials, and activities from the broad spectrum of risks that face businesses and government agencies on a daily basis, whether at home or internationally. Business Continuity Management presents concepts that can be applied in part, or full, to your business, regardless of its size or number of employees. The comprehensive spectrum of useful concepts, approaches and systems, as well as specific management guidelines and report templates for over forty risk types, will enable you to develop and sustain a continuity management plan essential to compete, win, and safely operate within the complex and fluid global marketplace.","torrent":{"xt":"urn:btih:96f3a639f7ae4911a27ec4c6d389fb1fdcea3fb4","amp;dn":"Business+Continuity+Management+Building+an+Effective+Incident+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96f3a639f7ae4911a27ec4c6d389fb1fdcea3fb4","infoHashBuffer":{"type":"Buffer","data":[150,243,166,57,247,174,73,17,162,126,196,198,211,137,251,31,220,234,63,180]},"announce":[],"urlList":[]}}