{"title":"The Prof Andrew Basnett Mystery Collection - Elizabeth Ferrars","uid":11023665,"size":706953600,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:971661db5e78747de79f9e0dbb689c0c1c572891&amp;dn=The+Prof+Andrew+Basnett+Mystery+Collection+-+Elizabeth+Ferrars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"davieboy1966","files":90,"time":1410635861,"description":"Audio Books : Mystery and Suspense : Other quality : English\nAll from cassette tapes and unabridged. 32 kbps / 22 kHz Mono CBR MP3.\n\n\n\nAndrew Basnett is a retired professor of Botany living in London, who much to his consternation keeps stumbling across murder!\n\n#1. Something Wicked [1983], 5 hours 14 mins, read by James Saxon (thanks to Telpointer)\nWhen Andrew Basnett, retired professor of botany, took his nephew's cottage in a quiet Oxfordshire village for the winter, he didn't expect to find himself living opposite a woman locally reputed to have killed her husband, even though it was never proved. Nor did he expect to find himself cut off by a blizzard. And he certainly didn't expect to discover in his cold, dark living room the body of the village's second murder victim. Naturally suspicion centred on the 'murderess', but there were so many factors still unexplained about the first murder, so many dark secrets, such an atmosphere of evil within the village community, that Andrew Basnett was soon on the way to becoming a detective. And that was something he hadn't expected either...\n\n#2. Root of all Evil [1984], 6 hours 7 mins, read by John Hendry\nAndrew Basnett, retired professor of botany, never supposed that accepting aged cousin Felicity's invitation to stay with her in her Berkshire home over Easter would force him to turn detective. But the reappearance of a former housekeeper creates a mystery which intrigues Basnett, even though it is dismissed by Felicity's relatives when they arrive for a family party. However, Basnett soon finds himself investigating a murder with all too many suspects and apparently only one motive - money!\n\n#3. The Crime And The Crystal [1985], 6 hours 30 mins, read by Graham Roberts\nAndrew Basnett, that endearing professor of botany who has discovered in retirement a talent for solving crime, decides to accept an invitation from a former student, Tony Gardiner, to spend Christmas with him and his newly wedded wife in Adelaide, where, so Andrew observes, he has heard more bizarre murders have happened than anywhere else in Australia. He soon finds his quiet holiday shattered by two more murders, in which the most significant clue is a mysterious piece of crystal...\n\n#4. The Other Devil's Name [1986] , 6 hours 30 mins, read by John Hendry (thanks to Muse)\nAndrew Basnett, retired botany professor, reluctantly accompanied an old friend to her Berkshire home because her sister had received a blackmail letter. A letter which seemed to indicate that a murder had been committed in Lindleham, where strangely, several people were missing from their homes. Quietly Andrew investigates his friends' neighbours and discovers situations of deepening complexity. Not the least disconcerting is the realisation that his friends too have something to hide...\n\n#5. A Murder Too Many [1988], 5 hours 51 mins, read by Nigel Graham\nProf Andrew Basnett has returned to Knotlington for a conference, and also to help an old friend. Two years ago a member of the Fine Arts Dept. was murdered and Stephen is serving a life sentence for the crime, but many people thinks he's innocent...\n\n#6. Smoke Without Fire [1990], 6 hours 15 mins, read by George Hagen (thanks to Telpointer)\nThe peace of Prof Andrew Basnett's Christmas with friends in the country was shattered by a bomb explosion which killed their neighbour, a judge. Terrorists or a vengeful prisoner were the obvious perpetrators, but Andrew suspected the guilt lay nearer home...\n\n#7. A Hobby of Murder [1994], 5 hours 51 mins, read by Gene Foad\nRetired Professor, Andrew Basnett has been at loose ends since finishing the book that had for so long been his full-time companion. A country visit with his friends the Davidges seems just the diversion he needs. When a mystery writer is murdered at a dinner party, the solution lies in Basnett's close observation and ingenious powers of deduction...\n.\n#8. Choice of Evils [1995], 5 hours 10 mins, read by Garard Greene\nExpecting nothing more than a quiet holiday in the sleepy seaside town of Gallmouth, England, Andrew Basnett is first surprised to meet his nephew, Peter Dilly, quite by chance, and then both pleased and annoyed to find himself drawn into the activities of the town's first arts festival. It's pleasant to be invited for dinner at the home of successful novelist Simon Amory, but not so pleasant when Amory's sister-in-law is found shot to death in Amory's summer house, and Basnett's nephew is both the last person to have seen her alive and the first to see her dead. When a second woman of Amory's acquaintance is also found dead, the rather prickly writer would seem to be a prime suspect but Basnett has other ideas...\n\n* Note that these rare recordings are from cassette tapes that are in some cases quite old, thus the sound quality may not be pristine, but they are reasonably hiss free and clear.\nNo CD or Electronic Download versions of any of these titles are available to my knowledge.\n(The author only wrote eight titles in this well written cozy British murder mystery series.)\nElizabeth Ferrars (as her books are by-lined in England - she was known as E.X.Ferrars is the USA) was a prolific author of the classic British detective story who never quite achieved the top level, probably due to the fact that she did not develop a series character. However, in Ellery Queen's Mystery Magazine, she was described as the &quot;writer who may be the closest of all to Agatha Christie in style, plotting and general milieu,&quot; and the Washington Post described her as &quot;a consummate professional in clever plotting, characterization and atmosphere.&quot; (TKM)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:971661db5e78747de79f9e0dbb689c0c1c572891","amp;dn":"The+Prof+Andrew+Basnett+Mystery+Collection+-+Elizabeth+Ferrars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971661db5e78747de79f9e0dbb689c0c1c572891","infoHashBuffer":{"type":"Buffer","data":[151,22,97,219,94,120,116,125,231,159,158,13,187,104,156,12,28,87,40,145]},"announce":[],"urlList":[]}}