{"title":"The Imaginative Argument- A Practical Manifesto for Writers ","uid":9203249,"size":706947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97d2c8a116224df34c2a75dc40b1165e0b875ed9&amp;dn=The+Imaginative+Argument-+A+Practical+Manifesto+for+Writers+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1384638837,"description":"More than merely a writing text, The Imaginative Argument offers writers instruction on how to use their imaginations to improve their prose. Cioffi shows writers how they can enliven argument--the organizing rubric of all persuasive writing--by drawing on emotion, soul, and creativity, the wellsprings of imagination. While Cioffi suggests that argument should become a natural habit of mind for writers, he goes still further, inspiring writers to adopt as their gold standard the imaginative argument: the surprising yet strikingly apt insight that organizes disparate noises into music, that makes out of chaos, chaos theory.\n\nRather than offering a model of writing based on established formulas or templates, Cioffi urges writers to envision argument as an active parsing of experience that imaginatively reinvents the world. Cioffi's manifesto asserts that successful argument also requires writers to explore their own deep-seated feelings, to exploit the fuzzy but often profoundly insightful logic of the imagination.\n\nBut expression is not all that matters: Cioffi's work anchors itself in the actual. Drawing on Louis Kahn's notion that a good architect never has all the answers to a building's problems before its physical construction, Cioffi maintains that in argument, too, answers must be forged along the way, as the writer inventively deals with emergent problems and unforeseen complexities. Indeed, discovery, imagination, and invention suffuse all stages of the process.\n\nThe Imaginative Argument offers all the intellectual kindling that writers need to ignite this creativity, from insights on developing ideas to avoiding bland assertions or logical leaps. It cites exemplary nonfiction prose stylists, including William James, Ruth Benedict, and Erving Goffman, as well as literary sources to demonstrate the dynamic of persuasive writing. Provocative and lively, it will prove not only essential reading but also inspiration for all those interested in arguing more imaginatively more successfully.","torrent":{"xt":"urn:btih:97d2c8a116224df34c2a75dc40b1165e0b875ed9","amp;dn":"The+Imaginative+Argument-+A+Practical+Manifesto+for+Writers+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97d2c8a116224df34c2a75dc40b1165e0b875ed9","infoHashBuffer":{"type":"Buffer","data":[151,210,200,161,22,34,77,243,76,42,117,220,64,177,22,94,11,135,94,217]},"announce":[],"urlList":[]}}