{"title":"The Cambridge Ancient History Vol 01, Part 01 - Prolegomena and ","uid":6568682,"size":20005769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:980a6b5407c0eccb1f6f1ed4ed28f00146b4d34e&amp;dn=The+Cambridge+Ancient+History+Vol+01%2C+Part+01+-+Prolegomena+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"_F1_","files":1,"time":1311849615,"description":"Series: The Cambridge Ancient History, Volume 1, Part 1: Prolegomena and Prehistory\nEdited by: I. E. S. Edwards, C. J. Gadd and N. G. L. Hammond\nPublication Date: 1970\nHardback ISBN-13 9780521070515\nDigital Object Identifier (DOI): 10.1017/CHOL9780521070515\n\nOverview:\nPart 1 of volume I deals with the history of the Near East from about 3000 to 1750 B.C. In Egypt, a long period of political unification and stability enabled the kings of the Old Kingdom to develop and exploit natural resources, to mobilize both the manpower and the technical skill to build the pyramids, and to encourage sculptors in the production of works of superlative quality. After a period of anarchy and civil war at the end of the Sixth Dynasty the local rulers of Thebes established the so-called Middle Kingdom, restoring an age of political calm in which the arts could again flourish. In Western Asia, Babylonia was the main centre and source of civilisation, and her moral, though not always her military, hegemony was recognized and accepted by the surrounding countries of Anatolia, Syria, Palestine, Assyria and Elam. The history of the region is traced from the late Uruk and Jamdat Nasr periods up to the rise of Hammurabi, the most significant developments being the invention of writing in the Uruk period, the emergence of the Semites as a political factor under Sargon, and the success of the centralized bureaucracy under the Third Dynasty of Ur.","torrent":{"xt":"urn:btih:980a6b5407c0eccb1f6f1ed4ed28f00146b4d34e","amp;dn":"The+Cambridge+Ancient+History+Vol+01%2C+Part+01+-+Prolegomena+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"980a6b5407c0eccb1f6f1ed4ed28f00146b4d34e","infoHashBuffer":{"type":"Buffer","data":[152,10,107,84,7,192,236,203,31,111,30,212,237,40,240,1,70,180,211,78]},"announce":[],"urlList":[]}}