{"title":"Yo Yo Ma - Silk Road Recordings","uid":3884276,"size":308376749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:983b8a8af4c0f8bfc1a43737f5bb33de60cea5be&amp;dn=Yo+Yo+Ma+-+Silk+Road+Recordings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pan216","files":79,"time":1194810744,"description":"Yo Yo Ma - Silk Road Recordings\n &lt;a href=&quot;\nhttp://vip.tracker.thepiratebay.se/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vip.tracker.thepiratebay.se/announce&lt;/a&gt; \nMp3 bit rate: 128-192\nAll album art and id tags are present.\n\n\n\nHere are 3 albums (4 CDs) of Yo Yo Ma&amp;#039;s Silk Road \n\nRecordings.  I would describe the &quot;Musical Caravan&quot; as a \n\ncollection of folk music and the Silk Road Ensemble as a \n\nfusion of folk and modern classical.  Every musician heard \n\nhere is a virtuoso, but be advised, this is not for the \n\ncasual listener!\n\n\n\nThe Silk Road: A Musical Caravan\n\n&quot;What if Marco Polo had owned tape recorder?&quot; This \n\nintriguing concept is raised in the liner notes to this \n\nimpressive two-CD set, which wanders along ancient Asian \n\ntrade routes known as the Silk Road. The first disc, \n\nMasters &amp; Traditions, deals with formal styles performed \n\nby and for sophisticated connoisseurs. Meanwhile, the \n\nmusic on Minstrels and Lovers is played by amateurs who \n\nare part of daily life and thus reach a wider audience. \n\nThe imaginary caravan passes through Iran, Kazakhstan, \n\nChina, Uzbekistan, Mongolia, and Afghanistan, encountering \n\nnomads, mystics, and bards along the way. The instruments \n\nare scratchy, pungent, and/or serene, while the singers \n\nweave a potent spell out of a millennium&amp;#039;s worth of slow-\n\nchanging rural and urban vistas. In the opening essay, \n\ncellist Yo-Yo Ma, the project&amp;#039;s artistic director, pleads \n\nfor intercultural communication and empathy. This \n\ncompilation provides an exotic, brave, entertaining first \n\nstep in that direction.\n\n\nWhen Strangers Meet - The Silk Road Project\n\nThis recording includes music from Mongolia, China, \n\nPersia, Japan, Iran, Azerbaijan, and an improvisation on \n\nan Italian Renaissance street song, performed by musicians \n\nfrom all those countries, as well as America, on both \n\nEastern and Western instruments. Ma, who participates in \n\nevery piece either as soloist or part of the ensemble, \n\nplays cello and a Mongolian &quot;horse-head fiddle.&quot; There is \n\nalso a Mongolian soprano, who sings a traditional song \n\nnative to her region. For the uninitiated Western \n\nlistener, the music requires some getting used to. Much of \n\nit is based on rhythmic ostinatos. The melodies use \n\nOriental scales; the intonation is untempered; the music \n\nseems all color, texture, and atmosphere, without what \n\nmight be called themes; and repetition takes the place of \n\ndevelopment. Contrast is achieved through sudden change, \n\nbuildup by adding instruments. However, the music is often \n\nbeautiful, delicate, dreamy, or peaceful; every listener \n\nwill find his or her own favorite pieces. The playing is \n\nsplendid, with much inventive improvisation. Inevitably, \n\nMa&amp;#039;s tone and personality stand out, but he never \n\ndominates in fact or spirit. The booklet offers essays by \n\nMa and the project&amp;#039;s musicologist, Theodore Levin, \n\nphotographs of the players, and drawings of the Eastern \n\ninstruments.\n\n\nSilk Road Journeys: Beyond the Horizon\n\nIt is a perilous proposition when genres clash--and no \n\nsuch collaboration is more potentially fraught than when \n\nimprovisation-trained folk musicians sit in with Western \n\nclassical instrumentalists, who are taught to interpret a \n\nprinted score. The renowned cellist Yo-Yo Ma has devoted \n\nmuch of his professional life to such intercultural \n\nexperiments. But the traditions of nations situated along \n\nthe ancient Silk Road, which began in the Far East, \n\nmeandered through Asia and terminated in Europe, are \n\nespecially dear to him. These lushly arranged pieces range \n\nfrom moody scenic vistas to percussive Turkish hip-shakers \n\nand they make very pleasant listening. If they owe more to \n\nthe European canon than the ethnic sources that inspired \n\nthem, they are also the result of respectful give-and-take \n\nbetween a team of acknowledged masters. And nobody is more \n\nof a team player than Maestro Ma, an impassioned, fearless \n\nmusical seeker and a gracious, deferential colleague.\n\n\n\nPLEASE SEED!!!","torrent":{"xt":"urn:btih:983b8a8af4c0f8bfc1a43737f5bb33de60cea5be","amp;dn":"Yo+Yo+Ma+-+Silk+Road+Recordings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"983b8a8af4c0f8bfc1a43737f5bb33de60cea5be","infoHashBuffer":{"type":"Buffer","data":[152,59,138,138,244,192,248,191,193,164,55,55,245,187,51,222,96,206,165,190]},"announce":[],"urlList":[]}}