{"title":"Io speriamo che me la cavo, [DVD5 - Ita - Sub Eng] Commedia [Tnt","uid":5012249,"size":4072386560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9869a91b62f7d7185a4ad7f52c754abcfa07fe5f&amp;dn=Io+speriamo+che+me+la+cavo%2C+%5BDVD5+-+Ita+-+Sub+Eng%5D+Commedia+%5BTnt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"year2012","files":14,"time":1248049683,"description":"Io speriamo che me la cavo, [DVD5 - Ita - Sub Eng] Commedia [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=%20Io%20speriamo%20che%20me%20la%20cavo&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nIo speriamo che me la cavo\nby anno2036\n\nLocandina del film &lt;a href=&quot;\nhttp://www.mymovies.it/filmclub/2006/07/215/locandina.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mymovies.it/filmclub/2006/07/215/locandina.jpg&lt;/a&gt;\n\nSCHEDA DEL FILM\nVisit the IMDB link: http://www.Imdb.com/title/tt0107225\n\n\n\nTRAMA\nPer un errore del computer del Ministero della Pubblica Istruzione, il maestro Marco Tullio Sperelli (Paolo Villaggio), che aveva chiesto il trasferimento alla scuola elementare di Corsano, in Liguria, vicino casa sua, viene invece mandato a Corzano, un paesino in provincia di Napoli, e destinato ad una terza elementare.\nSi trova subito in una condizione piuttosto tragica: la classe assegnatagli sarebbe costituita da una ventina di bambini, ma lui al suo arrivo ne trova solo tre. Il quarto deve andare a cercarlo al suo domicilio e gli altri li trova per le strade della cittÃƒÂ , tra storie di povertÃƒÂ  e di microcriminalitÃƒÂ . Il maestro ha notevoli problemi ad adattarsi alla vita tipica dello stereotipo del sobborgo meridionale; vale a dire mancanza totale di organizzazione e di rispetto delle regole. Ad esempio, la preside ÃƒÂ¨ la moglie di un politico e non fa nulla nel suo istituto, il bidello ÃƒÂ¨ il vero capo della scuola e vende agli alunni gesso e carta igienica intascando grosse somme, il sindaco favoreggia il lavoro minorile clandestino e i bambini dicono diverse volgaritÃƒÂ  e dimostrano un'elevata ignoranza.\nQuando i ragazzi cominciano ad aver fiducia nel maestro, e questo comincia ad affezionarsi a loro, arriva la notizia del nuovo trasferimento al Nord del loro insegnante. Tutta la classe, con la direttrice, ÃƒÂ¨ alla stazione per salutare il maestro Sperelli, che parte. Durante il viaggio, legge il tema &quot;su di una parabola evangelica&quot; che un suo allievo gli ha consegnato all'ultimo momento; il tema del piccolo napoletano, che commuove il maestro, si conclude con la frase io speriamo che me la cavo.\n\nCURIOSITA'\nLiberamente tratto dal best seller di Marcello D'Orta, Io speriamo che me la cavo, il film ÃƒÂ¨ ambientato nel paesino di &quot;Corzano&quot;: una storpiatura del nome di un paese davvero esistente, Arzano (il nome fu modificato per evitare problemi giudiziari, dato che il comune viene rappresentato con case cadenti, immondizia in ogni dove e strade completamente diroccate).\nIl film, in realtÃƒÂ , ÃƒÂ¨ stato girato soprattutto nel Borgo Antico di Taranto, con alcune scene a Corato, anche se non mancano riprese realmente effettuate nella provincia di Napoli (come la scena dell'arresto di un alunno da parte dei carabinieri, girata nei pressi della Villa Pignatelli di Montecalvo a San Giorgio a Cremano), nella Reggia di Caserta ed anche a Tivoli, in provincia di Roma.\n\nRECENSIONE\nfonte:  Visit this link: http://magazine.libero.it/cinema/bd/schedafilm.php?sch=25447\nQuesto film lo si puÃƒÂ² volentieri collocare tra i migliori di Lina Wertmuller; sentimenti e freschezza di espressione. Non ÃƒÂ¨ mai facile dirigere e far recitare i bambini con naturalezza, evitando leziosaggini fastidiose. La trama ÃƒÂ¨ di per se fragile e si ÃƒÂ¨ addebitato al maestro trasferito dall'Italia del nord una lentezza eccessiva in quanto personaggio. Al contrario Paolo Villaggio lo ha compiutamente colto, lasciandosi catturare dalle voci pigolanti dei suoi allievi, comprendendoli nelle marachelle e furbizie, ma anche sapendoli capire nelle esperienze quotidiane e in quella espressione di dolore, che da secoli sedimenta perfino negli occhi dei bambini napoletani: per finire affascinato da bizzarrie e dolcezze, da melanconie e sorrisi nella confusione generale. Villaggio a tratti sognante, ma sempre partecipe, ÃƒÂ¨ stato delicato e bravissimo e gli allievi irresistibili. Il dialetto, con i suoi sapori, i suoi guizzi, il necessario e vivido miscuglio di allegria , di speranza e di scetticismo da sostanza e fa da mediatore e persuasore. Qua e la, probabilmente inevitabili, anche spunti e ritmi da sceneggiata (l'arresto da parte dei carabinieri di un ragazzo dei vicoli, con conseguenti clamori, lacrime e coralitÃƒÂ  del quartiere). Altrettanto inevitabile nello sfondo (ma pure in una miriade di echi e notazioni spicciole) la cittÃƒÂ  ed il clima che si conoscono, senza per fortuna ricorrere a battibecchi e sfide Nord-Sud ultra acusate. Dalle labbra di alcuni bambini, per i quali la fanciullezza ÃƒÂ¨ stagione precoce e troppo presto finisce nel disincanto, fuoriesce qualche parolaccia\n\nCARATTERISTICHE DEL DVD\nDurata: 100 min.\nLingue: Italiano\nSottotitoli: Inglese\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:9869a91b62f7d7185a4ad7f52c754abcfa07fe5f","amp;dn":"Io+speriamo+che+me+la+cavo%2C+%5BDVD5+-+Ita+-+Sub+Eng%5D+Commedia+%5BTnt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9869a91b62f7d7185a4ad7f52c754abcfa07fe5f","infoHashBuffer":{"type":"Buffer","data":[152,105,169,27,98,247,215,24,90,74,215,245,44,117,74,188,250,7,254,95]},"announce":[],"urlList":[]}}