{"title":"Centauri Dreams Imagining and Planning Interstellar Exploration ","uid":8871957,"size":151960054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:987d2b233a672991b10379d63e5821aab3daf835&amp;dn=Centauri+Dreams+Imagining+and+Planning+Interstellar+Exploration+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":5,"time":1378090178,"description":"&quot;Gilster introduces the challenges of imagining and planning interstellar exploration by leading readers through the difficulties of reaching and exploring the nearest bright star, Alpha Centauri. Seeded by ideas and concepts of the late Robert Forward, the narrative is framed as a learning process undertaken simultaneously by writer and reader. Although Alpha Centauri is astronomically nearby, a postulated trip by robot spacecraft, followed by manned exploration, would take 50 to 1,000 years, depending on the type of spacecraft propulsion used. Various methods for interstellar travel are introduced and discussed, including solar sails that use the power of starlight, nuclear fusion, antimatter hybrid systems, and beamed laser propulsion. One challenge is to get there in a reasonable time so that funding support, public interest, and events on Earth will not divert attention from the mission. Another challenge is timing the mission relative to available technology, because with better technology it might be possible to send a later robot on the same mission in less time. The book has no figures, tables, or illustrations but does include 30 pages of notes and an adequate 14-page index. Though the concepts presented are often fanciful, this book will appeal to readers who wonder about the future of exploration beyond the solar system. Summing Up: Highly recommended. General readers; professionals.&quot; (W. E. Howard III, CHOICE, March 2005) ","torrent":{"xt":"urn:btih:987d2b233a672991b10379d63e5821aab3daf835","amp;dn":"Centauri+Dreams+Imagining+and+Planning+Interstellar+Exploration+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987d2b233a672991b10379d63e5821aab3daf835","infoHashBuffer":{"type":"Buffer","data":[152,125,43,35,58,103,41,145,177,3,121,214,62,88,33,170,179,218,248,53]},"announce":[],"urlList":[]}}