{"title":"Goatsnake - Trampled Under Hoof (2004) [FLAC]","uid":6414808,"size":205177901,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:991c163a723f7de4af98f4cdc039dd046cff28bb&amp;dn=Goatsnake+-+Trampled+Under+Hoof+%282004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zibbik","files":14,"time":1306135027,"description":"\nArtist: Goatsnake\nTitle: Trampled Under Hoof \nGenre: Stoner Rock,Doom Metal\nOrigin: US\n\nTracklist:\n\n1 Portraits of Pain 7:00\n2 Black Cat Bone 2:52\n3 Juniors Jam 9:05\n4 Burial at Sea (Saint Vitus) 8:41\n5 Hot Rod (Black Oak Arkansas) 3:19\n\nBand:\nGreg Anderson (guitars) [Teeth of Lions Rule the Divine, Sunn O))), Thorr's Hammer]\nPete Stahl (vocals) [Orquesta del Desierto]\nGreg Rogers (drums) [The Obsessed]\nScott Reeder (bass) [The Obsessed, Unida, Kyuss, Butcher]\n\nAfter two of the best outings into doom/stoner metal in the past decade - 1999's &quot;1&quot; and 2000's &quot;Flower of Disease&quot; - and the powerful EP &quot;Dog Days&quot;, Goatsnake returned to good form with the EP &quot;Trampled Under Hoof&quot;, albeit slightly short at roughly 30 minutes.\n\nAnderson and Stahl are without doubt a fine pairing, Stahl's distinct vocal delivery adds the infectious bluesy choral lines, and Anderson is well, a monster on the guitar, as anyone who has heard his work with doom legends Sunn O))) will second. And the two are in fine form in the EPs opener Portraits of Pain which fuses a slow brooding opening riff with expert time changes and one of the most sublime closing sections the band has ever created. The adrenaline is at full flight with Stahl crying `like your mother before your sacrifice' and the band pummelling big downtuned riffs, all to be slowed back down to the opening crawling pace. A wonderful showcase of the bands talents.\nBlack Cat Bone contrasts the slow booming ending with its relatively fast pace and abundant energy. In case anyone doubted Anderson's ability to create superb riffs this song will change that. At just under 3 minutes it is a short and sharp piece and will get your head bobbing. Then things slow down to ultimate doom pace with Junior's Jam. Opening with atmospheric effects, the best riff of the album lurches in and pummels the listener. The song has a similar structure to Portraits of Pain, starting at punishing crawl pace, speeding up and then back to the opening riff for good measure (and also some farmyard animal effects). And in no way does it feel repetitive. A classic Goatsnake song.\nThe next two tracks are covers, the first is Burial at Sea, a St. Vitus cover. The recording isn't prefect but it doesn't need to be. It is an almost perfect adaptation for Stahl and a great tribute to the pioneering classic act. The next cover is Hot Rod originally played by the obscure act Black Oak Arkansas, and is not really up to the standard Goatsnake set themselves, but it is a fun way to end an excellent EP.\nHopefully there will be more in the future from this fine band, these 5 tracks are very good and showcase classic doom metal, but it doesn't quite quench the thirst for more of the Snake. \n\n","torrent":{"xt":"urn:btih:991c163a723f7de4af98f4cdc039dd046cff28bb","amp;dn":"Goatsnake+-+Trampled+Under+Hoof+%282004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"991c163a723f7de4af98f4cdc039dd046cff28bb","infoHashBuffer":{"type":"Buffer","data":[153,28,22,58,114,63,125,228,175,152,244,205,192,57,221,4,108,255,40,187]},"announce":[],"urlList":[]}}