{"title":"Manowar - Battle Hymns (1982), [LOSSY MP3 320 kbps] Heavy metal ","uid":4851199,"size":86481995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99ad35fb4ace3b03422e9c2f62ae8a517919036d&amp;dn=Manowar+-+Battle+Hymns+%281982%29%2C+%5BLOSSY+MP3+320+kbps%5D+Heavy+metal+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"year2012","files":8,"time":1239883031,"description":"Manowar - Battle Hymns (1982), [LOSSY MP3 320 kbps] Heavy metal [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Manowar%20-%20Battle%20Hymns%20(1982)&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nManowar - Battle Hymns\nby anno2036\n\nCover\n Visit this link: http://upload.wikimedia.org/wikipedia/en/c/cc/ManowarBattlehymns.jpg\n\nAlbum\nTitle: Battle Hymns\nYear:  1982                                    \nGenre: Heavy metal\nLabel: Liberty Records\n\nTracklist\n1. Death Tone\n2. Metal Daze\n3. Fast Taker\n4. Shell Shock\n5. Manowar\n6. Dark Avenger\n7. William's Tale\n8. Battle Hymn\n\nReview\nfonte:  Visit this link: http://truemetal.it/reviews.php?op=albumreview&amp;id=52\nCon questo primo full lenght della storica band americana ci troviamo, senza ombra di dubbio, davanti ad un album dal notevole valore storico. Un disco dove ÃƒÂ¨ presente un Epic Metal ancora in una fase embrionale, si, proprio quell' Epic Metal che ha caratterizzato in modo schiacciante e superbo i loro 3 dischi successivi e che tanto ha fatto scuola. Battle Hymns esprime un'epicitÃƒÂ  non ancora presente in modo marcato, infatti ÃƒÂ¨ un Heavy Metal grezzo e diretto che caratterizza principalmente il sound portante del lavoro, relegando &quot;solo&quot; due traccie (Dark Avenger e Battle Hymns, di cui parleremo in seguito) a manifesti di Epic Metal qui presenti.\nIl discorso ÃƒÂ¨ inaugurato da Death Tone song introdotta addirittura da un rombo di motocicletta che cede il passo all'energico quanto assolutamente devastante basso di DeMaio. La batteria di Hamzik ÃƒÂ¨ travolgente e la voce di Adams, giÃƒÂ  da queste prime battute, ÃƒÂ¨ caratterizzata dall'aggressivitÃƒÂ , l'estensione e la potenza vocale che sarÃƒÂ  presente in ogni album della band e che ne ha fatto uno dei piÃƒÂ¹ grandi Heavy metal singer di tutti i tempi. La seguente Metal Daze ÃƒÂ¨ un brano scritto per travolgere il pubblico in sede live (e, vi assicuro, ci riesce in maniera perfetta), mentre con il successivo duo Fast Taker (dal mitico refrain) e Shell Shok, la band mette a segno un ottimo colpo di irruenta hard'n heavy music. Con Manowar ci troviamo innanzi ad una canzone travolgente e potente, il vero Manowar hymn (bellissimo il glorioso finale che vedeva Eric &quot;The Warrior&quot; Adams cimentarsi nell'intonare il nome del gruppo con potenza e passione).\nMa il picco compositivo dell'album comincia con la successiva ed imprescindibile Dark Avenger, una canzone dal ritmo cadenzato e straordinariamente epico nel suo cupo e drammatico incedere. La song ÃƒÂ¨ resa &quot;leggendaria&quot; anche grazie alla partecipazione in essa del mitico Orson Welles (si, proprio lui, il genio del cinema) alla voce narrante!\nSe William's Tale ÃƒÂ¨ un assolo di basso che ha il compito di mostrarci tutta la classe di DeMaio, l'altro suo compito ÃƒÂ¨ sicuramente quello di spianare la strada al prossimo brano capolavoro. E cosÃƒÂ¬ ha inizio l'eroica ed epica Battle Hymns, aperta da un dolce arpeggio, la canzone si attesta ad essere uno dei cavalli da battaglia dell'intera discografia de gruppo. Il brano, dall'inizio potente, sontuoso e monolitico, ÃƒÂ¨ reso assolutamente immortale grazie anche al suo dolce intermezzo centrale che precede un successivo ritorno alle sonoritÃƒÂ  dure e massicce che ne hanno caratterizzato la prima parte. Una costruzione melodica semplice e geniale (che sarÃƒÂ  adottata anche in futuro!) che aveva la prerogativa di mettere in musica una sensazione di quiete tra la battaglia fatta di riff ed eroiche prestazioni vocali. La song addirittura si conclude grazie ad un bellico drumming ad opera di Scott che va cosÃƒÂ¬ a chiudere il principio di quella che si rivelerÃƒÂ  poi essere una delle piÃƒÂ¹ belle saghe epico-musicali mai scritte nella storia.\n\nBiography\nfonte:  Visit this link: http://it.wikipedia.org/wiki/Manowar\nI Manowar sono una band heavy metal nata ad Auburn, New York, nel 1980 dall'incontro tra il bassista del gruppo Joey DeMaio e il chitarrista Ross the Boss.\nIl nome del gruppo deriva da un termine usato nell'inglese arcaico, per l'appunto man o' war o man-o-war, che indicava una tipologia di antica nave da guerra a vela. Un'altra possibile traduzione ÃƒÂ¨ quella che intende man-o'-war una contrazione di man of war letteralmente uomo di guerra. I temi ricorrenti delle loro canzoni sono la mitologia, la guerra, la lealtÃƒÂ  e l'onore. I testi delle loro canzoni presentano quasi sempre elogi sulla musica heavy metal, che ÃƒÂ¨ visto non solo come un semplice genere musicale, ma come un vero e proprio stile di vita, di cui i Manowar si vantano di essere gli unici seguaci e portatori della parola.\nI Manowar sono tra i gruppi antesignani e fondatori del sottogenere epic metal; pionieristico in tal senso ÃƒÂ¨ soprattutto l'album Into Glory Ride, pubblicato nel 1983. Il gruppo detiene anche un vasto numero di record. In particolare rivendicano il titolo di &quot;band piÃƒÂ¹ rumorosa del mondo&quot; (precedentemente appartenuto ai MotÃƒÂ¶rhead) grazie al Guinness dei primati che ha registrato questo fatto. La band ÃƒÂ¨ infatti giunta a quota 129.5 decibel attraverso uno speciale equipaggiamento costruito da John &quot;Dawk&quot; Stillwell. Inoltre sono stati la prima band metal a includere argomenti di guerra, spade e metallo sia nelle loro canzoni che nelle loro copertine, a costruirsi un set di amplificatori e chitarre da sÃƒÂ© e su propria misura, ad aver registrato un album in Dolby 5.1 e detengono il record per il concerto metal piÃƒÂ¹ lungo della storia, con una prestazione di 5 ore ed 1 minuto in cui hanno eseguito oltre 50 brani.\n\nFormat\nMP3 - 320 Kbps - 44 kHz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:99ad35fb4ace3b03422e9c2f62ae8a517919036d","amp;dn":"Manowar+-+Battle+Hymns+%281982%29%2C+%5BLOSSY+MP3+320+kbps%5D+Heavy+metal+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ad35fb4ace3b03422e9c2f62ae8a517919036d","infoHashBuffer":{"type":"Buffer","data":[153,173,53,251,74,206,59,3,66,46,156,47,98,174,138,81,121,25,3,109]},"announce":[],"urlList":[]}}