{"title":"APTuner 3.08","uid":3922129,"size":1359873,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99d5fbea27672dced4c59fe57d5a6cc33fdcd68a&amp;dn=APTuner+3.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"electroacoustic","files":2,"time":1196877550,"description":"AP Tuner is a full feature chromatic tuner for your PC. The tuner is responsive and accurate (~0.1 cents). The detection algorithm has been improved to better find low and inharmonic notes. The tuning system is fully customizable with a custom temperaments and stretch tables, as well as adjusting Middle A. Finally, a new &quot;harmonic graph&quot; window has been added to assist in visualizing harmonic content over time.\nEditor&amp;#039;s review of AP Tuner AP Tuner takes a classic musician&amp;#039;s instrument tuner and puts it on the computer, while adding a few extra, useful features. It offers a &quot;note preset&quot; function that allows musicians to tune to the standard notes used by their instruments, as well as customizable temperaments. It has a harmonic graph feature that shows the nearby harmonics of the note being played, aiding in more precise tuning adjustments. The interface is smart and straightforward, with menus and settings logically organized and easy to find. Our main objection was that it works only in standalone mode, without an option to be used as a DirectX or VST plug-in inside one of the most popular audio-editing programs. This drawback alone may keep it out of professional recording studios, but we would otherwise happily recommend it to computer-friendly musicians.","torrent":{"xt":"urn:btih:99d5fbea27672dced4c59fe57d5a6cc33fdcd68a","amp;dn":"APTuner+3.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d5fbea27672dced4c59fe57d5a6cc33fdcd68a","infoHashBuffer":{"type":"Buffer","data":[153,213,251,234,39,103,45,206,212,197,159,229,125,90,108,195,63,220,214,138]},"announce":[],"urlList":[]}}