{"title":"Mindfulness And The Brain -- Dr. Jack Kornfield &amp; Dr. Daniel","uid":7969067,"size":375090997,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:99eb9e0a63185ffb0404a801965b5e12db32bfc6&amp;dn=Mindfulness+And+The+Brain+--+Dr.+Jack+Kornfield+%26amp%3B+Dr.+Daniel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"levijk","files":44,"time":1356780327,"description":"Course objectives:\n\n\nSummarize basic concepts of neurobiology and neuroplasticity\n\nExplain the difference between the concept of mind and the brain\n\nSummarize the Buddhist model of mental health\n\nCompare awareness with mental activity\n\nDiscuss how mindfulness practices can change the brain\n\nPractice mindfulness meditation exercises\n\nEvaluate the practical relevance of these insights on the individual and on the world as a whole\n\n\nThe Buddha Meets Neurobiology in the Science of Heightened Awareness\n\nMindful awareness creates scientifically recognized enhancements in our mental functions and interpersonal relationships. But how can we integrate this information into our personal or professional lives?\n\nIn theMindfulness and the Brain audio learning course, Jack Kornfield, PhD, and Daniel Siegel, MD, offer theoretical and experiential teachings on the power of inner transformation and the cultivation of a wise and loving heart.\n\nWhether youre a therapist, healer, educator, parent, meditation practitioneror anyone interested in developing a healthy mindthis training offers a practical exploration of what it means for our world and us to be able to nurture and sustain heightened awareness\n\n\nAn Integration of Head and Heart\n\nIn this training, youll discover how mindful practice helps reduce suffering and promote resilience; the resonance circuit that enables an individual to attune to oneself and others; and how intrapersonal attunement can catalyze mental, interpersonal, and psychological well-being.\n\nFrom scientific findings and down-to-earth Buddhist perspectives to memorable anecdotes and real-life stories that illustrate key concepts, Mindfulness and the Brain invites you to discover a more integrated and connected way of knowing and developing a wise and loving heart.\n\n\nCourse Highlights:\n\n\nClinical findings on the transformative power of interpersonal neurobiology\n\nThe structure of the mind and how understanding consciousness can lead to freedom\n\nNeural integration and how it helps create more balanced lives\n\nHow to incorporate compassion and forgiveness into our personal and professional life\n\nMore than six hours of essential teachings and tools for cultivating healthy change in ourselves and others","torrent":{"xt":"urn:btih:99eb9e0a63185ffb0404a801965b5e12db32bfc6","amp;dn":"Mindfulness+And+The+Brain+--+Dr.+Jack+Kornfield+%26amp%3B+Dr.+Daniel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99eb9e0a63185ffb0404a801965b5e12db32bfc6","infoHashBuffer":{"type":"Buffer","data":[153,235,158,10,99,24,95,251,4,4,168,1,150,91,94,18,219,50,191,198]},"announce":[],"urlList":[]}}