{"title":"Twinkie Chan's Crochet Goodies for Fashion Foodies","uid":9137977,"size":37191589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a09132b05c8030bbcc451755d9ba8bc566169a0&amp;dn=Twinkie+Chan%27s+Crochet+Goodies+for+Fashion+Foodies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KnitLady","files":-1,"time":1383452658,"description":"Eat your cake! And wear it too! Silly food-themed wearables you can make to keep up with the hottest new craft trend.\n\nWith Twinkie Chan's Crochet Goodies for Fashion Foodies, crocheters can have their cupcakes and wear them, too. The founder of her own popular line of food-inspired fashions, Twinkie Chan has whipped up a feast of head-turning scarves, mittens, hats, and more so that her many fans can learn to make her culinary creations at home.\n\nYou'll find recipes for food-themed scarves that feature sushi, salad, gingerbread men, buttered toast, eggs and bacon, ice-cream cones, popcorn boxes, and more. You'll also learn how to make a pair of strawberry fingerless mittens, a chocolate cupcake hat complete with a cherry on top, and even a coconut-lemon cake tissue box cozy. Twinkie Chan's Crochet Goodies for Fashion Foodies is divided into three chapters--Sweet Things, Fruits and Veggies, and Savory Stuff--and comes complete with an illustrated how-to section, lists of &quot;ingredients&quot; for each project, easy-to-follow, step-by-step directions, and full-color photos and illustrations. Beginning and experienced crafters alike will go wild for these quirky, colorful, wearable confections. ","torrent":{"xt":"urn:btih:9a09132b05c8030bbcc451755d9ba8bc566169a0","amp;dn":"Twinkie+Chan%27s+Crochet+Goodies+for+Fashion+Foodies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a09132b05c8030bbcc451755d9ba8bc566169a0","infoHashBuffer":{"type":"Buffer","data":[154,9,19,43,5,200,3,11,188,196,81,117,93,155,168,188,86,97,105,160]},"announce":[],"urlList":[]}}