{"title":"La storia in giallo 136 - Maria Goretti [Mp3 Ita] [TNTvillage]","uid":6606612,"size":71543245,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9a3142c37a0a5a83095a8481b8da59e18edce53e&amp;dn=La+storia+in+giallo+136+-+Maria+Goretti+%5BMp3+Ita%5D+%5BTNTvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"darayava","files":1,"time":1313423086,"description":"La storia in giallo 136 - Maria Goretti [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 22/10/2005\n\nMARIA GORETTI\n\n\nSiamo agli albori del 1900, e le condizioni di vita nelle campagne di tutta Italia sono al limite dell'umano. La famiglia Goretti, originaria delle Marche, decide di cercare lavoro nel Lazio e si ritrova catapultata nell'inferno delle paludi pontine, tra sporcizia, denutrizione e malaria. A farne le spese, quasi subito, ÃƒÂ¨ il padre di Maria. Ma un'altra tragedia ÃƒÂ¨ in agguato. Alessandro, figlio ventenne del capofamiglia Serenelli, con i quali i Goretti dividono la stessa abitazione, viene colto da raptus e tenta di violentarla, ma non ci riesce. Poi afferra un vecchio punteruolo e colpisce piÃƒÂ¹ volte la piccola Maria, che morirÃƒÂ  in ospedale poche ore dopo.\nAntonella Ferrera ospita in studio Giordano Bruno Guerri, che, a Santa Maria Goretti, ha dedicato nel 1985, un libro che ha fatto molto discutere: &quot;Povera santa, povero assassino. La vera storia di Maria Goretti&quot;.\n\n\nFile Details\n========================================\nName..........: 2005 - Maria Goretti.mp3\nFilesize......: 68Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:9a3142c37a0a5a83095a8481b8da59e18edce53e","amp;dn":"La+storia+in+giallo+136+-+Maria+Goretti+%5BMp3+Ita%5D+%5BTNTvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3142c37a0a5a83095a8481b8da59e18edce53e","infoHashBuffer":{"type":"Buffer","data":[154,49,66,195,122,10,90,131,9,90,132,129,184,218,89,225,142,220,229,62]},"announce":[],"urlList":[]}}