{"title":"La Diligencia (John Ford, John Wayne1939)(spanish).","uid":5010900,"size":621574202,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a4123b3d59aa6b09ffad0310dda8bc244c676b9&amp;dn=La+Diligencia+%28John+Ford%2C+John+Wayne1939%29%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zurera","files":1,"time":1247997432,"description":"AÃƒÂ±o 1939\nWestern\n91 minutos\n\nJohn Wayne, Claire Trevor, Andy Devine, John Carradine, Thomas Mitchell, Louise Platt, George Bancroft, Donald Meek, Berton Churchill, Tim Holt\n\n\nUn forajido llamado Ringo Kid comparte viaje en diligencia con otros variopintos compaÃƒÂ±eros: Dallas, una prostituta a la que han echado del pueblo; Hatfield, un jugador; Boone, un mÃƒÂ©dico borrachÃƒÂ­n; Peacock, un viajante de whisky; Gatewood, un banquero; la seÃƒÂ±ora Mallory, que estÃƒÂ¡ embarazada; el sheriff Curly y conductor Buck. El trayecto va desde Tonto hasta Lordsburg, a travÃƒÂ©s del desierto de Arizona, con la constante amenaza de los indios, ya que el indio GerÃƒÂ³nimo ha huido de la reserva y se alzado en armas. Las relaciones entre los viajeros son tensas. De repente, cerca de su destino, los apaches les atacan en medio de una llanura.\nUna de las grandes obras maestras de John Ford, considerado como el mejor realizador de la ÃƒÂ©poca dorada de Hollywood. El papel de Ringo Kid fue clave en la carrera de John Wayne, que se convirtiÃƒÂ³ en la estrella por excelencia del gÃƒÂ©nero. El film consiguiÃƒÂ³ dos Oscar en 1939, relativos a la mejor mÃƒÂºsica original y al mejor actor secundario, Thomas Mitchell. TodavÃƒÂ­a hoy resulta antolÃƒÂ³gica la escena del ataque de los apaches, de una planificaciÃƒÂ³n y ritmo impresionantes.","torrent":{"xt":"urn:btih:9a4123b3d59aa6b09ffad0310dda8bc244c676b9","amp;dn":"La+Diligencia+%28John+Ford%2C+John+Wayne1939%29%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a4123b3d59aa6b09ffad0310dda8bc244c676b9","infoHashBuffer":{"type":"Buffer","data":[154,65,35,179,213,154,166,176,159,250,208,49,13,218,139,194,68,198,118,185]},"announce":[],"urlList":[]}}