{"title":"Eminem - Curtain Call: The Hits [24 bit FLAC] vinyl","uid":8321066,"size":1602809774,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b2b1b40e9003cb78c2d800ae2bb35434d65a693&amp;dn=Eminem+-+Curtain+Call%3A+The+Hits+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"24.96","files":-1,"time":1364673742,"description":"  Eminem - Curtain Call: The Hits (2005) [24 bit FLAC] vinyl\n\n  Released: 2005\n  Source: INT2-90287 / US\n  Genre: Rap\n  Style: Hardcore Rap\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Intro \n  A2. Fack \n  A3. The Way I Am \n  A4. My Name Is \n  B1. Stan \n  B2. Lose Yourself \n  B3. Shake That \n  B4. Sing For The Moment \n  C1. Without Me \n  C2. Like Toy Soldiers \n  C3. The Real Slim Shady \n  C4. Mockingbird \n  C5. Guilty Conscience \n  D1. Cleaning' Out My Closet \n  D2. Just Lose It \n  D3. When I'm Gone \n  D4. Stan (Live)\n\n  If Eminem's Curtain Call: The Hits really is his final bow and not merely a clever denouement to his series of Eminem Show and Encore albums, it's a worthy way to retire. And even if he stages a comeback years from now, there's little question that the first five years of his career, spanning four albums plus a soundtrack, will be his popular and creative peak, meaning that the time is right for Curtain Call -- it has all the songs upon which his legend lies. Which isn't necessarily the same things as all the hits. There are a few odds and ends missing -- most notably one of his first hip-hop hits, &quot;Just Don't Give a F***,&quot; plus 2003's &quot;Superman&quot; and 2005's &quot;Ass Like That&quot; -- but all the big songs are here: &quot;Guilty Conscience,&quot; &quot;My Name Is,&quot; &quot;Stan,&quot; &quot;The Real Slim Shady,&quot; &quot;The Way I Am,&quot; &quot;Cleanin' Out My Closet,&quot; &quot;Lose Yourself,&quot; &quot;Without Me&quot; and &quot;Just Lose It.&quot; They're not presented in chronological order, which by and large isn't a problem, since the sequencing here not only has a good, logical momentum, alternating between faster and slower tracks, but they're all part of a body of work that's one of the liveliest, most inventive in pop music in the 21st century. The only exception to the rule are the three new songs here, all finding Shady sounding somewhat thin. There's the closing &quot;When I'm Gone,&quot; a sentimental chapter in the Eminem domestic psychodrama that bears the unmistakable suggestion that Em is going away for a while. While it's not up to the standard of &quot;Mockingbird,&quot; it is more fully realized than the two other new cuts here, both sex songs that find Shady sounding as if he's drifting along in his own orbit. &quot;Shake That&quot; has an incongruous Nate Dogg crooning the chorus, while the wildly weird &quot;Fack&quot; finds Eminem spending the entire track fighting off an orgasm; it seems tired, a little too close to vulgar Weird Al territory, and it doesn't help that his Jenna Jameson reference seems a little old (everybody knows that the busty porno &quot;It&quot; girl of 2005 is Jesse Jane; after all, she even was in Entourage). Even if these three cuts suggest why Eminem is, if not retiring, at least taking a long break, that's fine: they're reasonably good and are bolstered by the rest of the songs here, which don't just capture him at his best, but retain their energy, humor, weirdness, and vitality even after they've long become overly familiar. And that means Curtain Call isn't just a good way to bow out, but it's a great greatest-hits album by any measure.","torrent":{"xt":"urn:btih:9b2b1b40e9003cb78c2d800ae2bb35434d65a693","amp;dn":"Eminem+-+Curtain+Call%3A+The+Hits+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b2b1b40e9003cb78c2d800ae2bb35434d65a693","infoHashBuffer":{"type":"Buffer","data":[155,43,27,64,233,0,60,183,140,45,128,10,226,187,53,67,77,101,166,147]},"announce":[],"urlList":[]}}