{"title":"DVDFab 9.0.1.2 Final (cracked ChVL) [ChingLiu]","uid":7875571,"size":37065941,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9bdb7c3309f81cc67b8fb59472c732962f6a822a&amp;dn=DVDFab+9.0.1.2+Final+%28cracked+ChVL%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Ching_Liu","files":4,"time":1354330191,"description":"DVDFab 9.0.1.2 for Windows (November 30, 2012)\n\nNew: Added &quot;Version&quot; and &quot;Serial Number&quot; in Settings-&gt;Drives.\nNew: Added &quot;Prevent standby/hibernation/screensaver when processing&quot; feature.\nNew: Added &quot;Burn again&quot; feature.\nFix: A problem that the temp files are not deleted after burning.\nFix: A problem that cannot display the progress at task bar.\nFix: Some external subtitle problems in Blu-ray Copy and Bu-ray Ripper mode.\nFix: A problem that the volume name is wrong in task queue.\nFix: A problem that &quot;Always display only forced subpicture&quot; feature cannot work. \nFix: A problem that the summary info cannot be refreshed in certain cases.\nFix: A glitter problem of preview in certain cases.\nFix: A wrong link problem for renew.\nFix: A problem that DVDFab crashed when turn off subtitle in Preview.\nFix: A problem that cannot launch DVDFab in certain cases while an usb drive is connecting.\nFix: A crash problem when copying or ripping with a movie without any subtitle.\nFix: A problem that should not enable &quot;Remove HD Audio&quot; when the audio is not HD.\nFix: A problem that main window cannot be maximized in certain cases.\nFix: A truncation problem in Summary when the volume label is too long.\nFix: A problem that should not recognize blank DVD disc as a source.\nFix: A problem that cannot recognize blank disc for copying in certain cases.\nFix: A problem that cannot navigate to Full Disc mode from Split mode in certain cases.\nFix: A crash problem when opening with 2 channels PCM DVD in Ripper mode.\nFix: Added warning information when using &quot;Copy as 3D&quot; feature.\nFix: A problem that cannot create miniso file for folder source. \nFix: A crash problem when eject Blu-ray disc in Full disc mode.\nFix: A problem that missing &quot;Copy as Blu-ray 3D&quot;,&quot;Copy as Blu-ray 2D&quot; and &quot;Convert to Blu-ray SBS 3D&quot; in certain cases.\nFix: A problem that cannot distinguish &quot;Fake title&quot; by different color.\nFix: A no sound problem when ripping with some profiles, the bitrate of audio is too high. Should reduce the audio bitrate form &quot;main&quot; level to &quot;lc&quot;. \nFix: A problem that the progress bar of task queue display wrong in Video Converter mode. \nFix: A queue problem when creating multiple files to a DVD or Blu-ray.\nFix: A crash problem when opening a broken file source.\n\nOS: Windows 7 / Vista / XP (32-bit / 64-bit)\n\nLanguages : Multilanguage\n\nHomepaage : http://www.dvdfab.com/","torrent":{"xt":"urn:btih:9bdb7c3309f81cc67b8fb59472c732962f6a822a","amp;dn":"DVDFab+9.0.1.2+Final+%28cracked+ChVL%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bdb7c3309f81cc67b8fb59472c732962f6a822a","infoHashBuffer":{"type":"Buffer","data":[155,219,124,51,9,248,28,198,123,143,181,148,114,199,50,150,47,106,130,42]},"announce":[],"urlList":[]}}