{"title":"Succulent Paradise - Twelve Great Gardens of the World (gnv64)","uid":9722370,"size":101340315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9bfaea7d53fa514ee811cf1d81c3df1dd12ddf6d&amp;dn=Succulent+Paradise+-+Twelve+Great+Gardens+of+the+World+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":-1,"time":1394251716,"description":"Succulent Paradise - Twelve Great Gardens of the World\nby Gideon Smith and Estrela Figueiredo\nRandom House Struik | December 2013 | ISBN-10: 1431700908 | ePUB | 120 pages | 96.6 mb\n\nMost botanical gardens include succulents in their collections; few are devoted solely to them. In Succulent Paradise, the reader is taken on a verbal and visual tour of 12 exceptional succulent gardens.\nSee how a handful of landscaping and horticultural visionaries have juxtaposed indigenous and exotic plants with a blend of natural and created landscaping elements. Experience the impact and style of gardens in locations as diverse as steeply terraced Mediterranean cliffs, dusty Karoo plains, Mexico City's metropolis, California's canyons, and the red desert of Arizona. The authors have visited gardens around the world dedicated to the display, cultivation and propagation of succulent plants.\n\nIn Succulent Paradise, they have expressed their love of these tenacious, yet surprisingly glamorous, plants as well as appreciation for those whose vision and persistence has created abundance, promoted conservation, and left a legacy for future generations. This book features 12 of the world's top succulent gardens on three continents (Africa, Europe, Americas). Stunning photography captures the spirit of each garden. Accurate species identification makes this more than just another gardening book.\n\nAbout the Authors\nGIDEON SMITH is Chief Director: Biosystematics Research and Biodiversity Collections at the SA National Biodiversity Institute. He is involved in various national and international environmental associations and advisory committees. His interests are in the biology and classification of succulent plants, as well as landscaping and horticulture. South Africa's most prolific author on succulent plants, he has authored or co-authored Â±40 books, and more than 500 research and popular papers, mostly on succulents.\nDr. ESTRELA FIGUEIREDO is a research associate at Nelson Mandela Metropolitan University in Port Elizabeth and the University of Coimbra in Portugal. Her interests are in the African flora, plant classification, sustainable gardening, and landscaping. She has authored or co-authored books on aloes, ferns and Angolan flora.","torrent":{"xt":"urn:btih:9bfaea7d53fa514ee811cf1d81c3df1dd12ddf6d","amp;dn":"Succulent+Paradise+-+Twelve+Great+Gardens+of+the+World+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bfaea7d53fa514ee811cf1d81c3df1dd12ddf6d","infoHashBuffer":{"type":"Buffer","data":[155,250,234,125,83,250,81,78,232,17,207,29,129,195,223,29,209,45,223,109]},"announce":[],"urlList":[]}}