{"title":"No. 1 Ladies Detective Agency Series 1-13 Alexander McCall Smith","uid":9022737,"size":12689423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c25fe0e432d16a26fd02df9c6c905770459b9aa&amp;dn=No.+1+Ladies+Detective+Agency+Series+1-13+Alexander+McCall+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"tpbcopy","files":15,"time":1381306903,"description":"Books 7 and 9 are PDF...I have supplied PDF converted epubs if you want them......you've been warned...\n\nimage\n\nThe No. 1 Ladies' Detective Agency (No. 1 Ladies' Detective Agency #1)\n\nWorking in a mystery tradition that will cause genre aficionados to think of such classic sleuths as Melville Davisson Post's Uncle Abner or Robert van Gulik's Judge Dee, Alexander McCall Smith creates an African detective, Precious Ramotswe, who's their full-fledged heir.\n\nIt's the detective as folk hero, solving crimes through an innate, self-possessed wisdom that, combined with an understanding of human nature, invariably penetrates into the heart of a puzzle. If Miss Marple were fat and jolly and lived in Botswana--and decided to go against any conventional notion of what an unmarried woman should do, spending the money she got from selling her late father's cattle to set up a Ladies' Detective Agency--then you have an idea of how Precious sets herself up as her country's first female detective.\n\nOnce the clients start showing up on her doorstep, Precious enjoys a pleasingly successful series of cases. But the edge of the Kalahari is not St. Mary Mead, and the sign Precious orders, painted in brilliant colors, is anything but discreet. Pointing in the direction of the small building she had purchased to house her new business, it reads &quot;THE NO. 1 LADIES DETECTIVE AGENCY. FOR ALL CONFIDENTIAL MATTERS AND ENQUIRIES. SATISFACTION GUARANTEED FOR ALL PARTIES. UNDER PERSONAL MANAGEMENT.&quot;\n\nThe solutions she comes up with, whether in the case of the clinic doctor with two quite different personalities (depending on the day of the week), or the man who had joined a Christian sect and seemingly vanished, or the kidnapped boy whose bones may or may not be those in a witch doctor's magic kit, are all sensible, logical, and satisfying. Smith's gently ironic tone is full of good humor towards his lively, intelligent heroine and towards her fellow Africans, who live their lives with dignity and with cautious acceptance of the confusions to which the world submits them. Precious Ramotswe is a remarkable creation, and The No. 1 Ladies' Detective Agency well deserves the praise it received from London's Times Literary Supplement.","torrent":{"xt":"urn:btih:9c25fe0e432d16a26fd02df9c6c905770459b9aa","amp;dn":"No.+1+Ladies+Detective+Agency+Series+1-13+Alexander+McCall+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c25fe0e432d16a26fd02df9c6c905770459b9aa","infoHashBuffer":{"type":"Buffer","data":[156,37,254,14,67,45,22,162,111,208,45,249,198,201,5,119,4,89,185,170]},"announce":[],"urlList":[]}}