{"title":"Facing the Giants (2006) English subs [H264]","uid":4187894,"size":542624852,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9c9903c19c46206924d43acc07c1ceb78f8986d7&amp;dn=Facing+the+Giants+%282006%29+English+subs+%5BH264%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pakmenu","files":2,"time":1210780387,"description":"Encoded in Advanced Audio Coding, for 20% better quality at same filesize!\n\nLength : 517 MiB for 1h 46mn 6s 260ms\nVideo  : H264 at 601 Kbps\nAspect : 854 x 480 (16/9) at 29.970 fps\nAudio  : MP3 VBR at 59 Kbps English 24 KHz\n\nReviews:\n\na little movie with a lot of heart, 8 August 2006\n9/10\nAuthor: chris boltin from United States\n\nThe movie was well worth my time. I would encourage anyone who is looking for a good uplifting movie to check this one out. the characters are easy to relate to and the underlying story is very heartwarming. If you are having a bad day, or even if you are having a good day, this would be a great film. I left the movie feeling uplifted and full of hope!! The spirit of the movie is a bit reminiscent of &quot;Pay It Forward&quot;. One word of warning, although the film does make you laugh in parts, you will need to bring your own box of tissues. After watching the film, I found out that the film was shot with only 1 camera. I honestly did not notice while watching the movie. everyone should be able to find a part of themselves in at least one of the main characters.\nWas the above comment useful to you?\n------------------------------------\n\nFinally...a movie of value!!, 15 September 2006\n10/10\nAuthor: embo_1999 from United States\n\nI was invited to preview this movie and took my family with me. Even my youngest son, who is 4, came home reciting the message of the film. If a four year old gets it, I am thrilled to think of how many lives could be changed by going to see it. My children laughed at me because I cried like a baby. It evoked so many different emotions! It has been a long time since a movie has touched me like &quot;Facing the Giants&quot; did. The message was awesome and what was more amazing were the non-paid &quot;servants&quot; that starred in this film. This movie has the ability to make an amazing impact in this world. To God be the glory!!! I have been telling everyone to go see this movie, you will not regret it.\nWas the above comment useful to you?\n------------------------------------\n\nGo see it!!!, 29 September 2006\n9/10\nAuthor: youngace-1 from United States\n\nIt was an awesome movie. I laughed. I cried. I clapped. I cheered. I smiled! At times, I was on the edge of my seat! The message is truly inspirational. Reminds me a lot of &quot;Remember the Titans&quot; but faith-based. The movie stays away from the usual Hollywood hype. It&amp;#039;s clean.....no sidetracking on meaningless words, bad language, or other things that detract from the plot or overall movie. They don&amp;#039;t shy away from talking about God or praying. It has down-home charm and a feel-good quality. Our family loved it and will go see it again. I recommend it to anyone who wants to be inspired! My kids are already saving to buy it! \n------------------------------------\n","torrent":{"xt":"urn:btih:9c9903c19c46206924d43acc07c1ceb78f8986d7","amp;dn":"Facing+the+Giants+%282006%29+English+subs+%5BH264%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c9903c19c46206924d43acc07c1ceb78f8986d7","infoHashBuffer":{"type":"Buffer","data":[156,153,3,193,156,70,32,105,36,212,58,204,7,193,206,183,143,137,134,215]},"announce":[],"urlList":[]}}