{"title":"Resident Evil The Darkside Chronicles - Wii - Iso+Wbfs","uid":8798236,"size":1004414939,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:9c9bbe17d2ec8bbbdc33a68599035ee20809b544&amp;dn=Resident+Evil+The+Darkside+Chronicles+-+Wii+-+Iso%2BWbfs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"globeplus","files":-1,"time":1376128668,"description":"Hi and play this resident evil game ...\n\nFile Info : Videos ripped but with an HTML page with the complete movie of the game including all the videos of the game and inside the game the player get the perception of the location of the videos because the first seconds of each video are available then it is clicking on the next button to skip the video and go to the next cene of the game,\nthis file have applications included that creates the iso or the wbfs files from the main game easily to manage, all necessary instructions included\n\nPlot\n\nThe game's plot revolves around the personal stories and tragedies in the series.[4] Its main focus is retelling the events of Resident Evil 2 and Resident Evil Code: Veronica, and a new chapter is featured. For the Resident Evil 2 segment, the player takes control of protagonists Leon S. Kennedy and Claire Redfield,[1] with Sherry Birkin acting as an escort character in one chapter.[6] The Code: Veronica chapter features Claire, accompanied by fellow Rockfort Island prisoner Steve Burnside and later her brother Chris Redfield.\n\n\n\n* enjoy ...\n","torrent":{"xt":"urn:btih:9c9bbe17d2ec8bbbdc33a68599035ee20809b544","amp;dn":"Resident+Evil+The+Darkside+Chronicles+-+Wii+-+Iso%2BWbfs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c9bbe17d2ec8bbbdc33a68599035ee20809b544","infoHashBuffer":{"type":"Buffer","data":[156,155,190,23,210,236,139,187,220,51,166,133,153,3,94,226,8,9,181,68]},"announce":[],"urlList":[]}}