{"title":"Dungeon of Cum Redux - DR - Feb 18, 2015 - Mya Nichole","uid":11883791,"size":338774807,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9cf3cde1c6dbeb1c62c50be48b19dbfe085f6ec3&amp;dn=Dungeon+of+Cum+Redux+-+DR+-+Feb+18%2C+2015+-+Mya+Nichole&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":193,"time":1430760480,"description":"&quot;Bondage Date Night&quot; \n\n Dungeon of Cum : Redux\n Mya Nichole\n\n Beautiful Mya Nichole makes her debut to The Dungeon this week. Mya enjoys bondage immensely and was extremely eager to shoot with us. On top of all of that, Mya is a knockout with one hell of an amazing figure... To set the stage, Mya and Otto sneak into a dark, dank building. Despite Mya's protests Otto insists on exploring the gloomy place until they stumble upon a bed loaded with bondage devices. Silver tongued Otto doesn't take long convincing beautiful Mya to disrobe and once she reluctantly undresses, Otto greedily helps himself to a hearty portion of Mya's amazing body... After Otto cuffs his beautiful slave, he gags, collars and chains her then, coaxes Mya into giving him a hand job. Extremely aroused by the situation, Otto buries his cock into Mya from behind and tools away at her moist pussy. Drooling uncontrollably Mya lubes her Master's cock with her own saliva and Otto releases her from her chained position so she can obediently slurp on his pole and balls. After, getting his fill for the moment, Otto re-chains Mya and bends her over and fucks her wildly as Mya begs for more... Next, Otto tightly ties Mya doggie style on the edge of the bed and then resumes fucking her pussy. With restricted movement, Mya takes her fucking like a good girl as Otto barrels away at her snatch from behind. Spreading his bound slave's pussy lips wide, Otto buries his cock balls deep in her with long strides. Then, he removes her gag again so Mya can have a taste of her own juices as he slides his cock into her open mouth... Now, on her back with her hands tie behind her, Mya finds Otto's cock between her hefty tits. After he gets his fill of titty fucking his slave, Otto rolls Mya onto her side and fucks her pussy some more. Mya is then positioned on her tummy so her Master may have easier access to her pussy. Then she is hoisted onto Otto's cock and rides it wildly. Finally, Otto repositions Mya on her side, grabs hold of her heels and pounds away until he cums all over Mya's mouth. Then, after Mya cleans up the mess, Otto reties her and leaves her on her own \n\n Wmv 480p + Pics \n\n Screens &lt;a href=&quot;\nhttp://www.dungeoncorp.com/u...s15/DRE/MYA_071708/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/u...s15/DRE/MYA_071708/index.php&lt;/a&gt;\n\n 17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\n Just keep on leaving us the nice comments below and we are happy :)\n\n Any Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\n\nCheers :-)","torrent":{"xt":"urn:btih:9cf3cde1c6dbeb1c62c50be48b19dbfe085f6ec3","amp;dn":"Dungeon+of+Cum+Redux+-+DR+-+Feb+18%2C+2015+-+Mya+Nichole","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cf3cde1c6dbeb1c62c50be48b19dbfe085f6ec3","infoHashBuffer":{"type":"Buffer","data":[156,243,205,225,198,219,235,28,98,197,11,228,139,25,219,254,8,95,110,195]},"announce":[],"urlList":[]}}