{"title":"Psychic Ills - One Track Mind (2013) [FLAC]","uid":8204084,"size":300482478,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d0c2892ff52d0d6c5898128aed1b1cfa553a98f&amp;dn=Psychic+Ills+-+One+Track+Mind+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1362082194,"description":"\n  Psychic Ills - One Track Mind (2013) [FLAC]\n\n  Released: 2013\n  Duration: 47:13\n  Genre: Pop/Rock\n  Style: Experimental, Shoegaze\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 One More Time\n  02 See You There \n  03 Might Take a While \n  04 Depot \n  05 Tried to Find It \n  06 FBI\n  07 I Get By \n  08 City Sun \n  09 Western Metaphor \n  10 Drop Out \n  \n  Going from their 2003 inception to fourth album One Track Mind ten years later has been a winding road for New York's Psychic Ills. The strung-out experimental electro-drones the band made in its earliest days couldn't sound much more different from the amorphous desert psych of 2011's Hazed Dream, and the damaged but infinitely more accessible songcraft of that album takes a turn for the even more coherent on One Track Mind. The menacing and hypnotic basslines, ghost-town blues, and druggy drifter motifs of the album still have shades of the group's noisy beginnings, but most of the formless doom has been replaced with more traditional expressions of dread. &quot;One More Time&quot; kicks things off sounding like a listless sunburned daydream from some imaginary hybrid of the Gun Club and Spacemen 3. \n\n  Tres Warren's scowling vocals keep repetitive songs like &quot;See You There&quot; and &quot;FBI&quot; tense and mysterious. The latter is a dusty, demented blues with touches of spare psychedelia from the tape echo-drowned vocals and patches of understated backwards guitar. Royal Trux/Howling Hex alum Neil Michael Hagerty shows up to assist with everything from guest backing vocals to additional guitar to some production and mixing. Hagerty's pedigreed presence adds much to an already strong album in the vein of dark and foreboding psych rock. Much like Hazed Dream before it, the 11 songs on One Track Mind feel less like an album of various moods or perspectives and more like a continuously rolling soundtrack to a haunted highway. The washy blend of acoustic dirges, blown-out guitar tones, and lonely psychedelic character sketches solidify into an increasingly accessible sound from this once ungrounded act, without losing any of the group's character or inspiration.","torrent":{"xt":"urn:btih:9d0c2892ff52d0d6c5898128aed1b1cfa553a98f","amp;dn":"Psychic+Ills+-+One+Track+Mind+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0c2892ff52d0d6c5898128aed1b1cfa553a98f","infoHashBuffer":{"type":"Buffer","data":[157,12,40,146,255,82,208,214,197,137,129,40,174,209,177,207,165,83,169,143]},"announce":[],"urlList":[]}}