{"title":"Full.Steam.Ahead.[2016].s01e02.EN.SUB.MPEG4.x264.WEBRIP.[MPup]","uid":15441409,"size":1056314889,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d5018d95954fd69e0406c42edf2f9bc2fd1c80d&amp;dn=Full.Steam.Ahead.%5B2016%5D.s01e02.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"makinapufterpup","files":2,"time":1469824979,"description":"Full.Steam.Ahead.[2016].s01e02.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nFull Steam Ahead (2016) is a six part documentary series that brings back to life the golden age of steam and explores how the Victorian railways created modern Britain.\r\n\r\n\t---------------------------------------------\r\n\r\nHistorians Ruth Goodman, Alex Langlands and Peter Ginn visit Beamish in County Durham to examine how railway companies began to develop ways of moving people, rather than just stone, coal and iron, around the country. The comfort of the early passenger wagons are put to the test on one of the earliest steam trains, and Ruth finds out how people were moving further than ever before.\r\n\r\nPeter and Alex are put through their paces discovering what life was like for the railway navvies, the people that built thousands of miles of iron roads across the country and in all weather conditions. They come face to face with the harsh realities faced by countless workmen.\r\n\r\nA demand for building railways transcended across other industries, even reviving many. Ruth finds out what impact they had on cottage industries and looks at the role that horsehair played in making the carriages as people-friendly as possible.\r\n\r\nWith the railways opening up plenty of new job roles, Ruth finds out what the role of the guard would have entailed at the Bluebell Line. The team take a flying visit to a refreshment room, using the Railway Travellers Handy Book to guide them through the necessary etiquette.\r\n\r\nThe team also discover the downside of compartment-only carriages, come face to face with a cardsharp and find out what precautions you could take should you go on a long train journey that was yet to include the necessary facilities!","torrent":{"xt":"urn:btih:9d5018d95954fd69e0406c42edf2f9bc2fd1c80d","amp;dn":"Full.Steam.Ahead.%5B2016%5D.s01e02.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5018d95954fd69e0406c42edf2f9bc2fd1c80d","infoHashBuffer":{"type":"Buffer","data":[157,80,24,217,89,84,253,105,224,64,108,66,237,242,249,188,47,209,200,13]},"announce":[],"urlList":[]}}