{"title":"Jet Li - The Shaolin Temple (ENG DUB)(DivX DVDRip).avi","uid":4276509,"size":768045615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9db5ebc4c2cfe8055b3d0efc39f4f4b8155d5523&amp;dn=Jet+Li+-+The+Shaolin+Temple+%28ENG+DUB%29%28DivX+DVDRip%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"d1111s","files":-1,"time":1215208165,"description":"The Shaolin Temple (1979)\n\n\n\nENGLISH DUB\nRUNTIME: 90MIN\nFORMAT: AVI\nVideo: DivX 3 720x304 25.00fps 984Kbps [Videostream 0]\nAudio: MPEG Audio Layer 3 48000Hz stereo 128Kbps [Audiostream 1 1]\n\nChang Hsin Yen, Xinyan Zhang (director)\n\nCAST: Wang Jue ?. Ban Kong\nSun Jian Kui ?. Se Kong\nDing Lan ?. Bai Wu Xia\nLiu Huai Liang ?. Liao Kong\nJet Li ?. Chieh Yuan\n\n\n\n\nJet Li's debut film. This movie was one of China's biggest blockbusters and helped rebuild the real Shaolin Temple as it stands today. The story reenacts one of Shaolin's most famous legends at the beginning of the Tang Dynasty. At Loyang, the cruelty of the Emperor Huang Shi Chun oppressed the people. A famous Kung Fu master named &quot;Mighty Leg Chang&quot; fought back, but was killed by the Emperor's nephew, Huang Yih Jih. His son Shiu Hwu (Jet Li) was saved by the Shaolin Monks and learns Shaolin Kung Fu. Together, 13 staff wielding monks rescued the new Tang Emperor, Li Shinmin. Contains some of the finest fights scenes ever filmed.\n\nSCREEN\n\n\nThe Shaolin Temple (1979) Movie Review\n\nBy Erick Kwon\n\nStop me if you?ve heard this one before: Boy sees father killed by evil warlord. Boy escapes to Shaolin Temple to learn kung fu. Boy gets payback. Of course, there?s more to the plot than that, but not much. This is a pretty standard kung-fu movie with a couple of major distinctions.\n\nBetween 1974 and 1979, after Nixon had opened up China, the Chinese National Wushu Team toured the world, including the White House, and people got to see what all the fuss was about. Wushu is the catch-all term for Chinese martial arts, and as a sport it takes the motions and athleticism of combat martial arts and turns them into a sort of performance art. During performances, kids and adults would demonstrate classic weapons techniques and hand-to-hand styles.\n\nOne of these kids was Li Lian Jie, a prodigy who went on to win gold medals in the Chinese National Martial Arts Contest from 1974 to 1979. Then the government produced a kung fu movie based on a folk tale about the monks at the legendary Shaolin Temple. Li was tapped to star, and the entire cast was filled with performers from various wushu teams in China. The movie came out, became a huge success that spawned two in-name-only sequels, and Li Lian Jie was dubbed Jet Li. You don?t like wirework? I?m not crazy about it either. You don?t like obvious stunt doubles? Ditto. So grab a copy of ?The Shaolin Temple?, put the thinking side of your brain on hibernate, and watch some of the most amazing stuff you?ll ever see in a kung-fu movie.\n\nSo what do you get when you have wushu athletes instead of actors in a kung-fu movie? Some of the finest, real martial arts action ever put on film. You get a hint of it at the start, when we see a pack of teenaged monks practice with fighting sticks, moving in perfect timing with one another like a tougher version of ?Riverdance.? Once the fighting really starts, characters go at each other, armed and unarmed, with the speed, grace and precision that can only come from a lifetime of practice. And the background for most of the action is beautiful rural Mainland China, not some studio set, and that alone gives the movie a feel that?s different from what was coming out of Hong Kong at the time.\n\nIf you?ve only seen Jet Li in his recent English language movies or in his 1990?s Hong Kong action films, ?Shaolin Temple? will be a special treat. Only 16 at the start of film production, it?s amazing just how young and spry he looks. This is Jet before his many injuries and during his physical prime, when he was arguably the finest wushu artist in the world. There are hints of the superstar he would become and his character?s transformation from a brash, vengeance-fueled kid to a Shaolin warrior monk who finds inner peace is dead-on. It?s all even more remarkable when you consider this was his debut film.\n\nThe story is routine, but supposedly based on an actual legend, a fact that is stressed in the pre-title sequence. However, anyone familiar with China?s present policies in Tibet and its treatment of that country?s Buddhist population may recognize some disturbing themes in the story. Unlike Buddhists portrayed in past martial arts movies, the monks here, despite being the good guys, have no qualms about killing, eating meat, drinking alcohol and in one case, even fathering children. And when this conflict of faith is brought up, there?s usually some dialogue that suggests Buddhism can be cast aside in certain real world situations.\n\nI can only imagine the reaction of a devout Buddhist at the sight of monks eating dog meat and drinking wine while chattering: ?As long as Buddha is in your heart, it doesn?t matter what you do.? This approach is to be expected considering the politics of the film?s country of origin, but it does compromise an otherwise straightforward plot with some extraneous moments, most notably in the insertion of a musical number (!!) during one of the early training montages.\n\nThe movie is also conflicted in its attitude toward the monks. On one hand, they are brave and skilled warriors capable of superhuman feats, but they?re also depicted as wide-eyed, grinning simpletons who blindly sacrifice their lives and the founding principals of their religion for the Greater Good. That feels a lot like period commie propaganda, which is ultimate what ?Shaolin Temple? is.\n\nSo if you want to see Jet Li before he was Jet Li in the movie that made him a star, and don?t mind some Commie propaganda elements, then down ?The Shaolin Temple? and enjoy. Just don?t think too much about the dog meat.\n\n &lt;a href=&quot;\nhttp://workittothebone.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://workittothebone.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:9db5ebc4c2cfe8055b3d0efc39f4f4b8155d5523","amp;dn":"Jet+Li+-+The+Shaolin+Temple+%28ENG+DUB%29%28DivX+DVDRip%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9db5ebc4c2cfe8055b3d0efc39f4f4b8155d5523","infoHashBuffer":{"type":"Buffer","data":[157,181,235,196,194,207,232,5,91,61,14,252,57,244,244,184,21,93,85,35]},"announce":[],"urlList":[]}}