{"title":"InstaTab Pro for Instagram - 1.02 [Cracked]","uid":9777433,"size":1216131,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:9df37e82a65f3bf0e4c1ce3aad44915a6d8caa3e&amp;dn=InstaTab+Pro+for+Instagram+-+1.02+%5BCracked%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoogleWolf","files":-1,"time":1395055124,"description":"# # #  THE PERFECT INSTAGRAM APP FOR YOUR MAC - PRO VERSION # # #\n\n\n## Updated: Feb 25, 2014\n## Version: 1.02\n## Size: 0.7 MB\n## Language: English\n## More : https://itunes.apple.com/us/app/instatab-pro-for-instagram/id735066417?mt=12\n\n\nInstaTab Pro for Instagram is new way to access your Instagram. Doesn't have enough space for a menubar app? Not a problem. We introduce InstaTab Pro that will stick on edges of your screen. \n\nInstaTab Pro for Instagram with these Charming features: \n\nAccess your Instagram with &quot;1 click&quot; from your menubarï¼Œred camera icon in menubar, Desktop mode with attachments, Popup notifications, Stealth mode, Full screen support and much more! \n\n1. It is Convenient to access to Instagram via your Mac's menu bar \n\nAccess your Instagram with &quot;1 click&quot; from your menubar or you can via its customizable hot key (Command + G). \n\n2. New picture notifications with customizable audio alerts \n\nWhen you've got an updates via a vivid red menu bar icon we've made it really simple to know. \n\n3. Mobile &amp; desktop mode, you can easily alternate between modes \n\n4. Popup notifications support \n\nYou can enable a popup notification for every time you receive a new updates posts.\n\n\n5. Stealth mode, adjust the transparency of the tab with the opacity control slider. Use stealth mode to secretively check your photos and updates without anyone else noticing.\n\n6. Resizable tab window, easily increase/decrease the tab window to your liking \n\n7. Tab can be dragged and pulled using physical principle\n\n8. Auto hidet Tab when inactive eg. for watch movie\n\nYou'll soon be able to discover new posts when you receive new posts software icon is colored. \n\nLegal Note: \nInstaTab Pro for Instagram is a 3rd party application for Instagram and is in no way endorsed or affiliated with Instagram Inc. Instagram and the Instagram Logo are trademarks of Instagram Inc. \n\nWe love to hear your feedback. Please remember, we cannot reply to your comments in the Mac App Store. If you have a question, please contact us through our support mail. Thank you! \n\n\n## What's New in Version 1.02\nremember desktop mode","torrent":{"xt":"urn:btih:9df37e82a65f3bf0e4c1ce3aad44915a6d8caa3e","amp;dn":"InstaTab+Pro+for+Instagram+-+1.02+%5BCracked%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df37e82a65f3bf0e4c1ce3aad44915a6d8caa3e","infoHashBuffer":{"type":"Buffer","data":[157,243,126,130,166,95,59,240,228,193,206,58,173,68,145,90,109,140,170,62]},"announce":[],"urlList":[]}}