{"title":"Essential Oil Safety (2nd Ed)(gnv64)","uid":9547716,"size":17382556,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9eb1ae7b284926ea5c193182c33a447ef8e33182&amp;dn=Essential+Oil+Safety+%282nd+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":-1,"time":1391166107,"description":"Essential Oil Safety - A Guide for Health Care Professionals (2nd Ed)\nby Robert Tisserand and Tony Balazs\nChurchill Livingstone | November 2013 | ISBN-10: 0443062412 | PDF | 784 pages | 16.5 mb\n\nThe second edition of this book is virtually a new book. It is the only comprehensive text on the safety of essential oils, the first review of essential oil/drug interactions, and it provides detailed essential oil constituent data not found in any other text. Much of the existing text has been re-written, and 80% of the text is completely new. There are 400 comprehensive essential oil profiles and almost 4000 references. There are new chapters on the respiratory system, the cardiovascular system, the urinary system, the digestive system and the nervous system. For each essential oil there is a full breakdown of constituents, and a clear categorization of hazards and risks, with recommended maximum doses and concentrations. There are also 206 Constituent Profiles. There is considerable discussion of carcinogens, the human relevance of some of the animal data, the validity of treating an essential oil as if it was a single chemical, and the arbitrary nature of uncertainty factors. There is a critique of current regulations.\n\n- The only comprehensive text on the safety of essential oils\n- The first review of essential oil/drug interactions\n- essential oil constituent data not found in any other text\n- Essential oil safety guidelines\n- 400 essential oil profiles\n- Five new chapters\n- 305 new essential oil profiles, including Cedarwood, Clary sage, Lavender, Rose, Sandalwood, Tea tree\n- 79 new constituent profiles\n- Five new chapters: the respiratory system, the cardiovascular system, the urinary system, the digestive system, the nervous system.\n- Significantly expanded text\n\nAbout the Author\nRobert Tisserand was born in London in 1948 to a French father and Scottish mother. In 1974 he founded an aromatherapy business (Tisserand Aromatherapy). In 1988 he started teaching aromatherapy in the UK, and in the same year he launched The International Journal of Aromatherapy. He has spoken at many conferences around the world. He now lives in Ojai, a small town in S. California. He is the author or co-author of three books including The Art of Aromatherapy, published in 1977, the first book on aromatherapy in the English language. Robert received a Lifetime Achievement Award in 2007, and continues to write, teach and consult.\nRodney Young - Originally trained as a chemist, Rodney obtained a BSc from the University of London in 1965 and a PhD in medicinal chemistry from the University of Essex in 1968. He worked for many years in the pharmaceutical industry as a research chemist, focusing on modulators of histamine, serotonin and inositol phosphates. Rodney has published widely in the scientific literature, and has taught at University College, London, Oxford Brookes University, Edinburgh Napier University, and the University of East London. He has a longstanding interest in the medicinal properties of plant natural products, and serves on the editorial boards of professional journals promoting evidence-based botanical medicine.","torrent":{"xt":"urn:btih:9eb1ae7b284926ea5c193182c33a447ef8e33182","amp;dn":"Essential+Oil+Safety+%282nd+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb1ae7b284926ea5c193182c33a447ef8e33182","infoHashBuffer":{"type":"Buffer","data":[158,177,174,123,40,73,38,234,92,25,49,130,195,58,68,126,248,227,49,130]},"announce":[],"urlList":[]}}