{"title":"Sony Vegas Pro 10.0a Build 387 Portable Preactivated  - [StarGaz","uid":6299672,"size":105400962,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9edb3a2cbb2f16e5deca03408bf94c96acbfd657&amp;dn=Sony+Vegas+Pro+10.0a+Build+387+Portable+Preactivated++-+%5BStarGaz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"313852","files":3,"time":1302114502,"description":" /   _____//  |______ _______  /  _____/_____  ________ ___________ \n \\_____  \\\\   __\\__  \\\\_  __ \\/   \\  ___\\__  \\ \\___   // __ \\_  __ \\\n /        \\|  |  / __ \\|  | \\/\\    \\_\\  \\/ __ \\_/    /\\  ___/|  | \\/\n/_______  /|__| (____  /__|    \\______  (____  /_____ \\\\___  &gt;__|   \n        \\/           \\/               \\/     \\/      \\/    \\/       \n\n000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000\n000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000\n\n\n\nThis is a PORTABLE VERSION. \nAll you have to do, is run this as an administrator, otherwise, it will come out as a window that asks for the registration code for Sony Vegas Pro 10.\nRun as Adminstrator, and presto done, \nSony Vegas Pro 10 at your side. Read the system requirements. \nNo activation needed, so no pain in the butt trying to activate it using 2 computers, etc.\nHave fun with the product ;).\n\n000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000\n\nVegas Pro 10 overview\n\nThe Vegas Pro 10 collection integrates two powerful applications that work seamlessly together to provide an efficient and intuitive environment for video and broadcast professionals. This comprehensive suite offers the most robust and progressive platform available for content creation and production. With broad format support, superior effects processing, unparalleled audio support, and a full complement of editorial tools, the Vegas Pro 10 collection streamlines your workflow. From acquisition to delivery, from camera to Blu-ray Disc??C?o, the Vegas Pro 10 collection delivers exactly what you need to produce outstanding results.\nPrecise editing tools\n\nEdit SD or HD video with drag-and-drop functionality, mouse and keyboard trimming, and ripple editing. Features include ProType titling technology, multicamera editing tools, 32-bit floating-point video processing, customizable window layouts, color-coded snapping, HDV/AVCHD/RED/SDI/XDCAM support, A/V synchronization detection and repair, and automatic frame quantization.\nMore about video editing\nProfessional 32- and 64-bit workflow\n\nThe Vegas Pro 10 interface provides a fully customizable workspace for accomplishing a wide range of production requirements. Dock multiple windows across multiple monitors and save your layouts to fit specific editing tasks, nest Vegas projects within the timeline, customize and save keyboard commands, and use application scripting to automate repetitive tasks. Systemwide media management produces maximum efficiency.\nMore about workflow\nStereoscopic 3D editing\n\nCreate stereoscopic 3D projects utilizing the same workflow we??e??aove provided for 2D media! Vegas Pro 10 provides the ability to import, adjust, edit, preview, and output stereoscopic 3D media ??e??C? all using industry-standard professional delivery formats including single or dual files with side-by-side, top/bottom, or line-alternate encoding. Anaglyphic monitoring and output are also supported.\nMore about 3D editing &amp; delivery\n\n\n\nSuperior audio control\n\nUse unlimited tracks, 24-bit/192 kHz audio, punch-in recording, 5.1 surround mixing, effects automation, and time compress/expand. Apply customizable, real-time audio effects like EQ, Reverb, Delay, and more. Expand your audio processing and mixing options with supported third-party DirectXTÃ‚Â« and VST audio plug-ins. Use the Mixing Console for precise audio control.\nMore about audio production\nBroad format support\n\nVegas Pro 10 software natively supports the newest professional camcorder formats including XDCAM, NXCAM, AVCHD, and RED. Vegas Pro 10 software also includes support for still images greater than one gigapixel in resolution. Use Pan and Scan to create a stunning movie sequence from these large pictures while maintaining HD resolution.\nMore about capture and import\nPowerful Blu-ray Disc authoring\n\nCreate your own Blu-ray DiscsBurn movies to Blu-ray Disc??C?o directly from the Vegas Pro timeline for high-definition delivery. Use DVD Architect Pro software (included with the Vegas Pro collection) to author DVDs or Blu-ray Disc media with multiple video angles, subtitles, multiple languages, and special features. Preview and test your work in real time. Apply Brightness and Contrast, Auto Levels, Crop, and Anti-Flicker filters. Set CSS and MacrovisionTÃ‚Â« copy-protection flags for masters.\nMore about Blu-ray Disc authoring\nLearn as you go with easy Interactive Tutorials\nBuilt in tutorials teach you to use the software as you work.\n\nVegas Pro 10 software has a comprehensive help system, as well as detailed interactive tutorials that provide walkthrough demonstrations of common features and functionality. These tutorials provide an easy step-by-step method of learning the product and the workflow necessary to complete most common tasks.\nMicrosoftTÃ‚Â« WindowsTÃ‚Â« 7 compatible\nWindows 7 Compatible\n\nVegas Pro 10 software is fully compatible with the Microsoft Windows 7 platform.\n\n\nVegas Pro 10 system requirements\n\n    * MicrosoftTÃ‚Â« WindowsTÃ‚Â« XP 32-bit SP3, Windows VistaTÃ‚Â« 32-bit or 64-bit SP2, or Windows 7 32-bit or 64-bit\n    * 2 GHz processor (multicore or multiprocessor CPU recommended for HD or stereoscopic 3D)\n    * 400 MB hard-disk space for program installation\n    * 1 GB RAM (2 GB recommended)\n    * OHCI-compatible i.LINKTÃ‚Â« connector/IEEE-1394DV card (for DV and HDV capture and print-to-tape)\n    * USB 2.0 connection (for importing from AVCHD, XDCAM EX, NXCAM, or DVD camcorders)\n    * Windows-compatible sound card\n    * DVD-ROM drive (for installation from a DVD only)\n    * Supported CD-recordable drive (for CD burning only)\n    * Supported DVD-R/-RW/+R/+RW (for DVD burning only)\n    * Supported BD-R/-RE drive (for Blu-ray Disc??C?o burning only)\n    * Microsoft .NET Framework 3.0 (included on application disc)\n    * AppleTÃ‚Â« QuickTimeTÃ‚Â« 7.1.6 or later\n    * Internet Connection (for Gracenote MusicID Service)\n","torrent":{"xt":"urn:btih:9edb3a2cbb2f16e5deca03408bf94c96acbfd657","amp;dn":"Sony+Vegas+Pro+10.0a+Build+387+Portable+Preactivated++-+%5BStarGaz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9edb3a2cbb2f16e5deca03408bf94c96acbfd657","infoHashBuffer":{"type":"Buffer","data":[158,219,58,44,187,47,22,229,222,202,3,64,139,249,76,150,172,191,214,87]},"announce":[],"urlList":[]}}