{"title":"Cosmic Origins: The Scientific Evidence for Creation (2012)","uid":15617543,"size":681675190,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ee97544bd5b20c19efac2c0a963a5dddd4bf65d&amp;dn=Cosmic+Origins%3A+The+Scientific+Evidence+for+Creation+%282012%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"catholicstuff","files":1,"time":1471843449,"description":"How did we get here?\r\n\r\nHow did everything get here - our planet, our solar system ... our universe?\r\n\r\nFor generations, science has ignored the concept of creation because doing otherwise would beg the question ... of a Creator. Today, however, we have compelling evidence - from science itself - for a beginning and fine-tuning of the universe. The insights are complementary, and that very fact provides evidence of a transcendent, intelligent Creator.\r\n\r\nCosmic Origins explores those insights. Executive Producer Fr. Robert J. Spitzer, S.J., Ph.D., is a philosopher, educator, author and former President of Gonzaga University. He is founder and President of the Magis Institute for Faith and Reason, an organization dedicated to public education on the relationship among the disciplines of physics, philosophy, reason, and faith.\r\n\r\nThis fascinating film features Fr. Spitzer and a group of physicists and academic heavyweights exploring modern scientific theories about how the universe came to exist. Joining Fr. Spitzer are Nobel Laureate Arno Penzias (who discovered the background radiation from the Big Bang), Templeton Prize winners John Polkinghorne (Cambridge) and Michael Heller (Vatican Observatory), Owen Gingerich (Harvard), Lisa Randall (Harvard), Jennifer Wiseman (NASA) and Stephen Barr (University of Delaware), who narrates the film.Throughout the journey, viewers learn that modern scientific paths point toward a very Christian understanding of how we came to be.\r\n\r\nCosmic Origins explains what we know about the beginning and nature of the universe, as well as its transcendent implications in clear, easy-to-understand terms. The film weaves together a compelling narrative from academics and credentialed scientists pointing toward a very Christian understanding of how the universe came to exist.\r\n\r\nCosmic Origins expertly conveys a vital and important message for everyone - our Christian faith is not disproven by modern science, but rather corroborated by it.\r\n\r\nLearn more at www.cosmicoriginsfilm.com\r\n\r\nTrailer:\n\r\n---\r\n\r\nPlease seed!\r\n\r\nIf you enjoy this media, please purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:9ee97544bd5b20c19efac2c0a963a5dddd4bf65d","amp;dn":"Cosmic+Origins%3A+The+Scientific+Evidence+for+Creation+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ee97544bd5b20c19efac2c0a963a5dddd4bf65d","infoHashBuffer":{"type":"Buffer","data":[158,233,117,68,189,91,32,193,158,250,194,192,169,99,165,221,221,75,246,93]},"announce":[],"urlList":[]}}