{"title":"Blacksad [Graphic Novel] + A Silent Hell","uid":8734439,"size":254954686,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9eeeeea3bd0f35525ca0f324ab92e2052aff1439&amp;dn=Blacksad+%5BGraphic+Novel%5D+%2B+A+Silent+Hell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1374661940,"description":"- Contains the Blacksad graphic novel which collects 3 issues of the original 4 issue miniseries, and the Blacksad - A Silent Hell graphic novel which collects the fourth and final issue of the Blacksad miniseries.\n\nGenre: Crime/Noir\n\n- A CBR/CBZ viewer will be needed in order to view this content, which can be found here: http://www.cdisplay.me/\n\n**I don't own or take credit for any of the content contained in this torrent, all credit goes to the creator(s) of the comic.**\n\nBlacksad:\n\nPrivate investigator John Blacksad is up to his feline ears in mystery, digging into the backstories behind murders, child abductions, and nuclear secrets. Guarnido's sumptuously painted pages and rich cinematic style bring the world of 1950s America to vibrant life, with Canales weaving in fascinating tales of conspiracy, racial tension, and the &quot;red scare&quot; Communist witch hunts of the time. Guarnido reinvents anthropomorphism in these pages, and industry colleagues no less than Will Eisner, Jim Steranko, and Tim Sale are fans! Whether John Blacksad is falling for dangerous women or getting beaten to within an inch of his life, his stories are, simply put, unforgettable.\n\n\nBlacksad - A Silent Hell:\n\nDetective John Blacksad returns, with a new case that takes him to a 1950s New Orleans filled with hot jazz and cold-blooded murder! Hired to discover the fate of a celebrated pianist, Blacksad finds his most dangerous mystery yet in the midst of drugs, voodoo, the rollicking atmosphere of Mardi Gras, and the dark underbelly that it hides!\n\nFeatures an extensive making-of section, with tons of prelim sketches and watercolor studies.\n\n\n** If you have any question please feel free to ask! **","torrent":{"xt":"urn:btih:9eeeeea3bd0f35525ca0f324ab92e2052aff1439","amp;dn":"Blacksad+%5BGraphic+Novel%5D+%2B+A+Silent+Hell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eeeeea3bd0f35525ca0f324ab92e2052aff1439","infoHashBuffer":{"type":"Buffer","data":[158,238,238,163,189,15,53,82,92,160,243,36,171,146,226,5,42,255,20,57]},"announce":[],"urlList":[]}}