{"title":"Kiri Te Kanawa - Sole e Amore  Puccini Arias  FLAC","uid":5495012,"size":269006491,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f11f767fdf864c0e68bfdfa8f7a5c169a6ecd55&amp;dn=Kiri+Te+Kanawa+-+Sole+e+Amore++Puccini+Arias++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"keeybee","files":21,"time":1271213501,"description":"Please seed!\n\nDon't know why, but EAC wouldn't rip this one. So it's ripped with Winamp. But Audiochecker don't recognize all the tracks as genuine flac/cdda. But trust me, if Winamp has done its work, these are genuine flacfiles.\n\nKiri Te Kanawa\n\nDame Kiri Janette Te Kanawa, ONZ, DBE, AC (born 6 March 1944, Gisborne, New Zealand) is a New Zealand soprano who had a highly successful international opera career since 1968. Possessing a warm full lyric soprano voice, Te Kanawa sang a wide repertoire that encompassed works from the 17th to the 20th century in Italian, French, German, Russian, and English. She particularly excelled in the works of Wolfgang Amadeus Mozart, Richard Strauss, Giuseppe Verdi, George Frideric Handel and Giacomo Puccini. (Wiki)\n\n\nKiri Te Kanawa - Orchestre De L'OpÃƒÂ©ra National De Lyon, Kent Nagano - Sole &amp; Amore, Puccini Arias\nErato Disques 1997\n\n01 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Vissi d'arte (from 'Tosca')\n02 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Se come voi (from 'Le villi)\n03 Sole e Amore, Puccini Arias - Kiri Te Kanawa - In quelle trine morbide (from 'Manon Lescaut')\n04 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Intermezzo Atto 3 (from 'Manon Lescaut')\n05 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Sola, perduta, abandonnata (from 'Manon Lescaut')\n06 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Sole e amore *\n07 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Si, mi chiamano Mimi (from 'La Boheme')\n08 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Donde lieta usci (from 'La Boheme')\n09 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Canto d'anime *\n10 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Un bel di vedremo (from 'Madama Butterfly')\n11 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Intermezzo Atto 2, Parte seconda (from 'Madama Butterfly')\n12 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Ch'il bel sogno di Doretta (from 'La Rondine')\n13 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Morire *\n14 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Senza Mamma, o bimbo (from 'Suor Angelica')\n15 Sole e Amore, Puccini Arias - Kiri Te Kanawa - O Mio Babbino Caro (Gianni Schicchi)\n16 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Signore ascolta (from 'Turandot')\n17 Sole e Amore, Puccini Arias - Kiri Te Kanawa - Tu che di gel sei cinta (from 'Turandot')\n\nOrchestre De L'OpÃƒÂ©ra National De Lyon, Kent Nagano\n* Roger Vignoles, piano\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Kiri_Te_Kanawa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Kiri_Te_Kanawa&lt;/a&gt;","torrent":{"xt":"urn:btih:9f11f767fdf864c0e68bfdfa8f7a5c169a6ecd55","amp;dn":"Kiri+Te+Kanawa+-+Sole+e+Amore++Puccini+Arias++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f11f767fdf864c0e68bfdfa8f7a5c169a6ecd55","infoHashBuffer":{"type":"Buffer","data":[159,17,247,103,253,248,100,192,230,139,253,250,143,122,92,22,154,110,205,85]},"announce":[],"urlList":[]}}