{"title":"Marijuana and the Cannabinoids","uid":7394062,"size":3845490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f1d63e7bb828a6aea6b92f930361f024142c750&amp;dn=Marijuana+and+the+Cannabinoids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1340863750,"description":"Marijuana and the Cannabinoids: Forensic Science and Medicine\n\nEdited by:Mahmoud A. ElSohly, PhD\nPublished by: Humana Press, November 19, 2010\nFormat: PDF\n\n\nMarijuana and the Cannabinoids presents a compendium of research into the botany, chemistry, and pharmacology of cannabis and the medicinal aspects of the cannabinoids. While medicinal use of Cannabis sativa L. has been reported for over 5000 years, interest in its medicinal potential and controversy surrounding its illicit use have grown exponentially since the identification of the chemical structure of the plant's active constituent (D9-THC) in 1964. This volume presents the findings of researchers on the forefront of this emerging and controversial field of study. Chapter 1 is an overview of Cannabis and natural Cannabis medicines, while Chapter 2 focuses on the chemistry and analysis of phytocannabinoids and other Cannabis constituents. Chapter 3 discusses the potential of chemical fingerprinting of Cannabis as a means for source identification, and Chapters 4 and 5 outline the chemistry and pharmacology of cannabinoids and marijuana smoke condensate. In Chapter 6, the endocannabinoid system and the therapeutic potential of cannabinoids is presented. Chapter 7 provides technologies, development strategies, and multilevel applications for immunoassays for the detection of Cannabis abuse. In Chapter 8, mass spectrometric methods for the analysis of cannabinoids in physiological specimens are described. Chapters 9-12 discuss various consequences and adverse effects of prolonged marijuana use, including medical and health concerns and driving impairments. Chapters 13 and 14 examine postmortem considerations and the effects of cannabinoids on biopsychological, neuropsychiatric, and neurological processes.","torrent":{"xt":"urn:btih:9f1d63e7bb828a6aea6b92f930361f024142c750","amp;dn":"Marijuana+and+the+Cannabinoids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f1d63e7bb828a6aea6b92f930361f024142c750","infoHashBuffer":{"type":"Buffer","data":[159,29,99,231,187,130,138,106,234,107,146,249,48,54,31,2,65,66,199,80]},"announce":[],"urlList":[]}}