{"title":"The Low-Carb Fraud (2014) T Colin Campbell (multi)","uid":9497851,"size":1761140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f664adcdde9a280a4e20c05c17513c7e1438c8c&amp;dn=The+Low-Carb+Fraud+%282014%29+T+Colin+Campbell+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"7","files":-1,"time":1390155239,"description":"\nFormat: mobi/epub/azw3\nLength: 98 pages\nGenre: Non-Fiction/Health\nDate: 25 February 2014*\n\n*Not an ARC (Advance Reader Copy). Book has been Copyedited, Proofread and Indexed (see inside). This is a pre-release publicity/review edition.\n\nBy now, the low-carb diet's refrain is a familiar one:\n\nBread is bad for you. Fat doesn't matter. Carbs are the real reason you can't lose weight.\n\nThe low-carb universe Dr. Atkins brought into being continues to expand. Low-carb diets, from South Beach to the Zone and beyond, are still the go-to method for weight-loss for millions. These diets' marketing may differ, but they all share two crucial components: the condemnation of 'carbs' and an emphasis on meat and fat for calories. Even the latest diet trend, the Paleo diet, is - despite its increased focus on (some) whole foods - just another variation on the same carbohydrate fears.\n\nIn The Low-Carb Fraud, longtime leader in the nutritional science field T. Colin Campbell (author of The China Study and Whole) outlines where (and how) the low-carb proponents get it wrong: where the belief that carbohydrates are bad came from, and why it persists despite all the evidence to the contrary. The foods we misleadingly refer to as 'carbs' aren't all created equal - and treating them that way has major consequences for our nutritional well-being.\n\nIf you're considering a low-carb diet, read this e-book first. It will change the way you think about what you eat - and how you should be eating, to lose weight and optimize your health, now and for the long term.\n\nAuthor:\n\nFor more than 40 years, T. Colin Campbell, PhD, has been at the forefront of nutrition research. His legacy, the China Study, is the most comprehensive study of health and nutrition ever conducted. Dr. Campbell is the author of the bestselling book, The China Study, and the Jacob Gould Schurman Professor Emeritus of Nutritional Biochemistry at Cornell University. He has received more than 70 grant-years of peer-reviewed research funding and authored more than 300 research papers.\n","torrent":{"xt":"urn:btih:9f664adcdde9a280a4e20c05c17513c7e1438c8c","amp;dn":"The+Low-Carb+Fraud+%282014%29+T+Colin+Campbell+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f664adcdde9a280a4e20c05c17513c7e1438c8c","infoHashBuffer":{"type":"Buffer","data":[159,102,74,220,221,233,162,128,164,226,12,5,193,117,19,199,225,67,140,140]},"announce":[],"urlList":[]}}