{"title":"Challenges for Games Designers - [K-23]","uid":8132136,"size":4529581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fa0354692b0b048cabd871199060c4f0ed280f9&amp;dn=Challenges+for+Games+Designers+-+%5BK-23%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"K-23","files":-1,"time":1360626402,"description":"Challenges for Game Designers\n*****************************\n\nWelcome to a book written to challenge you, improve your brainstorming abilities, and sharpen your game design skills! Challenges for Game Designers: Non-Digital Exercises for Video Game Designers is filled with enjoyable, interesting, and challenging exercises to help you become a better video game designer, whether you are a professional or aspire to be. Each chapter covers a different topic important to game designers, and was taken from actual industry experience. After a brief overview of the topic, there are five challenges that each take less than two hours and allow you to apply the material, explore the topic, and expand your knowledge in that area. Each chapter also includes 10 &quot;non-digital shorts&quot; to further hone your skills. None of the challenges in the book require any programming or a computer, but many of the topics feature challenges that can be made into fully functioning games. The book is useful for professional designers, aspiring designers, and instructors who teach game design courses, and the challenges are great for both practice and homework assignments. The book can be worked through chapter by chapter, or you can skip around and do only the challenges that interest you. As with anything else, making great games takes practice and Challenges for Game Designers provides you with a collection of fun, thoughtprovoking, and of course, challenging activities that will help you hone vital skills and become the best game designer you can be.\n\nAuthor: Brenda Brathwaite | Publication Date: August 21, 2008 | Pages: 352 | Format: PDF","torrent":{"xt":"urn:btih:9fa0354692b0b048cabd871199060c4f0ed280f9","amp;dn":"Challenges+for+Games+Designers+-+%5BK-23%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fa0354692b0b048cabd871199060c4f0ed280f9","infoHashBuffer":{"type":"Buffer","data":[159,160,53,70,146,176,176,72,202,189,135,17,153,6,12,79,14,210,128,249]},"announce":[],"urlList":[]}}