{"title":"311 - Discography (1991-2011) [FLAC]","uid":8945910,"size":4276731017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a05b375c1328f2b01d0728c48ee417356c83e273&amp;dn=311+-+Discography+%281991-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":7,"uploader":"politux","files":-1,"time":1379775522,"description":"\n  311 - Discography (1991-2011) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Funk Metal, Rap-Metal, Rap-Rock\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1991 Unity\n  1993 Music\n  1994 Grassroots\n  1995 311\n  1997 Transistor\n  1998 Live\n  1998 Omaha Sessions\n  1999 Soundsystem\n  2001 From Chaos\n  2003 Evolver\n  2005 Don't Tread on Me\n  2009 Uplifter\n  2011 Universal Pulse      \n\n  311's fusion of reggae and rap-metal was created in Omaha, Nebraska, where singer/guitarist Nick Hexum, DJ/singer S.A. Martinez, guitarist Tim Mahoney, drummer Chad Sexton, and the bassist known only as P-Nut launched the group in 1990. Taking their name from the Omaha Police Department's code for indecent exposure, the quintet began gigging locally and soon moved to Los Angeles, signing with Capricorn Records in 1991. 311 then translated their regional success into national recognition with several key albums, including 1992's Music, 1993's Grassroots, and 1995's eponymous 311 (aka The Blue Album), the latter of which reached number 12 on the album chart, sold three million copies in the U.S., and sported the hit tracks &quot;All Mixed Up&quot; and &quot;Down.&quot;\n\n  In 1996, following a nonstop year of touring in support of 311, the band released Enlarged to Show Detail, a home video of live performances taken from amphitheater shows in Kansas City and Denver. Transistor, a double album of new songs sandwiched onto one CD, arrived one year later and prompted the group's most ambitious tour yet. The album soon achieved platinum status, and the resulting show dates provided ample material for Live, which was released in 1998 and captured the band's strength in concert. A year later, 311 returned with Soundsystem before jumping to the Volcano label for the release of From Chaos, which appeared in summer 2001. Evolver appeared two years later; unlike its predecessors, however, the album failed to go gold or platinum.\n\n  By now, 311 had been together over ten years, and the band celebrated its decade-plus existence with the Greatest Hits compilation. Released in July 2004, the album included all of 311's hit singles, several new tracks, and the band's reggae-tinged cover of the Cure's &quot;Love Song,&quot; which had originally appeared on the soundtrack to the Adam Sandler film 50 First Dates. 311 presented new material in August 2005 with the Don't Tread on Me LP, followed by an additional round of touring. Upon its completion, the road-weary musicians took a hiatus, their first break in nearly ten years. 311 soon returned to the studio, however, this time partnering with mega-producer Bob Rock. Heralded by frontman Nick Hexum as &quot;the heaviest 311 has ever been,&quot; the resulting Uplifter arrived in 2009. Rock returned in 2011 for the band's tenth studio, Universal Pulse.","torrent":{"xt":"urn:btih:a05b375c1328f2b01d0728c48ee417356c83e273","amp;dn":"311+-+Discography+%281991-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05b375c1328f2b01d0728c48ee417356c83e273","infoHashBuffer":{"type":"Buffer","data":[160,91,55,92,19,40,242,176,29,7,40,196,142,228,23,53,108,131,226,115]},"announce":[],"urlList":[]}}