{"title":"Suicide Squad # 1-67 (DC)","uid":9184037,"size":571261635,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a0e9c8558ad805ee108639d1009ec9642f4772d3&amp;dn=Suicide+Squad+%23+1-67+%28DC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"fudoh101","files":67,"time":1384267356,"description":"67 issues published by DC 1987-1992\n\nThis series ran for 66 issues under John Ostrander and ended in 1992 but the series was resurrected in 2010 for a single issue (#67) as a tie-in for Blackest Night. Writer John Ostrander gave the new Suicide Squad its own ongoing series, having brought the team together in 1986's &quot;Legends&quot; mini series. In &quot;Legends&quot; Ostrander paired his concept with a familiar name from DC's history. With the team's own title, Ostrander was helped by Luke McDonnell. The squad was a team of criminals led by government volunteers into impossible situations and missions. The choice was simple: rot away in a jail cell for the rest of their lives or perform black ops missions for the government as part of its clandestine Task Force X. They might not make it back alive. But to the hardened criminals serving time in Belle Reve Federal Prison, it was the chance of a lifetime.\n\nStarring regular cast members Rick Flag Jr, Nightshade, Captain Boomerang, Deadshot, Bronze tiger, the Enchantress and Plastique, &quot;Suicide Squad&quot; also featured guest villains, many of whom didn't survive their adventure. Under the watchful eye of the tough Amanda Waller, the Suicide Squad combined super heroics with international intrigue and tangible suspense. This series also featured the debut of Barbara Gordon as Oracle after her paralysis in The Killing Joke.","torrent":{"xt":"urn:btih:a0e9c8558ad805ee108639d1009ec9642f4772d3","amp;dn":"Suicide+Squad+%23+1-67+%28DC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e9c8558ad805ee108639d1009ec9642f4772d3","infoHashBuffer":{"type":"Buffer","data":[160,233,200,85,138,216,5,238,16,134,57,209,0,158,201,100,47,71,114,211]},"announce":[],"urlList":[]}}