{"title":"Gay - ScreenPlay (1984) [Bijou]","uid":8773687,"size":845008896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a1082b8c46e31233ffa71e734e8d09d1995f73f8&amp;dn=Gay+-+ScreenPlay+%281984%29+%5BBijou%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"urboboho","files":1,"time":1375504467,"description":"Winner of the 1984 award for Best Gay Film by the Gay Critics Association, this Steve Scott film is one of his best, technically superior \nand only suffering because of its underdeveloped and slow-moving (yet forgivable due to its dramatic tension) storyline. Characterization \nand narrative, too, add to its overall superior quality. Hung Lee Ryder plays a drifter who wanders into the shooting of a porn film, shot \non location at the All Worlds Resort in Palm Springs. The film begins as a Latino crewman/chauffeur, Robert Vega, is being sucked off in a \nmoving van trailer by a clean-cut man. Robert plugs his hole with his uncut pud and they both blow as Ryder happens upon the scene.\n\nWardrobe gopher Jon King delivers a costume to the porno's cowboy star, Eric Ryan, who's fresh from the shower. King, vocalizing all the \nway, kneels down to take Ryan's huge cock in the shower to test his virility and noisily sucks his meat before getting a nohands penetration \nand butt-fuck on the bed. Having given Ryder a lift to the set (&quot;this isn't the fluffy-hair over-hung twink of Huge and Huge II -- this is a \nLee Ryder that Scott's camera has lovingly captured in a new state; two years older, slighdy more muscular; a new sleek, almost panther-like \ncarriage.&quot; -- Manshots), the Latino admires him showering and offers him a blowjob. Vega takes it to the hilt and ends up swallowing the load \nemptied onto his tongue.\n\nA subplot reveals, too, that Vega is a spy for Ryan's lover, Michael Braun. Ryan later finds himself with Ryder, and as the cowboy porn star \nfellates him, ditty-talking Ryder spews &quot;suck that big cock,&quot; &quot;lick my balls,&quot; and &quot;take it easy.&quot;\n\nScene five has the crew chowing down at a Palm Springs restaurant. Lust-smitten Ryan ends up hand-jobbing the shy Ryder under the table - in \none of the most convincing and imaginative scenes ever created. In an aside from the main plot, a film crew worker masturbates through his \nskivvies while a sleeping buddy lays beside him in the nude.\n\nA lover's spat occurs once Braun arrives on the scene and is concluded by a suck-off reconciliation, with Ryan's meat shooting hard. Still \nupset, Braun moves to the pool, spying an exhibitionist beating off by a picture window. Both men end up jacking off, and an underwater \ncamera, excellently captures Braun exploding in the pool. The finale has King and Ryder in a betrayal session. King takes Ryder's 10-inch boner \nboth orally and anally, continuing his clever mouthings (suck those balls, take that fuckin' big dick-), and the encounter has been set up \nby Braun to prove to Ryan that Ryder is just another star fucker.","torrent":{"xt":"urn:btih:a1082b8c46e31233ffa71e734e8d09d1995f73f8","amp;dn":"Gay+-+ScreenPlay+%281984%29+%5BBijou%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1082b8c46e31233ffa71e734e8d09d1995f73f8","infoHashBuffer":{"type":"Buffer","data":[161,8,43,140,70,227,18,51,255,167,30,115,78,141,9,209,153,95,115,248]},"announce":[],"urlList":[]}}