{"title":"They Drive By Night DVDRip XviD","uid":5522140,"size":1097061555,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a12d279f49a311aa1f2f534fc163fe31438862e0&amp;dn=They+Drive+By+Night+DVDRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"parkyns","files":3,"time":1272644281,"description":"They just don't make 'em like They Drive By Night anymore. This slam-bang Warner Bros. attraction stars George Raft and Humphrey Bogart as Joe and Paul Fabrini, owners of a small but scrappy trucking firm. The film deftly combines comedy with thrills for the first half-hour or so, as the Fabrini boys battle crooked distributors and unscrupulous rivals while establishing their transport company. Things take a potentially tragic turn when the overworked Paul Fabrini falls asleep at the wheel and cracks up, losing an arm in the accident. He's pretty bitter for a while, but, with the help of his loving wife, Pearl (Gale Page), Paul eventually snaps out of his self-pity and goes to work as a dispatcher for the Fabrinis' company. Meanwhile, Joe's on-and-off romance with wisecracking waitress Cassie Hartley (Ann Sheridan) is threatened by the presence of seductive Lana Carlsen (Ida Lupino), the wife of glad-handing trucking executive Ed Carlsen (Alan Hale). At this point, the film metamorphoses into a remake of the 1935 Paul Muni-Bette Davis vehicle Bordertown. Desperately in love with Joe, Lana murders her husband, making it look like an accident, then offers Joe half-interest in Carlsen's organization. Joe accepts the offer, but spurns Lana's romantic overtures, whereupon the scheming vixen accuses Joe of plotting Carlsen's murder. Thus, the stage is set for a spectacular courtroom finale, completely dominated by a demented Lana, whose &quot;mad scene&quot; rivals those of Ophelia and Lucia di Lammermoor. In addition to the full-blooded performances by the stars and the virile direction by Raoul Walsh, They Drive By Night benefits immeasurably from the nonstop brilliant dialogue by Jerry Wald and Richard Macaulay -- especially in an early lunch-counter scene between Ann Sheridan and George Raft, generously seasoned with hilarious double- and single-entendres.\n\nLanguage: English\nSubtitles: English, German, Spanish, Croatian, Czech, Danish, Finnish, Greek, Polish, Hungarian, Swedish, Hebrew, Icelandic, Italian, French, Portuguese, Slovenian, Turkish\n\nVideo Quality: DVD Rip\nVideo Codec: XVID\nVideo Bitrate: 1455 Kbps\nAudio Codec: MP3 VBR\nAudio Bitrate: 105 Kbps\nResolution: 624x480\nAspect Ratio: 1.300\nFrame Rate: 25.000\nSize: 1.003 GiB","torrent":{"xt":"urn:btih:a12d279f49a311aa1f2f534fc163fe31438862e0","amp;dn":"They+Drive+By+Night+DVDRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a12d279f49a311aa1f2f534fc163fe31438862e0","infoHashBuffer":{"type":"Buffer","data":[161,45,39,159,73,163,17,170,31,47,83,79,193,99,254,49,67,136,98,224]},"announce":[],"urlList":[]}}