{"title":"Avery Aames Cheese Shop Mystery series [epub]","uid":9473301,"size":1744391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a15e9560f51f66d66bd61b708597aa16ed9cc261&amp;dn=Avery+Aames+Cheese+Shop+Mystery+series+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"7","files":-1,"time":1389634329,"description":"GENRE: Mystery\n\nAvery Aames 'Cheese Shop Mystery' series  [epub]\n\n1. The Long Quiche Goodbye (2010)\n\nWelcome to the grand opening of Fromagerie Bessette. Or as it's more commonly known by the residents of small-town Providence, Ohio-the Cheese Shop. Proprietor Charlotte Bessette has prepared a delightful sampling of bold Cabot Clothbound Cheddar, delicious tortes of Stilton and Mascarpone, and a taste of Sauvignon Blanc-but someone else has decided to make a little crime of passion the piece de resistance. Right outside the shop Charlotte finds a body, the victim stabbed to death with one of her prized olive-wood handled knives.\n\n2. Lost and Fondue (2011)\n\nThe fair town of Providence has settled down to normal after last year's murder. Jonquils are in bloom. The Cheese Shop is thriving. and Charlotte's romance with Jordan is flourishing. But when her friend, Meredith, decides to throw a fund-raiser to create a liberal arts college out of a long-abandoned winery--a winery that is rumored to hold not only buried bodies but buried treasure--Charlotte's joie de vivre deflates like a bad souffle.Charlotte's fears are realized when an art student is found dead in the wine cellar, and Meredith's niece is the main suspect.\n\n3. Clobbered by Camembert (2012)\n\nCharlotte Bessette--proprietor of Fromagerie Bessette, affectionately known in Providence, Ohio, as the Cheese Shop--is busy setting up her tent for the town's Winter Wonderland faire, where she'll offer fine wines and scrumptious cheeses. In the midst of the preparations, Charlotte meets an old friend of her mother, Kaitlyn Clydesdale, who has come back to Providence with plans to start a new honeybee farm.\n\nWhen Kaitlyn is found dead in the cottage of Charlotte's assistant Rebecca, suspicion falls on Rebecca's boyfriend, a honeybee farmer himself. Charlotte knows this beekeeper wouldn't hurt a fly, so she decides to find the real killer. While the town buzzes with gossip, can Charlotte catch the culprit without getting stung herself?\n\n4. To Brie or Not To Brie (2013)\n\nCharlotte Bessette - owner of Fromagerie Bessette, known by locals as The Cheese Shop - has a lot on her plate: setting a date with her fianc , feeding the actors in her grandmother's production of Hamlet, and planning the menu for her best friend and cousin's upcoming wedding. At least her new creation - sinfully delicious Brie blueberry ice cream - has turned out perfectly.\n\nJust days before the wedding, a stranger turns up dead in the Igloo Ice Cream Parlor's freezer, his head bashed with a container of Charlotte's signature ice cream. But this stranger turns out to be more than he seems, and his death threatens to unravel all that Charlotte has worked for. She has no choice but to add one more thing to her to-do list: find the killer before the villain destroys all that she loves.","torrent":{"xt":"urn:btih:a15e9560f51f66d66bd61b708597aa16ed9cc261","amp;dn":"Avery+Aames+Cheese+Shop+Mystery+series+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a15e9560f51f66d66bd61b708597aa16ed9cc261","infoHashBuffer":{"type":"Buffer","data":[161,94,149,96,245,31,102,214,107,214,27,112,133,151,170,22,237,156,194,97]},"announce":[],"urlList":[]}}