{"title":"FastStone Capture 7.9 Final (preactivated) RePack (&amp; portabl","uid":10728990,"size":2635994,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a165d8ff642df40d74e22d00b8abebbb6dec27f8&amp;dn=FastStone+Capture+7.9+Final+%28preactivated%29+RePack+%28%26amp%3B+portabl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"yfjfrj","files":5,"time":1407602632,"description":"FastStone Capture is a powerful, lightweight, yet full-featured screen capture tool and screen video recorder. It allows you to easily capture and annotate anything on the screen including windows, objects, menus, full screen, rectangular / freehand / fixed regions as well as scrolling windows / web pages. It also allows you to record all screen activities including onscreen changes, speech from microphone, mouse movements and clicks into highly compressed video files. You can choose to send captures to editor, file, clipboard, printer, email, Word / PowerPoint document or upload them to your website. Editing tools include annotating (texts, arrowed lines, highlights), resizing, cropping, sharpening, watermarking, applying edge effects and many more. Other features include image scanning, global hotkeys, automatic filename generation, support for external editors, a color picker, a screen magnifier, a screen crosshair and a screen ruler. \n\nFastStone Capture saves images in BMP, GIF, JPEG, PCX, PNG, TGA, TIFF and PDF formats. Built-in screen recorder saves videos in WMV (Windows Media Video) format.\n\nFeatures:\n=========\n\nA small handy Capture Panel that provides quick access to its capture tools and output options\nGlobal hotkeys to activate screen capturing instantly\nCapture windows, objects, menus, full screen, rectangular/freehand regions and scrolling windows/web pages\nCapture multiple windows and objects including multi-level menus\nRecord screen activities including onscreen changes, speech from microphone, mouse movements and clicks into highly compressed video files (Windows Media Video format). A built-in video editor allows you to draw annotations, apply zoom effects and cut unwanted sections\nOptions to specify output destination (internal editor, clipboard, file, printer ...)\nDraw annotation objects such as texts, arrowed lines, highlights, watermarks, rectangles and circles\nApply effects such as drop-shadow, frame, torn-edge and fade-edge \nAdd image caption\nResize, crop, rotate, sharpen, brighten, adjust colors ...\nUndo/Redo\nSupport tabs that allow you to capture and edit multiple screenshots simultaneously \nSupport external editors\nSave in BMP, GIF, JPEG, PCX, PNG, TGA, TIFF and PDF formats\nAcquire images from scanner\nConvert images to a multi-page PDF file\nJoin images side by side to produce a single image file\nSend captured images by email\nSend captured images to Word and PowerPoint documents\nSend captured images to a Web (FTP) server\nScreen Color Picker\nScreen Magnifier\nScreen Crosshair\nScreen Ruler\nSupport multiple monitors\nSupport touch interface (tap, swipe, pinch) \nRun when Windows starts (optional)\nMinimize to System Tray area\nSmall footprint in memory\nAnd many more ...\n\n\nPlatform - Windows 98, ME, XP, Vista,7 and Windows 8\n\nNew in version 7.9:\nAdded &quot;Polyline&quot; and &quot;Insert Mouse Pointer / Icon&quot; to the Draw tool\nAdded &quot;Remove Strip / Insert Strip&quot; to the right-click menu on a selected area\nAdded &quot;Lock Toolbar Position&quot; option (a pin icon) to the new capture toolbar activated from the editor. This will lock the toolbar position for next use\nNow, you can join images together into a new tab directly. In previous version, it is required to save the file first\nOther minor improvements\n\nLanguage - English, Russian\n\nScreen: &lt;a href=&quot;\nhttp://i5.imageban.ru/out/2014/08/01/e57d930e1a4ea0a3eb86223e681a0ed7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i5.imageban.ru/out/2014/08/01/e57d930e1a4ea0a3eb86223e681a0ed7.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a165d8ff642df40d74e22d00b8abebbb6dec27f8","amp;dn":"FastStone+Capture+7.9+Final+%28preactivated%29+RePack+%28%26amp%3B+portabl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a165d8ff642df40d74e22d00b8abebbb6dec27f8","infoHashBuffer":{"type":"Buffer","data":[161,101,216,255,100,45,244,13,116,226,45,0,184,171,235,187,109,236,39,248]},"announce":[],"urlList":[]}}