{"title":"STEVIE RAY VAUGHAN: Live From Austin, TX","uid":4479736,"size":3820466086,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a1d7f9a4182b0923bdd98b1d4b998c660d52bda5&amp;dn=STEVIE+RAY+VAUGHAN%3A+Live+From+Austin%2C+TX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"stylishirish","files":-1,"time":1225509992,"description":"____STEVIE RAY VAUGHAN: LIVE FROM AUSTIN, TEXAS____________________________________\n\n\n    SRV's two amazing performances from the acclaimed PBS series Austin City Limits in 1983 and 1989 at UT Austin. Pride &amp; Joy, Voodoo Chile, Little Wing (w/ footage of Stevie and glimpses of Leadbelly, Hendrix, Big Bill Broonzy, T-Bone Walker, Albert King, and Albert Collins with SRV Stratocasters) plus more...\n\n    Blues guitarist Stevie Ray Vaughan was already a legend when he was killed in a helicopter crash in 1990. Like all talents who die early, he has left behind a legacy of myths and stories concerning his complex life and persona. This very special video release -- which contains a 1983 and a 1989 appearance on the television show &quot;Austin City Limits&quot; -- provide a glimpse into the mythical musician at the beginning and the end of his short career. Eleven tracks are virtuostically performed here; half by the young, newly successful Vaughan, and half by an older, calmer and more together Vaughan. An intriguing musical look at the evolution of a man who became a myth...\n\n    Few guitarists ever mastered the Fender Stratocaster like the late, great Texas bluesman Stevie Ray Vaughan, and this priceless digital video disc collects both of the sizzling appearances that Vaughan and his solid band, Double Trouble, made on the PBS concert series Austin City Limits. Combined to form the most popular program in the show's distinguished history, the concerts were taped in 1983 and 1989; both provide a valuable portrait of Vaughan's astounding artistic development. The performances serve as bookends to Vaughan's brilliant career with Double Trouble, showing (in the words of producer Terry Lickona) a striking contrast between &quot;zero self-confidence&quot; and &quot;pure magic,&quot; but in both cases you can see a master at work. Songs include &quot;Pride and Joy,&quot; &quot;Texas Flood,&quot; &quot;Voodoo Chile,&quot; &quot;Cold Shot,&quot; and &quot;Riviera Paradise.&quot; This great-sounding DVD also includes the posthumous music video &quot;Little Wing,&quot; featuring clips of Double Trouble and archival footage of blues greats from the 1920s to the mid-1990s... \n\n    If you're even a part-time blues fan...\n    Stevie Ray Vaughan: Live from Austin, Texas is a must-have disc!\n \n    Discs: 1 (SRV live from ATX.iso)\n    Release Date: Sep 03, 1997\n    Rating: Not Rated\n    Running Time: 63 Minutes\n    Dolby Digital 5.1 - English\n    Dolby Digital Stereo 2.0 - English\n    Interactive Menus\n    Text/Photo Galleries\n    Song Lyrics\n\n        A SCAN OF THE DVD COVER ---- http://bayimg.com/oALhaAaBl\n        ... AND THE DISC ITSELF ---- http://bayimg.com/PalhFAabl \n\n\n    H o o K     ' e M     H o R N S ! ! !\n\n___________________________________________________________________________________\n\n    IF YOU LIKE IT, PLEASE SEED IT!","torrent":{"xt":"urn:btih:a1d7f9a4182b0923bdd98b1d4b998c660d52bda5","amp;dn":"STEVIE+RAY+VAUGHAN%3A+Live+From+Austin%2C+TX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1d7f9a4182b0923bdd98b1d4b998c660d52bda5","infoHashBuffer":{"type":"Buffer","data":[161,215,249,164,24,43,9,35,189,217,139,29,75,153,140,102,13,82,189,165]},"announce":[],"urlList":[]}}