{"title":"Willie Mays - The Life, The Legend - James Hirsch {FerraBit}","uid":15489214,"size":1982337184,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1e96b37c321bd1f473f8556df54f11763591e5d&amp;dn=Willie+Mays+-+The+Life%2C+The+Legend+-+James+Hirsch+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"FerraBit","files":26,"time":1470358276,"description":"Willie Mays - The Life, The Legend by James Hirsch (2010) {FerraBit}\r\n\r\nRead by . . : Adam Grupper, Michael Boatman\r\nPublisher . : Recorded Books (2010). Product Number: C5328\r\nISBN-10 . . : 1440776555\r\nISBN-13 . . : 9781440776557\r\nFormat . . .: MP3. 23 tracks.\r\nSize: . . . : 1.84 GB\r\nBitrate . . : 160 kbps (iTunes 12, Stereo, CBR, 44.1 kHz)\r\nSource . . .: 23 CDs (27.5 hrs)\r\nGenre . . . : Biography Autobiography Memoir, History, Sports\r\nUnabridged .: Unabridged\r\n\r\n1 track per CD, nicely tagged and labeled, cover scan included.\r\n\r\nThanks for sharing &amp; caring.\r\nCheers, FerraBit\r\nAugust 2016\r\n\r\n Links: \nhttp://www.recordedbooks.com/title-details/9781440776557\r\n\r\n Originally posted: \nhttps://thepiratebay.se/search/FerraBit/ \nhttps://www.demonoid.ooo/files/?uid=4819534\r\n\r\nTaken the time to read this? Take some more, and leave me a nice \r\nnote of encouragement. Got your FPL card?\r\n_____________________________________________________\r\n\r\nDescription\r\n\r\nA former reporter for the Wall Street Journal and the New York Times, author James S. Hirsch is highly regarded for his exhaustively researched biographies. Authorized by the Say Hey Kid himself, this thrilling biography follows the life and career of Hall of Fame baseball player Willie Mays. From his career in the Negro Leagues through his time as a New York then San Francisco Giant and continuing with his late career as one of baseball's leading African-American statesmen, Mays' story chronicles the many challenges he faced both on and off the diamond.\r\n\rReview:\r\n\r\nAuthorized by Willie Mays and written by a New York Times bestselling author, this is the definitive biography of one of baseball's immortals.\r\nConsidered to be &quot;as monumental--and enigmatic--a legend as American sport has ever seen&quot; (Sports Illustrated), Willie Mays is arguably the greatest player in baseball history, still revered for the passion he brought to the game. He began as a teenager in the Negro Leagues, became a cult hero in New York, and was the headliner in Major League Baseball's bold expansion to California. With 3,283 hits, 660 home runs, and 338 stolen bases, he was a blend of power, speed, and stylistic bravado that enraptured fans for more than two decades. Now, in the first biography authorized by and written with the cooperation of Willie Mays, James Hirsch reveals the man behind the player.\r\n\r\nWillie is perhaps best known for &quot;The Catch&quot;--his breathtaking over-the-shoulder grab in the 1954 World Series. But he was a transcendent figure who received standing ovations in enemy stadiums and who, during the turbulent civil rights era, urged understanding and reconciliation. More than his records, his legacy is defined by the pure joy that he brought to fans and the loving memories that have been passed to future generations so they might know the magic and beauty of the game. With meticulous research, and drawing on interviews with Mays himself as well as with close friends, family, and teammates, Hirsch presents a complex portrait of one of America's most significant cultural icons","torrent":{"xt":"urn:btih:a1e96b37c321bd1f473f8556df54f11763591e5d","amp;dn":"Willie+Mays+-+The+Life%2C+The+Legend+-+James+Hirsch+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e96b37c321bd1f473f8556df54f11763591e5d","infoHashBuffer":{"type":"Buffer","data":[161,233,107,55,195,33,189,31,71,63,133,86,223,84,241,23,99,89,30,93]},"announce":[],"urlList":[]}}