{"title":"Sustainable Construction {BBS}","uid":6957339,"size":55094616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1ecdc737f2cf8c3e009504c6c4e4a2ae63fd420&amp;dn=Sustainable+Construction+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1326636301,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ /                                                          \n\n****************************************************************************\n\nIt has taken a very long time for sustainable development to be recognised as a justified restraint on inappropriate development and a primary driver of improving quality of life for all.\n\nFor designers, clients and project managers this means we have to create healthy buildings and places which support communities, enhance biodiversity and contribute to reversing unsustainable trends in pollution and resource consumption. It is a very positive agenda.\n\nThis groundbreaking book will help all building design, management and cost professionals to understand sustainable design and provide the technical skills needed to implement the most up-to-date concepts. Based on a hugely successful series of workshops for professionals in construction, the book covers the history of ideas, materials, measurement - both cost and benchmarking performance - environmental services, and the building design and delivery process through to post-occupancy evaluation. It covers individual buildings and the urban scale.\n\nSustainable Construction is a master-class in how to achieve practical, affordable, replicable, sustainable design.\n\nIt has something new and often surprising in it for everybody in the construction industry.\n\nFor the Architect and Engineer it gives chapter and verse to the basic design issues at all scales and through the whole of the plan of work\n\nFor Quantity Surveyors and cost professionals it challenges current conventions with researched case study evidence&quot;\n\nFor clients and project managers it outlines the drivers and the justification for a sustainable approach and outlines the legislative framework; and it gives guidance on procurement and project and site management issues\n\nFor contractors and developers it contains a wealth of case study material, rooted in practical experience and economic reality.\n\nFor teachers and students it will bust myths, liberate thinking and inform design\n\n*Best practice solutions and case studies\n*Practical advice on implementation of sustainable construction techniques\n*Prepared by industry experts for their peers\n\n\n# Paperback: 408 pages\n# Publisher: Butterworth-Heinemann (January 23, 2008)\n# Language: English\n# ISBN-10: 0750663944\n# ISBN-13: 978-0750663946","torrent":{"xt":"urn:btih:a1ecdc737f2cf8c3e009504c6c4e4a2ae63fd420","amp;dn":"Sustainable+Construction+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1ecdc737f2cf8c3e009504c6c4e4a2ae63fd420","infoHashBuffer":{"type":"Buffer","data":[161,236,220,115,127,44,248,195,224,9,80,76,108,78,74,42,230,63,212,32]},"announce":[],"urlList":[]}}