{"title":"Ngugi wa Thiong'o - Fiction, Essays, Memoirs (14 books)","uid":11152589,"size":55586553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a292e9e246e57a400bd8a10035f9baf911608f99&amp;dn=Ngugi+wa+Thiong%27o+-+Fiction%2C+Essays%2C+Memoirs+%2814+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"workerbee","files":-1,"time":1412366951,"description":"\n            This is a revised and enlarged version of an earlier torrent.\n\n\nNGÅ¨GÄ¨ WA THIONG'O (b. 1938) is a Kenyan writer, formerly working in English and now working in Gikuyu.  His work includes novels, plays, short stories, and essays, ranging from literary and social criticism to children's literature.  He is frequently regarded as a likely candidate for the Nobel Prize in Literature.\n\nHis first novel, WEEP NOT, CHILD (1964), was the first English novel to be published by an East African author.  It describes the effects of the Mau Mau uprising on the lives of ordinary men and women, and on one family in particular.  THE RIVER BETWEEN (1965), his second novel, tells the story of the separation of two neighbouring villages of Kenya caused by differences in faith, with the Mau Mau uprising as its background.  \n\nA GRAIN OF WHEAT (1967) weaves together several stories set during the state of emergency in Kenya's struggle for independence (1952-1959) and marked Ngugi's embrace of Fanonist Marxism.  PETALS OF BLOOD (1977) is an angry cry against the betrayal of the independence struggle, questioning to what extent modern Kenya merely emulates and perpetuates the oppression found during its time as a colony, and was described by Moses Isegawa as &quot;the definitive African book of the 20th century&quot;.\n\nNgugi's later works include DETAINED, his prison diary (1981); DECOLONISING THE MIND (1986), a collection of essays on linguistic decolonization and the role of language in the construction of national culture, history, and identity; and MATIGARI (1987), a satire based on a Gikuyu folktale.\n\nHis first new novel in nearly two decades, WIZARD OF THE CROW (2006), was a sweeping satire laced with magical realism and described by Ngugi as a &quot;global epic from Africa.&quot;  His most recent books are SOMETHING TORN AND NEW (2009), a collection of essays that traces the arc of Africa's fragmentation and restoration amidst the global history of colonialism and modernity, and two autobiographical works: DREAMS IN A TIME OF WAR (2010), a memoir of his childhood in Kenya, and IN THE HOUSE OF THE INTERPRETER (2012), which hauntingly describes the formative experiences of a young man who would become a world-class writer and, as a political dissident, a moral compass to us all.\n\n\nThe following books are in PDF format unless otherwise noted:\n\n* DECOLONISING THE MIND: The Politics of Language in African Literature (Zimbabwe Publishing House, 1987)\n\n* DETAINED: A Writer's Prison Diary (Heinemann, 1981)\n\n* DREAMS IN A TIME OF WAR: A Childhood Memoir (Pantheon, 2010) -- ePUB\n\n* A GRAIN OF WHEAT (Penguin Classics, 2002) -- ePUB\n\n* HOMECOMING: Essays on African and Caribbean Literature, Culture and Politics (Heinemann, 1972)\n\n* IN THE HOUSE OF THE INTERPRETER: A Memoir (Pantheon, 2012) -- ePUB\n\n* MATIGARI (Heinemann, 1990)\n\n* MOVING THE CENTRE: The Struggle for Cultural Freedoms (East African Educational Publishers, 1993)\n\n* PETALS OF BLOOD (Penguin Classics, 1991) -- ePUB + PDF\n\n* THE RIVER BETWEEN (Heinemann, 1965)\n\n* SOMETHING TORN AND NEW: An African Renaissance (Basic Civitas Books, 2009)\n\n* WEEP NOT, CHILD (Heinemann, 1964 / Penguin Classics, 2012) -- ePUB + PDF\n\n* WIZARD OF THE CROW (Anchor, 2007) -- ePUB\n\n* WRITERS IN POLITICS: Essays (Heinemann, 1981)\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:a292e9e246e57a400bd8a10035f9baf911608f99","amp;dn":"Ngugi+wa+Thiong%27o+-+Fiction%2C+Essays%2C+Memoirs+%2814+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a292e9e246e57a400bd8a10035f9baf911608f99","infoHashBuffer":{"type":"Buffer","data":[162,146,233,226,70,229,122,64,11,216,161,0,53,249,186,249,17,96,143,153]},"announce":[],"urlList":[]}}