{"title":"The Passionate Programmer (2009) - (Malestrom)","uid":5055984,"size":1219895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2e391908bf9b23012a42efbb3faa29a59244339&amp;dn=The+Passionate+Programmer+%282009%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1250423231,"description":" &lt;a href=&quot;http://bayimg.com/BaDehAace&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/BaDehAace&lt;/a&gt;\n\nChad Fowler, &quot;The Passionate Programmer: Creating a Remarkable Career in Software Development&quot;\nPragmatic Bookshelf | 2009-05-28 | ISBN: 1934356344 | 200 pages | PDF\n\nSuccess in today's IT environment requires you to view your career as a business endeavor. In this book, you'll learn how to become an entrepreneur, driving your career in the direction of your choosing. You'll learn how to build your software development career step by step, following the same path that you would follow if you were building, marketing, and selling a product. After all, your skills themselves are a product.\n\nThe choices you make about which technologies to focus on and which business domains to master have at least as much impact on your success as your technical knowledge itself--don't let those choices be accidental. We'll walk through all aspects of the decision-making process, so you can ensure that you're investing your time and energy in the right areas.\n\nYou'll develop a structured plan for keeping your mind engaged and your skills fresh. You'll learn how to assess your skills in terms of where they fit on the value chain, driving you away from commodity skills and toward those that are in high demand. Through a mix of high-level, thought-provoking essays and tactical &quot;Act on It&quot; sections, you will come away with concrete plans you can put into action immediately. You'll also get a chance to read the perspectives of several highly successful members of our industry from a variety of career paths.\n\nAs with any product or service, if nobody knows what you're selling, nobody will buy. We'll walk through the often-neglected world of marketing, and you'll create a plan to market yourself both inside your company and to the industry in general.\n\nAbove all, you'll see how you can set the direction of your career, leading to a more fulfilling and remarkable professional life.","torrent":{"xt":"urn:btih:a2e391908bf9b23012a42efbb3faa29a59244339","amp;dn":"The+Passionate+Programmer+%282009%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e391908bf9b23012a42efbb3faa29a59244339","infoHashBuffer":{"type":"Buffer","data":[162,227,145,144,139,249,178,48,18,164,46,251,179,250,162,154,89,36,67,57]},"announce":[],"urlList":[]}}