{"title":"State-Sponsored Terrorism, Crimes, and Lies - Collection 3","uid":6542341,"size":211937940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a315e8ec71709d5776bf391892c035e24e09bd36&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"moman73","files":30,"time":1310736481,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 3:\n\n\nThis collection includes several titles that expose the crimes, lies and terrorist acts committed by the state of Israel. Interestingly, most of these titles were written by Jewish writers: Chomsky, Finkelstein, Giladi, Pappe, ..\n\nIn all we have the following 30 titles:\n\n-  Blakeley - State Terrorism and Neoliberalism; The North in the South (2009)\n\n-  Blum - Killing Hope; U.S. Military and CIA Interventions Since World War II (2004)\n\n-  Bronner - Blood in the Sand; Imperial Fantasies, Right-Wing Ambitions and the Erosion of American Democracy (2005)\n\n-  Bunton - Colonial Land Policies in Palestine, 1917-1936 (2007)\n\n-  Campbell - A Bird in the Bush; Failed Policies of the George W. Bush Administration (2005)\n\n-  Chomsky - Failed States; The Abuse of Power and the Assault on Democracy (2006)\n\n-  Chomsky &amp; Pappe - Gaza in Crisis; Reflections on Israel's War against the Palestinians (2010)\n\n-  Cook - Tracking Deception; Bush Mid-East Policy  (2005)\n\n-  Fawcett - You Said What; Lies and Propaganda Throughout History (2007)\n\n-  Finkelstein - Beyond Chutzpah; On the Misuse of Anti-Semitism and the Abuse of History (2008)\n\n-  Finkelstein - Holocaust Industry (2000)\n\n-  Giladi - Ben Gurion's Scandals; How Haggannah and Mosad Eliminated Jews (2004)\n\n-  Goodman &amp; Goodman - Static; Government Liars, Media Cheerleaders, and the People Who Fight Back (2006)\n\n-  Hanhimaki - The Flawed Architect; Henry Kissinger and American Foreign Policy (2004)\n\n-  Hitchens - The Trial of Henry Kissinger (2001)\n\n-  HRW - Off Target; The Conduct of the War and Civilian Casualties in Iraq (2003)\n\n-  Israel and the Occupied Territories; Under the Rubble; House Demolition and Destruction of Land and Property (Amnesty Int., 2004)\n\n-  Kahn - High Treason, the Plot Against the People (1950)\n\n-  Kinzer - Overthrow; America's Century of Regime Change from Hawaii to Iraq (2006)\n\n-  Mearsheimer - Why Leaders Lie; The Truth About Lying in International Politics (2011)\n\n-  Menjivar &amp; Rodriguez - When States Kill; Latin America, the U.S., and Technologies of Terror (2005)\n\n-  O'Huallachain &amp; Sharpe - Neo-conned; Just War Principles; A Condemnation of War in Iraq (2007)\n\n-  Open Secrets; WikiLeaks, War and American Diplomacy (New York Times, 2011)\n\n-  Risen - State of War; The Secret History of the CIA and the Bush Administration (2006)\n\n-  Ron - Frontiers and Ghetto; State Violence in Serbia and Israel (2003)\n\n-  Schneer - The Balfour Declaration; The Origins of the Arab-Israeli Conflict (2010)\n\n-  Seib - Media and Conflict in the Twenty-First Century (2005)\n\n-  Smith - Pact With the Devil. Washington's Bid for World Supremacy (2007)\n\n-  Winer - Between the Lies; Rise Of The Media-Military-Industrial Complex (2004)\n\n-  Winkler - In the Name of Terrorism; Presidents on Political Violence in the Post-World War II (2006)\n\n\n","torrent":{"xt":"urn:btih:a315e8ec71709d5776bf391892c035e24e09bd36","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+Collection+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a315e8ec71709d5776bf391892c035e24e09bd36","infoHashBuffer":{"type":"Buffer","data":[163,21,232,236,113,112,157,87,118,191,57,24,146,192,53,226,78,9,189,54]},"announce":[],"urlList":[]}}