{"title":"ITV.Legacy.The.Origins.of.Civilization.2.of.6.India.Empire.of.th","uid":4341683,"size":481438246,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a3306adf1728ff5914b35c8b4ceafdada908c249&amp;dn=ITV.Legacy.The.Origins.of.Civilization.2.of.6.India.Empire.of.th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"JumpinS","files":1,"time":1218642072,"description":"Legacy - The Origins of Civilization\n\nHistory Documentary hosted by Michael Wood and published by ITV, NHK in 1991 - English narration\n\n\nInformation\n------------------------------\n\nThe Legacy series is a search for the first civilizations and their continuing legacies. Each hour-long program focuses on one of the following regions: Iraq, India, China, Egypt, Central America, and the West.\n\nAt best, this search for the continuing legacies of past civilizations can help explain how different cultures have developed over time, show how the past greatly influences all our lives, and cultivate a respect for other cultures. At worst, it can send a message that these civilizations have remained virtually unchanged through time, unlike the West, and cultivate a false view of other peoples as less &quot;modern.&quot; The negative impact of the assumption that other cultures are not as modern as the West surfaces when Westerners make judgements, business deals, and policy decisions based on this assumption. Although Legacy aspires to the former objective, it often ends up fulfilling the latter. For example, the following statements by writer and presenter Michael Wood exemplify how the language Westerners often use to talk about non-Western peoples relegates them to a space and time outside of a Western view of the universe: &quot;Two conceptions of civilization have fought for the soul of the peoples of the Americas, one foreign and recent, that of the West, the other ancient and native;&quot; &quot;For over 2000 years, China has been sustained by ideas virtually unchanged since the Bronze Age.&quot; Throughout the series, comments like the ones above and the relative absence of images of people creating and using modern technology make it difficult for viewers to see the integral roles non-Western peoples occupy in the present.\n\nEach program in the series seeks to outline the &quot;great tradition&quot; of a civilization. Wood&amp;#039;s explorations of these various civilizations&amp;#039; great traditions are attempts to delineate some of the broad cultural principles which hold cultures together and distinguish them from one another. However, his efforts serve to create essentialized descriptions of societies that are comprised of numerous classes, ethnic groups, religions, and other types of communities (e.g. agrarian, nomadic, and urban). These descriptions are reminiscent of Ruth Benedict&amp;#039;s characterizations of the Hopi and Apache as Apollonian and Dionysian, respectively. Specifically, he characterizes Iraqis as long-suffering, resilient, hard-bitten, and pessimistic people; he states that Indians hold non-violence, renunciation, the inner-life, and the female as pillars of their civilization; he claims that the Chinese are guided by Confucianism, reverence for ancestors, and the quest for harmony; he asserts that the key to understanding the lives of ancient Egyptians was their desire to overcome time, a yearning to live beyond their time on earth and become immutable; he characterizes Mayans as obsessed with time and the mathematics of eternity, Aztecs as war-like, and all Central Americans as possessed of an inner strength that would allow them to bear any burden, even one as heavy as the last 500 years; and lastly, he describes the great tradition of the West as rooted in a contradiction between savagery and idealism. One can only imagine an encounter between a Westerner and non-Westerner in which the Westerner judges the non-Westerner as an inauthentic Indian, Mayan or Iraqi because he/she does not conform to the essentialized characterizations above.\n\nWood&amp;#039;s presentation is also problematic because he does not allow the people whose civilizations he examines to speak for themselves. Even when he does interview people, he does not allow the viewer to hear their words directly or through a translator, rather he summarizes and interprets the meaning of their statements. In short, Wood deprives them of their ability to represent themselves.\n\nWood is an ever-present guide through the series, perhaps distractingly so. There are several shots focused on him walking through crowds and across landscapes, and of him looking at buildings and artifacts where he obstructs the audience&amp;#039;s view of the object under discussion. The scenes in which he observes buildings, art or ceremonies seem like guides for tourists, instructing them how to properly admire these objects and phenomena.\n\nEach video contains a great deal of information on the civilization it investigates, but the presentation of this information is problematic. In addition to its function as a source of information, this series could be useful as a study of the ways in which cultural information is presented, especially in comparison to other films.\n\n\n\n2)  India - Empire of the Spirit \nThis episode examines the origins of Indian civilization and the long history of migrations and invasions of people and ideas that has formed the culturally and religiously diverse nation of India. Wood is particularly interested in the wealth of spirituality in India for he sees it as central to Indian life. He states that India&amp;#039;s great tradition is based on non-violence, renunciation, the inner-life, and the female principle.\n\nMuch of Wood&amp;#039;s exploration of Indian civilization is a search for the immutable characteristics of India&amp;#039;s great tradition. He comments that &quot;India today is still a village society&quot; in order to point out the continuity of practices in India through time. What does this say to people who are unfamiliar with Indian society? What of New Delhi, Calcutta and other cities in India? What role do they play in Indian society? The episode opens and closes with scenes of millions of Hindus gathering for age-old religious practices. &quot;For the pilgrims bathing [in the Ganges] on the morning of Shiva&amp;#039;s festival day, the city of Shiva is beyond time and history, a place of redemption.&quot; The images and narrative reinforce a static view of Indian civilization and downplay the diversity of modern India. They also allow Wood to speak of a &quot;typically Indian response&quot; and a &quot;Tamil sensibility.&quot;\n\nWood aims to set an example for Westerners by demonstrating respect for other cultures. However, he occasionally falls short of this goal: &quot;How easy it is to forget that there was an India there before the British came which is still there now they&amp;#039;ve gone.&quot; Easy for whom to forget? It is doubtful that it has been easy or desirable for Indians to forget. How can viewers cultivate an unpatronizing respect for a nation that appears to need the West to develop and extend its society? &quot;And for all the achievements of the British, their most fateful legacy was to open up India irrevocably to a wider world.&quot; This statement assumes that India would not have developed international relations without Western intervention and fails to acknowledge the long-established trade networks and relations India already had with other empires and nations before British colonization.\n\nOverall, this episode presents an essentialized, romantic account of the history of Indian civilization.\n\n\nScreenshots\n------------------------------\n\n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: DIVX\n * Video Resolution: 528x400\n * Audio Codec: mpga\n * Audio BitRate: 160000 BPS and 44100 Hz\n * Audio Channels: 2\n * RunTime Per Part: 51:32 mins\n * Number Of Parts: 6\n * Part Size: 460 Mb\n * Subtitles: Not Available\n * Ripped by anurag\n * VHS Rip\n\n\n\nLinks\n------------------------------\n\n1)  Related Documentaries \n * http://docuwiki.net/?title=Civilisations\n * http://docuwiki.net/?title=Lost%20Cities%20of%20the%20Ancients\n * http://docuwiki.net/?title=Secrets%20of%20Lost%20Empires\n * http://docuwiki.net/?title=The%20Ascent%20of%20Man\n * http://docuwiki.net/?title=Ancient%20Voices\n * http://docuwiki.net/?title=Lost%20Worlds\n\n2)  ed2k Links \n\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.1.of.6.Iraq.The.Cradle.of.Civilization.DivX.MP3.anurag.avi|482457588|58233AF7525666677B9A5DCD4344449D|h=6ESHI3A2B2A5SFL7WU7F5WG462LEN5VH|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.2.of.6.India.Empire.of.the.Spirit.DivX.MP3.anurag.avi|481438246|F2214AF61EA95ACF716F1BD9FB6AC134|h=663GSLJKYKPG7K4ESBM5HLG7Y2U5H2VT|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.3.of.6.China.The.Mandate.of.Heaven.DivX.MP3.anurag.avi|487020580|A715D308F9534CF11BC0CD94F19025E2|h=UFPO4J4ELQAXFCYTDZJEDIC5FERF3KDF|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.4.of.6.Egypt.The.Habit.of.Civilization.DivX.MP3.anurag.avi|487162430|C913D920ED61E8F67A77CBED6F1A446C|h=XYTD7XK3WKU77R5DJ4NGDJQLZOZLFAR5|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.5.of.6.Central.America.The.Burden.of.Time.DivX.MP3.anurag.avi|481486532|EE17A46DF4B808E8AEE885FBDF7E2F50|h=VUB2KTRKOEYH4P6HBC4DN7BJ3JXLNDVZ|/\ned2k://|file|ITV.Legacy.The.Origins.of.Civilization.6.of.6.The.Barbarian.West.DivX.MP3.anurag.avi|478856922|E3D205AD5504C3A505180237DD937B70|h=ZAYUWWW7BRBXLFXMCBH5C6PYIIYFJOTY|/\n\n\n\nAdded by http://docuwiki.net/?title=User%3AJumpinS\n\nSource: http://docuwiki.net/index.php?title=Legacy_-_The_Origins_of_Civilization\n","torrent":{"xt":"urn:btih:a3306adf1728ff5914b35c8b4ceafdada908c249","amp;dn":"ITV.Legacy.The.Origins.of.Civilization.2.of.6.India.Empire.of.th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3306adf1728ff5914b35c8b4ceafdada908c249","infoHashBuffer":{"type":"Buffer","data":[163,48,106,223,23,40,255,89,20,179,92,139,76,234,253,173,169,8,194,73]},"announce":[],"urlList":[]}}