{"title":"Eggelletion-Thieves in Temple-Federal Reserve System(2004)","uid":5736481,"size":756440,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a34fb95f244ec26c1e2c5f305e2ea50b092c2bab&amp;dn=Eggelletion-Thieves+in+Temple-Federal+Reserve+System%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1280832839,"description":"This is Andre Michael Eggelletion's mindblowing book Thieves in the Temple - America Under the Federal Reserve System (2004) which describes how the average American taxpayer struggles financially, because the important decisions about the economy are made not by elected officials, but by a group of businessmen out for profit. What the average person does not know about the directors of our monetary policy, the Federal Reserve, is the fact that there is absolutely nothing &quot;Federal&quot; about the Federal Reserve System, and neither does it have any &quot;Reserves.&quot; Eggelletion reveals facts about how the American economy operates that every American deserves to know. He establishes a historical perspective, by discussing the definitions and functions of money, and how the idea of a central banking system evolved through American history.  Thieves in the Temple fills the gaps of ignorance and mis-information about how capitalism really works. It offers all the economics essential for becoming a wise  investor, a savvy entrepreneur, an effective political decision maker, or simply an informed member of our society. 245 pages. A must read for everyone.","torrent":{"xt":"urn:btih:a34fb95f244ec26c1e2c5f305e2ea50b092c2bab","amp;dn":"Eggelletion-Thieves+in+Temple-Federal+Reserve+System%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a34fb95f244ec26c1e2c5f305e2ea50b092c2bab","infoHashBuffer":{"type":"Buffer","data":[163,79,185,95,36,78,194,108,30,44,95,48,94,46,165,11,9,44,43,171]},"announce":[],"urlList":[]}}