{"title":"Three Roads to Quantum Gravity by Lee Smolin","uid":12738313,"size":929711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a37a51614cd67725624adec17e40442ec5f37ae8&amp;dn=Three+Roads+to+Quantum+Gravity+by+Lee+Smolin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":3,"time":1447208992,"description":"From one of the World's most distinguished scientsits, an elegant and concise presentation of the controversial ideas behind quantum gravity. The Holy Grail of modern physics is the search for a theory of &quot;quantum gravity.&quot; It is a search for a view of the universe that unites two seemingly opposing pillars of modern science: Einstein's theory of general relativity, which deals with large-scale phenomena (planets, solar systems and galaxies), and quantum theory, which deals with the world of the very small (molecules, atoms, electrons). In Three Roads to Quantum Gravity, cosmologist and science writer Lee Smolin provides the first concise and accessible overview of current attempts to reconcile these two theories in a final &quot;theory of everything.&quot; Other books and articles have painted an incomplete picture by exposing only one of the different approaches, including string theory and loop quantum gravity. Here is the closest anyone has ever come to devising a completely new theory of space, time, and the universe to replace the Newtonian ideas that were the foundation of all science until the beginning of the twentieth century","torrent":{"xt":"urn:btih:a37a51614cd67725624adec17e40442ec5f37ae8","amp;dn":"Three+Roads+to+Quantum+Gravity+by+Lee+Smolin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a37a51614cd67725624adec17e40442ec5f37ae8","infoHashBuffer":{"type":"Buffer","data":[163,122,81,97,76,214,119,37,98,74,222,193,126,64,68,46,197,243,122,232]},"announce":[],"urlList":[]}}