{"title":"Tacitus - Annals - Oxford World's Classics","uid":9731825,"size":2405053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3d14cadb9db3affdefd9c2ee32ddfc16e93c7b5&amp;dn=Tacitus+-+Annals+-+Oxford+World%27s+Classics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Duke2347","files":1,"time":1394394096,"description":"Here is a lively new translation of Cornelius Tacitus' timeless history of three of Rome's most memorable emperors. Tacitus, who condemns the depravity of these rulers, which he saw as proof of the corrupting force of absolute power, writes caustically of the brutal and lecherous Tiberius, the weak and cuckolded Claudius, and &quot;the artist&quot; Nero. In particular, his gripping account of the bloody reigns of Tiberius and Nero brims with plots, murder, poisoning, suicide, uprisings, death, and destruction. The Annals also provides a vivid account of the violent suppression of the revolt led by Boudicca in Britain, the great fire of Rome under Nero, and the subsequent bloody persecution of the Christians. J. C. Yardley's translation is vivid without sacrificing accuracy, and is based on the recent Latin Heubner text, with variations noted in an appendix. Anthony A. Barrett's introduction and notes provide invaluable historical and cultural context. This superb edition also includes maps, a glossary of Roman terms and place names, and a full index of names and places.","torrent":{"xt":"urn:btih:a3d14cadb9db3affdefd9c2ee32ddfc16e93c7b5","amp;dn":"Tacitus+-+Annals+-+Oxford+World%27s+Classics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3d14cadb9db3affdefd9c2ee32ddfc16e93c7b5","infoHashBuffer":{"type":"Buffer","data":[163,209,76,173,185,219,58,255,222,253,156,46,227,45,223,193,110,147,199,181]},"announce":[],"urlList":[]}}