{"title":"The Whole Ten Yards(2004)DVDRip.AC3(ENG)-DROCK","uid":6804430,"size":734990457,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a42bbabaf977043ad859a38ce449b261a4e29b27&amp;dn=The+Whole+Ten+Yards%282004%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"drock232","files":-1,"time":1320801985,"description":"Bruce Willis and Matthew Perry reprise their roles as a killer for hire and a dentist with a bad case of nerves in this sequel to the comedy hit The Whole Nine Yards. Former hitman Jimmy &quot;The Tulip&quot; Tudeski (Bruce Willis) has retired from his life of crime and is living a quiet life of cooking and housekeeping in Mexico, despite the fact his wife, Jill (Amanda Peet), a would-be hired killer, still wants to keep her hand in the business. Tudeski has been able to convince the authorities he's dead thanks to dental records falsified by his former neighbor Nicholas &quot;Oz&quot; Oseransky (Matthew Perry), who lives in Los Angeles. But Oseransky discovers that not everyone is fooled by Tudeski's handiwork when his wife, Cynthia (Natasha Henstridge), is kidnapped by Lazlo Gogolak (Kevin Pollak) and his goons. Gogolak is a high-ranking member of the Hungarian mafia, and Tudeski previously murdered his son, so he's abducted Cynthia in order to get Oseransky to reveal the hired killer's current whereabouts. But Tudeski has come to like the quiet life, and isn't so sure he wants to face Gogolak and his crew for the sake of a jittery dentist who once did him a favor. Most of the principle cast of The Whole Nine Yards returned for this sequel, though director Howard Deutch stepped in to replace Jonathan Lynn, who was working on The Fighting Temptations when The Whole Ten Yards went into production. \n\nRipped with Handbrake.\n\nLength: 1 Hour 39 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:a42bbabaf977043ad859a38ce449b261a4e29b27","amp;dn":"The+Whole+Ten+Yards%282004%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a42bbabaf977043ad859a38ce449b261a4e29b27","infoHashBuffer":{"type":"Buffer","data":[164,43,186,186,249,119,4,58,216,89,163,140,228,73,178,97,164,226,155,39]},"announce":[],"urlList":[]}}