{"title":"Television - Marquee Moon .flac files","uid":6291924,"size":321742478,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4388025e2409b5acd58bc4ed4c9f766065d256a&amp;dn=Television+-+Marquee+Moon+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ulikes","files":13,"time":1301849349,"description":"Marquee Moon is simply one of the 10 best hipster\nrecords ever made. Mike, the owner of Subterranean\nrecords in NYC, puts it squarely at #1. Every single song\non this record is stellar. It is Passionate, explorative,\nand firmly on its own unique course. It is rich in\nflavor, and defys deconstruction. Due to its quirky\nuniqueness, this album is an acquired taste. Like a\nsushi orgasm, or LSD. Several people that I have turned\non to this record, were unimpressed at first, only to\nfall in love with it later. If you like the same old common,\nderivative, unimaginative, over-produced, superstar crap,\nthen this record is not for you. The cadence of the guitar\nlines in Venus De Milo are so beautiful, they will give you\nchills. In the crescendo of the title track, Verlaine makes\nhis guitar sound like sea gulls. Elevation is taught, edgy,\nand dripping with as much mood as a song can possibly be made\nto hold. Some people do not respond to the herky-jerkiness\nof Verlaines vocals, but they are well suited to the material.\nThe album has a bit of European flavor. Actually, one has to\ndescribe this album in broad strokes, because there is no\nartist that make sense to compare them to. Television blaze\ntheir own trail. Marquee Moon is honestly and truly a classic\nmasterpiece, Television's jewel. The albums Adventure (2nd\nrelease), Television (3rd release), and several Verlaine solo\nalbums, all have their moments, with an occasional great song,\nbut they all seriously pale to Marquee Moon. It deserves a place\nin any desert island list. The true test, is that this record\nis as relevant and effecting today, as it was in 77. One of\nmy fondest memories is having seen Television and Talking Heads\non the same bill at CBGB'S, a storm of epic proportions. Helpful\nnote: On first listen, do not play this record as background\nmusic. Open your mind, relax, square off with your stereo, and\nenjoy the swirls of passion, subtlety, vivid color, and\n\notherwise, ENJOY THE RIDE!\n\nTrack Listing:\n\n1. See No Evil\n2. Venus\n3. Friction\n4. Marquee Moon\t\n5. Elevation\t\n6. Guiding Light\t\n7. Prove It\t\n8. Torn Curtain\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:a4388025e2409b5acd58bc4ed4c9f766065d256a","amp;dn":"Television+-+Marquee+Moon+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4388025e2409b5acd58bc4ed4c9f766065d256a","infoHashBuffer":{"type":"Buffer","data":[164,56,128,37,226,64,155,90,205,88,188,78,212,201,247,102,6,93,37,106]},"announce":[],"urlList":[]}}