{"title":"The Pretenders - Pirate Radio 1979-2005 - 4CD-Box (2006)","uid":11383278,"size":2233688227,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a45b38c4a8442f0f603284536045ece60216caca&amp;dn=The+Pretenders+-+Pirate+Radio+1979-2005+-+4CD-Box+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bluesmax","files":-1,"time":1415234942,"description":"\nPretenders - Pirate Radio 1979-2005\nLabel: Rhino Entertainment Company/ Warner Bros. Records / Sire - 8122-73270-6\nFormat: 4 Ã— CD, Compilation, Remastered, Box Set, Reissue\nCountry: UK &amp; Europe\nReleased: 2006\nGenre: Rock\nStyle: New Wave, Pop Rock, Classic Rock\n\n\nTracklist:\n\n\tDisc One\nCD1-1 \tPrecious (Regent Park Demo) \t\nCD1-2 \tStop Your Sobbing \t\nCD1-3 \tThe Wait (Single Version) \t\nCD1-4 \tKid \t\nCD1-5 \tTattooed Love Boys \t\nCD1-6 \tMystery Achievement \t\nCD1-7 \tBrass In Pocket \t\nCD1-8 \tPorcelain \t\nCD1-9 \tTalk Of The Town \t\nCD1-10 \tMessage Of Love \t\nCD1-11 \tCuban Slide \t\nCD1-12 \tWhat You Gonna Do About It \t\nCD1-13 \tThe Adultress \t\nCD1-14 \tBad Boys Get Spanked \t\nCD1-15 \tI Go To Sleep \t\nCD1-16 \tDay After Day \t\nCD1-17 \tBirds Of Paradise \t\nCD1-18 \tThe English Roses \t\nCD1-19 \tTime The Avenger \t\nCD1-20 \tWatching The Clothes (Denmark Street Demo) \t\nCD1-21 \tShow Me \t\n\tDisc Two\nCD2-1 \tBack On The Chain Gang \t\nCD2-2 \tThumbelina \t\nCD2-3 \tThin Line Between Love And Hate \t\nCD2-4 \tMy City Was Gone \t\nCD2-5 \tMiddle Of The Road \t\nCD2-6 \tTequila \t\nCD2-7 \t2000 Miles \t\nCD2-8 \tWhen I Change My Life (Alternate Version) \t\nCD2-9 \tMy Baby \t\nCD2-10 \tWorlds Within Worlds \t\nCD2-11 \tDon't Get Me Wrong \t\nCD2-12 \tHymn To Her \t\nCD2-13 \tTradition Of Love \t\nCD2-14 \tRoom Full Of Mirrors \t\nCD2-15 \tReconsider Me \t\nCD2-16 \tHold A Candle To This (Alternate Version) \t\nCD2-17 \tWindows Of The World \t\nCD2-18 \tNever Do That \t\nCD2-19 \tNo Guarantee \t\nCD2-20 \tNot A Second Time \t\n\tDisc Three\nCD3-1 \tSense Of Purpose \t\nCD3-2 \tDowntown (Akron) \t\nCD3-3 \tHow Do I Miss Me \t\nCD3-4 \tBold As Love \t\nCD3-5 \tWhen Will I See You \t\nCD3-6 \tHollywood Perfume \t\nCD3-7 \tNight In My Veins \t\nCD3-8 \t977 \t\nCD3-9 \tAll My Dreams \t\nCD3-10 \tAngel Of The Morning (Original Version) \t\nCD3-11 \tMoney Talk \t\nCD3-12 \tRebel Rock Me \t\nCD3-13 \tI'll Stand By You \t\nCD3-14 \tEvery Mother's Son \t\nCD3-15 \tLove Colours \t\nCD3-16 \tPrivate Life (Live) \t\nCD3-17 \tLovers Of Today (Live) \t\nCD3-18 \tCreep (Live) \t\nCD3-19 \tCriminal (Live) \t\nCD3-20 \tRevolution (Live) \t\n\tDisc Four\nCD4-1 \tEveryday Is Like Sunday \t\nCD4-2 \tHuman (Class Mix) \t\nCD4-3 \tPopstar \t\nCD4-4 \tBack Down \t\nCD4-5 \tCalifornia \t\nCD4-6 \tThe Needle And The Damage Done \t\nCD4-7 \tFrom The Heart Down (Alternate Version) \t\nCD4-8 \tWho's Who \t\nCD4-9 \tBiker \t\nCD4-10 \tNails In The Road \t\nCD4-11 \tLegalize Me \t\nCD4-12 \tThe Homecoming (Live) \t\nCD4-13 \tUp The Neck (Live) \t\nCD4-14 \tFools Must Die (Live) \t\nCD4-15 \tNothing Breaks Like A Heart \t\nCD4-16 \tLie To Me \t\nCD4-17 \tComplex Person \t\nCD4-18 \tYou Know Who Your Friends Are \t\nCD4-19 \tI Should Of \t\nCD4-20 \tThe Losing\n\n\nReview by Stephen Thomas Erlewine, allmusic.com\n\nTo say that Warner/Rhino/Sire's 2006 four-CD, one-DVD box set Pirate Radio is for the die-hard Pretenders fan may be stating the obvious -- after all, career-spanning multi-disc sets heavy on rarities are by definition for diehards. But die-hard Pretenders fans are different than other die-hard fans, since they can be easily split into two separate camps: those who followed Chrissie Hynde throughout her career, and those who lost interest somewhere after 1983's Learning to Crawl, the triumphant third album that proved Hynde was above all a survivor. After that, Pretenders records were notoriously hit-or-miss affairs, sometimes holding together a little better than others, but patchy enough to whittle down their audience to just the dedicated, while still indicating that a killer comp could be pieced together from these records.\n\nIs Pirate Radio that comp? No, not really. It has almost all of their charting singles and many of their best album tracks, but it's not a lean collection of nothing but the best from the Pretenders; it has too many rarities and treats each portion of their career too evenhandedly to be that. By the end of the first disc, Pirate Radio has already dipped into Learning to Crawl, and well over half the collection is devoted to music released from 1990 on -- an era that had two solid albums (1994's Last of the Independents and 2002's Loose Screw) and one strong one (1999's Viva el Amor), plus a popular if subdued live album (1995's Isle of View). This era was certainly good, but in no way matched the intensity of their first five years as a band, particularly in its first incarnation when Hynde was in a gang with guitarist James Honeyman-Scott, bassist Pete Farndon, and drummer Martin Chambers. The first disc bears this out through its rarities, where the original 1978 demo of &quot;Precious&quot; is nearly as tough as the one on the group's peerless debut, while the Nick Lowe-produced single version of &quot;The Wait&quot; has a reckless energy.\n\nEven songs that seemed like throwaways at the time have aged into mini-masterpieces: there are the two songs that had been stranded on the 1981 Extended Play EP -- the tense, dramatic &quot;Porcelain&quot; and the infectious &quot;Cuban Slide&quot; -- plus a dynamic take on the Small Faces' &quot;What You Gonna Do About It.&quot; All three enhance the reputation of the original Pretenders while filling out corners in their history, something that can't quite be said about the deluge of rarities that follows over the next three discs. Not that the 13 previously unreleased cuts and six stray songs (mostly from B-sides and tribute singles) are bad by any means -- there are quite a few gems in this batch, particularly the terrific country tune &quot;Tequila&quot; (dating from the first days of the band, but cut during Learning to Crawl), the searching outtake &quot;When I Change My Life,&quot; and a bunch of covers, including takes on the Beatles' &quot;Not a Second Time,&quot; Warren Zevon's &quot;Reconsider Me,&quot; Radiohead's &quot;Creep,&quot; and Merrilee Rush's &quot;Angel of the Morning.&quot; But as the box shifts into second gear halfway through the second disc, it stops being a set that holds appeal to both camps of Pretenders fans and becomes the province of those who have faithfully followed Hynde throughout her ups and down.\n\nFor those fans, Pirate Radio is pretty much an unqualified delight. It rounds up the best of the uncollected songs, it presents an accurate and thorough history, it sounds terrific, it has great and comprehensive notes from Ben Edmonds (along with some track-by-track comments from Hynde), and the DVD is filled with thrilling television performances (eight of the 19 clips on the disc are from the original lineup, plus there are two from the Learning to Crawl group), which is alone worth the price of the set for the truly devoted. And ultimately that's who Pirate Radio is for -- for fans who love Hynde, warts and all. It's for the fans who believe that, despite (or perhaps because of) the peaks and valleys, she is indeed how Nick Lowe describes her: &quot;she's still the same girl we were all in love with nearly 30 years ago...and Chrissie's still the coolest girl in the world.&quot; For those who agree with Basher, Pirate Radio is proof that their love has not been in vain","torrent":{"xt":"urn:btih:a45b38c4a8442f0f603284536045ece60216caca","amp;dn":"The+Pretenders+-+Pirate+Radio+1979-2005+-+4CD-Box+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45b38c4a8442f0f603284536045ece60216caca","infoHashBuffer":{"type":"Buffer","data":[164,91,56,196,168,68,47,15,96,50,132,83,96,69,236,230,2,22,202,202]},"announce":[],"urlList":[]}}