{"title":"Terry Eagleton - How to Read a Poem (2007)","uid":9131282,"size":1313746,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a46999515566ac2d3db9545926c718d90c8f7549&amp;dn=Terry+Eagleton+-+How+to+Read+a+Poem+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1383324204,"description":"\nTerry Eagleton - How to Read a Poem (Wiley-Blackwell, 2007).\n\nISBN: 9781405151412 | 192 pages | PDF\n\n\nLucid, entertaining and full of insight, HOW TO READ A POEM is designed to banish the intimidation that too often attends the subject of poetry, and in doing so to bring it into the personal possession of the students and the general reader.\n\nTerry Eagleton offers a detailed examination of poetic form and its relation to content.  Taking a wide range of poems from the Renaissance to the present day, he discusses the work of major poets, including John Milton, Alexander Pope, John Keats, Christina Rossetti, Emily Dickinson, W.B. Yeats, Robert Frost, W.H.Auden, Seamus Heaney, Derek Mahon, and many more.\n\n\nReviews\n\n&quot;The wit he brings to the task of helping readers read poems will, for some readers (myself included), be a source of pleasure.&quot; -- Notes and Queries\n\n&quot;From the first page, the reader of How to Read a Poem realises that this, at last, is a book which begins to answer Adrian Mitchell's charge: 'Most people ignore most poetry because most poetry ignores most people'.  Eagleton introduces himself as 'a politically minded literary theorist.'  The remarkable achievement of this book is to prove that such a theorist is the only person who can really show what poetry is for.  By a brilliant and scrupulous series of readings -- of Yeats and Frost and Auden and Dickinson -- framed in a lively account of the function of criticism as perhaps only he could expound it, Eagleton shows how literary theory, seriously understood, is the ground of poetic understanding.  This will be the indispensable apology for poetry in our time.&quot; -- Bernard O'Donoghue\n\n&quot;With energy and wit, Eagleton proves once and for all that close readers and theoretical readers should be partners rather than enemies.&quot; -- John Redmond\n\n&quot;Lucid and engaging. . .  Eagleton's book, designed as an introduction to poetry for students and general readers, is a breath of fresh air.&quot; -- Marjorie Perloff, TLS\n_______________________________________________\n\nFor more books by Terry Eagleton, see:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9036245/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9036245/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a46999515566ac2d3db9545926c718d90c8f7549","amp;dn":"Terry+Eagleton+-+How+to+Read+a+Poem+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a46999515566ac2d3db9545926c718d90c8f7549","infoHashBuffer":{"type":"Buffer","data":[164,105,153,81,85,102,172,45,61,185,84,89,38,199,24,217,12,143,117,73]},"announce":[],"urlList":[]}}