{"title":"GWT in Action Easy Ajax with the Google Web Toolkit 2012","uid":7637978,"size":10268131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a488763d8b4c8a106c30c7dc03dab2b8d2e05c42&amp;dn=GWT+in+Action+Easy+Ajax+with+the+Google+Web+Toolkit+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"renatosistema","files":-1,"time":1347703422,"description":"\nBook Description\n\nThe Google Web Toolkit is a new technology that automatically translates Java into JavaScript, making Ajax applications easier to code and deploy. GWT in Action is a comprehensive tutorial for Java developers interested in building the next generation of rich, web-based applications. This book was written by Robert Hanson, creator of the popular GWT Widget Library and Adam Tacy a major contributor to the GWT Widget Library.\n\nThere is a new emphasis on building rich, web-based applications. These applications can be difficult to build because they rely on JavaScript, which lacks the sophisticated object-oriented structures and static typing of Java, they are tricky to debug, and they require you to manage numerous browser inconsistencies.\n\nIn May of 2006 Google released the Google Web Toolkit (GWT). GWT enables developers to create Ajax applications in Java. With GWT, you can build your applications using a real object-oriented language and take advantage of Java tools like Eclipse that are already available. Instead of trying to bring tool support to Ajax, Google brought Ajax to a place where the tools already existed.\n\nGWT in Action shows you how to take advantage of these exciting new tools. Readers will follow an example running throughout the book and quickly master the basics of GWT: widgets, panels, and event handling. The book covers the full development cycle, from setting up your development environment, to building the application, then deploying it to the web server. The entire core GWT library is discussed, with details and examples on how it can be extended.\n\nGWT helps you make the most of Ajax in your web applications and GWT in Action helps you get more out of GWT. Readers can download Early Access Chapters of GWT in Action now and participate in the Author Forum by visiting at the Manning site.","torrent":{"xt":"urn:btih:a488763d8b4c8a106c30c7dc03dab2b8d2e05c42","amp;dn":"GWT+in+Action+Easy+Ajax+with+the+Google+Web+Toolkit+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a488763d8b4c8a106c30c7dc03dab2b8d2e05c42","infoHashBuffer":{"type":"Buffer","data":[164,136,118,61,139,76,138,16,108,48,199,220,3,218,178,184,210,224,92,66]},"announce":[],"urlList":[]}}