{"title":"Weather Report - Mr. Gone TQMP","uid":5221904,"size":246900146,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4a4bbefb9172c711ce227e14f4abf8f4e1efd82&amp;dn=Weather+Report+-+Mr.+Gone+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":26,"time":1260924320,"description":"Not my rip, so all the credits goes to original ripper. Requested by a friend.\nBreezin, enjoy!\n\nOn Mr. Gone, Weather Report becomes merely a cover name for a Joe Zawinul/Jaco Pastorius jazz/rock/funk record production, with several guest drummers (Steve Gadd, Tony Williams, Peter Erskine), no resident percussionist, and Wayne Shorter as a still-potent solo saxophone threat. This album was denounced in its time as a sellout, probably on the reputation of Jaco's pulsating &quot;River People,&quot; which is as close as WR ever came to outright disco. But there is lots of diversity and adventure here, as the creative core of the band uses the latest electronics to push out the boundaries of sound while maintaining tight control over structure. &quot;The Pursuit of the Woman with the Feathered Hat&quot; is quintessential Zawinul; the Third World-centered groove is everything, no chord changes to impede this rush of layered electronics, percussion, and voices. Shorter's spare &quot;The Elders&quot; flirts with the electronic avant-garde and he retrofits his Miles Davis-era &quot;Pinocchio&quot; in rapid-fire electro-acoustic garb. In other words, the multi-flavored WR stew continues to cook at a fine boil.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-) ","torrent":{"xt":"urn:btih:a4a4bbefb9172c711ce227e14f4abf8f4e1efd82","amp;dn":"Weather+Report+-+Mr.+Gone+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a4bbefb9172c711ce227e14f4abf8f4e1efd82","infoHashBuffer":{"type":"Buffer","data":[164,164,187,239,185,23,44,113,28,226,39,225,79,74,191,143,78,30,253,130]},"announce":[],"urlList":[]}}