{"title":"Understanding Normal and Clinical Nutrition (8th Ed)(gnv64)","uid":7777737,"size":40866781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a51a46047009bfb2177dc272492ba34936a63bef&amp;dn=Understanding+Normal+and+Clinical+Nutrition+%288th+Ed%29%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"gnv65","files":-1,"time":1351697937,"description":"Understanding Normal and Clinical Nutrition (8th Ed)\nby Sharon Rady Rolfes, Kathryn Pinna and Ellie Whitney\nBrooks Cole | August 2008 | ISBN-10: 0495828793 | 1184 pages | PDF | 29.81 MB &lt;a href=&quot;\nhttp://www.amazon.com/Understanding-Normal-Clinical-Nutrition-Sharon/dp/0495828793&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Understanding-Normal-Clinical-Nutrition-Sharon/dp/0495828793&lt;/a&gt;\n\nUNDERSTANDING NORMAL AND CLINICAL NUTRITION, Eighth Edition, provides the most current and comprehensive coverage of both &quot;normal&quot; nutrition, such as digestion and metabolism, vitamins and minerals, and life cycle nutrition, as well as &quot;clinical&quot; nutrition related to diseases, such as nutrition and gastrointestinal, liver, and cardiovascular diseases. The text also incorporates a number of learning tools designed to help you retain the information and apply your knowledge so you are better prepared to work in a clinical setting. Features include case studies, &quot;How To&quot; boxes with examples of problem-solving in real-world situations, and study questions that further conceptual understanding of the material. Regardless of your course background, the text is organized and written in a clear, easy-to-follow format that will get you actively involved in the field of nutrition.\n\nAbout the Authors\nSharon Rady Rolfes received her M.S. in nutrition and food science from Florida State University. She is a founding member of Nutrition and Health Associates, an information resource center that maintains a research database on over 1,000 nutrition-related topics.\nKathryn Pinna received her M.S. and Ph.D. in nutrition from the University of California at Berkeley. She has taught nutrition, food science, and human biology courses in the San Francisco Bay Area for over 20 years and currently teaches nutrition classes at City College of San Francisco.\nEllie Whitney, Ph.D., received her B.A. in biology from Radcliffe College in 1960 and her Ph.D. in biology from Washington University, St. Louis, in 1970. Formerly on the faculty at Florida State University and a dietitian registered with the American Dietetic Association, she now devotes all her time to research, writing, and consulting in nutrition, health, and environmental issues\n\nBrief Contents\nCHAPTER 1 An Overview of Nutrition 2\nCHAPTER 2 Planning a Healthy Diet 36\nCHAPTER 3 Digestion, Absorption, and Transport 70\nCHAPTER 4 The Carbohydrates: Sugars, Starches, and Fibers 100\nCHAPTER 5 The Lipids: Triglycerides, Phospholipids, and Sterols 138\nCHAPTER 6 Protein: Amino Acids 180\nCHAPTER 7 Metabolism: Transformations and Interactions 212\nCHAPTER 8 Energy Balance and Body Composition 248\nCHAPTER 9 Weight Management: Overweight, Obesity, and Underweight 280\nCHAPTER 10 The Water-Soluble Vitamins: B Vitamins and Vitamin C 322\nCHAPTER 11 The Fat-Soluble Vitamins: A, D, E, and K 368\nCHAPTER 12 Water and the Major Minerals 39\nCHAPTER 13 The Trace Minerals 440\nCHAPTER 14 Life Cycle Nutrition: Pregnancy and Lactation 476\nCHAPTER 15 Life Cycle Nutrition: Infancy, Childhood, and Adolescence 514\nCHAPTER 16 Life Cycle Nutrition: Adulthood and the Later Years 560\nCHAPTER 17 Nutrition Care and Assessment 588\nCHAPTER 18 Nutrition Intervention 614\nCHAPTER 19 Medications, Herbal Products, and Diet-Drug Interactions 640\nCHAPTER 20 Enteral Nutrition Support 662\nCHAPTER 21 Parenteral Nutrition Support 686\nCHAPTER 22 Metabolic and Respiratory Stress 708\nCHAPTER 23 Upper Gastrointestinal Disorders 730\nCHAPTER 24 Lower Gastrointestinal Disorders 754\nCHAPTER 25 Liver Disease and Gallstones 786\nCHAPTER 26 Diabetes Mellitus 810\nCHAPTER 27 Cardiovascular Diseases 840\nCHAPTER 28 Renal Diseases 872\nCHAPTER 29 Cancer and HIV Infection 900\nAPPENDIX A Cells, Hormones, and Nerves A-1\nAPPENDIX B Basic Chemistry Concepts B-1\nAPPENDIX C Biochemical Structures and Pathways C-1\nAPPENDIX D Measures of Protein Quality D-1\nAPPENDIX E Nutrition Assessment: Supplemental Information E-1\nAPPENDIX F Physical Activity and Energy Requirements F-1\nAPPENDIX G Exchange Lists for Diabetes G-1\nAPPENDIX H Table of Food Composition H-1\nAPPENDIX I WHO: Nutrition Recommendations Canada: Guidelines and Meal Planning I-1\nAPPENDIX J Healthy People 2010 J-1\nAPPENDIX K Enteral Formulas K-1","torrent":{"xt":"urn:btih:a51a46047009bfb2177dc272492ba34936a63bef","amp;dn":"Understanding+Normal+and+Clinical+Nutrition+%288th+Ed%29%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a51a46047009bfb2177dc272492ba34936a63bef","infoHashBuffer":{"type":"Buffer","data":[165,26,70,4,112,9,191,178,23,125,194,114,73,43,163,73,54,166,59,239]},"announce":[],"urlList":[]}}