{"title":"The Oxford Handbook of Atheism - Stephen Bullivant","uid":14428658,"size":6017602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a543b30253f65da67dfdd62435473f156e8de5c6&amp;dn=The+Oxford+Handbook+of+Atheism+-+Stephen+Bullivant&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Pahly","files":1,"time":1461591325,"description":"Recent books by, among others, Sam Harris, Richard Dawkins, and Christopher Hitchens have thrust atheism firmly into the popular, media, and academic spotlight. This so-called New Atheism is arguably the most striking development in western socio-religious culture of the past decade or more. As such, it has spurred fertile (and often heated) discussions both within, and between, a diverse range of disciplines. Yet atheism, and the New Atheism, are by no means co-extensive. Interesting though it indeed is, the New Atheism is a single, historically and culturally specific manifestation of positive atheism (the that there is/are no God/s), which is itself but one form of a far deeper, broader, and more significant global phenomenon.\r\n\r\nThe Oxford Handbook of Atheism is a pioneering edited volume, exploring atheism - understood in the broad sense of &quot;an absence of belief in the existence of a God or gods&quot; - in all the richness and diversity of its historical and contemporary expressions. Bringing together an international team of established and emerging scholars, it probes the varied manifestations and implications of unbelief from an array of disciplinary perspectives (philosophy, history, sociology, anthropology, demography, psychology, natural sciences, gender and sexuality studies, literary criticism, film studies, musicology) and in a range of global contexts (Western Europe, North America, post-communist Europe, the Islamic world, Japan, India). Both surveying and synthesizing previous work, and presenting the major fruits of innovative recent research, the handbook is set to be a landmark text for the study of atheism","torrent":{"xt":"urn:btih:a543b30253f65da67dfdd62435473f156e8de5c6","amp;dn":"The+Oxford+Handbook+of+Atheism+-+Stephen+Bullivant","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a543b30253f65da67dfdd62435473f156e8de5c6","infoHashBuffer":{"type":"Buffer","data":[165,67,179,2,83,246,93,166,125,253,214,36,53,71,63,21,110,141,229,198]},"announce":[],"urlList":[]}}