{"title":"Teutoburg Forest, AD 9: The Destruction of Varus and His Legions","uid":11773967,"size":19749147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a56b55dfe0590d9c7be02eeb071b6bde2d89848e&amp;dn=Teutoburg+Forest%2C+AD+9%3A+The+Destruction+of+Varus+and+His+Legions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427193870,"description":"Osprey's study of one of the  most important battles of the long-elasting Germanic Wars (113 BC - 439 AD). Arminius, a young member of the Cheruscan tribe under the Roman Empire felt that Rome could be beaten in battle and that such a victory would guarantee the freedom of the Germans as a confederation of independent tribes, led by the Cheruscans, who would - in turn - be led by him.\n\nThroughout AD 8 and the early part of AD 9, Arminius used his position under the governor of Germania Inferior well, ostensibly promoting Rome whilst in reality welding the tribes together in an anti-Roman alliance, agreeing with his confederates that they would wait until the Roman garrison had moved to their summer quarters and then rise up against the invaders. With the arrival of September, the time soon came for the Roman troops to return to their stations along the Rhine and as they marched westwards through the almost impenetrable Teutoburg Forest, Arminius sprang his trap. In a series of running battles in the forest, Varus' army, consisting of three Roman Legions (XVII, XVIII and XIX) and several thousand auxiliaries - a total of roughly 20,000 men - was destroyed.\n\nThe consequences for Rome were enormous - the province of Germania was now virtually undefended and Gaul was open to a German invasion which although it never materialized, led a traumatized Augustus to decree that, henceforth, the Rhine would remain the demarcation line between the Roman world and the German tribes, in addition to which the destroyed legions were never re-formed or their numbers reused in the Roman Army: after AD 9, the sequence of numbers would run from I to XVI and then from XX onwards, it was as if the three legions had never existed","torrent":{"xt":"urn:btih:a56b55dfe0590d9c7be02eeb071b6bde2d89848e","amp;dn":"Teutoburg+Forest%2C+AD+9%3A+The+Destruction+of+Varus+and+His+Legions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56b55dfe0590d9c7be02eeb071b6bde2d89848e","infoHashBuffer":{"type":"Buffer","data":[165,107,85,223,224,89,13,156,123,224,46,235,7,27,107,222,45,137,132,142]},"announce":[],"urlList":[]}}