{"title":"Scientific Modeling and Simulations","uid":6523385,"size":11102017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a59d0745dbee303318a56f6a1508459f375012d3&amp;dn=Scientific+Modeling+and+Simulations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"_F1_","files":-1,"time":1310074043,"description":"Sidney Yip, &quot;Scientific Modeling and Simulations&quot; \n Publisher: Springer | ISBN: 1402097409 | edition 2009 | PDF | 393 pages | 10.5 mb\n\n The conceptualization of a problem (modeling) and the computational solution of this problem (simulation), is the foundation of Computational Science. This coupled endeavor is unique in several respects. It allows practically any complex system to be analyzed with predictive capability by invoking the multiscale paradigm linking unit-process models at lower length (or time) scales where fundamental principles have been established to calculations at the system level.\n\n The community of multiscale materials modeling has evolved into a multidisciplinary group with a number of identified problem areas of interest. Sidney Yip and Tomas Diaz De La Rubia, the editors of this volume, have gathered 18 contributions that showcase the conceptual advantages of modeling which, coupled with the unprecedented computing power through simulations, allow scientists to tackle the formibable problems of our society, such as the search for hydrocarbons, understanding the structure of a virus, or the intersection between simulations and real data in extreme environments.\n\n\n Scientific Modeling and Simulations advocates the scientific virtues of modeling and simulation, and also encourages the cross fertilization between communities, exploitations of high-performance computing, and experiment-simulation synergies.","torrent":{"xt":"urn:btih:a59d0745dbee303318a56f6a1508459f375012d3","amp;dn":"Scientific+Modeling+and+Simulations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59d0745dbee303318a56f6a1508459f375012d3","infoHashBuffer":{"type":"Buffer","data":[165,157,7,69,219,238,48,51,24,165,111,106,21,8,69,159,55,80,18,211]},"announce":[],"urlList":[]}}