{"title":"Quitter: Closing the Gap Between Your Day Job  Your Dream Job","uid":8345546,"size":250426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5c7b23d36917ceb6ba2f2f6096f99cb2b812448&amp;dn=Quitter%3A+Closing+the+Gap+Between+Your+Day+Job++Your+Dream+Job&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365192777,"description":"\nQuitter: Closing the Gap Between Your Day Job and Your Dream Job by Jon Acuff\nLampo Press | 2011 | ISBN: 0982986270 | English | 256 pages | EPUB \n\nHave you ever felt caught between the tension of a day job and a dream job? That gap between what you have to do and what you'd love to do?\n\nI have.\n\nAt first I thought I was the only one who felt that way, but then I started to talk to people and realized we're becoming the I'm, but generation. When we talk about what we do for a living we inevitably say, I'm a teacher, but I want to be an artist. I'm a CPA, but I'd love to start my own business.\n\nI'm a _____, but I want to be a ______.\n\nAll too often, we hear that dreaming big means you quit your day job, sell everything you own, and move to Guam. But what if there were a different way?\nWhat if you could blow up your dream without blowing up your life?\nWhat if you could go for broke without going broke?\nWhat if you could start today?\nWhat if you already have everything you need to begin?\n\nFrom figuring out what your dream is to quitting in a way that exponentially increases your chance of success, Quitter is full of inspiring stories and actionable advice. This book is based on 12 years of cubicle living and my true story of cultivating a dream job that changed my life and the world in the process.\n\nIt's time to close the gap between your day job and your dream job.\n\nIt's time to be a Quitter.","torrent":{"xt":"urn:btih:a5c7b23d36917ceb6ba2f2f6096f99cb2b812448","amp;dn":"Quitter%3A+Closing+the+Gap+Between+Your+Day+Job++Your+Dream+Job","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5c7b23d36917ceb6ba2f2f6096f99cb2b812448","infoHashBuffer":{"type":"Buffer","data":[165,199,178,61,54,145,124,235,107,162,242,246,9,111,153,203,43,129,36,72]},"announce":[],"urlList":[]}}