{"title":"Subnautica v3114","uid":13061910,"size":3255710120,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a62876df65090165aadc520e3867d319ec59e346&amp;dn=Subnautica+v3114&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dauphong","files":1,"time":1450722854,"description":"Subnautica is an open world, underwater exploration and adventure game currently under construction at Unknown Worlds, the independent developer behind Natural Selection 2.\r\nDive Into a Vast Underwater World\r\n\r\nAfter crash landing on an alien ocean world, the only way to go is down. Subnautica's oceans range from sun drenched shallow coral reefs to treacherous deep-sea trenches. Manage your oxygen supply as you explore Kelp Forests, plateaus, reefs, and winding cave systems. The water teems with life: Some of it helpful, much of it harmful.\r\nScavenge, Craft, and Survive\r\n\r\nAfter waking up in your Life Pod, the clock is ticking to find water, food, and to develop the equipment you need to explore. Collect resources from the ocean around you. Craft knives, lights, diving gear and personal water craft. Venture deeper and further form to find rarer resources, allowing you to craft more advanced items.\r\nDisrupt the Food Chain\r\n\r\nThe ocean teams with life: Use the ecosystem to help you. Lure and distract a threatening creature with a fresh fish, or simply swim as fast as you can to avoid gnashing jaws of roaming predators.\r\nFear the Night\r\n\r\nAs the sun goes down, the predators come out. The ocean is unforgiving of those caught unawares in the darkness. Areas that are safe to explore during the day become treacherous at night, but also reveal a beauty that those who hide from the darkness will never see.\r\nShape the World\r\n\r\nThe Subnautica sea-floor is presented using a dynamic voxel terrain system. Dig caves to hide, store loot, or short-circuit cave systems. Impacts from vehicles, or even exploding creatures, will change the way the world looks.\r\nGo Below The Deep\r\n\r\nCave systems wind below the sea bed, from dark claustrophobic passages to caverns lit by bioluminescent life. Explore the world below the ocean floor, but watch your oxygen levels, and take care to avoid the threats lurking in the darkness.\r\nOpen Development\r\n\r\nGet weekly or daily updates, see what the development team is working on, view real time change logs, and give feedback from inside the game. Subnautica Early Access development is open, and the development team wants to hear from you","torrent":{"xt":"urn:btih:a62876df65090165aadc520e3867d319ec59e346","amp;dn":"Subnautica+v3114","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62876df65090165aadc520e3867d319ec59e346","infoHashBuffer":{"type":"Buffer","data":[166,40,118,223,101,9,1,101,170,220,82,14,56,103,211,25,236,89,227,70]},"announce":[],"urlList":[]}}