{"title":"GetFLV 9.6.1.1 Final + Keygen - REPT","uid":9411079,"size":14915174,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a62a42188f4d32cbde63281b38e241ee38461ed0&amp;dn=GetFLV+9.6.1.1+Final+%2B+Keygen+-+REPT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"or1gins","files":6,"time":1388298005,"description":"GetFLV is a powerful and reliable application designed to turn your PC into a FLV studio. It helps you download and manage FLV Video Files. With this tool, you are able to download the FLV movies you like and save them to your hard drive for future playback.\nYou can convert FLV files to regular video files. It will help you extract FLV Audio to mp3 or other audio format. The application can also repair the FLV video files \nthat can't be seeked.\n\n\nHere are some key features of &quot;GetFLV&quot;:\nGrab Web Video URL flawlessly:\nSimply launch the FLV browser, and visit your favorite video site. Select and play a video, and click &quot;download&quot; to save it to your local disk.\n\nDownload Web Video flawlessly:\nGetFLV dramatically reduces the download time of Web Videos. The program splits the file into sections, and downloads multiple sections simultaneously, efficiently.\n\nConvert Any Web Videos:\nIt's simple to convert any web video to MP4, WMV, 3GP, AVI and MOV formats. After conversion, you can watch your movies on any of your computers or portable devices.\n\nConvert other videos to Flash:\nGetFLV can convert any of these popular video formats into Flash files. It supports almost all types of video formats such as AVI, WMV, MOV, ASF, MP4, 3GP and etc.\nExtract music from Web Video:\n\nGetFLV's built-in audio ripper can extract the music track from any web video and \nsave as MP3, WMA, AAC and other popular music formats.\n\nRepair damaged Flash movie:\nGetFLV can repair damaged Flash movies. The built-in FLV Fixer and MetaData Injector will analyze and repair Flash files that won't play properly.","torrent":{"xt":"urn:btih:a62a42188f4d32cbde63281b38e241ee38461ed0","amp;dn":"GetFLV+9.6.1.1+Final+%2B+Keygen+-+REPT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62a42188f4d32cbde63281b38e241ee38461ed0","infoHashBuffer":{"type":"Buffer","data":[166,42,66,24,143,77,50,203,222,99,40,27,56,226,65,238,56,70,30,208]},"announce":[],"urlList":[]}}