{"title":"Chicago.Fire.S02E15.720p.HDTV.X264-DIMENSION","uid":9705005,"size":942860637,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a6d8ee2106825553d14b03dc4ecafea77889beab&amp;dn=Chicago.Fire.S02E15.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":1,"time":1394052109,"description":"Chicago Fire\n\nVisit: thhaque.blogspot .com\n\nGenre: Action, Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Michael Brandt, Derek Haas\nCast: Jesse Spencer, Taylor Kinney, Monica Raymund, Eamonn Walker, Lauren German, Charlie Barnett, David Eigenberg, Teri Reeves\n\n.: Plot :.\nNo job is more stressful, dangerous or exhilarating than those of the Firefighters, Rescue Squad and Paramedics of Chicago Firehouse 51. These are the courageous men and women who forge headfirst into danger when everyone else is running the other way. But the enormous responsibilities of the job also take a personal toll.\n\nWith big reputations and hefty egos, the pressure to perform and make split-second decisions is bound to put squad members at odds. When a tragedy claims one of their own, there's plenty of guilt and blame to go around. In the middle of a divorce, Lt. Matthew Casey tries to go about business as usual, but can't help butting heads with the brash Lt. Kelly Severide of the Rescue Squad - and each blames the other for their fallen team member. When it's &quot;go-time,&quot; though, they put their differences aside and put everything on the line for each other. This is a look inside one of America's noblest professions.\n\nFrom renowned Emmy-winning producer Dick Wolf and the writing team behind &quot;3:10 to Yuma&quot; comes an edge-of-your-seat view of a dirty job that often means the difference between life and death.\t","torrent":{"xt":"urn:btih:a6d8ee2106825553d14b03dc4ecafea77889beab","amp;dn":"Chicago.Fire.S02E15.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d8ee2106825553d14b03dc4ecafea77889beab","infoHashBuffer":{"type":"Buffer","data":[166,216,238,33,6,130,85,83,209,75,3,220,78,202,254,167,120,137,190,171]},"announce":[],"urlList":[]}}