{"title":"God Is Great, God Is Good - Dr. William Lane Craig","uid":10345172,"size":857280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a71fcf1664a742a40037da2c3ad07f7512d74af7&amp;dn=God+Is+Great%2C+God+Is+Good+-+Dr.+William+Lane+Craig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":2,"time":1402595116,"description":"The days have passed when the goodness of God--indeed, the reality of God itself--could reasonably be called a consensus opinion. God's reputation has come under considerable review in recent days, with some going so far as to say that it's not we who've made a mess of things. Instead whatever it is we call God is to blame. But is such an opinion really a fair assessment? In this magisterial collection, the contemporary complaints against belief in God are addressed with intellectual passion and rigor by some of the most astute theological and philosophical minds of the day:\n   J. P. Moreland\n   Paul Moser\n   John Polkinghorne\n   Michael Behe\n   Michael J. Murray\n   Alister McGrath\n   Paul Copan\n   Jerry Walls\n   Charles Taliaferro\n   Scot McKnight\n   Gary Habermas\n   Mark Mittelberg\n   Chad Meister\n   William Lane Craig\nIncluding an interview by Gary Habermas with noted convert to theism Antony Flew, and a direct critical response to Richard Dawkins's God Delusion by Alvin Plantinga, God Is Great, God Is Good offers convincing and compelling reassurance that though the world has changed, God has not.\n\n\nAbout the editors:\nWilliam Lane Craig is Research Professor of Philosophy at Talbot School of Theology in La Mirada, California. At the age of sixteen as a junior in high school, he first heard the message of the Christian gospel and yielded his life to Christ. Dr. Craig pursued his undergraduate studies at Wheaton College (B.A. 1971) and graduate studies at Trinity Evangelical Divinity School (M.A. 1974; M.A. 1975), the University of Birmingham (England) (Ph.D. 1977), and the University of Munich (Germany) (D.Theol. 1984). From 1980-86 he taught Philosophy of Religion at Trinity, during which time he and Jan started their family. In 1987 they moved to Brussels, Belgium, where Dr. Craig pursued research at the University of Louvain until 1994.\nHe has authored or edited over thirty books, including The Kalam Cosmological Argument; Assessing the New Testament Evidence for the Historicity of the Resurrection of Jesus; Divine Foreknowledge and Human Freedom; Theism, Atheism and Big Bang Cosmology; and God, Time and Eternity, as well as over a hundred articles in professional journals of philosophy and theology, including The Journal of Philosophy, New Testament Studies, Journal for the Study of the New Testament, American Philosophical Quarterly, Philosophical Studies, Philosophy, and British Journal for Philosophy of Science. He lives in Atlanta, Georgia, with his wife Jan and their two teenage children Charity and John.\n\nChad V. Meister (Ph.D., Marquette University) is Professor of Philosophy and Theology at Bethel College in Mishawaka, Indiana. He was formerly vice president of the Evangelical Philosophical Society and head of the Defenders ministry at Willow Creek Community Church. Meister is the author and editor of multiple books and articles, including God is Great, God is Good (winner of the Christianity Today Book of the Year); Building Belief; Evil: A Guide for the Perplexed; and the forthcoming Debating Christian Theism (with J. P. Moreland and Khaldoun Sweis). Meister is also editor of the Journal of the International Society of Christian Apologetics, book review editor for Philosophia Christi, and General Editor (with Paul Moser) of the new book series with Cambridge University Press entitled Cambridge Studies in Religion, Philosophy, and Society. ","torrent":{"xt":"urn:btih:a71fcf1664a742a40037da2c3ad07f7512d74af7","amp;dn":"God+Is+Great%2C+God+Is+Good+-+Dr.+William+Lane+Craig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a71fcf1664a742a40037da2c3ad07f7512d74af7","infoHashBuffer":{"type":"Buffer","data":[167,31,207,22,100,167,66,164,0,55,218,44,58,208,127,117,18,215,74,247]},"announce":[],"urlList":[]}}