{"title":"Sixaxis Controller v0.9.0 {KatCore}.apk","uid":15127027,"size":1223526,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a7889b57c3c1debbd0299e92bd055574335beda1&amp;dn=Sixaxis+Controller+v0.9.0+%7BKatCore%7D.apk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"-KatCore-","files":1,"time":1467120886,"description":"SceenShot\r\n \nhttp://extraimago.com/images/2016/06/28/VR5T86LeFq.png \nhttp://extraimago.com/images/2016/06/28/VqdUJkDP7O.jpg \nhttp://extraimago.com/images/2016/06/28/C2rMaVDed3.png \nhttp://extraimago.com/images/2016/06/28/gYHDWK8czj.png\r\n\r\n\r\nSixaxis Controller v0.9.0 {KatCore} .apk\r\n\r\n★ Please read all instructions carefully. ★\r\n\r\nNot every products are supported, it is therefore strongly suggested that you simply try the Sixaxis Compatibility Checker (readily available for free on the internet Play) before buying this application.\r\n\r\nFinally waiting for has ended... The best gaming experience awaits! You can now play games in your phone how they were intended to be performed! Sixaxis Controller enables you to employ the next controllers in lots of of the favourite games and programs:\r\n\r\nPlayStation 3:\r\n\r\nSixaxis Controller\r\nDualShock® 3 Wireless Controller\r\nPlayStation® Move Navigation Controller\r\n\r\nPlayStation 4:\r\nDualShock® 4 Wireless Controller (If pairing on the PC, you have to use SixaxisPairTool .3+ )\r\n\r\n★ IMPORTANT ★\r\n\r\n★ ROOT access is needed!!!\r\n★ With the way pairing is completed using the controllers, you have to by hand pair your controller using the PC utility 'SixaxisPairTool' (available online) along with a small-USB cable. Android 3.1 customers may also pair on their products via USB.\r\n★ It's highly suggested that you employ an authentic controller. Many after market controllers won't use this application. When you get a 'Client connected: 1' message, however the lights in your controller still flash, it's probably no original The new sony controller.\r\n★ The fake controllers that are likely to operate (though not guaranteed) are individuals produced by Gasia. Should you purchased a fake that actually works but is not produced by Gasia, I'd like to know what you think in order to compile a summary of known working controllers.\r\n★ Make sure to browse the instructions within the help menu carefully.\r\n\r\nFeatures:\r\n\r\n★ Up to four Sixaxis, DualShock 3, DualShock 4 and Navigation controllers supported at the same time.\r\n★ Support like a native gamepad in Android 3.1 products. Full support for analog sticks and analog triggers.\r\n★ Keyboard emulation. Map all buttons and stays with just about any key obtainable in Android.\r\n★ Mouse emulation. Configure a control button to activate a button pointer on products that support rodents (most capsules, and lots of phones should work).\r\n★ Touch emulation enables you to definitely map buttons and analog stays with the screen. Play all of your favourite games with full analog support, even individuals without built-in controller support!\r\n\r\nThe product isn't associated with, nor approved, endorsed or licensed by any means by The new sony Corporation, its affiliates or subsidiaries. All trademarks are property of the particular holders","torrent":{"xt":"urn:btih:a7889b57c3c1debbd0299e92bd055574335beda1","amp;dn":"Sixaxis+Controller+v0.9.0+%7BKatCore%7D.apk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7889b57c3c1debbd0299e92bd055574335beda1","infoHashBuffer":{"type":"Buffer","data":[167,136,155,87,195,193,222,187,208,41,158,146,189,5,85,116,51,91,237,161]},"announce":[],"urlList":[]}}