{"title":"X TrainFit - x264 - MP4 - DVDrip","uid":9538092,"size":5562376593,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a7bbc41bb67b74d35635ebf0f9570da902eb6f6d&amp;dn=X+TrainFit+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MrTVGuy","files":-1,"time":1390968854,"description":"This is four (4) amazing workout systems from x-trainfit all in one amazing download.\n\nThe systems included in this torrent:\n\n1. X-TrainFit At Home Workout (12 week program)\n2. X-TrainFit Toning\n3. X-TrainFit Circuit Burnout 30 Day Fat Shred\n4. X-TrainFit Yoga\n\nAs always these DVDs have been encoded with maximum compatibility, small file sizes and good quality.\n\nABOUT THE WORKOUT PROGRAMS\n\n1. X-TrainFit At Home \n\nX-TrainFit At Home Training is a high intensity fitness program that is designed to be completed within the privacy of your own home or on the road. Very little equipment is just a set of dumbbells or exercise bands.\n\nOver 12 weeks, you will use the 8 intense workouts on the 8 DVDs to shred fat and sculpt and tone muscle. Don't worry ladies, you won't be bulking up, you'll be building a slimmer, fitter you.\n\nEach video demonstrates a modified level of difficulty throughout ranging from level 1 for beginners to level 4 for advanced users. You can pick a modification level that challenges you then try and push it to the next level when ready.\nYou will complete the videos with varying frequency and in varying order depending on the period of the program you are in as outlined in the quick start guide provided.\n\n2. X-TrainFit Toning\n\nGET TONED WITH KAREN GENTZ\n\nThree (3) All new workouts from X-TrainFit\n\nIf you are ready to get the mean, lean, shredded body you have been hoping for, this is the set for you! Karen Gentz and X-TrainFit At Home will help you get ripped with this shred-tastic program that focuses on the full body with three complete workouts.\n\nThese three workouts are great for anyone looking to tone up or build lean, calorie burning muscle. These workouts target the entire body; strengthening the core and building lean muscle mass that will not only help you become a leaner, fitter person but will allow you to burn more calories at rest.\nLEVELS\n\nMultiple levels are demonstrated in each workout to allow everyone to be challenged, regardless of your fitness level. The multiple levels also allow you to scale your workout up or down based on progression and goals.\nSUPER SETS\n\nIf you think you can handle it each DVD includes a bonus Super Set designed to give you an added calorie burn at the end of each workout. Give us 5 more minutes and we will grant you bonus pounds shredded!\n3 WORKOUTS\n\nCore - Chisel your entire midsection and glutes with this killer workout. Creative moves in this workout will get those abs ripped and glutes lifted in no time.\n\nUpper Body - This upper body toning will tone everything from the belly button up.\n\nLower Body - Working one of the body's largest muscle groups has never been this much fun.\n\nRequires: Dumbbells or Resistance band(not included)\n\n3. X-TrainFit Circuit Burnout 30 Day Fat Shred\n\nLOSE WEIGHT AT HOME WITH MONIQUE ST.PIERRE\n\nLooking to scorch fat but have limited time each day? Then this is the set for you! Monique St.Pierre and X-TrainFit bring you a high energy and up-tempo full body workout that shreds fat while toning muscle in only 20 minutes a day.\n\nThe pyramid approach keeps you moving with cardio and toning sets while showing a variety of intensity levels. Work through multiple moves for 5 minutes, rest for 1 minute, sweat and tone for 4 minutes, rest for 1, shred it for 3 more minutes, rest for 1, push through 2 minutes, rest for 1 more then finish strong in the final 1 minute set!\n5 WORKOUTS ON 5 DVDS\n\nAbs and Assets - Chisel your entire midsection and glutes with this killer workout.\n\nUpper Body - Effective use of cardio moves and upper body toning will burn fat while toning everything from the belly button up.\n\nLower Body - Lunge, kick, squat and more to get the lower body you have been wanting.\n\nTotal Body - Monique will work every inch of your body in this intense workout.\n\nAbs and Burn - This cardiovascular routine is a fast paced, no nonsense, full body fat burner.\nSUPER SETS\n\nIf you think you can handle it or you are just a cardio-fanatic, well we have you covered. Each DVD includes a bonus Super Set designed to give you an added calorie burn at the end of each workout. Give us 5 more minutes and we will grant you bonus pounds shredded!\nTRAINING AND NUTRITION GUIDE\n\nThe included guide guide will help maximize your workouts and fat loss by providing guidance and recipes designed to fuel your workouts and lose the fat. Combine this with the Training Calendar provided and your results are guaranteed!\nRequires: Dumbbells or Resistance band and stability ball (not included)\n\n4. X-TrainFit Yoga\n\nGET LONG AND LEAN MUSCLES WITH CARRIE KEARNEY\n\nIf you are looking for a set that offers a range of yoga workouts for various ability levels, then this is the program for you! Whether you are new to the practice, or a yoga veteran, you will be sure to enhance your practice and challenge yourself in the meantime.\n\nEnjoy the combination of lower body strengthening, flow and power flow yoga workouts along with guided meditation with Carrie Kearney in X-TrainFit At Home Yoga. These three different workouts show multiple levels that allow you to progress for more intense workouts as you get stronger. This set will help you gain strength while building long and lean muscle mass! So, pull up your mat, slip into your comfortable clothes and pop in any of these workouts or guided meditation to explore your mind, body and spirit.\n\n3 WORKOUTS AND BONUS MEDITATION\n\nLower Body Strength - Target the trouble areas of the lower body with the various poses in this workout.\n\nPower Flow - Build upon the flow workout by moving through the poses quicker in this power yoga workout.\n\nFlow - Enhance your foundation and alignment while focusing on bringing your breath and body into balance.\n\nMeditation - Train your mind to relax deeply and completely while bringing your entire system into sync with your breath. Gain inner harmony and clarity\n\nRequires: Yoga mat recommended but not included. ","torrent":{"xt":"urn:btih:a7bbc41bb67b74d35635ebf0f9570da902eb6f6d","amp;dn":"X+TrainFit+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7bbc41bb67b74d35635ebf0f9570da902eb6f6d","infoHashBuffer":{"type":"Buffer","data":[167,187,196,27,182,123,116,211,86,53,235,240,249,87,13,169,2,235,111,109]},"announce":[],"urlList":[]}}