{"title":"Preservation Hall Jazz Band - 1999 - Songs of New Orleans (2004)","uid":9420290,"size":793498129,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7d9995b852bf3a6ef217eff316e68cd353fdde8&amp;dn=Preservation+Hall+Jazz+Band+-+1999+-+Songs+of+New+Orleans+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eika256","files":-1,"time":1388571529,"description":"Preservation Hall Jazz Band - 1999 - Songs of New Orleans (2004)\n\nAlthough New Orleans' traditional jazz scene had many top players in the 1950s, there was no one center for the city's veteran greats to play. In 1961, local art dealer Larry Borenstein opened a building in the French Quarter called Preservation Hall. The young tuba player Allan Jaffe ran the hall and organized tours for the musicians who often performed there, naming the band after the venue. In the Hall's early days, the key musicians included, at various times, trumpeters Kid Thomas Valentine, Punch Miller, or De De Pierce; trombonists Louis Nelson or Jim Robinson; clarinetists George Lewis, Albert Burbank, or Willie Humphrey; and pianists Joseph Robichaux, Billie Pierce, or Sweet Emma Barrett. By the early '70s, trumpeter Percy Humphrey, his brother Willie on clarinet, and trombonist Jim Robinson (who, after his death in 1976, was succeeded by Frank Demond) usually comprised the front line. The deaths of the Humphreys and Percy's occasional fill-in Kid Sheik Colar in the mid-'90s signalled more lineup changes. Four decades after the group's genesis, the Preservation Hall Jazz Band continues to honor the musical traditions of New Orleans, despite these switches in personnel.\nIn general, the group's best recordings are their early records under the leadership of Barrett and the Pierces; they also cut three hit-or-miss albums for Columbia during 1976-1992. the Preservation Hall Jazz Band's worldwide tours have resulted in a good deal of goodwill, and the band remained on the road throughout much of 2005 and early 2006, due to the temporary closure of Preservation Hall in the wake of Hurricane Katrina. Although the hurricane devastated the city, it left some of the band's archival recordings unscathed, resulting in the release of Made in New Orleans: The Hurricane Sessions in 2007. In 2010, they delivered the charity album, Preservation: An Album to Benefit Preservation Hall &amp; the Preservation Hall Music Outreach Program, which featured guest appearances by an eclectic mix of artists including Del McCoury, Steve Earle, Angelique Kidjo, Terence Blanchard, and many others. A year later, they collaborated once again with McCoury on the jazz meets bluegrass album American Legacies. In 2013, Preservation Hall released That's It!, the band's first album of all-original material in its entire 50 year career. (AllMusic)\n\nTrack list:\nCD 1\n01 - Bill Bailey (Won't You Please Come Home)\n02 - Go To The Mardi Gras\n03 - Summertime\n04 - My Blue Heaven\n05 - Dr. Jazz\n06 - My Josephine\n07 - Old Spinning Wheel\n08 - Ti-pi Ti-pi Tin\n09 - (I Wish I Could) Shimmy Like My Sister Kate\n10 - Maryland, My Maryland\nCD 2\n01 - Bourbon Street Parade\n02 - Algiers Stomp\n03 - Somebody Else Is Taking My Place\n04 - Basin Street Blues\n05 - St. Phillip Street Breakdown\n06 - Milenburg Joys\n07 - Georgia On My Mind\n08 - Some of These Days\n09 - That's a Plenty\n10 - Careless Love\n11 - Please Don't Talk About Me When I'm Gone\n\nPersonnel:\nFrank Demond - trombone\nJoseph &quot;Little Joy&quot; Lastie\nNarvin Kimball - vocals, banjo\nRickie &quot;Professor&quot; Monie\nBenjamin Jaffe - bass instrument\nDr. Michael White - clarinet\nWendell Brunious - vocals, trumpet\n\nEnjoy and share!","torrent":{"xt":"urn:btih:a7d9995b852bf3a6ef217eff316e68cd353fdde8","amp;dn":"Preservation+Hall+Jazz+Band+-+1999+-+Songs+of+New+Orleans+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d9995b852bf3a6ef217eff316e68cd353fdde8","infoHashBuffer":{"type":"Buffer","data":[167,217,153,91,133,43,243,166,239,33,126,255,49,110,104,205,53,63,221,232]},"announce":[],"urlList":[]}}