{"title":"Assimil - Le Hindi Sans Peine","uid":7723250,"size":258305700,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a80400441f2b4e0a6b30d8eb8dddda61b4012a38&amp;dn=Assimil+-+Le+Hindi+Sans+Peine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"assimilfreak2","files":52,"time":1350134910,"description":"How did you learn to speak?\n\nYou probably don't even know. You listened to your parents, gradually understanding the meanings of sounds, words, and then whole sentences. Then, once you had absorbed or assimilated the meanings of the word associations, you began to link words and form your own sentences. Assimil applied this same natural process adapting it to the abilities of adults, young and old.\n\nYou assimilate in two phases:\nThe Passive Phase\nThe Active Phase\n\nThe first step is to familiarize yourself with the new language through daily sessions lasting 20 to 30 minutes. You listen and read and you understand what is being said through the translation provided. You repeat each sentence aloud to practice your pronunciation, with the help of easy phonetic spellings and, better still, recordings. During the Passive Phase you shouldn't try to form sentences. Just immerse yourself in the language. Every seventh lesson you'll find a review of all the points covered in the previous six lessons and a summary of the main grammar points learned during the week. The key to success is the daily routine.\n\nThe first two weeks are crucial. The rest will come naturally.\n\nThe Active Phase starts when you have acquired enough passive knowledge around Lesson 50.\n\nThis phase continues alongside passive learning, and involves revising Lesson 1, then Lesson 2 and so on, completing one &quot;active&quot; lesson and one &quot;passive&quot; lesson each day.\n\nIn the Active Phase, you cover up the text in the target language and, using the translation on the opposite page, try to say it out loud or in writing if you wish. The Active Phase continues throughout the entire second half of the book. For most major languages, it takes about five months to assimilate a course of 100 lessons.\n\nYou'll be amazed at your results! During this second phase, you will be building sentences with ease and this encourages you to go on and complete your course.\n\nA With Ease course will enable you to reach a level of fluent everyday conversation.","torrent":{"xt":"urn:btih:a80400441f2b4e0a6b30d8eb8dddda61b4012a38","amp;dn":"Assimil+-+Le+Hindi+Sans+Peine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a80400441f2b4e0a6b30d8eb8dddda61b4012a38","infoHashBuffer":{"type":"Buffer","data":[168,4,0,68,31,43,78,10,107,48,216,235,141,221,218,97,180,1,42,56]},"announce":[],"urlList":[]}}