{"title":"The English Teacher's Companion - Fourth Edition - Jim Burke","uid":10293762,"size":17615174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a81bc02d4f1436031bf536740278b2caa9c65fa8&amp;dn=The+English+Teacher%27s+Companion+-+Fourth+Edition+-+Jim+Burke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1401894518,"description":"A new companion for every English teacher\n\n*&quot;Why have I written an entirely new English Teacher's Companion*? Because to offer you anything less would suggest I had not grown, changed, or evolved these past fifteen years. I am not the same teacher I was when I wrote the first edition.&quot;\n-Jim Burke\n\nThe fourth edition of English Teacher's Companion is 100 percent new. Jim Burke has rewritten it to model methods for reaching a new generation of students-when all the ground rules for teaching are changing.\n\nA teacher's teacher and a recognized leader in English/language arts education, Jim understands the need for instructional methods that connect the why of teaching to the how. &quot;This edition makes the research behind my practice more explicit,&quot; he writes. &quot;It is also anchored in the Common Core State Standards, because I am still teaching every day-so these standards are my standards too.&quot;\n\nWeaving in ideas for working with ELLs, struggling readers, and technology, **English Teacher's Companion, Fourth Edition:\n\nlooks comprehensively at the research and reality of our profession, our students, and our content\nprovides practical and thoughtful methods for meeting standards in reading, writing, speaking and listening, and language study\nmakes assessment a priority, not only to find out what students know but to help practitioners improve.\n&quot;I have taught English for nearly 25 years, and I love it,&quot; writes Jim Burke. Never has this love been more apparent than in the numerous lessons and teaching moves he includes as well as in the many examples of his own classroom language. Trust the fourth edition of *English Teacher's Companion, *and bring the passion, power, and practicality of one of America's best teachers to your classroom.\n\nAbout the Author\n\nJim Burke is the author of numerous bestselling Heinemann titles, including the English Teacher's Companion, Fourth Edition and What's the Big Idea? The question he's always tried to answer is &quot;How can we teach our students better?&quot; He seeks these answers daily through his work in his own classroom at Burlingame High School in California where he still teaches after twenty years. Facing the same constraints and challenges as every other teacher, Jim shares his creative solutions in bestselling professional titles with Heinemann such as Reading Reminders and Writing Reminders as well as through Heinemann Professional Development Services. As part of his commitment to helping teachers and learning how to use the latest technologies, he founded the English Companion Ning, described by Education Week as &quot;the world's largest English department&quot; and winner of several Edublog Awards for Best Social Network for Education. In addition to the EC Ning, Jim offers a steady stream of recommended resources through his website (www.englishcompanion.com) and Twitter (@englishcomp) where he is ranked in the top 100 educators to follow at the top within the online English teacher community. Jim serves on several national commissions related to adolescent literacy and standards, including the Advanced Placement English Literature and Language Course and Exam Review Commission with the College Board and the Partnership for Assessment of Readiness for College and Careers (PARCC) where he serves on the Content Technical Working Group, which advises PARCC on the national assessments being developed for the Common Core State Standards. In addition, he is a senior author on the Holt McDougal Harcourt Literature series. Jim has received numerous awards, including the NCTE Intellectual Freedom Award, the NCTE Conference on English Leadership Award, and the California Reading Association Hall of Fame Award. He served on the National Board for Professional Teaching Standards Committee on Adolescence and Young Adulthood English Language Arts Standards. Through his work in the class and on such commissions, Jim Burke seeks not only to clarify but reimagine what English should be, honoring the past even as he works with others to create the future of the discipline he loves so much.","torrent":{"xt":"urn:btih:a81bc02d4f1436031bf536740278b2caa9c65fa8","amp;dn":"The+English+Teacher%27s+Companion+-+Fourth+Edition+-+Jim+Burke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81bc02d4f1436031bf536740278b2caa9c65fa8","infoHashBuffer":{"type":"Buffer","data":[168,27,192,45,79,20,54,3,27,245,54,116,2,120,178,202,169,198,95,168]},"announce":[],"urlList":[]}}