{"title":"Conspiracy.Theory.with.Jesse.Ventura.S02E04.Police.State.HDTV.Xv","uid":5953772,"size":364263190,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8768e2d708ab61f2ae598888b19d4ac0a0957ca&amp;dn=Conspiracy.Theory.with.Jesse.Ventura.S02E04.Police.State.HDTV.Xv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"k3nd00d","files":-1,"time":1289631067,"description":"Video: Xvid 512x384 29.97fps 999kbps\nAudio: MPEG Audio Layer 3 44100Hz stereo 96kbps\nAR: 4:3\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nConspiracy Theory with Jesse Ventura\n\nSeason 2 Episodes\n\n\nEpisode 1 - &quot;Plum Island&quot;\nPremieres Fri, October 15, 2010 at 10P\nJesse storms Congress to find out if the government is conducting dangerous\nexperiments at the Plum Island Animal Research Center off the coast of Long\nIsland. The center, which began as a bio-warfare lab run by former Nazi\nscientists, has been blamed for spreading diseases and viruses throughout the\nmainland, including African swine flu and Lyme disease. Some suspect the\nmysterious Montauk Monster emanated from the facility. TV-14\n\nEpisode 2 - &quot;Area 51&quot;\nPremieres Fri, October 29, 2010 at 10P\nQuestions surrounding the military's secret research base in the Nevada desert\nhave been swirling around for years. Jesse faces off against guards at Area 51,\nto find out why the Joint Terrorism Task Force raided the homes of two Area 51\nwatchdogs and to review alleged evidence that the government has been faking\nUFO sightings and alien abductions in order to cover up darker secrets at the\nbase. TV-PG-L\n\nEpisode 3 - &quot;Wall Street&quot;\nPremieres Fri, November 5, 2010 at 10P\nJesse goes inside the secret billionaire's boy's club to find out what caused\nthe financial meltdown and how the group allegedly continues to manipulate and\ncontrol the stock market and oil, gold and silver prices. From Wall Street to\nWashington, the governor barges in on the rich and powerful to demands answers.\nTV-PG-L\n\n**THIS EPISODE** Episode 4 - &quot;Police State&quot;\nPremieres Fri, November 12, 2010 at 10P\nIt's been said the government has a plan to declare martial law and round up\nmillions of United State citizens into concentration camps. Jesse may have\nfound a conspiracy in plain sight as he investigates the proliferation of law\nenforcement Fusion Centers around the country. And they may be connected to\nhundreds of detention centers ready to accept prisoners at the stroke of a\nPresidential pen. TV-PG-L\n\nEpisode 5 - &quot;JFK Assassination&quot;\nPremieres Fri, November 19, 2010 at 10P\nNever-published declassified CIA documents appear to support a link between the\nassassination of John F. Kennedy and the Watergate scandal that brought down\nRichard Nixon. To find out for sure, Jesse Ventura goes to Dallas, where he\nmeets Lee Harvey Oswald's widow, Marina, and investigates the &quot;Two Oswalds&quot;\ntheory that a CIA-groomed double killed JFK. TV-PG-L\n\nEpisode 6 - &quot;Great Lakes&quot;\nPremieres Fri, November 26, 2010 at 10P\nVentura looks into the prospects of &quot;Blue Gold&quot; and why corporations and the\nsuper-rich are buying up water rights around the world in what could be a plan\nin controlling the nations and their masses. He looks into evidence that these\ntactics are going on in North America in what could be a literal theft of the\nGreat Lakes. TV-PG-L\n\n\nmore? ...unknown.\n\n","torrent":{"xt":"urn:btih:a8768e2d708ab61f2ae598888b19d4ac0a0957ca","amp;dn":"Conspiracy.Theory.with.Jesse.Ventura.S02E04.Police.State.HDTV.Xv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8768e2d708ab61f2ae598888b19d4ac0a0957ca","infoHashBuffer":{"type":"Buffer","data":[168,118,142,45,112,138,182,31,42,229,152,136,139,25,212,172,10,9,87,202]},"announce":[],"urlList":[]}}