{"title":"The Beatles - Help [MONO] [320k MP3]","uid":7645973,"size":172897950,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a886779003c94d3aee10b7fa076fd426e7bb1dc2&amp;dn=The+Beatles+-+Help+%5BMONO%5D+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1347904055,"description":"Help! is the title of the fifth British and tenth North American album by The Beatles, and the soundtrack from their film of the same name. Produced by George Martin for EMI's Parlophone Records, it contains fourteen songs in its original British form, of which seven appeared in the film. These songs took up the first side of the vinyl album and included the singles &quot;Help!&quot; and &quot;Ticket to Ride&quot;. The second side contained seven other releases including one of the most-covered songs ever written, &quot;Yesterday&quot;. \n\nThe American release was a true soundtrack album, mixing the first seven songs with orchestral material from the film. Of the other seven songs that were on the British release, two were released on the US version of the next Beatles album, Rubber Soul, two were back-to-back on the next US single and then appeared on Yesterday and Today, and three had already been on Beatles VI.\n\nIn 2012, Help! was voted 331st on Rolling Stone magazine's list of the &quot;500 Greatest Albums of All Time&quot;\n\nThere have been three Compact Disc releases of Help!. The first was on 30 April 1987, using the 14-song UK track line-up. Having been available only as an import in the US in the past, the original 14-track UK version replaced the original US version with its release on LP and cassette as well on 21 July 1987. As with the CD release of the 1965 Rubber Soul album, the Help! CD featured a contemporary stereo digital remix of the album prepared by Martin in 1986. Martin had expressed concern to EMI over the original 1965 stereo remix, claiming it sounded &quot;very woolly, and not at all what I thought should be a good issue&quot;. Martin went back to the original four-tracks tapes and remixed them for stereo. One of the most notable changes is the echo added to &quot;Dizzy Miss Lizzy&quot;, something that was not evident on the original mix of the LP. Certain Canadian-origin CD editions of Rubber Soul and Help! use the original mixes of the albums, presumably in error.\n\nThe 2009 remastered stereo CD was released on 9 September. It was &quot;created from the original stereo digital master tapes from Martin's CD mixes made in 1986&quot; . The disc in the mono box set contains the 1965 mono mix as well as the 1965 stereo mix.\n\n2009 MONO/1965 STEREO REMASTER [320k MP3]\n\n01. \t&quot;Help!&quot;   \tLennon \t2:18\n02. \t&quot;The Night Before&quot;   \tMcCartney \t2:33\n03. \t&quot;You've Got to Hide Your Love Away&quot;   \tLennon \t2:08\n04. \t&quot;I Need You&quot; (George Harrison) \tHarrison \t2:28\n05. \t&quot;Another Girl&quot;   \tMcCartney \t2:05\n06. \t&quot;You're Going to Lose That Girl&quot;   \tLennon \t2:17\n07. \t&quot;Ticket to Ride&quot;   \tLennon \t3:10\n08. \t&quot;Act Naturally&quot; (Voni Morrison) \tStarr and McCartney \t2:29\n09. \t&quot;It's Only Love&quot;   \tLennon \t1:54\n10. \t&quot;You Like Me Too Much&quot; (Harrison) \tHarrison \t2:35\n11. \t&quot;Tell Me What You See&quot;   \tLennon and McCartney \t2:36\n12. \t&quot;I've Just Seen a Face&quot;   \tMcCartney \t2:04\n13. \t&quot;Yesterday&quot;   \tMcCartney \t2:03\n14. \t&quot;Dizzy Miss Lizzy&quot; (Larry Williams) \tLennon \t2:53\t\t","torrent":{"xt":"urn:btih:a886779003c94d3aee10b7fa076fd426e7bb1dc2","amp;dn":"The+Beatles+-+Help+%5BMONO%5D+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a886779003c94d3aee10b7fa076fd426e7bb1dc2","infoHashBuffer":{"type":"Buffer","data":[168,134,119,144,3,201,77,58,238,16,183,250,7,111,212,38,231,187,29,194]},"announce":[],"urlList":[]}}