{"title":"The Complete Hitler - 3400 pages","uid":8588333,"size":21115047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8b760c515bf3586f1fc1b2e659a7c09be4ac1ae&amp;dn=The+Complete+Hitler+-+3400+pages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":1,"time":1371580588,"description":"Domarus' indispensable eight volumes 5,724 pages total; four volumes in English, four in German of Hitler's speeches and proclamations with commentary is available in an easily portable eBook. This searchable PDF document (created with AdobeTM AcrobatTM) provides incomparable access for anyone interested in research and in-depth study. Special Features * Easily perform complex proximity searches to discover elements of Hitler's dictatorship not easily indexed. Click on the search results to navigate within the text. * Run basic keyword searches for any term, name, or place regardless of diacritics. * Bookmarks for each year and each event of the rise and fall of Adolf Hitler immediately bring you into the text. * Click on over 5,000 linked notes for instant access to additional context and commentary. * Follow links to images documenting Hitler's seduction of a nation and the aftermath of post-World War II Europe. This translation compiles speeches and proclamations from Hitler's rise to power in 1932 to his demise in 1945. It provides insight into his political agenda and ideology in an unprecedented span of years. Described as 'essential,' 'extraordinarily useful,' and 'indispensable,' this standard reference work on the Third Reich represents the most comprehensive collection of Hitler's Speeches, with an extensive commentary and the largest set of footnotes. It provides insight into his political agenda and ideology in addition to demonstrating his organizational and rhetorical skills. The four-volume set, Hitler Speeches and Proclamations is completely translated into English for the first time and is a much-needed addition to every public, research, historical, or personal library. 'An invaluable reference tool' Holocaust Museum, Washington D.C. 'An indispensable source for the history of our times.' Alan Bullock\n &lt;a href=&quot;\nhttp://www.amazon.com/The-Complete-Hitler-Reference-Proclamations/dp/0865166587/ref=sr_1_3?ie=UTF8&amp;qid=1371573076&amp;sr=8-3&amp;keywords=hitler+complete&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Complete-Hitler-Reference-Proclamations/dp/0865166587/ref=sr_1_3?ie=UTF8&amp;qid=1371573076&amp;sr=8-3&amp;keywords=hitler+complete&lt;/a&gt;","torrent":{"xt":"urn:btih:a8b760c515bf3586f1fc1b2e659a7c09be4ac1ae","amp;dn":"The+Complete+Hitler+-+3400+pages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b760c515bf3586f1fc1b2e659a7c09be4ac1ae","infoHashBuffer":{"type":"Buffer","data":[168,183,96,197,21,191,53,134,241,252,27,46,101,154,124,9,190,74,193,174]},"announce":[],"urlList":[]}}