{"title":"Robert W. Tebbs, Photographer to Architects (Art Ebook)","uid":11777728,"size":85563756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8c87751f121408d67843e309aede2d49cf4f206&amp;dn=Robert+W.+Tebbs%2C+Photographer+to+Architects+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":1,"time":1427398591,"description":"Robert W. Tebbs, Photographer to Architects: Louisiana Plantations in 1926 By Robert Cangelosi, Richard Anthony Lewis\n2011 | 168 Pages | ISBN: 0807142182 | PDF | 82 MB\n\nOne of the finest architectural photographers in America, Robert W. Tebbs produced the first photographic survey of Louisiana s plantations in 1926. From those images, now housed in the Louisiana State Museum, and never before widely available, 110 plates showcasing fifty-two homes are reproduced here. \n\nRichard Anthony Lewis explores Tebbs's life and career, situating his work along the line of plantation imagery from nineteenth-century woodcuts and paintings to later twentieth-century photographs by John Clarence Laughlin, among others. Providing the family lineage and construction history of each home, Lewis discusses photographic techniques Tebbs used in his alternating panoramic and detail views. \n\nA precise documentarian, Tebbs also reveals a poetic sensibility in the plantation photos: a frequent emphasis on aspects of decay, neglect, incompleteness, and loss lends a wistful aura compounded by the fact that many of the homes no longer exist. This noticeable ambivalence between objectivity and sentiment, Lewis shows, suggests unfamiliarity and even discomfort with the legacy of slavery. \n\nLouisiana in the mid-1920s moved from an economy beyond slave-based agriculture, toward mechanization, and on the brink of social and political reforms. Tebbs's Louisiana plantation photographs capture a literal and cultural past, reflecting a new national awareness of historic preservation and presenting plantations to us anew. \n\nPlantations pictured include: Ashland/Belle Helene, Avery Island, Belle Chasse, Belmont, Butler-Greenwood, L'Hermitage, Oak Alley, Parlange, Rene Beauregard House, Rosedown, Seven Oaks, Shadows-on-the-Teche, The Shades, and Waverly","torrent":{"xt":"urn:btih:a8c87751f121408d67843e309aede2d49cf4f206","amp;dn":"Robert+W.+Tebbs%2C+Photographer+to+Architects+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8c87751f121408d67843e309aede2d49cf4f206","infoHashBuffer":{"type":"Buffer","data":[168,200,119,81,241,33,64,141,103,132,62,48,154,237,226,212,156,244,242,6]},"announce":[],"urlList":[]}}