{"title":"Karin Slaughter - Onbegrepen (audioboek)(Dutch) 2Lions-Team","uid":5923890,"size":77597504,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a8e678e9c6e48c66c930f5619002c2798efcb594&amp;dn=Karin+Slaughter+-+Onbegrepen+%28audioboek%29%28Dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Pioen","files":-1,"time":1288486587,"description":"Karin Slaughter - Onbegrepen\n\n\n\n\nKarin Slaughter: Onbegrepen\nDE DODELIJKE LUCHTVERFRISSER\nPeter Kuijt\n\n&quot;Een kleine traktatie voor liefhebbers van misdaad.'' Ze zegt het zelf, maar het is de perfecte omschrijving van het geschenkboekje Onbegrepen dat Karin Slaughter voor 'Juni - Maand van het Spannende Boek' heeft geschreven. Het op verzoek van de Stichting CPNB geschreven boekje is een cadeautje vol grofkorrelige satire geworden. Zoals het een thriller betaamt komt er wel moord en doodslag in voor, maar niet zo gruwelijk zoals in de 'reguliere' spannende romans van de Amerikaanse bestsellerauteur.\n\nBuiten de Verenigde Staten was Nederland het eerste land waar Slaughter onderdak vond bij een uitgeverij. Als blijk van waardering heeft ze een 'Nederlands' tintje aan Onbegrepen verschaft: de vrouwelijke rechercheur Anther Albada in de novelle is de dochter van immigranten uit Hindeloopen.\n\nMaar het boekje draait in feite om Martin Reed, hoofdboekhouder bij het bedrijf Southern Toiletbenodigdheden. Hij woont nog thuis bij een kreng van een moeder. Zijn fysiek helpt ook niet mee: hij heeft een weke kaaklijn, een haakneus en zijn hele lijf doet denken aan 'Jodie Foster in haar studententijd'. Op kantoor wordt hij constant gepest: het woord 'lul' is in de lak van zijn Toyota Camry gekrast en een vibrerende rubberen dildo werd met secondenlijm op zijn bureau geplakt. Kortom, Reed beschikt over de ideale omstandigheden voor een miserabel leven.\n\nReed zoekt zijn toevlucht in zijn enige echte passie: het lezen van misdaadromans. En die thrillers komen hem tot op zekere hoogte van pas als hij verdacht wordt van moord op twee collega's. Van de eerste zijn resten in het bandenprofiel van zijn Toyota gevonden en de tweede werd in het damestoilet gevonden, gedood met een muurmodel luchtverfrisser. Het is bij die gelegenheid dat Martin Reed met rechercheur Albada wordt geconfronteerd en hoewel hij zijn onschuld niet kan bewijzen, stevent het verhaal af op een vrolijk einde.\n\nOnbegrepen is een fraai geschenk. Hier en daar wat grof gebekt, maar goed geschreven, vol zwarte humor en knetterende dialogen. Slaughter kent haar klassiekers door te verwijzen naar Patricia Cornwell, Kathy Reichs, Tom Clancy, John Grisham, Ann Rule en anderen. Maar een klassieke 'Slaughter' is Onbegrepen niet. Zie daarvoor Nachtschade, Zoenoffer, Onzichtbaar of Onaantastbaar.\n\nOnbegrepen van Karin Slaughter telt 95 pagina's en wordt verspreid in een oplage van 740.000 exemplaren. Het boekje wordt in juni cadeau gegeven bij aankoop van tenminste 12,50 euro aan Nederlandstalige boeken.\n\nSpotinformatie \nCategorie : Geluid \nFormaat : MP3 \n\nMet dank aan poster clair1991\n\n*****************************************\n\nBrought to you by \n2Lions Team\n","torrent":{"xt":"urn:btih:a8e678e9c6e48c66c930f5619002c2798efcb594","amp;dn":"Karin+Slaughter+-+Onbegrepen+%28audioboek%29%28Dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8e678e9c6e48c66c930f5619002c2798efcb594","infoHashBuffer":{"type":"Buffer","data":[168,230,120,233,198,228,140,102,201,48,245,97,144,2,194,121,142,252,181,148]},"announce":[],"urlList":[]}}