{"title":"The Letters of Robert Frost Volume 1 (838p) [Inua].pdf","uid":11602121,"size":4460728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a919a0beecdbc5497815b2b5b630b99be3b4dd38&amp;dn=The+Letters+of+Robert+Frost+Volume+1+%28838p%29+%5BInua%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Inua1","files":1,"time":1417366489,"description":"Title: The Letters of Robert Frost, Volume 1: 1886 - 1920 \nAuthor: Robert Frost \nEditors: Donald Sheehy, Mark Richardson, Robert Faggen\nSeries: Letters of Robert Frost\nHardcover: 848 pages\nPublisher: Belknap Press; annotated edition edition (February 27, 2014)\nLanguage: English\nISBN-10: 0674057600\nISBN-13: 978-0674057609\n\nDescription:\nOne of the acknowledged giants of twentieth-century American literature, Robert Frost was a public figure much celebrated in his day. Although his poetry reached a wide audience, the private Frost--pensive, mercurial, and often very funny--remains less appreciated. Following upon the publication of Frost's notebooks and collected prose, The Letters of Robert Frost is the first major edition of the poet's written correspondence. The hundreds of previously unpublished letters in these annotated volumes deepen our understanding and appreciation of this most complex and subtle of verbal artists.\n\nVolume One traverses the years of Frost's earliest poems to the acclaimed collections North of Boston and Mountain Interval that cemented his reputation as one of the leading lights of his era. The drama of his personal life--as well as the growth of the audacious mind that produced his poetry--unfolds before us in Frost's day-to-day missives. These rhetorical performances are at once revealing and tantalizingly evasive about relationships with family and close friends, including the poet Edward Thomas. We listen in as Frost defines himself against contemporaries Ezra Pound and William Butler Yeats, and we witness the evolution of his thoughts about prosody, sound, style, and other aspects of poetic craft.\n\nIn its literary interest and sheer display of personality, Frost's correspondence is on a par with the letters of Emily Dickinson, Robert Lowell, and Samuel Beckett. The Letters of Robert Frost holds hours of pleasurable reading for lovers of Frost and modern American poetry","torrent":{"xt":"urn:btih:a919a0beecdbc5497815b2b5b630b99be3b4dd38","amp;dn":"The+Letters+of+Robert+Frost+Volume+1+%28838p%29+%5BInua%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a919a0beecdbc5497815b2b5b630b99be3b4dd38","infoHashBuffer":{"type":"Buffer","data":[169,25,160,190,236,219,197,73,120,21,178,181,182,48,185,155,227,180,221,56]},"announce":[],"urlList":[]}}