{"title":"Jerry Goldsmith - Star Trek The Motion Picture (2CD) [EAC-FLAC]","uid":4804055,"size":578561210,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9b898ef845311cd3ea12cd8fe610788f3a9d61e&amp;dn=Jerry+Goldsmith+-+Star+Trek+The+Motion+Picture+%282CD%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"repopo","files":42,"time":1238140058,"description":"TRACKLIST\n\nJerry Goldsmith - Star Trek: The Motion Picture\n\n01.   Ilia's Theme      03:02\n02.   Main Title        01:23\n03.   Klingon Battle    05:27\n04.   Total Logic       03:44\n05.   Floating Office   01:03\n06.   The Enterprise    06:00\n07.   Leaving Drydock   03:30\n08.   Spock's Arrival   02:00\n09.   The Cloud         04:59\n10.   Vejur Flyover     04:58\n11.   The Force Field   05:03\n12.   Games             03:41\n13.   Spock Walk        04:20\n14.   Inner Workings    03:02\n15.   Vejur Speaks      03:50\n16.   The Meld          03:09\n17.   A Good Start      02:27\n18.   End Titles        03:17\n\n\nON THE MOVIE SOUNDTRACK (from Wikipedia)\n\nThe score for Star Trek: The Motion Picture was written by Jerry Goldsmith, who would later compose the scores Star Trek V: The Final Frontier, Star Trek: First Contact, Star Trek: Insurrection, and Star Trek Nemesis, as well as the themes to the television series Star Trek: The Next Generation and Star Trek: Voyager. Gene Roddenberry had originally wanted Goldsmith to score Star Trek's pilot episode, &quot;The Cage&quot;, but the composer was unavailable. When Wise signed on to direct, Paramount asked the director if he had any objection to using Goldsmith. Wise, who had worked with the composer for The Sand Pebbles, replied &quot;Hell, no. He's great!&quot; Wise would later consider his work with Goldsmith one of the very best relationships he ever had with a composer.\n\nFor Star Trek, Goldsmith was charged with depicting a universe with his music, and so it is extremely expansive. Goldsmith's initial main theme was not well-received by the filmmakers (director Robert Wise felt &quot;It sounds like sailing ships&quot;). Although somewhat irked by its rejection, Goldsmith consented to re-work his initial ideas. Star Trek: The Motion Picture is the only Star Trek film to have a true overture, using &quot;Ilia's Theme&quot; for this music. Star Trek and The Black Hole would be the only feature films to use an overture from the end of 1979 until the year 2000 (with the movie Dancer in the Dark). The rush to finish the film impacted the music as well; Goldsmith finished recording the score only five days before the release.\n\nMuch of the recording equipment used to create the movie's intricately complicated sound effects was, at the time, extremely cutting edge. Among these pieces of equipment was the ADS (Advanced Digital Synthesizer) 11, manufactured by Pasadena, California custom synthesizer manufacturer Con Brio, Inc. The movie provided major publicity at the time and was used to advertise the synthesizer, though no price was given at the time. The film's soundtrack also provided a debut for the Blaster Beam, an electronic instrument about 12 to 15 feet long and played with an artillery shell. Jerry Goldsmith used it to create the eerie signature V'Ger sound. Goldsmith also utilized a large pipe organ, which required the score be recorded at 20th Century Fox (which had the only scoring stage in Los Angeles equipped with such an organ).\n\nREVIEW (by Bruce Eder, allmusic.com) ON THE 20TH ANNIVERSARY EDITION\n\nIssued in 1999 after some considerable delay (and heavily available as a promo before that), this double-CD set corrects a lot of the mistakes that were made on the original LP and CD releases. For starters, there are about 20 more minutes of music from the film here -- Columbia Records obviously wanted to hold the original LP release to one disc, but they still could have gotten most, if not all, of the extra material on. The additional music isn't anything profound, because all of the major thematic material was represented on the original LP and its CD equivalent -- it's mostly just more of the Vejur oscillations over dark orchestral chords, but anything that gets more Jerry Goldsmith music into print is intrinsically OK. Indeed, listening to the full score here, it is more apparent than ever just how important Goldsmith's score was to the lethargically paced, deeply troubled film -- almost all of the majesty, excitement, and mystery that the screen was supposed to present actually resides in the music, and Goldsmith probably deserved an Academy Award, not just a nomination, for his contribution to this movie. Additionally, one of the new tracks, &quot;Spock's Arrival,&quot; may be the closest that Goldsmith has ever come to writing serious music in a pure Romantic idiom; this could have been the work of Rimsky-Korsakov or Stravinsky -- it's that good. And all of the music has been remastered in state-of-the-art 20-bit sound, so the previously available parts of the score sound deeper and brighter -- one also gets echoes of his score for Alien amid the sweeping orchestral passages. The second disc is given over to the reissue of the mid-'70s Inside Star Trek LP, which was a Columbia release -- it's mostly talk by creator/producer Gene Roddenberry with William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, and Nichelle Nichols, with some comments by Isaac Asimov, some theme music, and some sound effects. It won't tell you much that the interviews accompanying the Sci-Fi Channel's rebroadcast of the uncut original series didn't, but it's handy to have as an improbable CD re-release.\n\nON JERRY GOLDSMITH (from Wikipedia)\n\nGoldsmith was born in Los Angeles, California, the son of Tessa (nÃƒÂ©e Rappaport), an artist, and Morris Goldsmith, a structural engineer. He learned to play the piano at age six. At fourteen, he studied composition, theory and counterpoint with teachers Jacob Gimpel and Mario Castelnuovo-Tedesco. Goldsmith attended the University of Southern California, where he attended courses taught by veteran composer MiklÃƒÂ³s RÃƒÂ³zsa. Goldsmith developed an interest in writing scores for movies after being inspired by RÃƒÂ³zsa.\n\nGoldsmith provided tailor-made scores for many different genres; including war films (The Blue Max), film noir (Chinatown), action movies (Rambo: First Blood and the first two sequels), erotic thrillers (Basic Instinct), sports pictures (Rudy), family comedies (The Trouble with Angels), westerns (Breakheart Pass), comic book adaptations (Supergirl), animated features (The Secret of NIMH), and science fiction (Total Recall, Alien and five Star Trek films). His ability to write terrifying music won him his only Academy Award for his violent choral/orchestral score for The Omen. He also was awarded with Emmys for television scores like the Holocaust drama QB VII, and the epic Masada, as well as the theme for Star Trek: Voyager.\n\nGoldsmith also composed for The Waltons TV series (including its famous theme), a fanfare for the Academy Awards presentation show and the score for one of the Disneyland Resort's most popular attractions, Soarin' Over California. Goldsmith never cared for the term &quot;film composer&quot;, as he also wrote a fair amount of &quot;absolute&quot; music for the concert hall as well (such as &quot;Music For Orchestra&quot;, which was premiered by Leonard Slatkin and the Minnesota Orchestra in 1970).\n\nGoldsmith was a lover of innovation and adaptation, and the use of strange instruments. His score for Alien for example featured an orchestra augmented by shofar, steel drum and serpent (a 16th century instrument), while creating further &quot;alien&quot; sounds by filtering string pizzicati through an echoplex. Many of the instruments in Alien were used in such atypical ways they were virtually unidentifiable. During the 80s, with the development of more sophisticated synthesizers and technology such as MIDI, Goldsmith started to abandon acoustical solutions to create unusual timbres, and relied more and more on digital instruments. He continued to champion the use of orchestras however (to which, for him, electronics were merely an adjunct). He also remained a studious researcher of ethnic music, and utilized South American ZampoÃƒÂ±as in Under Fire, native tribal chants in Congo, and interwove a traditional Irish folk melody with African rhythms in The Ghost and the Darkness. His concept for creation and innovation delighted his fans -- and often intimidated his peers. Henry Mancini, another film-music composer, once admitted that Goldsmith &quot;scares the hell out of us.&quot;\n\nA list of his most distinguished film scores, most of which were Oscar nominated and all of which exhibit his dramatic instinct, include Freud, A Patch of Blue, The Blue Max, The Sand Pebbles, Planet of the Apes, Patton, Papillon, Chinatown, The Wind and the Lion, The Omen, Logan's Run, Islands in the Stream (acknowledged by Goldsmith as his own personal favorite), The Boys from Brazil, Capricorn One, Alien, The First Great Train Robbery, Star Trek: The Motion Picture, Twilight Zone: The Movie, Lionheart, The Russia House, First Blood, Rambo: First Blood Part II, Rambo III, Total Recall, Medicine Man, Basic Instinct, Hoosiers, The Edge, The 13th Warrior and The Mummy. Goldsmith's Oscar-nominated score for Under Fire (1983) prominently featured solo guitar work by Pat Metheny. Of all the scores he wrote, Goldsmith has said that Basic Instinct was the hardest and most complex, according to a mini-documentary on the special edition DVD.\n\nOne of Goldsmith's least-heard scores was for the 1985 Ridley Scott film Legend. Director Scott had commissioned Goldsmith to write an orchestral score for the movie, but was initially heard only in European theatres, and replaced with electronic music and pop songs for the American release due to studio politics (it has since been restored for DVD release).\n\n\n\nINSIDE STAR TREK\n\nTRACKLIST\n\nGene Roddenberry - Inside Star Trek\n\n01.   Star Trek Theme                         01:31\n02.   Introduction                            01:12\n03.   Inside Star Trek                        01:04\n04.   William Shatner Meets Captain Kirk      09:11\n05.   Introduction to Live Show               00:25\n06.   About Science Fiction                   00:40\n07.   The Origin of Spock                     01:44\n08.   Sarek's Son Spock                       07:20\n09.   The Questor Affair                      03:49\n10.   The Genesis 2 Pilot                     02:34\n11.   Cyborg Tools and ET Life Forms          04:05\n12.   McCoy's RX for Life                     06:14\n13.   The Star Trek Philosophy                04:39\n14.   Asimov's World of Science Fiction       06:27\n15.   The Enterprise Runs Around              01:49\n16.   A Letter From a Network Censor          05:03\n17.   The Star Trek Dream                     05:47\n18.   Sign Off                                00:45\n","torrent":{"xt":"urn:btih:a9b898ef845311cd3ea12cd8fe610788f3a9d61e","amp;dn":"Jerry+Goldsmith+-+Star+Trek+The+Motion+Picture+%282CD%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9b898ef845311cd3ea12cd8fe610788f3a9d61e","infoHashBuffer":{"type":"Buffer","data":[169,184,152,239,132,83,17,205,62,161,44,216,254,97,7,136,243,169,214,30]},"announce":[],"urlList":[]}}