{"title":"Optimum Design of Steel Structures","uid":9710300,"size":2508254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9de5c9267f2696f3a7265179d67f74f3b68ad6c&amp;dn=Optimum+Design+of+Steel+Structures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394103748,"description":"2013 | 280 pages | PDF | 3 Mb\n\nThis book helps designers and manufacturers to select and develop the most suitable and competitive steel structures, which are safe, fit for production and economic. An optimum design system is used to find the best characteristics of structural models, which guarantee the fulfilment of design and fabrication requirements and minimize the cost function. Realistic numerical models are used as main components of industrial steel structures.\nChapter 1 containts some experiences with the optimum design of steel structures\nChapter 2 treats some newer mathematical optimization methods.\nChapter 3 gives formulae for fabrication times and costs.\nChapters 4 deals with beams and columns. Summarizes the Eurocode rules for design.\nChapter 5 deals with the design of tubular trusses.\nChapter 6 gives the design of frame structures and fire-resistant design rules for a frame.\nIn Chapters 7 some minimum cost design problems of stiffened and cellular plates and shells are worked out for cases of different stiffenings and loads.\nChapter 8 gives a cost comparison of cylindrical and conical shells.\nThe book contains a large collection of literatures and a subject list and a name index. ","torrent":{"xt":"urn:btih:a9de5c9267f2696f3a7265179d67f74f3b68ad6c","amp;dn":"Optimum+Design+of+Steel+Structures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9de5c9267f2696f3a7265179d67f74f3b68ad6c","infoHashBuffer":{"type":"Buffer","data":[169,222,92,146,103,242,105,111,58,114,101,23,157,103,247,79,59,104,173,108]},"announce":[],"urlList":[]}}