{"title":"Harvard Business Review 09/13-02/14 5 issues","uid":9389604,"size":131279913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa495ada8b71e0d83aadb1205561f1c14d6cb377&amp;dn=Harvard+Business+Review+09%2F13-02%2F14+5+issues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sidmal","files":-1,"time":1387859503,"description":"Harvard Business Review (HBR) is a general management magazine published by Harvard Business Publishing, a wholly owned subsidiary of Harvard University. It is published 10 times a year and is headquartered in Watertown, Massachusetts.\n\nHBR's articles cover a wide range of topics that are relevant to different industries, management functions, and geographic locations. They focus on such areas as leadership, organizational change, negotiation, strategy, operations, marketing, finance, and managing people.\n\nHarvard Business Review has been the frequent publishing home for scholars and management thinkers such as Clayton M. Christensen, Peter F. Drucker, Michael E. Porter, Rosabeth Moss Kanter, John Hagel III, Thomas H. Davenport, Gary Hamel, C.K. Prahalad, Vijay Govindarajan, Robert S. Kaplan, Rita Gunther McGrath and others. Management concepts and business terms such as Balanced scorecard, Core competence, Strategic intent, Reengineering, Globalization, Marketing myopia, and Glass ceiling were all first given prominence in HBR.[citation needed]\n\nHarvard Business Review's worldwide English-language circulation is 250,000. HBR licenses its content for publication in eleven languages besides English: Chinese, German, Hebrew, Hungarian, Italian, Japanese, Polish,Portuguese, Russian, Spanish, Taiwanese.\n","torrent":{"xt":"urn:btih:aa495ada8b71e0d83aadb1205561f1c14d6cb377","amp;dn":"Harvard+Business+Review+09%2F13-02%2F14+5+issues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa495ada8b71e0d83aadb1205561f1c14d6cb377","infoHashBuffer":{"type":"Buffer","data":[170,73,90,218,139,113,224,216,58,173,177,32,85,97,241,193,77,108,179,119]},"announce":[],"urlList":[]}}