{"title":"NLP - Bandler, Grinder, Erickson, John La Tourette &amp; more","uid":4413890,"size":44632644367,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aae23caf803a9729b73bd4f8cb3c8e7b20f2fb6a&amp;dn=NLP+-+Bandler%2C+Grinder%2C+Erickson%2C+John+La+Tourette+%26+more&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":5,"uploader":"Typci","files":139,"time":1222408921,"description":"NLP other good stuff.\n\nIf you have downloaded my other nlp torrents, then you have some of this material already.  I am consolidating my NLP stuff into one torrent.\n\nI will continue uploading new material, however, I don't want to have to seed and keep up with multiple torrents.  I'm far too ADD for that. If anyone has a knows how to add new material to an existing torrent, let me know.\n\nAnyway, here is 15 gigs of new material: Richard Bandler, John Grinder, John La Tourette, and Kenrick Cleveland.  And the old Michael Hall and NLP Colorado Institue stuff.\n\nIf videos are extremely bad (not just bad) quality or don't play, reply in the comments and I will search for a better version.\n\nKnow some NLP greats that I missed? Add to comments, and I may be able to get them.\n\n\nUpdate (10-14-08):\nAlright, this torrent is almost seeded, which means soon we can move on to the next step.  Here is the deal: I have another 31.3 gigs of NLP related stuff.  But there is a catch: It is incomplete.  So it is time for all the leechers to pitch in, because the material isn't worth much if you don't have the whole series.  I'm going to upload what I have, and I'm going to tell you where you can get the missing files.  So here is the deal:  I need people to seed this torrent, so I can put the next one up.  Then I need to people downloading the next torrent to to go get the missing files and either start a new torrent with the complete series, or get the missing files to me so I can make a new torrent.  Anybody up for the challenge?","torrent":{"xt":"urn:btih:aae23caf803a9729b73bd4f8cb3c8e7b20f2fb6a","amp;dn":"NLP+-+Bandler%2C+Grinder%2C+Erickson%2C+John+La+Tourette+%26+more","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae23caf803a9729b73bd4f8cb3c8e7b20f2fb6a","infoHashBuffer":{"type":"Buffer","data":[170,226,60,175,128,58,151,41,183,59,212,248,203,60,142,123,32,242,251,106]},"announce":[],"urlList":[]}}