{"title":"Native.Instruments.Traktor.Scratch.Pro.v1.2-AiR","uid":5095702,"size":118515418,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aaf294095168679ac511ef2ab5e6adb428f81ed9&amp;dn=Native.Instruments.Traktor.Scratch.Pro.v1.2-AiR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Murlok","files":-1,"time":1253548275,"description":"TRAKTOR SCRATCH PRO is the premium system for DJs spinning digital tracks on vinyl and CD, and the new gold-standard in professional digital vinyl systems.\n\nWhat's new compared to TRAKTOR SCRATCH?\nTRAKTOR SCRATCH PRO is built on the same hardware components as its predesessor, TRAKTOR SCRATCH. And as of now, TRAKTOR SCRATCH PRO comes with the full version of the brand-new TRAKTOR PRO software, the new benchmark for professional DJing.\n\nThis is the the most advanced version of TRAKTOR yet, introducing several new features for all users, as well as some PRO-specific additions.\n\nNEW EFFECTS FOR PRO\nUsers of TRAKTOR PRO and TRAKTOR SCRATCH PRO are treated to three extra effects in this 1.2 version. Taking the total to 24 highly creative and professional effects, this update adds a Beat Slicer, and Formant Filter and a Peak Filter to your arsenal of weapons- all of which need to be heard to be believed.\nFour independent effect units:\nThe already impressive TRAKTOR effects section just got twice as nice. With the addition of two more effects units (in PRO versions only) the potential for warping and twisting your tracks has been vastly increased. With three separate effects chainable per unit, the possibilities are now almost endless.\nNative HID / Display Support\nTRAKTOR now supports the HID (Human Interface Device) protocol for the Pioneer CDJ-400 and display support for the Denon DN-HC4500. HID is an alternative to MIDI control that boasts a much improved sensitivity, meaning even more precise control over pitch control and effects parameters etc. HID also utilizes the product displays to show TRAKTOR info such as track name, remaining time etc, directly on the hardware.\n* AUDIO 8 DJ is the ultimate audio interface for DJs. Highest resolution control vinyl and CDs plus ultra-efficient Multicore cables complete the hardware.\n* TRAKTOR SCRATCH PRO runs on the industry's leading DJ software, TRAKTOR PRO, and has been designed to perfectly meet the needs of professional DJs.\n* TRAKTOR SCRATCH PRO comes with a comprehensive library of roughly 200 ready to scratch sounds.\n* Top ten features overview, including four decks, super high-end audio quality, 21 effects, a new crate flick browser search function, and many others.\n\nTested and working!\n\nEnjoy","torrent":{"xt":"urn:btih:aaf294095168679ac511ef2ab5e6adb428f81ed9","amp;dn":"Native.Instruments.Traktor.Scratch.Pro.v1.2-AiR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf294095168679ac511ef2ab5e6adb428f81ed9","infoHashBuffer":{"type":"Buffer","data":[170,242,148,9,81,104,103,154,197,17,239,42,181,230,173,180,40,248,30,217]},"announce":[],"urlList":[]}}