{"title":"Food and Drink Medieval Outdoors Dungeons and Dragons","uid":8964642,"size":90029546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab3fe41f408247e3883db32f6dc80b6a1602c59b&amp;dn=Food+and+Drink+Medieval+Outdoors+Dungeons+and+Dragons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380189677,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\n\nAnyone who found these by searching for something other than Dungeons and Dragons, or by just browsing ebooks, could very likely find books (or shorter materials) worth reading is this collection. I certainly don't mean to exclude anyone with the suggested use. These are in fact perfectly useable as cookbooks, guides and histories. That being said...\n\nFor those of you who are checking this out as part of my Dungeons &amp; Dragons uploads, much like the 'Plants, Herbs and their uses' torrent, this collection can be very useful and entertaining in your game if you have the time to use it. Admittedly, it's a lot more geeky than that one, but some players really like visiting and hanging around in taverns and other local meeting places, and these materials can be very helpful with fleshing out the sometimes tedious minutia involved with creating and maintaining those establishments. I would often even find names when looking at recipes and guides. For instance, my players regularly visited the Smoked Deer tavern for several years.","torrent":{"xt":"urn:btih:ab3fe41f408247e3883db32f6dc80b6a1602c59b","amp;dn":"Food+and+Drink+Medieval+Outdoors+Dungeons+and+Dragons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab3fe41f408247e3883db32f6dc80b6a1602c59b","infoHashBuffer":{"type":"Buffer","data":[171,63,228,31,64,130,71,227,136,61,179,47,109,200,11,106,22,2,197,155]},"announce":[],"urlList":[]}}