{"title":"The Richest Woman in America - Janet Wallach","uid":11667467,"size":4492822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aba2dac5dec7c1f60cd5f121d62486451a12ac84&amp;dn=The+Richest+Woman+in+America+-+Janet+Wallach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1418082523,"description":"A captivating biography of America's first female tycoon, Hetty Green, the iconoclast who forged one of the greatest fortunes of her time.\n\nNo woman in the Gilded Age made as much money as Hetty Green. At the time of her death in 1916, she was worth at least 100 million dollars, equal to more than 2 billion dollars today. A strong believer in women being financially independent, she offered valuable lessons for the present times.\n \n\nAbandoned at birth by her neurotic mother, scorned by her misogynist father, Hetty set out as a child to prove her value. Following the simple rules of her wealthy Quaker father, she successfully invested her money and along the way proved to herself that she was wealthy and therefore worthy. \n \n\nNever losing faith in America's potential, she ignored the herd mentality and took advantage of financial panics and crises. When everyone else was selling, she bought railroads, real estate, and government bonds. And when everyone was buying and borrowing, she put her money into cash and earned safe returns on her dollars. Men mocked her and women scoffed at her frugal ways, but she turned her back and piled up her earnings, amassing a fortune that supported businesses, churches, municipalities, and even the city of New York itself. \n\nShe relished a challenge. When her aunt died and did not leave Hetty the fortune she expected, she plunged into a groundbreaking lawsuit that still resonates in law schools and courts. When her husband defied her and sank her money on his own risky interests, she threw him out and, marching down to Wall Street, quickly made up the loss. Her independence, outspokenness, and disdain for the upper crust earned her a reputation for harshness that endured for decades. Newspapers kept her in the headlines, linking her name with witches and miscreants. Yet those who knew her admired her warmth, her wisdom, and her wit. \n   \nSet during a period of financial crisis strikingly similar to our current one, acclaimed author Janet Wallach's engrossing exploration of a fascinating life revives a rarely-mentioned queen of American finance","torrent":{"xt":"urn:btih:aba2dac5dec7c1f60cd5f121d62486451a12ac84","amp;dn":"The+Richest+Woman+in+America+-+Janet+Wallach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba2dac5dec7c1f60cd5f121d62486451a12ac84","infoHashBuffer":{"type":"Buffer","data":[171,162,218,197,222,199,193,246,12,213,241,33,214,36,134,69,26,18,172,132]},"announce":[],"urlList":[]}}