{"title":"The Technical And Social History Of Software Engineering (2014) ","uid":9551404,"size":19618552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac28dfce52e8966ceb45a7978ec695e52b18621f&amp;dn=The+Technical+And+Social+History+Of+Software+Engineering+%282014%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391272016,"description":"Format: mobi/epub/azw3\nLength: 496 pages\nGenre: Non-Fiction/Computers &amp; Technology\nDate: 6 January 2014\n\nSoftware engineering is one of the world's most exciting and important fields. Now, pioneering practitioner Capers Jones has written the definitive history of this world-changing industry. Drawing on several decades as a leading researcher and innovator, he illuminates the field's broad sweep of progress and its many eras of invention. \n\nHe assesses the immense impact of software engineering on society, and previews its even more remarkable future. Decade by decade, Jones examines trends, companies, winners, losers, new technologies, productivity/quality issues, methods, tools, languages, risks, and more. He reviews key inventions, estimates industry growth, and addresses 'mysteries' such as why programming languages gain and lose popularity. \n\nCOVERAGE INCLUDES:\n\n* The human need to compute: from ancient times to the modern era\n* Foundations of computing: Alan Turing, Konrad Zuse, and World War II\n* Big business, big defense, big systems: IBM, mainframes, and COBOL\n* A concise history of minicomputers and microcomputers: the birth of Apple and Microsoft\n* The PC era: DOS, Windows, and the rise of commercial software\n* Innovations in writing and managing code: structured development, objects, agile, and more\n* The birth and explosion of the Internet and the World Wide Web\n* The growing challenges of legacy system maintenance and support\n* Emerging innovations, from wearables to intelligent agents to quantum computing\n* Cybercrime, cyberwarfare, and large-scale software failure\n\nAuthor:\n\nCAPERS JONES is cofounder, vice president, and chief technology officer of Namcook Analytics LLC. Before founding Namcook Analytics LLC in 2011, he was the president of Capers Jones &amp; Associates LLC from 2000 through 2011. He is also the founder and former chairman of Software Productivity Research LLC (SPR). Before founding SPR, Capers was assistant director of Programming Technology for the ITT Corporation at the Programming Technology Center in Stratford, Connecticut.","torrent":{"xt":"urn:btih:ac28dfce52e8966ceb45a7978ec695e52b18621f","amp;dn":"The+Technical+And+Social+History+Of+Software+Engineering+%282014%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac28dfce52e8966ceb45a7978ec695e52b18621f","infoHashBuffer":{"type":"Buffer","data":[172,40,223,206,82,232,150,108,235,69,167,151,142,198,149,229,43,24,98,31]},"announce":[],"urlList":[]}}