{"title":"Dismantling the Empire - Johnson, Chalmers [Non-Fiction] Mobi/Ep","uid":8571700,"size":1813201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac344fe31326b95297a64c87ac72b3375e561a2f&amp;dn=Dismantling+the+Empire+-+Johnson%2C+Chalmers+%5BNon-Fiction%5D+Mobi%2FEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":5,"time":1371169746,"description":"The author of the bestselling Blowback Trilogy reflects on America's waning power in a masterful collection of essays\nimage In his prophetic book Blowback, published before 9/11, Chalmers Johnson warned that our secret operations in Iraq and elsewhere around the globe would exact a price at home. Now, in a brilliant series of essays written over the last three years, Johnson measures that price and the resulting dangers America faces. Our reliance on Pentagon economics, a global empire of bases, and war without end is, he declares, nothing short of &quot;a suicide option.&quot;\n\nDismantling the Empire explores the subjects for which Johnson is now famous, from the origins of blowback to Barack Obama's Afghanistan conundrum, including our inept spies, our bad behavior in other countries, our ill-fought wars, and our capitulation to a military that has taken ever more control of the federal budget. There is, he proposes, only one way out: President Obama must begin to dismantle the empire before the Pentagon dismantles the American Dream. If we do not learn from the fates of past empires, he suggests, our decline and fall are foreordained. This is Johnson at his best: delivering both a warning and an urgent prescription for a remedy.","torrent":{"xt":"urn:btih:ac344fe31326b95297a64c87ac72b3375e561a2f","amp;dn":"Dismantling+the+Empire+-+Johnson%2C+Chalmers+%5BNon-Fiction%5D+Mobi%2FEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac344fe31326b95297a64c87ac72b3375e561a2f","infoHashBuffer":{"type":"Buffer","data":[172,52,79,227,19,38,185,82,151,166,76,135,172,114,179,55,94,86,26,47]},"announce":[],"urlList":[]}}