{"title":"Kathryn S. Olmsted - Challenging the Secret Government - The Pos","uid":15451442,"size":629525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac6329d826157273003efd7eeece3c976e55e002&amp;dn=Kathryn+S.+Olmsted+-+Challenging+the+Secret+Government+-+The+Pos&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469944816,"description":"https://extraimago.com/images/2016/07/31/0fbb911db8df277e6a03993c8f6df4ae-w2041x.jpg\r\n\r\nKathryn S. Olmsted - Challenging the Secret Government - The Post-Watergate Investigations of the CIA and FBI 1996\r\n\r\nJust four months after Richard Nixon's resignation, New York Times reporter Seymour Hersh unearthed a new case of government abuse of power: the CIA had launched a domestic spying program of Orwellian proportions against American dissidents during the Vietnam War. The country's best investigative journalists and members of Congress quickly mobilized to probe a scandal that seemed certain to rock the foundations of this secret government. Subsequent investigations disclosed that the CIA had plotted to kill foreign leaders and that the FBI had harassed civil rights and student groups. Some called the scandal 'son of Watergate.' Many observers predicted that the investigations would lead to far-reaching changes in the intelligence agencies. Yet, as Kathryn Olmsted shows, neither the media nor Congress pressed for reforms. For all of its post-Watergate zeal, the press hesitated to break its long tradition of deference in national security coverage. Congress, too, was unwilling to challenge the executive branch in national security matters. Reports of the demise of the executive branch were greatly exaggerated, and the result of the 'year of intelligence' was a return to the status quo","torrent":{"xt":"urn:btih:ac6329d826157273003efd7eeece3c976e55e002","amp;dn":"Kathryn+S.+Olmsted+-+Challenging+the+Secret+Government+-+The+Pos","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac6329d826157273003efd7eeece3c976e55e002","infoHashBuffer":{"type":"Buffer","data":[172,99,41,216,38,21,114,115,0,62,253,126,238,206,60,151,110,85,224,2]},"announce":[],"urlList":[]}}