{"title":"Grand Designs Collection 13 01of11 1920s Cinema 540p x264 AAC HD","uid":9202705,"size":755637486,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac8095fecd6dada7425c47a495b2d4fff2d3f755&amp;dn=Grand+Designs+Collection+13+01of11+1920s+Cinema+540p+x264+AAC+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":-1,"time":1384625385,"description":"Grand Designs: Collection 13\n\nArts Documentary hosted by Kevin McCloud, published by Channel 4 broadcasted as part of CH4 Grand Designs series in 2013 - English narration\n\n\nInformation\n------------------------------\n\nGrand Designs: Collection 13\nPresenter Kevin McCloud follows some of Britain's most ambitious self-building projects, as intrepid individuals attempt to design and construct the home of their dreams. From derelict castles to run down tug-boats, to old water-towers to eco-homes carved from the side of a hill, Channel 4's Grand Designs, proves nothing is impossible if you use a bit of imagination and have a bit of cash to splash.\n\n\n1)  1920s Cinema \nKevin McCloud follows a project to renovate and extend a classic 1920s cinema in Thorne, South Yorkshire. With little knowledge of restoration, Gwyn and Kate boldly set about turning the dilapidated building into family home using masses of concrete after taking advice from an architect friend. The couple are hoping to create a hydraulic glass wall that opens up one side of the house to form a UV-filtered canopy, and there are also plans for a white roof extension that resembles a diving board.\n\n2)  Miniature Hollywood Mansion \nJonathan Broom and his wife Deborah have put everything on hold while he pursues his dream of building a miniature Hollywood Hills-style mansion. They stumble across a scrap of land in north London, but it's fraught with problems and the only way they can complete the Â£1million home is by sinking half of it six metres below ground. Surrounded on all sides by their neighbours' back gardens, the couple have to dismantle walls and fences and promise to put them back together again, and that's just the start of their difficulties. Kevin McCloud follows their progress.\n\n3)  Giant Farm Shed \nCommercial architect Martin Walker and his art-director wife Kae want to build the ultimate family home near York, inspired by a giant farm shed. However, her idea for a warm and cosy design conflicts dramatically with his penchant for building large square warehouses, and finding something they both agree on proves extremely challenging on their tight budget. Kevin McCloud follows the couple's progress.\n\n4)  Crooked Chocolate Box Cottage \nMarine captain Jon's life changed for ever when he stepped onto a land mine in Afghanistan and lost three limbs. After viewing many uninspired specialist homes and considering awkward conversions, he and partner Becky realised their best option was to build a property themselves. The design is cutting-edge, with sleek glass walls, open-plan spaces and a dramatic wing-like roof, and the couple want there to be no noticeable adaptations. However, they soon use up their budget of Â£250,000 and encounter problems with their incredibly tight schedule. Kevin McCloud follows their progress.\n\n5)  Metal Sculptural Home \nColin Mackinnon and his partner Marta Briongos take on an ambitious project to build a bespoke metal home next to an airfield runway designed by one of Scotland's most eminent architects and inspired by aircraft hangars. They have to contend with violent rain, snow, 100mph winds and the worst storms for 100 years, and the couple have to draw on their reserves of mental energy as what was supposed to be a 12-month build heads into a third year.\n\n6)  Japanese House \nKevin McCloud meets Tamayo Hussey, who has missed Japan ever since she moved to the UK 14 years ago with her husband, quantum physics professor Nigel. The couple want to transform a 1960s forester's lodge into a unique Japanese house, complete with a tatami room - decorated in her homeland's traditional style - sliding paper walls and a bath on the roof. Keen to keep costs down, they have decided to engage only the design skills - rather than the full services - of an architect, so with no previous building experience they tackle the project alone.\n\n7)  Modernist Masterpiece \nBen and Rachel Hammond have spent a year searching London for somewhere exciting to live with their two daughters, and they have finally stumbled on a 1950s home on a unique plot, situated within the leafy depths of a park in the south of the city. The only problem is the house itself - an ugly, inefficient and uninspiring property - and their solution is to radically redesign it into a sleek, modernist masterpiece. But this is no easy task, as Kevin McCloud finds out.\n\n8)  Cob Castle \nKevin meets Kevin McCabe who wants to build what may be the largest Cob structure in the world. With 6 metre-tall walls, McCabe fights a battle with the weather and his implausibly small 350,000 pound budget.\n\n9)  The Christmas Farm \nMichael Butcher and Phil Palmer were confirmed Londoners, loft-livers in the heart of Soho. Until they fell in love with Christmas Farm, near Newbury, and took the life changing decision to quit their urban media jobs and move to the country. They faced two big problems however: first there was an agricultural tie on the land, so Phil and Michael would have to become farmers; the second problem was the uninspiring faux-alpine timber chalet serving as a farmhouse - it had to go. And in order to make it all work financially they decide to set up a new micro-brewery in the barn.\n\n10)  The Modernist Villa Revisited \nAround ten years ago Gil and Hillary Briffa retired to southern Spain. Instead of creating a home like the traditional old fincas in the area, their architect son designed them a confrontational, modernist glass box, surrounded by boldly colourful connected rooms, behind a giant citadel wall.\n\n11)  The Modest Home Revisited \nSix years ago Lucie Fairweather and Nat McBride began to build an affordable eco home in Woodbridge for themselves and their two young children. However, their journey was to be about more than bricks and mortar. Just before they got started, Nat discovered he had cancer, and after just a few months he passed away. Lucie decided to carry on with the project Nat had devised. Kevin McCloud returns to find out just how life has moved on for Lucie and to discover whether her wonderful and striking house has become part of the landscape.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/270/i435.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/270/i435.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img28.imageshack.us/img28/7871/b3xk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img28.imageshack.us/img28/7871/b3xk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img708.imageshack.us/img708/7425/5ize.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img708.imageshack.us/img708/7425/5ize.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img716.imageshack.us/img716/207/id8y.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img716.imageshack.us/img716/207/id8y.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img209.imageshack.us/img209/7572/nhph.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img209.imageshack.us/img209/7572/nhph.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img34.imageshack.us/img34/858/2qjr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img34.imageshack.us/img34/858/2qjr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img9.imageshack.us/img9/8399/pltq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img9.imageshack.us/img9/8399/pltq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img850.imageshack.us/img850/9224/tqgr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img850.imageshack.us/img850/9224/tqgr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img689.imageshack.us/img689/8397/2uct.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img689.imageshack.us/img689/8397/2uct.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c28aaba5aa828ef1ecf2&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2151 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 960 x 540\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps ABR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 48mins\n * Framerate: 25fps\n * Number of Parts: 11\n * Part Size: average 720 MB\n * Container: Mp4\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.granddesignsmagazine.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.granddesignsmagazine.com/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:ac8095fecd6dada7425c47a495b2d4fff2d3f755","amp;dn":"Grand+Designs+Collection+13+01of11+1920s+Cinema+540p+x264+AAC+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8095fecd6dada7425c47a495b2d4fff2d3f755","infoHashBuffer":{"type":"Buffer","data":[172,128,149,254,205,109,173,167,66,92,71,164,149,178,212,255,242,211,247,85]},"announce":[],"urlList":[]}}