{"title":"Space Jam DVDRip Xvid Nederlands gesproken","uid":4845333,"size":870231934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aca16b66a9b78e2d9022e1b518cda399fe00cae8&amp;dn=Space+Jam+DVDRip+Xvid+Nederlands+gesproken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"paulalala","files":3,"time":1239658415,"description":"His Airness en His Hareness, basketbaas en baskethaas... wat een team! Michael Jordan dunkt, Bugs Bunny funkt en een losgeslagen bende Looney Tunes scoort driepunters aan de lopende band. Space Jam, een combinatie van animatie en live action, die zich niet laat ringeloren, is ontsproten aan het brein van Hollywood talenten met onbegrensde fantasieen. De moppen vliegen in het rond en aan de lol komt geen eind meer wanneer de Tune Squad en de Nerdlucks een partijtje basketbal met een grote inzet moeten betwisten. Als ze winnen, blijven de Looney Tunes op aarde. Verliezen ze, dan worden ze verscheept naar een aftands, afgelegen attractiepark dat Moron Mountain heet. De Nerdluckt beschikken echter over een monsterlijk geheim wapen: ze hebben het talent van enkele NBA topspelers zoals Charles Barkley en Patrick Ewing gestolen en ze veranderen in Monstars. Maar da's niet alles folks, Het Tune Squad heeft ook een geheim wapen, en da's toevallig wel de allerbeste speler in dit en elk ander universum. Hij speelt in een klasse apart. Net zoals deze film.","torrent":{"xt":"urn:btih:aca16b66a9b78e2d9022e1b518cda399fe00cae8","amp;dn":"Space+Jam+DVDRip+Xvid+Nederlands+gesproken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca16b66a9b78e2d9022e1b518cda399fe00cae8","infoHashBuffer":{"type":"Buffer","data":[172,161,107,102,169,183,142,45,144,34,225,181,24,205,163,153,254,0,202,232]},"announce":[],"urlList":[]}}