{"title":"Guns N' Roses - 1991 - Use Your Illusion II","uid":3460919,"size":72959327,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:acb6129c115b3b785186c68000867e78a2eb9094&amp;dn=Guns+N%5C%27+Roses+-+1991+-+Use+Your+Illusion+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KindTorrents","files":14,"time":1143024153,"description":"[b]Cover:[/b]\n\n[img]http://www.artistdirect.com/Images/Sources/AMGCOVERS/music/cover200/drc800/c834/c8348805fmv.jpg[/img]\n\n[b]Artist:[/b]\n\nGuns &amp;#039;N&amp;#039; Roses\n\n[img]http://www.artistdirect.com/Images/artd/amg/music/bio/439480_gnr_200x200.jpg[/img]\n\n[b]Album:[/b]\n\nUse Your Illusion II\n\n[b]Bio[/b]\n\nAt a time when pop was dominated by dance music and pop-metal, Guns N&amp;#039; Roses brought raw, ugly rock &amp; roll crashing back into the charts. They were not nice boys; nice boys don&amp;#039;t play rock &amp; roll. They were ugly, misogynist, and violent; they were also funny, vulnerable, and occasionally sensitive, as their breakthrough hit, &quot;Sweet Child O&amp;#039; Mine,&quot; showed. While Slash and Izzy Stradlin ferociously spit out dueling guitar riffs worthy of Aerosmith or the Stones, Axl Rose screeched out his tales of sex, drugs, and apathy in the big city. Meanwhile, bassist Duff McKagan and drummer Steven Adler were a limber rhythm section who kept the music loose and powerful. Guns N&amp;#039; Roses&amp;#039; music was basic and gritty, with a solid hard, bluesy base; they were dark, sleazy, dirty, and honest -- everything that good hard rock and heavy metal should be. There was something refreshing about a band who could provoke everything from devotion to hatred, especially since both sides were equally right. There hadn&amp;#039;t been a hard rock band this raw or talented in years, and they were given added weight by Axl Rose&amp;#039;s primal rage, the sound of confused, frustrated white trash vying for his piece of the pie. As the &amp;#039;80s became the &amp;#039;90s, there simply wasn&amp;#039;t a more interesting band around, but owing to intra-band friction and the emergence of alternative rock, Rose&amp;#039;s supporting cast gradually disintegrated, as he spent several years in seclusion.\n\nGuns N&amp;#039; Roses released their first EP in 1986, which led to a contract with Geffen; the following year, the band released their debut album, Appetite for Destruction. They started to build a following with their numerous live shows, but the album didn&amp;#039;t start selling until almost a year later, when MTV started playing &quot;Sweet Child o&amp;#039; Mine.&quot; Soon, both the album and single shot to number one, and Guns N&amp;#039; Roses became one of the biggest bands in the world. Their debut single, &quot;Welcome to the Jungle,&quot; was re-released and shot into the Top Ten, and &quot;Paradise City&quot; followed in its footsteps. By the end of 1988, they released G N&amp;#039; R Lies, which paired four new, acoustic-based songs (including the Top Five hit &quot;Patience&quot;) with their first EP. G N&amp;#039; R Lies&amp;#039; inflammatory closer, &quot;One in a Million,&quot; sparked intense controversy, as Axl Rose slipped into misogyny, bigotry, and pure violence; essentially, he somehow managed to distill every form of prejudice and hatred into one five-minute tune.\n\nGuns N&amp;#039; Roses began work on the long-awaited follow-up to Appetite for Destruction at the end of 1990. In October of that year, the band fired Adler, claiming that his drug dependency caused him to play poorly; he was replaced by Matt Sorum from the Cult. During recording, the band added Dizzy Reed on keyboards. By the time the sessions were finished, the new album had become two new albums. After being delayed for nearly a year, the albums Use Your Illusion I and Use Your Illusion II were released in September 1991. Messy but fascinating, the albums showcased a more ambitious band; while there were still a fair number of full-throttle guitar rockers, there were stabs at Elton John-style balladry, acoustic blues, horn sections, female backup singers, ten-minute art rock epics with several different sections, and a good number of introspective, soul-searching lyrics. In short, they were now making art; amazingly, they were successful at it. The albums sold very well initially, but while they had seemed destined to set the pace for the decade to come, that turned out not to be the case at all.\n\nNirvana&amp;#039;s Nevermind hit number one in early 1992, suddenly making Guns N&amp;#039; Roses -- with all of their pretensions, impressionistic videos, models, and rock star excesses -- seem very uncool. Rose handled the change by becoming a dictator, or at least a petty tyrant; his in-concert temper tantrums became legendary, even going so far as to incite a riot in Montreal. Stradlin left by the end of 1991, and with his departure the band lost their best songwriter; he was replaced by ex-Kill for Thrills guitarist Gilby Clarke. The band didn&amp;#039;t fully grasp the shift in hard rock until 1993, when they released an album of punk covers, The Spaghetti Incident?; it received some good reviews, but the band failed to capture the reckless spirit of not only the original versions, but their own Appetite for Destruction. By the middle of 1994, there were rumors flying that the band was about to break up, since Rose wanted to pursue a new, more industrial direction and Slash wanted to stick with their blues-inflected hard rock. The band remained in limbo for several more years, and Slash resurfaced in 1995 with the side project Slash&amp;#039;s Snakepit and an LP, It&amp;#039;s Five O&amp;#039;Clock Somewhere.\n\nRose remained out of the spotlight, becoming a virtual recluse and doing nothing but tinkering in the studio; he also recruited various musicians -- including Dave Navarro, Tommy Stinson, and ex-Nine Inch Nails guitarist Robin Finck -- for informal jam sessions. Remaining members were infuriated by Rose&amp;#039;s inclusion of childhood friend Paul Huge in the new sessions when both Stradlin and Clarke were excluded from rejoining the band. And a remake of the Rolling Stones&amp;#039; &quot;Sympathy for the Devil&quot; was essentially the straw that broke the camel&amp;#039;s back, as Rose cut out some of the other member&amp;#039;s contributions and pasted Huge over the song without consulting anyone else. By 1996 Slash was officially out of Guns N&amp;#039; Roses, leaving Rose the lone remaining survivor from the group&amp;#039;s heyday; rumors continued to swirl, and still no new material was forthcoming, though Rose did re-record Appetite for Destruction with a new lineup for rehearsal purposes. The first new original G N&amp;#039; R song in eight years, the industrial metal sludge of &quot;Oh My God&quot; finally appeared on the soundtrack to the 1999 Arnold Schwarzenegger film End of Days. Soon after, Geffen issued the two-disc Live Era 1987-1993.\n\n2000 brought the addition of guitarists Robin Finck (of Nine Inch Nails) and Buckethead. 2001 was greeted with Guns N&amp;#039; Roses&amp;#039; first live dates in nearly seven years, as the band (who consisted of Rose plus guitarists Finck, Buckethead, bassist Stinson, former Primus drummer Brian Mantia, childhood friend and guitarist Paul Huge, and longtime G N&amp;#039; R keyboardist Dizzy Reed) played a show on New Years Eve 2000 in Las Vegas, playing as well at the mammoth Rock in Rio festival the following month. A new album was announced for a summer release, but the date came and went without any CDs hitting the shelves. A summer tour of Europe was planned, but before tickets could go on sale Rose announced that the tour was cancelled and the band went into seclusion until New Years Eve of 2001. They played almost the exact same set as the year before, but they still managed to brew up some news by not allowing any former members to watch the show. Slash tried to get onto the guest list, and even claims to have tried to sneak in through a security guard. Manager Doug Goldstein released a statement taking full responsibility for the banning of former members, claiming that he was not sure of their intentions and he wanted to avoid making Rose nervous.\n\n2002 started with no new Axl news, instead seeing former members Slash, Duff, and Izzy work together on new material for Stradlin&amp;#039;s new album. Rose eventually ended up in music news as he fired producer Roy Thomas Baker from the group&amp;#039;s newest recording sessions, adding him to the superstar list of producers that had been attached to the project at various points (including Moby, Mike Clink, Youth, Bob Ezrin, and many others.) Slash&amp;#039;s contributions to Izzy&amp;#039;s album didn&amp;#039;t make the final cut, but rumors of a new band featuring former members McKagan, Sorum, and Slash began circulating by the end of the spring. A slew of Japanese and British festival dates were set in the spring, but the mysterious new album continued to elude fans as the release date was pushed into the fall of 2002. Before those concert dates rolled around, guitarist Paul Huge left the group, quickly replaced by former Love Spit Love member Richard Fortus.\n\nAn appearance at MTV&amp;#039;s annual Video Music Awards helped garner interest in the new lineup, but a rusty performance from Rose and an interview where he said his new album wasn&amp;#039;t coming out anytime soon didn&amp;#039;t do much to further their cause. That summer, the band started on their first tour in almost eight years, and they managed to fulfill all of their commitments in Europe in Asia. Sadly, they caused a violent and destructive riot in Vancouver when Rose failed to show up for the first date of their North American tour. While he was up to his old shenanigans with the retooled lineup, former members Stradlin, Slash, Sorum and McKagan finally put an end to the rumors and announced that they were searching for a vocalist for a new, Axl-free band. Over time, Stradlin would reduce his role in the new project to guest songwriting and the occasional live appearance, but with former Stone Temple Pilots vocalist Scott Weiland, Slash, Sorum and McKagan formed the successful Velvet Revolver in spring of 2002.\n\nThe years between Guns N&amp;#039; Roses albums have grown into a running joke in the music industry, Interscope&amp;#039;s frustration with the millions dumped into the recording has become secondary to Rose&amp;#039;s reclusive insistence to perfect his material. By leaving the industry on such a strong note, Rose&amp;#039;s image has been frozen in time as the frustrating, angry, yet sensitive genius behind the microphone, an image he might not be ready to live up to as the years go by. Despite what happens to most groups that have stayed out of the limelight for ten years, the legend of Guns N&amp;#039; Roses continues to grow with each year. Whatever may happen with the new lineup, the five original members continue to enjoy celebrity status despite having their post-GN&amp;#039;R material show less than enthusiastic sales. By writing one of the most critical hard rock albums of all time, they have secured their status as the most vital force to hit the mainstream rock scene in the 80&amp;#039;s. \n\n[b]Review:[/b]\n\nUse Your Illusion II is more serious and ambitious than I, but it&amp;#039;s also considerably more pretentious. Featuring no less than four songs that run over six minutes, II is heavy on epics, whether it&amp;#039;s the charging funk metal of &quot;Locomotive,&quot; the antiwar &quot;Civil War,&quot; or the multipart &quot;Estranged.&quot; As if an attempt to balance the grandiose epics, the record is loaded with an extraordinary amount of filler. &quot;14 Years&quot; may have a lean, Stonesy rhythm, and Duff McKagan&amp;#039;s Johnny Thunders homage, &quot;So Fine,&quot; may be entertaining, but there&amp;#039;s no forgiving the ridiculous &quot;Get in the Ring,&quot; where Axl Rose threatens rock journalists by name because they gave him bad reviews; the misinterpretation of Dylan&amp;#039;s &quot;Knockin&amp;#039; on Heaven&amp;#039;s Door&quot;; another version of &quot;Don&amp;#039;t Cry&quot;; and the bizarre closer, &quot;My World,&quot; which probably captures Rose&amp;#039;s instability as effectively as the tortured poetry of his epics. That said, there are numerous strengths to Use Your Illusion II; a couple of songs have a nervy energy, and for all their pretensions, the overblown epics are effective, though strangely enough, they reveal notorious homophobe Rose&amp;#039;s aspirations of being a cross between Elton John and Freddie Mercury. But the pompous production and poor pacing make the album tiring for anyone who isn&amp;#039;t a dedicated listener.\n\n[b]Tracks:[/b]\n\n   1.  Civil War\n   2. 14 Years\n   3. Yesterdays\n   4. Knockin&amp;#039; On Heaven&amp;#039;s Door\n   5. Get In The Ring\n   6. Shotgun Blues\n   7. Breakdown\n   8. Pretty Tied Up\n   9. Locomotive (Complicity)\n  10. So Fine\n  11. Estranged\n  12. You Could Be Mine\n  13. Don&amp;#039;t Cry (Alt. Lyrics)\n  14. My World\n\n[b]Rating (of 10):[/b]\n\n8\n\n[b]Release Date:[/b]\n\nSep 1991\n\n[b]Label:[/b]\n\nGeffen\n\n[b]Genre:[/b]\n\n    * Rock\n\n[b]Styles:[/b]\n\n    * Hard Rock\n    * Heavy Metal\n    * Album Rock\n\n[b]Bitrate:[/b]\n\n128kbps\n\n[b]File format:[/b]\n\nmp3\n\n[b]File size:[/b]\n\n69.5 MB\n\n[b]Tracker Address:[/b]\n &lt;a href=&quot;\nhttp://ddram.kicks-ass.net:6969/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ddram.kicks-ass.net:6969/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.kindtorrents.com/smf/index.php?topic=2107.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kindtorrents.com/smf/index.php?topic=2107.0&lt;/a&gt;","torrent":{"xt":"urn:btih:acb6129c115b3b785186c68000867e78a2eb9094","amp;dn":"Guns+N%5C%27+Roses+-+1991+-+Use+Your+Illusion+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acb6129c115b3b785186c68000867e78a2eb9094","infoHashBuffer":{"type":"Buffer","data":[172,182,18,156,17,91,59,120,81,134,198,128,0,134,126,120,162,235,144,148]},"announce":[],"urlList":[]}}