{"title":"Handel - Amadigi di Gaula, opera, HWV 11","uid":6022964,"size":359984718,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ace0fa0da6bd94c41e92c1ae4abe98aea51b3431&amp;dn=Handel+-+Amadigi+di+Gaula%2C+opera%2C+HWV+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"muzik62","files":-1,"time":1291858195,"description":"Georg Friedrich Handel - Amadigi di Gaula, opera, HWV 11\n\n\nConducted by Marc Minkowski\nPerformed by Les Musiciens de Louvre\nwith Jean Deletre, Jennifer Smith, Aline Zylberajch, Pascal Bertin, Nathalie Stutzmann, Dominique Poitevin, Eiddwen Harrhy, Pascal Monteilhet\n\nAmadigi di Gaula (1715) was the fifth Italian opera that Handel wrote for London, and the last before he took up his duties for the newly formed Royal Academy (in 1720, with Radamisto). Like Rinaldo and Teseo, which preceded it, Amadigi is a &quot;magic opera&quot;, a genre that always brought out the best in the composer; like them too it features a love-sick sorceress as a central figure, a character-type he was to return to with equally memorable results in Alcina (1735). (His remaining &quot;magic opera&quot; Orlando has a benevolent male sorceror in place of a malevolent female one.)\nAmadigi is an absolutely wonderful piece, with a memorable score of great freshness, invention and youthful vitality. There are two duets, an onstage death scene (very rare) and a ghost scene, all outstanding. The characters are all well-drawn, and at 2 1/2 hours it's one of Handel's most concise stage works. Without wishing to denigrate such Royal Academy masterpieces as Giulio Cesare in Egitto, Rodelinda and Tamerlano, there's no denying that some of the non-Academy operas Handel wrote (both before and after) have a special charm, exploring supernatural (and sometimes comic) terrain implicitly off limits in the predominately heroic Academy pieces.\nThis 1989 recording, the only one so far, is excellent. I believe it was conductor Marc Minkowski's first complete Handel opera on CD, and it shows him at his best, leading his fine band with great verve, and getting vivid delivery of the recitatives. And there's no tampering with the musical text, unlike some of Minkowski's later efforts (Teseo, Hercules). The four principals are are first-rate: two experienced sopranos (Jennifer Smith and Eiddwen Harrhy) and two (then) young contraltos (Nathalie Stutzmann and Bernarda Fink). This is one of the most enjoyable recordings of a Handel opera I've ever heard.\nBy Nicholas A. Deutsch\n\nmuzik62","torrent":{"xt":"urn:btih:ace0fa0da6bd94c41e92c1ae4abe98aea51b3431","amp;dn":"Handel+-+Amadigi+di+Gaula%2C+opera%2C+HWV+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ace0fa0da6bd94c41e92c1ae4abe98aea51b3431","infoHashBuffer":{"type":"Buffer","data":[172,224,250,13,166,189,148,196,30,146,193,174,74,190,152,174,165,27,52,49]},"announce":[],"urlList":[]}}