{"title":"Bad Paper: Chasing Debt from Wall Street..Jake Halpern Audiobook","uid":11471795,"size":191872287,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ad2e4317782a44b40a4c1dcaeb5ecaef0ab7a6d8&amp;dn=Bad+Paper%3A+Chasing+Debt+from+Wall+Street..Jake+Halpern+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1416098333,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nBad Paper: Chasing Debt from Wall Street to the Underworld\n\nWritten by: Jake Halpern\nNarrated by: Qarie Marshall\nLength: 6 hrs and 37 mins\nUnabridged Audiobook\nRelease Date:10-28-14\n\nJake Halpern introduces us to a former banking executive and a former armed robber who become partners and go in quest of &quot;paper&quot; - the uncollected debts that are sold off by banks for pennies on the dollar. As Halpern shows, the world of consumer debt collection is a wild and unregulated shadow land, where operators may misrepresent a debtor's situation, make illegal threats, and even lay claim to debts that are not theirs to collect in the first place. Halpern follows his collectors as they intimidate competitors with weapons, manage high-pressure call centers, and scheme new ways to benefit from American's debt-industrial complex. He also explores the history of collection agencies and reveals the human cost of a system that leaves hardworking Americans with little opportunity to retire their debts in a reasonable way","torrent":{"xt":"urn:btih:ad2e4317782a44b40a4c1dcaeb5ecaef0ab7a6d8","amp;dn":"Bad+Paper%3A+Chasing+Debt+from+Wall+Street..Jake+Halpern+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad2e4317782a44b40a4c1dcaeb5ecaef0ab7a6d8","infoHashBuffer":{"type":"Buffer","data":[173,46,67,23,120,42,68,180,10,76,29,202,235,94,202,239,10,183,166,216]},"announce":[],"urlList":[]}}