{"title":"Pearl Harbor DVDRip Spanish","uid":4699185,"size":1598613665,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad7b52ff92a1ec5fb4d33d5bb52ae2933579fde7&amp;dn=Pearl+Harbor+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"Mois20","files":4,"time":1233659962,"description":"Rafe McCawley (Ben Affleck) y Danny Walker (Josh Hatnett) son dos jÃƒÂ³venes y audaces pilotos del EjÃƒÂ©rcito del Aire de Estados Unidos que han crecido como hermanos, y que han aprendido a volar en aviones fumigadores. Rafe estÃƒÂ¡ enamorado de Evelyn Stewart (Kate Beckinsale), una preciosa y valiente enfermera que presta servicio en la Marina de Estados Unidos. Pero la guerra no tarda en separarlos, ya que Rafe se presenta voluntario para integrar el Eagle Squadron, un grupo de norteamericanos que luchÃƒÂ³ junto a los ingleses en la Batalla de Inglaterra. Rafe le promete a Evelyn que regresarÃƒÂ¡, antes de poner rumbo a los peligrosos cielos del Canal de la Mancha, mientras Evelyn y Danny son transferidos al paradisiaco Pearl Harbor en Hawai. Pero las malas noticias no tardan en llegar: Rafe ha muerto en combate. Para encontrar consuelo se aferran el uno al otro y terminan enamorÃƒÂ¡ndose. Pero Rafe regresa. Su vuelta serÃƒÂ¡ dramÃƒÂ¡tica para los tres. Antes de decidir lo que van a hacer, Pearl Harbor resulta atacado por una combinaciÃƒÂ³n de fuerzas navales y aÃƒÂ©reas japonesas. Este acontecimiento cambiarÃƒÂ¡ sus vidas y tambiÃƒÂ©n el curso de la historia. La respuesta de Estados Unidos a la humillaciÃƒÂ³n que supone la derrota de Pearl Harbor da lugar a uno de las acciones militares mÃƒÂ¡s inesperadas de la historia: el bombardeo de Tokio en una misiÃƒÂ³n suicida dirigida por Jimmy Doolittle (Alec Baldwin). Cuando el coronel Doolittle escoge a Rafe y a Danny para que sean los lÃƒÂ­deres de su ataque aÃƒÂ©reo, sus vidas y su amor por Evelyn vuelven a ser protagonistas de esta historia de amor y de valor...","torrent":{"xt":"urn:btih:ad7b52ff92a1ec5fb4d33d5bb52ae2933579fde7","amp;dn":"Pearl+Harbor+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7b52ff92a1ec5fb4d33d5bb52ae2933579fde7","infoHashBuffer":{"type":"Buffer","data":[173,123,82,255,146,161,236,95,180,211,61,91,181,42,226,147,53,121,253,231]},"announce":[],"urlList":[]}}