{"title":"The Origins of Monsters - Image and Cognition in the First Age o","uid":10086869,"size":6412582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aee674d360c6ddfbf4022f4871f6a134bf44f3f0&amp;dn=The+Origins+of+Monsters+-+Image+and+Cognition+in+the+First+Age+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1399118099,"description":"The Origins of Monsters: Image and Cognition in the First Age of Mechanical Reproduction by David Wengrow\nEnglish | 2013 | ISBN: 0691159041 | 184 pages | EPUB | 6 MB\n\nIt has often been claimed that &quot;monsters&quot;--supernatural creatures with bodies composed from multiple species--play a significant part in the thought and imagery of all people from all times. The Origins of Monsters advances an alternative view. Composite figurations are intriguingly rare and isolated in the art of the prehistoric era. Instead it was with the rise of cities, elites, and cosmopolitan trade networks that &quot;monsters&quot; became widespread features of visual production in the ancient world. Showing how these fantastic images originated and how they were transmitted, David Wengrow identifies patterns in the records of human image-making and embarks on a search for connections between mind and culture.\n\nWengrow asks: Can cognitive science explain the potency of such images? Does evolutionary psychology hold a key to understanding the transmission of symbols? How is our making and perception of images influenced by institutions and technologies? Wengrow considers the work of art in the first age of mechanical reproduction, which he locates in the Middle East, where urban life began. Comparing the development and spread of fantastic imagery across a range of prehistoric and ancient societies, including Mesopotamia, Egypt, Greece, and China, he explores how the visual imagination has been shaped by a complex mixture of historical and universal factors.\n\nExamining the reasons behind the dissemination of monstrous imagery in ancient states and empires, The Origins of Monsters sheds light on the relationship between culture and cognition.","torrent":{"xt":"urn:btih:aee674d360c6ddfbf4022f4871f6a134bf44f3f0","amp;dn":"The+Origins+of+Monsters+-+Image+and+Cognition+in+the+First+Age+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee674d360c6ddfbf4022f4871f6a134bf44f3f0","infoHashBuffer":{"type":"Buffer","data":[174,230,116,211,96,198,221,251,244,2,47,72,113,246,161,52,191,68,243,240]},"announce":[],"urlList":[]}}