{"title":"Graham Anthony Devine - Leo Brouwer - Guitar Music Volume 3","uid":4320038,"size":170115072,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aefcd9c50cbf606da0666494acff3fa873a195b7&amp;dn=Graham+Anthony+Devine+-+Leo+Brouwer+-+Guitar+Music+Volume+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Skeletronic","files":15,"time":1217396645,"description":"I&amp;#039;m disappointed by the lack of good modern classical guitar torrents out there so I&amp;#039;m going to be uploading a few of my favorites from Leo Brouwer: Guitar Music Volume 1 with performer Ricardo Cobo, Guitar Music Volume 3 with Graham Anthony Devine, and The Black Decameron with John Williams. \n\nThe Leo Brouwer Naxus albums go for less than 10 bucks so if you enjoy this music please go out and buy it.\n\n\nI yanked the following review of Guitar Music Volume 3 from:\n &lt;a href=&quot;\nhttp://www.musicweb-international.com/classRev/2003/July03/ABrouwer3.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.musicweb-international.com/classRev/2003/July03/ABrouwer3.htm&lt;/a&gt;\n\nReview:\n\nRight from the first note you know this is not your ordinary guitar disk. It?s a harmonic played at a strength and pitch you?ve never heard before. The guitar sound is beautiful throughout and both composer and performer must share the credit for this.\n\nThe music is ultra-modern, but not twelve-tone, not post-romantic, and not minimalistic. The compositions are ingenious and fascinating, defying any easy classification into style, but several characteristics can be pointed out. With the conspicuous exception of the final number, Un Dia de Noviembre, there is no beat, no steady rhythm. The works are reflective, improvisatory, made up of fragments of tunes, short rhythmic episodes, and sensual long-held chords. Even those numbers with dance titles do not have a beat. No texture is maintained for long, leading to constant exploration of sound, harmony, and texture. The music fits the guitar beautifully, not producing ugly squeaks or slaps or scrapes that much modern guitar music abounds in. Performer Devine is completely comfortable with this music technically and produces beautiful sounds and a minimum of finger noises in spite of the severe technical demands made upon him by the music. While the earliest work on this disk, the Suite #2, is the most classic sounding in style, all the works maintain a remarkable consistency of personality and style in spite of their eclecticism. Only a person with very strong traditional tastes and a firm dislike of modern sound could find fault with this music.\n\nThe final number, Un Dia de Noviembre, does have a tune and a beat; it was written as film music, in the BBC closing credits musical style, for a black and white film produced in Cuba by Humberto Solaz in 1967.\n\nThe composer is Cuban and first studied with his father. He seems to have had no difficulty travelling all over the world to study and concertize. He was a good friend of Toru Takemitsu and Hika was composed as an elegy for him. The Sonata was written for Julian Bream. The Latin American Pieces are hardly typical of other Latin American music except in their gentle Latin swing and relaxed good humour, particularly in #1, &quot;Variations on a Piazzola Tango.&quot; The Passacaglia was written for Eli Kassner, Brouwer?s Canadian guitar teacher. The Rito de los Orishas is descriptive of Afro-Cuban folk religious rituals; Orisha means god or goddess in the African Yoruba language. Since 1981 Brouwer has been general director of the Orquesta Nacional de Cuba. He also teaches at the Conservatorio Nacional and serves as an advisor to Radio Habana. ","torrent":{"xt":"urn:btih:aefcd9c50cbf606da0666494acff3fa873a195b7","amp;dn":"Graham+Anthony+Devine+-+Leo+Brouwer+-+Guitar+Music+Volume+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aefcd9c50cbf606da0666494acff3fa873a195b7","infoHashBuffer":{"type":"Buffer","data":[174,252,217,197,12,191,96,109,160,102,100,148,172,255,63,168,115,161,149,183]},"announce":[],"urlList":[]}}