{"title":"Take beautiful selfie with fabulous photo effects for Instagram","uid":11844279,"size":1704731,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:af40d1e67645d7ac9c74e50d8d03056c41c2ac45&amp;dn=Take+beautiful+selfie+with+fabulous+photo+effects+for+Instagram&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"j.walsh2014","files":1,"time":1429895363,"description":"Take the best selfie and express your personality with live filters in Photo Editor app! No retouch necessary!\n\nWith cool editing features in Photo Editor creating unique and fun photos has never been this easy! Share your beautiful and funny pictures created by Photo Editor with friends!\n\nâ–  No retouch necessary! Take the best selfies by snapping your moments with live filters! Make your pictures live and sunny, make photos crystal clear, make your selfies shine and make your selfies lovely with popular filters for your friends to like!\n\nâ–  Nice app user interface and many fascinating camera options for the best instant selfie that you will love. Powerful photo editing tools and features in this beautiful app: brightness, contrast, shade, saturation, rotate and more features just like Adobe Photoshop\n\nâ–  Make up your photos the pure beauty, funny, hot and fancy with many styles. Beautify your photos in one tap with enlarge eyes, smile, slim, hair, liquify, face and skin correction like brightening, whitening, concealers, etc. Easily tune and upgrade your photo, make it smart, beautiful, trendy, natural and realistic through lights effect to bring the outstanding shining style to your photo\n\nâ–  Sharing photos or share entire gallery of selfies! Editing photos taken by Photo wonder, Picsart, Candy Camera, Retrica, Camera 360, Pomelo, B612. SNS sharing to Instagram, Pinterest, Facebook, Tumblr, Twitter, Google+, Linkedin, Flickr, Weibo, Mixi, VK, and more social networks! Photo sharing to instant messengers (IM) such as Viber, WhatsApp, WeChat, KakaoTalk, Snapchat, Line, etc. Make photo albums at Dropbox, Google drive, OneDrive, etc. Backed up photos can be shared and edited with your friends to have memorable moments!\n\nGet so much fun with this number 1 app! You will like using this app to edit photos and to create collages. At all, the best, having great options, choices, enhancement features, very good and must have app on Android, ideal for editing pictures from the camera.\n\nMore filters, collage, stickers, retouch, beauty, liquify, lights, borders, vignette to maximize photo effects in the next version!\nThank you for using Photo Editor and give us feedback and rate app at Google Play!\n\nDownload Photo Editor app at Google Play:  &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.vinternete.photoeffects&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.vinternete.photoeffects&lt;/a&gt;\n\nDownload Photo Editor .apk-file directly from the app website:  &lt;a href=&quot;\nhttp://apps.vinternete.com/downloads/PhotoEditor-1.0.apk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://apps.vinternete.com/downloads/PhotoEditor-1.0.apk&lt;/a&gt;\n\nCamera Stream app website:  &lt;a href=&quot;\nhttp://vinternete.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vinternete.com&lt;/a&gt;","torrent":{"xt":"urn:btih:af40d1e67645d7ac9c74e50d8d03056c41c2ac45","amp;dn":"Take+beautiful+selfie+with+fabulous+photo+effects+for+Instagram","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af40d1e67645d7ac9c74e50d8d03056c41c2ac45","infoHashBuffer":{"type":"Buffer","data":[175,64,209,230,118,69,215,172,156,116,229,13,141,3,5,108,65,194,172,69]},"announce":[],"urlList":[]}}