{"title":"Thomas Mann - Buddenbrooks (retail epub, mobi)","uid":8794124,"size":1880625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af414f5f3e87f08c3ba7cd5345c0b9c6daa3b035&amp;dn=Thomas+Mann+-+Buddenbrooks+%28retail+epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1376028768,"description":"Thomas Mann (John E. Woods, trans.) - Buddenbrooks (Vintage, 1993).\n\nEpub and mobi formats from a retail source. Yes ... retail.\n\n\npublisher description:\n\nA brilliant new translation of Thomas Mann's first great novel, one of the two for which he was awarded the Nobel Prize in literature in 1929.\n\nBuddenbrooks, first published in Germany in 1900, when Mann was only twenty-five, has become a classic of modem literature -- the story of four generations of a wealthy bourgeois family in northern Germany. With consummate skill, Mann draws a rounded picture of middle-class life: births and christenings; marriages, divorces, and deaths; successes and failures. These commonplace occurrences, intrinsically the same, vary slightly as they recur in each succeeding generation. Yet as the Buddenbrooks family eventually succumbs to the seductions of modernity -- seductions that are at variance with its own traditions -- its downfall becomes certain.\n\nIn immensity of scope, richness of detail, and fullness of humanity, Buddenbrooks surpasses all other modem family chronicles; it has, indeed, proved a model for most of them. Judged as the greatest of Mann's novels by some critics, it is ranked as among the greatest by all. Thomas Mann was awarded the Nobel Prize for literature in 1929.\n\n\n\nFrom Publishers Weekly\n\nA superior new translation of Mann's 1901 saga about four generations of an affluent German family. \n\n\nFrom Library Journal\n\nThe reissue of Mann's wonderful first novel in a new translation is a cause for rejoicing. In loving, ironic, and sympathetic detail, Mann portrays several generations of a merchant family who belong to the bourgeois aristocracy in Lubeck, tracking them from high point to decline. While the author himself helped Lowe-Porter in the authorized English translation (1938), Woods simply has a better ear for dialog and for smoothing Mann's German syntax into a more naturally flowing English one. He is even so bold as to tackle puns that Lowe-Porter pretended weren't there. Highly recommended.\n\n---\n\nMany thanks to the original uploader.\n\n---\n\nFor the same book in pdf, see this: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8473524&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8473524&lt;/a&gt;\n\n---\n\nNote: I don't have any other titles by this author and translator in epub/mobi formats.\n","torrent":{"xt":"urn:btih:af414f5f3e87f08c3ba7cd5345c0b9c6daa3b035","amp;dn":"Thomas+Mann+-+Buddenbrooks+%28retail+epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af414f5f3e87f08c3ba7cd5345c0b9c6daa3b035","infoHashBuffer":{"type":"Buffer","data":[175,65,79,95,62,135,240,140,59,167,205,83,69,192,185,198,218,163,176,53]},"announce":[],"urlList":[]}}