{"title":"Beowulf's Ecstatic Trance Magic (2016).pdf Gooner","uid":13847480,"size":1851893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afa1add19735422ae062da4ae7b39b535939761c&amp;dn=Beowulf%27s+Ecstatic+Trance+Magic+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1457879477,"description":"Beowulf's Ecstatic Trance Magic - Accessing the Archaic Powers of the Universal Mind (2016).pdf Gooner\r\n\r\nPublisher: Bear &amp; Company (February 1, 2016)\r\nLanguage: English\r\nISBN-10: 1591432170\r\nISBN-13: 978-1591432173\r\n\r\nUse ecstatic trance to journey to the time of Beowulf and learn first hand the ancient magic of the early Nordic people \r\n\r\n• Reveals a hidden side to the epic of Beowulf through the perspective of Queen Wealhtheow \r\n\r\n• Shows how Grendel respected and would not harm Queen Wealhtheow because she practiced the ancient magic of the Mother Goddess Freyja \r\n\r\n• Explains how the magic practices of Queen Wealhtheow provide a blueprint for our emergence from the warlike nature of the past millennia into a time of peace and compassion for our Great Mother Earth \r\n\r\nUsing the altered state of ecstatic trance to access the memories of the Universal Mind, Nicholas Brink takes us back to ancient Scandinavia, to the time of the epic of Beowulf, the oldest piece of literature written in the English language. Sharing his ecstatic trance techniques along the way, his journey allows us to re-experience the life and shamanic practices of Queen Wealhtheow, the wife of King Hrothgar, the king rescued by Beowulf from the torment of the monster Grendel. \r\n\r\nRevealing a hidden side to the epic of Beowulf, Brink details how Grendel respected and would not harm Queen Wealhtheow and her teacher Vanadisdottir, a priestess of the goddess Freyja, for they practiced the ancient magic of the earlier hunter-gatherer era when the Great Mother Earth was worshipped. In the time of the queen the peaceful and compassionate traditions of this era were becoming forgotten, succumbing to settlements, kingdoms, and territorial disputes. We gain first-person experience of Wealhtheow and Vanadisdottir’s veneration of the Great Mother and the ancient magic of the early Nordic people as practiced by the seiðr workers, seers, and spirit travelers, the shamans of the time. These practices include divination through the goddess Freyr, contacting Bear spirits, and spirit journeying to various realms. \r\n\r\nAs we experience our own time of transition and turmoil much like that of Beowulf’s time, Nicholas Brink reveals how the original magic of our ancestors, as practiced by Queen Wealhtheow, provides a blueprint for our emergence from the warlike nature of the past into a time of peace and compassion for our Great Mother Earth","torrent":{"xt":"urn:btih:afa1add19735422ae062da4ae7b39b535939761c","amp;dn":"Beowulf%27s+Ecstatic+Trance+Magic+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa1add19735422ae062da4ae7b39b535939761c","infoHashBuffer":{"type":"Buffer","data":[175,161,173,209,151,53,66,42,224,98,218,74,231,179,155,83,89,57,118,28]},"announce":[],"urlList":[]}}