{"title":"Ed - The Complete Fourth Season","uid":3426865,"size":7243161552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b01da2130ded3ac654b27966ea108b9e5633f943&amp;dn=Ed+-+The+Complete+Fourth+Season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"Friedle","files":17,"time":1136190362,"description":"SUMMARY\nEd Stevens is a contracts lawyer at a high-profile New York City firm. Around the same time he splits with his wife (she slept with a mailman), he makes a single error in punctuation when going over a contract; and because of the resulting financial loss to the firm, he's fired. Despondent, he heads back to his (small) hometown of Stuckeyville -- 'Anytown', USA. There he realizes he's been missed by a lot of friends whom he's missed; and he sees Carol, the girl he'd adored in high school. Swept up in roiling emotions, Ed buys the local bowling alley on a whim, moves to Stuckeyville, and determines to win Carol's heart. His horizons broaden as he settles once more in Stuckeyville, and the series itself settles into a charming, funny, often serious slice-of-life series focused not solely on Ed but on the lovable ensemble cast of people who live and work with him in Stuckeyville.\n\nTHEME SONG\nThe first season's theme song was Foo Fighters' &quot;Next Year&quot; from their &quot;There Is Nothing Left To Lose&quot; cd. The second season's theme song was Clem Snide's &quot;Moment In The Sun&quot; from their &quot;The Ghost of Fashion&quot; cd. &quot;Next Year&quot; was welcomed back as the theme song at the beginning of the third season.\n\nSYNDICATION\nCurrently, the show is not in syndication, but CMT Canada has announced they will begin airing the show Sept 8th at 8pm. It's not believed to be aired in the USA.\n\nDVDs\nCurrently, there are no DVDs available for the show. Judging from what we've heard, the reason for the delay in getting DVDs to the market is the music rights are expensive. The show used a lot of tracks from a large number of artists, and it would be very expensive for NBC to acquire the rights to use the music on the DVDs.\n\nOriginally on NBC (60 mins)\nStatus: Ended\nPremiered October 8, 2000\nShow Category: Drama , Comedy\n &lt;a href=&quot;\nhttp://www.tv.com/ed/show/25/summary.html?q=ed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tv.com/ed/show/25/summary.html?q=ed&lt;/a&gt;\n\nThis show is great and it's a shame that DVDs seem like they are never going to happen.  So, until then... ;)","torrent":{"xt":"urn:btih:b01da2130ded3ac654b27966ea108b9e5633f943","amp;dn":"Ed+-+The+Complete+Fourth+Season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b01da2130ded3ac654b27966ea108b9e5633f943","infoHashBuffer":{"type":"Buffer","data":[176,29,162,19,13,237,58,198,84,178,121,102,234,16,139,158,86,51,249,67]},"announce":[],"urlList":[]}}