{"title":"Game of Thrones S04E01 720p HDTV MPEG2 SM10HD","uid":9908480,"size":1652464352,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b059bccb54576b45581d8a7a11654ea887125dd1&amp;dn=Game+of+Thrones+S04E01+720p+HDTV+MPEG2+SM10HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"darkj6","files":-1,"time":1396848937,"description":" ______   _______  ______    ___   _      ___  --------|\n|      | |   _   ||    _ |  |   | | |    |   ||   |----|    \n|  _    ||  |_|  ||   | ||  |   |_| |    |   ||   |___ \n| | |   ||       ||   |_||_ |      _|    |   ||    _  |\n| |_|   ||       ||    __  ||     |_  ___|   ||   | | |\n|       ||   _   ||   |  | ||    _  ||       ||   |_| |\n|______| |__| |__||___|  |_||___| |_||_______||_______|\n\n\n\nGame of Thrones S04E01 720p HDTV MPEG2 SM10HD\n\nGame of Thrones is an American epic fantasy television series created for HBO by David Benioff and D. B. Weiss. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is titled A Game of Thrones. Filmed in a Belfast studio and on location elsewhere in Northern Ireland, Malta, Croatia, Iceland, and Morocco, it premiered on HBO in the United States on April 17, 2011.\nThe series, set in the fictional continents of Westeros and Essos at the end of a decade-long summer, interweaves several plot lines. The first follows the members of several noble houses in a civil war for the Iron Throne of the Seven Kingdoms; the second covers the rising threat of the impending winter and the mythical creatures of the North; the third chronicles the attempts of the exiled last scion of the realm's deposed dynasty to reclaim the throne. Through its morally ambiguous characters, the series explores issues of social hierarchy, religion, civil war, sexuality, crime and punishment. It is the most recent big-budget work to have contributed to the popularity of the fantasy genre in mainstream media.\n\nEVOLVE provided the source file, which is incompatible with PS3 so to compensate for that as well as making it readily available for all PC rigs SM10HD re-encode the MKV into an MPEG2 and then manually mux the audio to sync up with it. We then alter the filters so the colours retain their maximum intensity and display nicely on big screens and home monitors. We do not share this process with others.\n\nWe seed for a minimum of 24 hours after the initial upload. After that it is down to the rest of the community.\n\nThanks for choosing SM10HD. There is a fan page dedicated to us on Facebook. Just search it out.","torrent":{"xt":"urn:btih:b059bccb54576b45581d8a7a11654ea887125dd1","amp;dn":"Game+of+Thrones+S04E01+720p+HDTV+MPEG2+SM10HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b059bccb54576b45581d8a7a11654ea887125dd1","infoHashBuffer":{"type":"Buffer","data":[176,89,188,203,84,87,107,69,88,29,138,122,17,101,78,168,135,18,93,209]},"announce":[],"urlList":[]}}