{"title":"Durbar - Tavleen Singh","uid":11739878,"size":1468984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b068bfa35152de8ad43b39ffd3ad7b36e8af4157&amp;dn=Durbar+-+Tavleen+Singh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425743328,"description":"In the summer of 1975 Tavleen Singh, not yet twenty-five, started working as a junior reporter in the Statesman in New Delhi. Within five weeks, Prime Minister Indira Gandhi declared the Emergency, suspending fundamental rights and imposing press censorship, and soon reckless policies said to be authored by the prime minister's younger son were unleashed on India's citizens. As the country suffered under the iron fist of an elected icon and her chosen heir, Tavleen observed that a small, influential section of Delhi's society people she knew well remained strangely unaffected by the perilous state of the nation. Before long, members of this circle were entrenched in key positions in the Indian government. \n\nIn 1984, following Indira Gandhi's assassination, Rajiv Gandhi became prime minister, fortified by a huge mandate from a nation desperate for change. But, belying its hopes, the young leader chose for himself a group of advisors, friends and acolytes from the drawing rooms of Delhi, as inexperienced as him and just as unaware of the ground realities of a complex nation. It was the beginning of a political culture of favouritism and ineptitude that would take hold at the highest levels of government, stunting India's ambitions and frustrating its people well into the next century. \n\nSeasoned reporter and distinguished newspaper columnist Tavleen Singh's Durbar is a sharp account of these turbulent years. Describing the Nehruvian era of her childhood, the Emergency of her youth and the political shifts that followed, Tavleen writes of the birth and evolution of insurgencies in Punjab and Kashmir, the blood spilt in assassinations and massacres, of crises internal and external and the clumsy attempts to set things right. A remarkable memoir, vivid with the colour of election campaigns and society dinners, low conspiracies and high corruption, Durbar rewards us with this truth: that if India is to achieve a better future the past can no longer be ignored or forgotten","torrent":{"xt":"urn:btih:b068bfa35152de8ad43b39ffd3ad7b36e8af4157","amp;dn":"Durbar+-+Tavleen+Singh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b068bfa35152de8ad43b39ffd3ad7b36e8af4157","infoHashBuffer":{"type":"Buffer","data":[176,104,191,163,81,82,222,138,212,59,57,255,211,173,123,54,232,175,65,87]},"announce":[],"urlList":[]}}