{"title":"KSP - Kerbal Space Program 0.18.2","uid":7943991,"size":364026741,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0c1a1ee0a4165fde134e7b2225ffa864b520464&amp;dn=KSP+-+Kerbal+Space+Program+0.18.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Crafter2","files":1,"time":1356083360,"description":"v0.18.2\n\nReleased 20th December, 2012\nNew:\nTraining: Added a Basic Flight Tutorial, and a Basic Vessel Construction Tutorial.\nSolar System: Added a new icy planet called Eeloo, somewhere out past Jool.\nScenarios: Added a scenario called Station One, where a refueling station is already in orbit.\nUI: Added a button to open the SpacePort site on the Main Menu (opens on the default browser)\nMusic: Added two new tracks for space and another one for construction.\nBugfixes and Tweaks:\nGraphics: 800x600 is no longer a valid resolution option. Minimum possible resolution is now 960x720.\nDocking: Fixed ejected debris being incorrectly typed as &quot;Unknown&quot;.\nUI: Fixed an issue where the &quot;Resume Saved&quot; dialog wouldn't show if a save folder was missing its persistent.sfs file.\nUI: The &quot;Resume Saved&quot; and Craft Load dialogs now offer to clean up incompatible files if any are detected.\nUI: Incompatible/Invalid entries on those dialogs are now greyed out, and the reason why they can't be loaded is displayed.\nUI: Fixed an issue with popup dialogs cutting out content (text and buttons) when multiple dialogs were spawned at once.\nUI: The Resources panel is now visible while in the Map View.\nDecouplers now break the connection at a specific node, instead of breaking the connection to the parent part. This enables choosing which side will remain attached.\nPhysicsless parts now get &quot;promoted&quot; to physical ones if they become the root of a vessel (by decoupling)\nPersistence: Vessel rotation is now stored relative to the universe, instead of in worldspace. This fixes vessels having seemingly random rotations upon resuming a save.\nParts: Fixed an issue with the engine fairings which caused engines to lose mass on save/load cycles.\nParts: RCS thrusters no longer try (and fail) to do lever arm compensation.\nMusic: Fixed an issue where some tracks were subject to doppler effects in flight.\nSolar System: Pol's gravity increased slightly\nSolar System: Bop and Pol's semi-major axes increased (Bop's SOI almost intersected Tylo's)\nGameplay: Fixed an issue where crashing a ship wouldn't properly remove the root part and cause weird &quot;physics&quot; sometimes.\nGameplay: Fixed an issue with renaming vessels from symmetrically-placed command pods.\nManeuver Nodes: Fixed a small but annoying issue where maneuver gizmos would switch modes when rotating the camera just after creating a maneuver.\nTraining: Fixed Gene Kerman introducing himself as Wernher von Kerman on the Orbit 101 tutorial.\nParts: Fixed an issue where the root part of a vessel would live on in a weird state after crashing.\nDocking: Fixed an issue where docking ports wouldn't resume their fuel crossfeed properly sometimes.\nControls: Added input locks to action groups and part context UIs, so they lock when appropriate.\nUI: Part Resource Context Gauges now correctly go away when the corresponding part gets detached from the current ship.\nParts: Fixed an issue that could cause RCS thrusters to fly off on their own because of numerical spikes.\nParts: Landing gear now remember to set the brakes when resuming flight.\nGameplay: Added a rule to prevent saving the game or switching vessels while the current one is throttled up.\nGameplay: Unrestricted vessel switching is now only allowed if the vessel to be focused is loaded and unpacked.\nTutorials: Fixed the Construction Tutorial erroring out with an &quot;incompatible&quot; sfs when launching after completing the tutorial.\nTutorials: Tutorial Scenarios now delete the instructor objects when the ScenarioModule is destroyed.\nTutorials: The Construction Tutorial now allows launching the constructed vessel, and going back to edit it later.\nControls: Action groups are now locked when in map view, to prevent accidental activation without being able to see the ship.\nControls: Map View won't lock RCS off anymore when the navball is up.\nUI: Added some sanity checking to text fields (vessel names and saves), so illegal characters don't cause trouble.","torrent":{"xt":"urn:btih:b0c1a1ee0a4165fde134e7b2225ffa864b520464","amp;dn":"KSP+-+Kerbal+Space+Program+0.18.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c1a1ee0a4165fde134e7b2225ffa864b520464","infoHashBuffer":{"type":"Buffer","data":[176,193,161,238,10,65,101,253,225,52,231,178,34,95,250,134,75,82,4,100]},"announce":[],"urlList":[]}}