{"title":"YouTube Downloader Pro YTD 3.9.6 20121212 Full - Cyclonoid","uid":8281572,"size":7084128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b11fa4546cdedb4990228850aec3af6940ef2f2a&amp;dn=YouTube+Downloader+Pro+YTD+3.9.6+20121212+Full+-+Cyclonoid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"cyclonoid","files":6,"time":1363855122,"description":"Youtube Downloader Pro\n\nYouTube Converter Features\n\nGet High Definition Video\nDownload High-Def (HD) 1080P videos from YouTube and all other major video streaming sites with YouTube Downloader. Watching HD YouTube videos from your laptop or mobile device with our YouTube converter has never been easier! \n\nDownload and Watch Later\nNever worry about missing a video, or having to watch YouTube clips on their time. With YouTube Downloader, you can save videos. Our software acts as a YouTube converter as well, and lets you convert YouTube videos easily, viewing them at any time you want! \n\nConverter Works with Most Formats\nYouTube Downloader's unique software downloads content from all the major video streaming sites, not only YouTube. It also acts as a YouTube Converter, where you can convert your movie files into any number of formats, including YouTube to MP3, MP4, 3GP, MPEG and even YouTube to AVI. View All. \n\nWatch on Other Devices\nWhen you download YouTube videos using our free YouTube Downloader, it doesn't mean you have to watch them on one device. YouTube Downloader is a video converter that turns files into playable, portable video formats - so you can convert YouTube to iPod, iPhone, PSP and even YouTube to iTunes. View All. \n\nIt's Fast and Easy to Use\nThe YouTube Downloader interface is intuitive and easy to use. Users simply copy and paste a video URL, then click the Download button. \n\nVideo Player Integrated\nOur free YouTube Converter will also save files onto its extensive database, allowing you to build a player to categorize and sort your favorite videos, just like you would using iTunes!\n\nAll Installation instruction given on read me txt\n\n\nPlease please seed it as much as possible :)\n\nRegards Cyclonoid","torrent":{"xt":"urn:btih:b11fa4546cdedb4990228850aec3af6940ef2f2a","amp;dn":"YouTube+Downloader+Pro+YTD+3.9.6+20121212+Full+-+Cyclonoid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11fa4546cdedb4990228850aec3af6940ef2f2a","infoHashBuffer":{"type":"Buffer","data":[177,31,164,84,108,222,219,73,144,34,136,80,174,195,175,105,64,239,47,42]},"announce":[],"urlList":[]}}