{"title":"R-Drive Image 5.3 Build 5305 Technician Multilingual","uid":10743219,"size":64768508,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b160f7a7c5483d85c9b1de9ac675c98ebf7ae031&amp;dn=R-Drive+Image+5.3+Build+5305+Technician+Multilingual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"nikita200","files":-1,"time":1407784993,"description":"R-Drive Image is a potent utility providing disk image files creation for backup or duplication purposes. A disk image file contains the exact, byte-by-byte copy of a hard drive, partition or logical disk and can be created with various compression levels on the fly without stopping Windows OS and therefore without interrupting your business. These drive image files can then be stored in a variety of places, including various removable media such as CD-R(W)/DVD, Iomega Zip or Jazz disks, etc. R-Drive Image restores the images on the original disks, on any other partitions or even on a hard drive's free space on the fly. To restore system and other locked partitions R-Drive Image is switched to the pseudo-graphic mode directly from Windows or bootable version created by the utility is launched from CD disc or diskettes.\n\nUsing R-Drive Image, you can completely and rapidly restore your system after heavy data loss caused by an operating system crash, virus attack or hardware failure. You can also use R-Drive Image for mass system deployment when you need to setup many identical computers. In other words, you can manually setup one system only, create an image of the system, and then deploy it on all other computers, saving your time and costs. If you need to restore only certain files from a disk image, you can connect that image as a virtual disk and copy those files directly from the disk image using Windows Explorer or any other file utility.\n\nR-Drive Image is one of the best backup and disaster recovery solutions to prevent losing your data after a fatal system failure.\n\nVersion 5.x\n- Full support for the GPT partitioning layout. R-Drive Image can create GPT disks, resize them, and change their partition layout during copy/restore operations.\n- Serious increase in read speed for compressed images.\n- Windows 8 and Windows Server 2012 support. The new R-Drive Image version supports all Windows 8 and Windows Server 2012 operating systems.\n- A new faster and more robust disk processing engine. R-Drive Image became more stable and reliable. A lot of bugs are fixed.\n- Separate files can be restored from images.\n- Support for several languages in GUI and help.\n- A startup version with GUI.\n- A new image format with a new file extension, .rdr. The old image formats are still supported.\n- Disk signature collision resolution for disk to disk copy.\n- Support for the ReFS file system (Resilient File System), a new local file system Microsoft has introduced in its Windows 2012 Server. All disk actions are supported, except partition resizing.\n","torrent":{"xt":"urn:btih:b160f7a7c5483d85c9b1de9ac675c98ebf7ae031","amp;dn":"R-Drive+Image+5.3+Build+5305+Technician+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b160f7a7c5483d85c9b1de9ac675c98ebf7ae031","infoHashBuffer":{"type":"Buffer","data":[177,96,247,167,197,72,61,133,201,177,222,154,198,117,201,142,191,122,224,49]},"announce":[],"urlList":[]}}