{"title":"Disciplined Dreaming: A Proven System to Drive Breakthrough Crea","uid":14258711,"size":393303873,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b186f4d063de1caa3912df3be54ece2089cdf74d&amp;dn=Disciplined+Dreaming%3A+A+Proven+System+to+Drive+Breakthrough+Crea&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"oinky222","files":75,"time":1460228268,"description":"A 5-part process that will transform your organization — or your career — into a non-stop creativity juggernaut\r\nWe live in an era when business cycles are measured in months, not years. The only way to sustain long term innovation and growth is through creativity-at all levels of an organization. Disciplined Dreaming shows you how to create profitable new ideas, empower all your employees to be creative, and sustain your competitive advantage over the long term. Linkner distills his years of experience in business and jazz — as well as hundreds of interviews with CEOs, entrepreneurs, and artists — into a 5-step process that will make creativity easy for you and your organization. The methodology is simple, backed by proven results.\r\n\r\nEmpowers individuals, teams, and organizations to meet creative challenges posed by the marketplace\r\nTurns the mystery of creativity into a simple-to-use process\r\nShows how creativity can be used for everything from innovative, game-shifting breakthroughs to incremental advances and daily improvements to business processes\r\nOffers dozens of practical exercises, thought-starters, workouts to grow &quot;creative muscles,&quot; and case studies\r\nDisciplined Dreaming shows even the stuffiest corporate bureaucracies how to cultivate creativity in order to become more competitive in today's shifting marketplace","torrent":{"xt":"urn:btih:b186f4d063de1caa3912df3be54ece2089cdf74d","amp;dn":"Disciplined+Dreaming%3A+A+Proven+System+to+Drive+Breakthrough+Crea","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b186f4d063de1caa3912df3be54ece2089cdf74d","infoHashBuffer":{"type":"Buffer","data":[177,134,244,208,99,222,28,170,57,18,223,59,229,78,206,32,137,205,247,77]},"announce":[],"urlList":[]}}