{"title":"Lauren Oliver - Delirium Amoris Trilogie. NL Ebook. DMT ","uid":11775767,"size":1797575,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b18c648931414b8741976855e920e28de9432511&amp;dn=Lauren+Oliver+-+Delirium+Amoris+Trilogie.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"BiWild","files":6,"time":1427281425,"description":"Lauren Oliver - Delirium Amoris Trilogie. NL Ebook. DMT \n\nAuteur: Lauren Oliver\nPagina's: 327/272/292\nTaal: Dutch/Nederlands\nUitgever: The House of Books\nJaar van uitgifte: 2014\nGenre: Jeugd\n\nSamenvatting\n\nAfbeelding\n\n(1) DELERIUM\nEr was een tijd dat liefde het belangrijkste was op aarde. Mensen reisden naar het einde van de wereld om het te vinden. \nZe logen ervoor om het te krijgen. Ze deden er zelfs een moord voor. Toen werd er, eindelijk, een behandeling voor gevonden. \nDe regering verlangt nu van haar burgers dat deze tegen liefde behandeld worden wanneer ze achttien jaar oud worden. \nLena Haloway keek altijd uit naar de dag van haar genezing. Een leven zonder liefde is een leven zonder pijn: veilig, afgepast, \nvoorspelbaar en gelukkig. Maar vijfennegentig dagen voor haar behandeling overkomt Lena het onmogelijke: ze wordt verliefd.\n\n(2) PANDEMONIUM \nHet tweede deel in de Delirium amoris-trilogie.\nDeze fascinerende roman zindert van het vuur van fel verzet, verboden liefde en de vonken van een revolutie die op het punt staat \nuit te barsten. Lena is in de Wildernis beland, zonder Alex, maar met vele anderen die hebben besloten \nhet leven in eigen hand te nemen. Een ruig en hard leven, zonder luxe, maar met liefde.\n\n(3) REQUEUM \nNa Julian te hebben gered van de dood, vluchten Lena en haar vrienden terug de Wildernis in. Maar de Wildernis is niet langer \nde veilige haven die ze dachten te vinden. De grensgebieden worden belaagd door soldaten. Zo gevaarlijk als het voor Lena is in \nde Wildernis, zo kalm is het leven van Hana, haar beste vriendin, die een leven zonder liefde leidt in Portland. \nDe wereld waarin ze leven verdeelt hen, maar hun verhalen komen toch bij elkaar.\n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:b18c648931414b8741976855e920e28de9432511","amp;dn":"Lauren+Oliver+-+Delirium+Amoris+Trilogie.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b18c648931414b8741976855e920e28de9432511","infoHashBuffer":{"type":"Buffer","data":[177,140,100,137,49,65,75,135,65,151,104,85,233,32,226,141,233,67,37,17]},"announce":[],"urlList":[]}}