{"title":"What Would Your Character Do? by Eric Maisel","uid":9676008,"size":7162981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b28906438fefadcadaedc268c6c4150dd594a5bc&amp;dn=What+Would+Your+Character+Do%3F+by+Eric+Maisel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"PirateBook","files":3,"time":1393562773,"description":"\nGet Inside Your Character's Head\nJust how well do you know your characters?\nTest yourself-and your characters-with 30 interactive pop quizzes designed to help you discover exactly what makes your characters tick.\n\nNoted author Eric Maisel draws on his technical knowledge of the craft and his background in psychology to show you how to combine character traits, character psychology, and character development to create realistic, memorable, and mutable characters.\nThe 30 real-life scenarios include questions and answers that provide you with a window into your characters' souls. For example:\n\nWhat would motivate your character to tell a lie-a big lie that may have unintended consequences?\n\nIs your character the type who would blow the whistle on a corporate cover-up or would she quietly toe the line?\n\nHow would your character cope with the loss of a parent with whom he was exceptionally close?\n\nHow likely would your character be to flirt with an attractive stranger in a hotel bar?\n\nIs your character the type who would drop everything-and everyone-for a spontaneous road trip?\n\nPlus, find out how to develop each scenario further using corresponding prompts and specific psychological insight into areas such as the role friendship plays in a person's mental and physical health, conflict resolution in intimate relationships, and the connection between time-impatience and free-floating hostility.\n\nWith What Would Your Character Do?, you don't have to guess at your character's responses to the important decisions and unexpected challenges he's sure to encounter in your story. Use and reuse these scenarios on each of your characters until you've got a nuanced, distinct cast that readers will never be able to forget!\n\nGenre: Non-Fiction","torrent":{"xt":"urn:btih:b28906438fefadcadaedc268c6c4150dd594a5bc","amp;dn":"What+Would+Your+Character+Do%3F+by+Eric+Maisel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28906438fefadcadaedc268c6c4150dd594a5bc","infoHashBuffer":{"type":"Buffer","data":[178,137,6,67,143,239,173,202,218,237,194,104,198,196,21,13,213,148,165,188]},"announce":[],"urlList":[]}}