{"title":"Computational Methods for Physics 2013 - Joel Franklin [PDF] Ehh","uid":8733700,"size":18705015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2cedc1c9b643e0dccfa8a4cb0bca6820ebe551d&amp;dn=Computational+Methods+for+Physics+2013+-+Joel+Franklin+%5BPDF%5D+Ehh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374647180,"description":"\nOverview\n\nThere is an increasing need for undergraduate students in physics to have a core set of computational tools. Most problems in physics benefit from numerical methods, and many of them resist analytical solution altogether. This textbook presents numerical techniques for solving familiar physical problems where a complete solution is inaccessible using traditional mathematical methods. The numerical techniques for solving the problems are clearly laid out, with a focus on the logic and applicability of the method. The same problems are revisited multiple times using different numerical techniques, so readers can easily compare the methods. The book features over 250 end-of-chapter exercises. A website hosted by the author features a complete set of programs used to generate the examples and figures, which can be used as a starting point for further investigation. A link to this can be found at www.cambridge.org/9781107034303.\n\n\nTable of Contents\n\n1. Programming overview; 2. Ordinary differential equations; 3. Root-finding; 4. Partial differential equations; 5. Time dependent problems; 6. Integration; 7. Fourier transform; 8. Harmonic oscillators; 9. Matrix inversion; 10. The eigenvalue problem; 11. Iterative methods; 12. Minimization; 13. Chaos; 14. Neural networks; 15. Galerkin methods; References; Index.\n\n\n\n\nProduct Details\n\n    ISBN-13: 9781107034303\n    Publisher: Cambridge University Press\n    Publication date: 5/31/2013\n    Pages: 424\n\n\n\nMeet the Author\n\nJoel Franklin is an Associate Professor in the physics department at Reed College. He focuses on mathematical and computational methods with applications to classical mechanics, quantum mechanics, electrodynamics, general relativity, and modifications of general relativity.\n","torrent":{"xt":"urn:btih:b2cedc1c9b643e0dccfa8a4cb0bca6820ebe551d","amp;dn":"Computational+Methods+for+Physics+2013+-+Joel+Franklin+%5BPDF%5D+Ehh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2cedc1c9b643e0dccfa8a4cb0bca6820ebe551d","infoHashBuffer":{"type":"Buffer","data":[178,206,220,28,155,100,62,13,204,250,138,76,176,188,166,130,14,190,85,29]},"announce":[],"urlList":[]}}