{"title":"Marvel NOW! Week 6 (darkhomr) [TPB]","uid":7940575,"size":436827446,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b350c34a156ea171083c6d93a9cb5fec590dcb9e&amp;dn=Marvel+NOW%21+Week+6+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"dadrkhomr","files":14,"time":1355967265,"description":"Starting the week of 12/19/2012 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\nA Plus X #3 (CBR 12/19/2012)\n\nJason Aaron and Pasqual Ferry bring you a teamup of two of the biggest Marvel heroes - STORM and BLACK PANTHER!  James Asmus and Billy Tan bring together the stars of the two biggest new Marvel series - GAMBIT AND HAWKEYE SAVE LIVES! \n\nAll New X-Men #4 (CBR 12/19/2012)\n\nThe Original 5 X-Men come face to face with their counterparts and it isn't a peaceful meeting! \n\nAvengers #2 (CBR 12/19/2012)\n\nThe greatest heroes in comics together on one unbeatable team!  Now shipping twice a month, the Avengers 'go large,' expanding their roster and their sphere of influence to a global and even interplanetary level. When Captain America puts out his call - who will answer?  Big threats, big ideas, big idealism - these are the Avengers NOW!\n \nAvengers Arena #2 (CBR 12/19/2012)\n\nANNIHILATION's Cammi vs. Deathlocket! AVENGER ACADEMY's Hazmat vs. Deathlocket! Who the heck is Deathlocket? And who dies in this issue?  Plus: Who are the students of the Braddock Academy?  This variant cover edition comes bagged and boarded. \n\nCable And X-Force #2 (CBR 12/19/2012)\n\nCable is back! NOW!  With a new X-Force at his side, he must tackle the threats that nobody else can know about. But just who are Cable's new recruits, and why is his team public enemy number one? Caught red-handed at the scene of a terrorist attack on a major American corporation whose CEO has expressed anti-mutant views, the X-Force is the run, with none other than the Uncanny Avengers in hot pursuit. \n\nCaptain America #2 (CBR 12/19/2012)\n\nDimension Z continues!  'Remember their faces, their families. Remember what they love. Learn how to turn it against them. ' Arnim Zola's ambitions leave Captain America stranded in the upside-down territory known as Dimension Z. Steve has saved the life of Zola's son, but can he keep him alive? Who are the barbarians of Phrox and what are their intentions for Steve and his new ward? \n\nFF #2 (CBR 12/19/2012)\n\nAnt-Man! She Hulk! Medusa! And, um -- Ms. Thing? How does the rest of the Future Foundation react to the new team? What classic Fantastic Four super-villain can't wait to get their hands on the new FF? \n\nHawkeye #6 (CBR 12/19/2012)\n\nDavid Aja returns to the most critically acclaimed comic of 2012!  The Ace Archer Clint Barton faces DVR-MAGEDDON! \n\nIndestructible Hulk #2 (CBR 12/19/2012)\n\nGuest starring IRON MAN!  While Bruce Banner and Tony Stark are friends, Hulk and Iron Man are anything but! Eisner Award winning writer Mark Waid (DAREDEVIL) and superstar artist Leinil Yu continue to take the Hulk in an all-new direction!\n \n\n","torrent":{"xt":"urn:btih:b350c34a156ea171083c6d93a9cb5fec590dcb9e","amp;dn":"Marvel+NOW%21+Week+6+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b350c34a156ea171083c6d93a9cb5fec590dcb9e","infoHashBuffer":{"type":"Buffer","data":[179,80,195,74,21,110,161,113,8,60,109,147,169,203,95,236,89,13,203,158]},"announce":[],"urlList":[]}}