{"title":"GeoTechnical Engineering_V.N.S. Murthy &lt;NNN&gt;","uid":5939767,"size":60930281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b37a23f8f1388d078235588977a1d8e2689489ab&amp;dn=GeoTechnical+Engineering_V.N.S.+Murthy+%3CNNN%3E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"anonymous_en","files":1,"time":1289108904,"description":"A reference book for consulting geotechnical engineers and contractors. Provides the latest developments in the design of drilled pier foundations and mechanically stabilized earth retaining walls are explained. Textbook.\n\nAuthor(s): V.N.S. Murthy\nPublisher: CRC Press\nDate     : October 25, 2002\nPages    : 1050\nFormat   : pdf\nQuality  : fine\nLanguage : English\nISBN-10  : 0824708733\n\nChapter 1 Introduction\nChapter 2 Soil Formation And Characterization\nChapter 3 SOIL PHASE RELATIONSHIPS, INDEX PROPERTIES\n          AND CLASSIFICATION\nCHAPTER 4 SOIL PERMEABILITY AND SEEPAGE\nCHAPTER 5 EFFECTIVE STRESS AND PORE WATER PRESSURE\nCHAPTER 6 STRESS DISTRIBUTION IN SOILS\n          DUE TO SURFACE LOADS\nCHAPTER 7 COMPRESSIBILITY AND CONSOLIDATION\nCHAPTER 8 SHEAR STRENGTH OF SOIL\nCHAPTER 9 SOIL EXPLORATION\nCHAPTER 10 STABILITY OF SLOPES\nCHAPTER 11 LATERAL EARTH PRESSURE\nCHAPTER 12 SHALLOW FOUNDATION I:\n           ULTIMATE BEARING CAPACITY\nCHAPTER 13 SHALLOW FOUNDATION II:\n           SAFE BEARING PRESSURE AND SETTLEMENT CALCULATION\nCHAPTER 14 SHALLOW FOUNDATION III:\n           COMBINED FOOTINGS AND MAT FOUNDATIONS\nCHAPTER 15 DEEP FOUNDATION I:\n           PILE FOUNDATION\n           PART A-VERTICAL LOAD BEARING CAPACITY OF A SINGLE VERTICAL PILE\n           PART B-PILE GROUP\nCHAPTER 16 DEEP FOUNDATION II:\n           BEHAVIOR OF LATERALLY LOADED VERTICAL AND\n           BATTER PILES\nCHAPTER 17 DEEP FOUNDATION III:\n           DRILLED PIER FOUNDATIONS\nCHAPTER 18 FOUNDATIONS ON COLLAPSIBLE AND\n           EXPANSIVE SOILS\n           PART A-COLLAPSIBLE SOILS\n           PART B-EXPANSIVE SOILS\nCHAPTER 19 CONCRETE AND MECHANICALLY STABILIZED\n           EARTH RETAINING WALLS\n           PART A-CONCRETE RETAINING WALLS\n           PART B-MECHANICALLY STABILIZED EARTH RETAINING WALLS\nCHAPTER 20 SHEET PILE WALLS AND BRACED CUTS\nCHAPTER 21 SOIL IMPROVEMENT\n \n\nFOREWORD BY  \n           BengtB.Broms, Ph.D.\n           Nanyang Technical University, Singapore (retired).\nand the effect of the installation method on bearing capacity and uplift are analyzed in Chapter 17.\nFoundations on swelling and collapsible soils are treated in Chapter 18 as are methods that can be\nused to reduce heave. This is an important subject, seldom treated in textbooks. The design of\nretaining walls is covered in Chapter 19, as well as the different factors that affect active and\npassive earth pressures. Different applications of geotextiles are covered in this chapter as well as\nthe topic of reinforced earth. Cantilever, anchored, and strutted sheet pile walls are investigated in\nChapter 20, as are methods to evaluate stability and the moment distribution. Different soil\nimprovement methods, such as compaction of granular soils, sand compaction piles,\nvibroflotation, preloading, and stone columns, are described in Chapter 21. The chapter also\ndiscusses lime and cement stabilization. Appendix A provides a list of SI units, and Appendix B\ncompares methods that have been proposed.\nThis textbook by Prof. V. N. S. Murthy is highly recommended for students specializing in\ngeotechnical engineering and for practicing civil engineers in the United States and Europe. The\nbook includes recent developments such as soil improvement and stabilization methods and\napplications of geotextiles to control settlements and lateral earth pressure. Numerous graphs and\nexamples illustrate the most important concepts in geotechnical engineering. This textbook\nshould serve as a valuable reference book for many years to come.\nBengtB.Broms, Ph.D.\nNanyang Technical University, Singapore (retired).It gives me great pleasure to write a foreword for Geotechnical Engineering: Principles and\nPractices of Soil Mechanics and Foundation Engineering. This comprehensive, pertinent and up-\nto-date volume is well suited for use as a textbook for undergraduate students as well as a\nreference book for consulting geotechnical engineers and contractors. This book is well written\nwith numerous examples on applications of basic principles to solve practical problems.\nThe early history of geotechnical engineering and the pioneering work of Karl Terzaghi in\nthe beginning of the last century are described in Chapter 1. Chapters 2 and 3 discuss methods of\nclassification of soil and rock, the chemical and the mechanical weathering of rock, and soil phase\nrelationships and consistency limits for clays and silts. Numerous examples illustrate the\nrelationship between the different parameters. Soil permeability and seepage are investigated in\nChapter 4. The construction of flow nets and methods to determine the permeability in the\nlaboratory and in the field are also explained.\nThe concept of effective stress and the effect of pore water pressure on effective stress are\ndiscussed in Chapter 5. Chapter 6 is concerned with stress increase in soil caused by surface load\nand methods to calculate stress increase caused by spread footings, rafts, and pile groups. Several\nexamples are given in Chapter 6. Consolidation of soils and the evaluation of compressibility in\nthe laboratory by oedometer tests are investigated in Chapter 7. Determination of drained and\nundrained shear strength by unconfined compression, direct shear or triaxial tests is treated in\nChapter 8.\nThe important subject of soil exploration is discussed in Chapter 9, including the use of\npenetration tests such as SPT and CPT in different countries. The stability of slopes is investigated\nin Chapter 10. Methods using plain and circular slip surfaces to evaluate stability are described\nsuch as the methods proposed by Bishop, Fellenius, Morgenstern, and Spencer. Chapter 11\ndiscusses methods to determine active and passive earth pressures acting on retaining and sheet\npile walls.\nBearing capacity and settlement of foundation and the evaluation of compressibility in the\nlaboratory by oedometer tests are discussed in Chapters 12, 13, and 14. The effect of inclination\nand eccentricity of the load on bearing capacity is also examined. Chapter 15 describes different\npile types, the concept of critical depth, methods to evaluate the bearing capacity of piles in\ncohesive and cohesionless soils, and pile-driving formulae. The behavior of laterally loaded piles\nis investigated in Chapter 16 for piles in sand and in clay. The behavior of drilled pier foundations\nand the effect of the installation method on bearing capacity and uplift are analyzed in Chapter 17.\nFoundations on swelling and collapsible soils are treated in Chapter 18 as are methods that can be\nused to reduce heave. This is an important subject, seldom treated in textbooks. The design of\nretaining walls is covered in Chapter 19, as well as the different factors that affect active and\npassive earth pressures. Different applications of geotextiles are covered in this chapter as well as\nthe topic of reinforced earth. Cantilever, anchored, and strutted sheet pile walls are investigated in\nChapter 20, as are methods to evaluate stability and the moment distribution. Different soil\nimprovement methods, such as compaction of granular soils, sand compaction piles,\nvibroflotation, preloading, and stone columns, are described in Chapter 21. The chapter also\ndiscusses lime and cement stabilization. Appendix A provides a list of SI units, and Appendix B\ncompares methods that have been proposed.\nThis textbook by Prof. V. N. S. Murthy is highly recommended for students specializing in\ngeotechnical engineering and for practicing civil engineers in the United States and Europe. The\nbook includes recent developments such as soil improvement and stabilization methods and\napplications of geotextiles to control settlements and lateral earth pressure. Numerous graphs and\nexamples illustrate the most important concepts in geotechnical engineering. This textbook\nshould serve as a valuable reference book for many years to come.\n                \n\n\nFOREWORD BY\n           MarkT. Bowers, Ph.D., P. E.\n           Associate Professor of Civil Engineering\n           University of Cincinnati\nGeotechnical Engineering: Principles and Practices of Soil Mechanics and Foundation\nEngineering is a long title befitting a major work. I am pleased to introduce this superb volume\ndestined for a readership of students, professors, and consultants. What makes this text different\nfrom other books on these subjects that appear each year and why am I recommending it to you? I\nhave been working and teaching in the area of geotechnical engineering for 25 years. I have read\nand used scores of textbooks in my classes and practice. Dr. Murthy's text is by far the most\ncomprehensive text I have found. You will find that his organization of the subject matter follows\na logical progression. His example problems are numerous and, like the text, start from fundamental\nprinciples and progressively develop into more challenging material. They are the best set of\nexample problems I have seen in a textbook. Dr. Murthy has included ample homework problems\nwith a range of difficulty meant to help the student new to the subject to develop his/her\nconfidence and to assist the experienced engineer in his/her review of the subject and in\nprofessional development.\nAs the technical editor I have read the entire manuscript three times. I have been impressed by\nthe coverage, the clarity of the presentation, and the insights into the hows and whys of soil and\nfoundation behavior. Often I have been astonished at Dr. Murthy's near-conversational approach to\nsharing helpful insights. You get the impression he's right there with you guiding you along,\nanticipating your questions, and providing instruction and necessary information as the next steps\nin the learning process. I believe you will enjoy this book and that it will receive a warm welcome\nwherever it is used.\nI thank Dr. Murthy for his commitment to write this textbook and for sharing his professional\nexperience with us. I thank him for his patience in making corrections and considering suggestions.\nI thank Mr. B. J. Clark, Senior Acquisitions Editor at Marcel Dekker Inc., for the opportunity to be\nassociated with such a good book. I likewise express my appreciation to Professor Pierre Foray of\n1'Ecole Nationale Superieure d'Hydraulique et de Mecanique de Grenoble, Institut National\nPolytechnique de Grenoble, France for his enthusiastic and unflagging support while I edited the\nmanuscript.\n\n\n\n\nA must have for all geotechnical engineers and engineering students\n\nRemember to seed and Enjoy!!!!!!!!!\n\nNNN","torrent":{"xt":"urn:btih:b37a23f8f1388d078235588977a1d8e2689489ab","amp;dn":"GeoTechnical+Engineering_V.N.S.+Murthy+%3CNNN%3E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b37a23f8f1388d078235588977a1d8e2689489ab","infoHashBuffer":{"type":"Buffer","data":[179,122,35,248,241,56,141,7,130,53,88,137,119,161,216,226,104,148,137,171]},"announce":[],"urlList":[]}}