{"title":"Josh Groban - Noel","uid":6033407,"size":344197175,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3ecc06259c7490e347a37c165dc66551db4aa93&amp;dn=Josh+Groban+-+Noel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ddawg","files":-1,"time":1292159812,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/27/a3/af8f90b809a0278e95cc6110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/27/a3/af8f90b809a0278e95cc6110.L.jpg&lt;/a&gt;\n\n\nTitle: Noel\nArtist: Josh Groban\nAudio CD (October 9, 2007)\nOriginal Release Date: October 9, 2007\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Silent Night\n02. Little Drummer Boy [Featuring Guitarist Andy McKee]\n03. I'll Be Home For Christmas\n04. Ave Maria\n05. Angels We Have Heard On High [Duet with Brian McKnight]\n06. Thankful\n07. The Christmas Song\n08. What Child Is This?\n09. The First Noel [Duet with Faith Hill]\n10. Petit Papa Noel\n11. It Came Upon A Midnight Clear\n12. Panis Angelicus\n13. O Come All Ye Faithful [With the Mormon Tabernacle Choir under the direction of Craig Jessop] \n\n\nAmazon Review:\nThe Grammy-nominated, twenty-something, pop-classical phenomenon's fourth studio album is an expertly accomplished entry to the holiday marketplace. NoÃƒÂ«l tackles the familiar sounds of holiday music with a charmingly eclectic array of guest vocalists and a wide range of material. The songs range from the sacred to the secular, while Groban--buoyed in spots by none other than the London Symphony Orchestra--soars in his duets with Brian McKnight, Faith Hill, and the Mormon Tabernacle Choir. There's even a song with a gospel choir directed by Kirk Franklin. Produced yet again by crossover maestro David Foster, the arrangements never overwhelm the songs. Groban's smooth and supple vocals can be hard to categorize--seeing how his range is somewhere in-between a high baritone and a low tenor--but he always finds and emphasizes the emotional core of these songs. And whether they have origins in pop or classical music seems not to matter. The addition of messages from troops stationed in Iraq on top of &quot;I'll Be Home for Christmas&quot; is undeniably heart-wrenching, while the album's highlight is its most spare song, &quot;It Came Upon a Midnight Clear,&quot; which finds Groban alone at his piano, sounding very much like some kind of angel.\n\nAllmusic Review:\nVocalist Josh Groban delivers his first Christmas themed album with 2007's Noel. Once again produced by longtime &quot;man behind the curtain&quot; David Foster, the album features more of Groban's dewy, supple vocals set to Foster's cinematic orchestrations. As per the holiday theme, these are primarily classic tunes of the season including such chestnuts as &quot;Silent Night,&quot; &quot;Ave Maria,&quot; and, of course, &quot;The Christmas Song.&quot; However, also included are a few lesser-known traditional songs as &quot;Panis Angelicus&quot; and &quot;Angels We Have Heard on High.&quot; Similarly, while most of the productions here should appeal to longtime fans of Groban's particular classical-crossover sound, some cuts like soft rock inflected &quot;It Came Upon a Midnight Clear&quot; and the Celtic folk leaning &quot;Little Drummer Boy&quot; do expand upon the Groban/Foster palette in a pleasing way. Notably, also showcased here are guest appearances by country superstar Faith Hill, R&amp;B stalwart Brian McKnight, and perennial holiday backing band the Mormon Tabernacle Choir.","torrent":{"xt":"urn:btih:b3ecc06259c7490e347a37c165dc66551db4aa93","amp;dn":"Josh+Groban+-+Noel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ecc06259c7490e347a37c165dc66551db4aa93","infoHashBuffer":{"type":"Buffer","data":[179,236,192,98,89,199,73,14,52,122,55,193,101,220,102,85,29,180,170,147]},"announce":[],"urlList":[]}}