{"title":"Torque Pro (OBD 2 &amp; Car) Version 1.8.10","uid":9393596,"size":5644399,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b436811cbc40db943e12eec4ad41ab2728a2fd03&amp;dn=Torque+Pro+%28OBD+2+%26amp%3B+Car%29+Version+1.8.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"allrockedout","files":-1,"time":1387932380,"description":" &lt;a href=&quot;https://play.google.com/store/apps/details?id=org.prowl.torque&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://play.google.com/store/apps/details?id=org.prowl.torque&lt;/a&gt;\n\n\n\nDescription\nSee what your car is doing in realtime, get OBD fault codes, car performance, sensor data and more!\nTorque is a vehicle / car performance / diagnostics tool and scanner that uses an OBD II Bluetooth adapter to connect to your OBD2 engine management / ECU\nLayout your own dashboard with the widgets / gauges you want!\nIt can use the GPS to provide tracker logs with OBD engine logging so you can see what you were doing at any point in time\nIt can also show and reset a DTC / CEL / fault code like a scantool. Helps you fix your car and helps keep repair costs down!\nTorque also features:\n* Dyno / Dynomometer and Horsepower/HP &amp; Torque\n* Can read Transmission Temperatures (vehicle dependant)\n* 0-60 speed timings - more accurate than just using plain old GPS - see how fast your car is (or truck )\n* CO2 emissions readout\n* Customisable dashboard &amp; profiles\n* Video your journey using the Track Recorder plugin with onscreen OBDII data overlay - a black box for your car/truck!\n* Automatically send GPS tagged tweets directly to twitter (for example if you are going on a road trip)\n* Massive fault code database for lookup of fault codes from different manufacturers\n* Theme support (choose from different themes to change the look of your dashboard)\n* Send logging information to web or email CSV/KML for analysis via excel / openoffice reader\n* Heads up display / HUD mode for night time driving\n* Compass (GPS Based) that won't suffer magnetic interference\n* GPS Speedometer/Tracking and realtime web upload capability - see what you were doing and your engine, at a point in time\n* Turbo boost feature for vehicles that support MAP and MAF sensors (VW &amp; Golf / Audi / Seat etc supported)\n* Alarms and warnings (for example if your coolant temperature goes over 120C whilst driving) with voice/speech overlay\n* Car dock support\n* Graph data\n* MPG\n* Able to share screenshots to Facebook, Twitter, Google+, Email, etc\n* AIDL API for third party apps, A simple Telnet interface for developers to talk to the adapter, and an OBD scanner.\n* Works on tablet devices like the Motorola Xoom, Dell Streak, Samsung Galaxy Tab and Nook\nWorks on any vehicle that uses the OBD 2 standard (most vehicles built after 2000, but can work for vehicles as far back as 1996) if in doubt check with your manufacturer first or look for 'OBD2' on written on a big white label in your engine bay\nWorks on vehicles made by Ford, VW, GM/Vauxhall/Opel, Chrysler, Mercedes, Volkswagen, Audi, Jaguar, Citroen, Peugoet, Skoda, Kia, Mazda, Lexus, Subaru, Renault, Mitsubishi, Nissan, Honda, Hyundai, BMW, Toyota, Seat, Dodge, Jeep, Pontiac and many more vehicle makes, European, US, Far East, etc. Some vehicle ECUs may support more/less features than others\nThe app needs a Bluetooth OBD2 adapter to work. The adapter is small and plugs into the diagnostics socket on the car which gives your phone access. You can find a list of adapters on: http://torque-bhp.com/wiki/Bluetooth_Adapters (Garmin EcoRoute HD adapters not supported)\nIf you buy one of the cheap china OBD2 ELM327 bluetooth adapters from ebay / amazon, then make sure you have a good returns policy with the seller\nSome of the best reliable OBD2 / OBD adapters are the Scantool.net adapter, the OBDKey, and PLX Devices, OBDLink, Bluetooth, ELM327 and other adapters are supported - search on google for them\nMore features added every release - there are forums at http://torque-bhp.com/forums/ - if you want something added then let me know and I'll try to add it if it is possible! Vehicle ECUs vary in the amount of sensors supported\n*PLEASE NOTE* Any reports of hanging or reboots after quitting the app is due to a bug in HTC devices and Galaxy Tab,this can be triggered by using the Pandora/Vlingo/Other BT apps. Disabling Pandoras new bluetooth settings fixes the problem, but HTC/Samsung need to release a fix.Please contact their support and request a fix,Thanks!\nChangelog:  &lt;a href=&quot;\nhttp://torque-bhp.com/forums/?wpforumaction=viewtopic&amp;t=3.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://torque-bhp.com/forums/?wpforumaction=viewtopic&amp;t=3.0&lt;/a&gt;","torrent":{"xt":"urn:btih:b436811cbc40db943e12eec4ad41ab2728a2fd03","amp;dn":"Torque+Pro+%28OBD+2+%26amp%3B+Car%29+Version+1.8.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b436811cbc40db943e12eec4ad41ab2728a2fd03","infoHashBuffer":{"type":"Buffer","data":[180,54,129,28,188,64,219,148,62,18,238,196,173,65,171,39,40,162,253,3]},"announce":[],"urlList":[]}}