{"title":"Scientist and Engineer's Guide to Digital Signal Processing","uid":8377119,"size":11222214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b47e712a54e0470877b026e2468b82cd8934bf1e&amp;dn=Scientist+and+Engineer%27s+Guide+to+Digital+Signal+Processing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"waldyrious","files":1,"time":1366080968,"description":"This is the pdf version of the well-known &quot;DSP guide&quot; book from http://www.dspguide.com\n\nHere's the description from the site:\n\n* 640 Pages, Hardcover. Over 500 graphs and illustrations.\n* Clear explanations: Very readable - low math - many examples.\n* All the classic DSP techniques: Convolution, Recursion, Fourier Analysis...\n* For students and professionals\n* Written for a wide range of fields: physics, bioengineering, geology, oceanography, mechanical and electrical engineering.\n\n\nThe website claims &quot;You can browse and/or download the entire book without charge&quot;, which is only partially true: pdf versions of each chapter are available on the website, but the complete version isn't available. I couldn't find a good complete version online. Most versions out there consist of the chapters merged together into a single pdf file, without the table of contents, the glossary, etc. The only complete version of the book I found online was this one:but it is read-only; printing or editing it requires a password. So I decided to make a proper e-book. Here are the nitty-gritty details for those interested:\n\n1) I obtained the chapter files from http://www.dspguide.com/pdfbook.htm\n   (CH1.PDF to CH33.PDF)\n2) I grabbed the front and back pages (cover, table of content, glossary, etc.)\n   fromand\n3) I used LaTeX to fix the pagination so that the first few pages are numbered\n   i, ii, iii, etc. This allows one to type &quot;50&quot; in the page input box\n   of the pdf reader and actually be taken to that page in the book.\n   For this I used the technique described at http://askubuntu.com/a/34269\n4) Still in LaTeX, I added a blank page before the first chapter,\n   so that it is the 16th, rather than the 15th page of the pdf.\n   This fixes a bug in Adobe Reader where dual-view displays the pages incorrectly\n   if the odd pages of the book don't correspond to odd pages in the pdf\n   (basically, right and left pages swap places).\n5) Using PdfMod, I hand-inserted the index from the table of contents,\n   so that a sidebar will display on pdf readers to allow jumping\n   to a specific chapter as desired.\n   While I was at it, I also added in the pdf metadata (author and title).\n\nThis should make a fairly robust and usable e-book, whether you like to read in single or dual-page mode, print it, edit it to fix typos (see the errata at http://www.dspguide.com/errata.htm), or whatever you want to do, really.\n\nAll in all, this is a great book for those starting to learn about DSP. I highly recommend it. If you enjoy this torrent, don't forget to seed!","torrent":{"xt":"urn:btih:b47e712a54e0470877b026e2468b82cd8934bf1e","amp;dn":"Scientist+and+Engineer%27s+Guide+to+Digital+Signal+Processing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b47e712a54e0470877b026e2468b82cd8934bf1e","infoHashBuffer":{"type":"Buffer","data":[180,126,113,42,84,224,71,8,119,176,38,226,70,139,130,205,137,52,191,30]},"announce":[],"urlList":[]}}