{"title":"video of assembly of Mazda rotary engine. 9 avi hq clips with sc","uid":3646255,"size":2137359888,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b48aacb060f90bf944311e1f96937aeb26d47033&amp;dn=video+of+assembly+of+Mazda+rotary+engine.+9+avi+hq+clips+with+sc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"partly mazda","files":28,"time":1174729176,"description":"Engine class parts 1 through 9\n\tI gave a rotary engine class to a small group of rx7 club members in the fall of 2005 at my Mom&amp;#039;s farm in Spokane Washington U.S.A. It was very informal, but should be informative to those enthusiasts who might want to rebuild their own engine someday. We taped the class in hopes of making a film for those in attendance, but the main tape turned up empty and blank. Something had gone wrong with the camera. On 16 March 2007 I was able to recover the missing film from the tape, and was able to complete the movie. The movie basically shows us assembling an early 13b Mazda rotary engine and discussing various issues during the build.\n\tAbout me: After I got hooked on my first rotary (a 72 rx2) around 1984 and finding out that it was too expensive for me to take it to someone else for engine repairs, I learned to do it my self. I sought advice from those whom I thought should know, but just got misinformation and inaccurate stories. Hence I am self taught, with no factory training. I have owned many old rotaries and even had my own car repair business &quot;Partly Mazda&quot; for a couple years. I was able to help out a friend with his car business, sponsor a race car with an experimental peripheral port motor, and still occasionally find time to help friends out with their motors.\n\tThanks to all who attended. Some came in from Idaho, and a group came all the way from Seattle (about 275 miles). Also, thanks to Mom for the home cooked meal.\n\nHope this finally works.. been pulling my hair out trying.. third time is a charm\nsorry, my first attempt at uploading a torrent\n\neach part of the video is around 250 megs, there are also some screen caps too\n\nread about it here: &lt;a href=&quot; http://www.nopistons.com/forums/index.php?showtopic=67642&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.nopistons.com/forums/index.php?showtopic=67642&lt;/a&gt;","torrent":{"xt":"urn:btih:b48aacb060f90bf944311e1f96937aeb26d47033","amp;dn":"video+of+assembly+of+Mazda+rotary+engine.+9+avi+hq+clips+with+sc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b48aacb060f90bf944311e1f96937aeb26d47033","infoHashBuffer":{"type":"Buffer","data":[180,138,172,176,96,249,11,249,68,49,30,31,150,147,122,235,38,212,112,51]},"announce":[],"urlList":[]}}