{"title":"On the Fifth Day (Thriller) -- A.J. Hartley. AZW3, EPUB, MOBI","uid":15414016,"size":1639951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4ad4ea9bd0b16248adb98a9bdb6b27e11ce39c6&amp;dn=On+the+Fifth+Day+%28Thriller%29+--+A.J.+Hartley.+AZW3%2C+EPUB%2C+MOBI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"FreddyFroggy1","files":5,"time":1469578346,"description":"On the Fifth Day —- A.J. Hartley. Formats: AZW3, EPUB, MOBI. Published in 2007.\r\nFiction. Tags: Christianity, Italy, Japan, Mystery, Suspense, Thriller\r\nisbn:9781440620119 \r\n\r\nDisgraced English teacher Thomas Knight confronts a church conspiracy of silence surrounding the death of his brother, Father Edward Knight, while on a research trip in the Philippines. Looking to make sense of it all, Thomas's search leads him from Italy to Japan to the site of his brother's death, all the while narrowly escaping agents of unknown origin who seem hellbent on stopping him.\r\n\r\nWith the distinction between friends and enemies becoming more fluid all the time, Knight falls in with his ex-wife at the State Department, a priestly colleague of his brother's and a murderous biologist to discover a secret that threatens, yes, the very foundations of Christianity. \r\n\r\nNot only is Hartley's novel well paced, with enough twists and turns to keep most thriller fans satisfied, he avoids the missteps of most attempts to cash in on the Da Vinci Code zeitgeist by focusing on the faithful rather than freewheeling conspiracies; his is a welcome take that considers thoughtfully, if at times clumsily, issues of belief and doubt. Though the action occasionally snags on some repetitive character details, this slam-bang title is a very fun, surprisingly satisfying read. \r\n\r\n--Publishers Weekly","torrent":{"xt":"urn:btih:b4ad4ea9bd0b16248adb98a9bdb6b27e11ce39c6","amp;dn":"On+the+Fifth+Day+%28Thriller%29+--+A.J.+Hartley.+AZW3%2C+EPUB%2C+MOBI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4ad4ea9bd0b16248adb98a9bdb6b27e11ce39c6","infoHashBuffer":{"type":"Buffer","data":[180,173,78,169,189,11,22,36,138,219,152,169,189,182,178,126,17,206,57,198]},"announce":[],"urlList":[]}}