{"title":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e02.MPup","uid":15477242,"size":1066298199,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4bad920a9223a4b2044b828a0daf110b290ae1a&amp;dn=Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e02.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1470199871,"description":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e02.Crisps.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nGregg Wallace follows 27 tonnes of potatoes from a farm in Hampshire through the largest crisp factory on earth, as they are peeled, sliced and fried to make more than five million packets of crisps every 24 hours. Once the crisps are flavoured, they are put into bags in one of the craziest rooms Gregg has ever seen, with over 100 machines that can fill hundreds of thousands of bags every hour. Greg discovers how each bag is filled with nitrogen to keep the crisps from going stale and how they are distributed all over the UK - and even as far as the Costa del Sol to satisfy the local expats.\r\n\r\nMeanwhile, Cherry Healey discovers the secrets of perfect crisp potatoes which are special varieties grown exclusively to make crisps, as well the surprising ways that our brain can be tricked into thinking a crisp is much crunchier than it really is. She also finds out how more than a third of savoury snacks consumed in the UK are made from corn and follows the production of Monster Munch, where the factory transforms 96 tonnes of corn into 12 million monster feet every single day.\r\n\r\nAnd historian Ruth Goodman investigates who really invented the crisp - was it the Americans, as is often cited, or the British? Ruth cooks up the earliest known recipe for crisps to uncover the truth. She also discovers how crisp wars between crisp manufacturers erupted in the 1960s and how in the 1980s, they tried to woo customers with strange innovations such as hedgehog crisps. Their determination fuelled our demand and today we get through over a half a billion crisps every 24 hours","torrent":{"xt":"urn:btih:b4bad920a9223a4b2044b828a0daf110b290ae1a","amp;dn":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e02.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4bad920a9223a4b2044b828a0daf110b290ae1a","infoHashBuffer":{"type":"Buffer","data":[180,186,217,32,169,34,58,75,32,68,184,40,160,218,241,16,178,144,174,26]},"announce":[],"urlList":[]}}