{"title":"Alcatraz: The Gangster Years","uid":8751619,"size":788500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4bee322231bd5bab4f5d29d4da1e2dbd61afc78&amp;dn=Alcatraz%3A+The+Gangster+Years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Djofullinn","files":1,"time":1375045523,"description":"This book may tell some readers more about Alcatraz and its inmates than they care to read about. The book covers the years from the prison's inception in 1934 through 1948, and includes 466 pages of text in addition to several pages of notes. The book includes well-known notorious inmates such as Al Capone, Alvin Karpis, and George Kelly in addition to several others who gained infamy through their uncooperative behavior during their incarceration. Various ingenious escape attempts during these years are also included, but I found the attempt beginning on May 2, 1946, (which was going on 63 years ago at this time)to be the most interesting. Books have been written and a movie produced covering this unsuccessful attempt, and I found the account in this book to be written in great detail. Interestingly enough deviant behavior inside the prison did not necessarily translate into future re-incarceration upon the individual's release, and vice versa. Three sections of photographs of various inmates, the 1946 escape attempt, and photos both inside and outside the prison are included. Several of these photos I have not seen in other books. I believe a follow-up volume covering the years 1949 until the prison's closing in 1963, which will include the escape attempt in 1962, will be forthcoming in the future. \n\n","torrent":{"xt":"urn:btih:b4bee322231bd5bab4f5d29d4da1e2dbd61afc78","amp;dn":"Alcatraz%3A+The+Gangster+Years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4bee322231bd5bab4f5d29d4da1e2dbd61afc78","infoHashBuffer":{"type":"Buffer","data":[180,190,227,34,35,27,213,186,180,245,210,157,77,161,226,219,214,26,252,120]},"announce":[],"urlList":[]}}