{"title":"Starting Paragliding","uid":3430144,"size":731867136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4c976ad15acd5f95e04d7e8126ca558d28bc8ec&amp;dn=Starting+Paragliding&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jpBenfica","files":1,"time":1136916633,"description":"[img]http://www.krik-adventure.hr/Material/Slike/paragliding/paragliding.jpg[/img]\n\n\nLearn what Paragliding is all about! See how easy it is to learn to Paraglide! If you've been looking for a video that will inspire you or your friends to take up paragliding - this is it!\n\nFeatures\nFirst lessons on the beginner hill\nSimulator instruction\nTandem instruction high in the skies\nExpert pilots show advanced techniques\n\nStarting Paragliding shows you what your first lessons will be like. It shows how to fly the glider before ever leaving the ground. It shows students doing takeoff?s on gentle slopes and then using the wind to help walk the glider back up the hill. It shows the movements as you first fly the training hill and how you learn to control the canopy above your head during the flight. Complete takeoffs, flights, and landing techniques are shown.\n\nYou will see some advanced pilots kiting the Paraglider over their heads in high winds and some techniques discussed about high winds.\n\nIn the simulator scenes you are shown how to control surges and how to make a coordinated turn. Safety tips you should know about how to keep the canopy pressurized at all times.\n\nThis is the best video to utilize before taking your lessons, during your lessons, and after you take your lessons. It has some important aspects that are also good for intermediate pilots.\n\nFilmed at Airplay paragliding schools in Washington and Arizona.\n\nSome great on-board camera shots, including a high tandem flight over Chelan Butte with dozens of hang gliders and paragliders. Close up action with no-wind reverse launches on both single place and tandem.","torrent":{"xt":"urn:btih:b4c976ad15acd5f95e04d7e8126ca558d28bc8ec","amp;dn":"Starting+Paragliding","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4c976ad15acd5f95e04d7e8126ca558d28bc8ec","infoHashBuffer":{"type":"Buffer","data":[180,201,118,173,21,172,213,249,94,4,215,232,18,108,165,88,210,139,200,236]},"announce":[],"urlList":[]}}