{"title":"Oxford.Very.Short.Introduction.Memory.2008.AUDIOBOOK-PHC","uid":6228216,"size":144931540,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b53228dc1ee2388ce22b599856552dd90cd82e51&amp;dn=Oxford.Very.Short.Introduction.Memory.2008.AUDIOBOOK-PHC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":33,"time":1299598373,"description":"Product Description\n\nMemories are an integral part of being human. They haunt us, we cherish them, and in our lives we collect more of them with each new experience. Without memory, you would not be able to maintain a relationship, drive your car, talk to your children, read a poem, watch television, or do much of anything at all. Memory: A Very Short Introduction explores the fascinating intricacies of human memory. Is it one thing or many? Why does it seem to work well sometimes and not others? What happens when it &quot;goes wrong&quot;? Can it be improved or manipulated through techniques such as mnemonic rhymes or &quot;brain implants&quot;? How does memory change as we age? And what about so-called recovered memories--can they be relied upon as a record of what actually happened in our personal past? This book brings together our most recent knowledge to address (in a scientifically rigorous but highly accessible way) these and many other important questions about how memory works, and why we can't live without it.\n\nAbout the Author\n\nJonathan Foster is Senior Research Fellow in Cognitive Neuroscience, Edith Cowan University. He is the author of Neuroimaging and Memory; Memory: Anatomical Regions, Physiological Networks and Cognitive Interactions; and the co-editor of Memory: System, Process or Function? (OUP 1999).","torrent":{"xt":"urn:btih:b53228dc1ee2388ce22b599856552dd90cd82e51","amp;dn":"Oxford.Very.Short.Introduction.Memory.2008.AUDIOBOOK-PHC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53228dc1ee2388ce22b599856552dd90cd82e51","infoHashBuffer":{"type":"Buffer","data":[181,50,40,220,30,226,56,140,226,43,89,152,86,85,45,217,12,216,46,81]},"announce":[],"urlList":[]}}