{"title":"Discovery Ch Curiosity 1of9 Did God Create the Universe x264 AC3","uid":6911801,"size":670717753,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5362c36872963c85614b83a253c660f749921f4&amp;dn=Discovery+Ch+Curiosity+1of9+Did+God+Create+the+Universe+x264+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":-1,"time":1324849317,"description":"Curiosity\n\nScience Documentary hosted by Stephen Hawking and Adam Savage, published by Discovery Channel in 2011 - English narration\n\n\nInformation\n------------------------------\n\nCuriosity\nHave you ever wondered what it would be like if you could live forever? What would happen if aliens attacked? Why sex is fun? Welcome to Curiosity. More than just a landmark television series, Curiosity is an adventure of discovery, an expedition to uncover the truths behind life's most challenging questions. With an insatiable thirst for answers and experiences, we're prepared to do anything, go anywhere and ask anyone to get to the heart of the matter. Whether it's jumping out of an airplane to confront fear, having neuroscientists implant false memories, or donating tissue to test the possibility of regeneration, there is nothing stopping us as we embark on a global journey of learning and surprises. Curiosity asks and answers the most fundamental questions facing the world today. Each episode of Curiosity will focus on a single enduring question in science, technology, and society. As is always the case, one single question cascades into several more, making each episode of Curiosity a rich and textured experience. From the micro to the macro, we tackle provocative and insightful questions. Is there a Creator? Is it likely there's an alternate universe? Could you find out exactly how you are going to die and would you want to know? Are some people genetically prone to violence? Is time travel really possible? Why is it that we dream? What don't we know about gravity and does it hold the secret for exploring the universe?\nCuriosity promises a television experience unlike any other. Join Stephen Hawking, , Michelle Rodriguez, Maggie Gyllenhaal, Morgan Spurlock, Adam Savage, Mike Rowe, Brendan Fraser, Eli Roth, Robin Williams and many more celebrity hosts on the journey for truth, as we go to extremes to uncover answers that will surprise even the most curious among us...\n\n\n1)  Did God Create the Universe \nStephen Hawking unfolds his personal, compelling vision of the biggest question of all - who or what created the universe in which we live? In this programme, physics and cosmology become tools to answer questions that philosophers have struggled with for thousands of years.\nStephen Hawking unfolds his personal, compelling vision of the biggest question of all: Who or what created the universe in which we live? The groundbreaking series Into the Universe with Stephen Hawking combined cutting-edge CG with Hawking's witty, distinctive and incisive worldview. Now, we take the journey a step further, as physics and cosmology become tools to answer questions that philosophers have struggled with for thousands of years.\n\n2)  Alien Invasion are We Ready \nWe've read the books, we've seen the movies. War of the Worlds, V, Independence Day. But they're all fiction, right? Well, probably not. New science is suggesting that aliens may be very real, and that they may not be as cuddly as E.T. Host Michelle Rodriguez (Avatar, Battle: LA) brings together top scientists and military strategists to dramatize what would happen if and when aliens attack.\n\n3)  Why is Sex Fun \nOrgasm - one of the most intense pleasures we can experience. But what are orgasms actually for? In men, the answer's simple - reproduction. But women don't need an orgasm to get pregnant. So why have them? With cutting edge science and research, Maggie Gyllenhaal hosts this revealing investigation into the mystery of the orgasm.\n\n4)  What Sank Titanic \nIt has been almost 100 years since the sinking of the Titanic. We think we know the story, but how much do we actually know about what went wrong? In the aftermath of the disaster, a full trial was conducted. This Curiosity Volume 1 DVD gives us a unique take with harrowing first person testimony from those who survived. This special will take those highly emotive human stories and for the first time use them as pieces of an enormous detective story. We will forensically piece together the precise mechanics of what went wrong and answer this question: How was the greatest piece of structural engineering in human history defeated by one of the simplest elements on the planet - water?\n\n5)  Whats Beneath America \nEverything which has made America bountiful and powerful is a product of forces which date back billions of years. How have earth's ancient forces made America what it is today? How did they create the gold that set California on a course to become the richest state in the Union, and how did vast sheets of ice enable Kansas to produce enough wheat to give six loaves of bread a year to every single person on earth? Using an array of dazzling visual effects, we connect past and present, showing how ancient geology has shaped modern America and its people.\n\n6)  How Will the World End \nThe Mayans tell us it will happen next year, on 21st December to be precise. And terrible recent events from Indonesia through Haiti to Japan seem, to some, evidence of impending global doom. But just how likely is a global apocalypse - from a scientific point of view? When will it happen, if at all? Where? And how? Samuel L. Jackson hosts this CGI spectacular which examines the most likely ways the world might end, and uses the latest geological, seismic and telescopic devices to put a number on the likelihood of their occurrence, the timeframe within which they'll take place, and even the potential casualties. It's almost certainly not going to happen in our lifetimes, nor in that of any of our children or grandchildren...\n\n7)  I Caveman Back to the Stone Age \nWere we better off as cavemen? Morgan Spurlock (&quot;Super Size Me&quot;) joins nine ordinary men and women in an attempt to survive in the wild using only stone-age technology. Cold, dehydration, and hunger threaten to derail the experiment from the The last ten thousand years have seen change on a scale previously unimaginable. From the first settlements around Ur and Catal Huyuk through the latest innovations in medicine, technology, travel and connectivity, we live in a world that would be utterly unrecognizable to our early ancestors. But alongside all this technological change, how much have we, as humans changed? Our bodies? Our minds? In this extraordinary social experiment, ten modern humans travel back in time to live like our earliest ancestors.\n\n8)  I Caveman the Great Hunt \nEating only what they hunt and gather, wearing only what they tan and weave. With only a cave for shelter and only each other for company, they will use nothing but paleolitic techniques and technology as they attempt to survive for a month. Will they rise to the challenge of caveman living, or race back to their centrally heated, super-connected lives? Welcome to the ultimate exploration of human evolution and technological advancement. Will they rise to the challenge of caveman living, or race back to their centrally heated, super-connected lives? Welcome to the ultimate exploration of human evolution and technological advancement.\n\n9)  Can You Live Forever \nWill we one day be able to live forever? If so, when? In 2011, Adam Savage was 43. Now it is the year 2967 and he is 1000 years old. He looks back on his long life revealing how medical science in the 21st century transformed his body, creating a supercharged cyber-human, allowing him to love forever. Along the way, we'll learn about transhumanism, brain downloads, self-regenerating organs, and full body transplants - all in the name of becoming the world's first 1000 year-old man.looks back on his long life revealing how medical science in the 21st century transformed his body, creating a supercharged cyber-human, allowing him to love forever. Along the way, we'll learn about transhumanism, brain downloads, self-regenerating organs, and full body transplants - all in the name of becoming the world's first 1000 year-old man.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/2925/curiosityscreen0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/2925/curiosityscreen0.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img827.imageshack.us/img827/2080/curiosityscreen1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img827.imageshack.us/img827/2080/curiosityscreen1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img513.imageshack.us/img513/800/curiosityscreen2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img513.imageshack.us/img513/800/curiosityscreen2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img714.imageshack.us/img714/7628/curiosityscreen3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img714.imageshack.us/img714/7628/curiosityscreen3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img832.imageshack.us/img832/6149/curiosityscreen4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img832.imageshack.us/img832/6149/curiosityscreen4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img28.imageshack.us/img28/6914/curiosityscreen5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img28.imageshack.us/img28/6914/curiosityscreen5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img36.imageshack.us/img36/9674/curiosityscreen6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img36.imageshack.us/img36/9674/curiosityscreen6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img849.imageshack.us/img849/9419/curiosityscreen7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img849.imageshack.us/img849/9419/curiosityscreen7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img853.imageshack.us/img853/9785/curiosityscreen8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img853.imageshack.us/img853/9785/curiosityscreen8.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC\n * Video Bitrate: 1924 Kbps\n * Video Aspect Ratio: 1.778:1\n * Video Resolution: 832x464 (16.9)\n * Audio Codec: AC3\n * Audio Bitrate: 128 Kbps CBR 48KHz\n * Audio Channels: 2\n * Run-Time: 44 Mins\n * Framerate: 29FPS\n * Number of Parts: 9\n * Part Size: 640 MB\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://blogs.discovery.com/discovery-insider/2011/08/all-star-hosts-to-join-curiosity-.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blogs.discovery.com/discovery-insider/2011/08/all-star-hosts-to-join-curiosity-.html&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Into%20the%20Universe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Into%20the%20Universe&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Stephen%20Hawking%20-%20Master%20of%20the%20Universe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Stephen%20Hawking%20-%20Master%20of%20the%20Universe&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=A%20Girl%27s%20Guide%20to%2021st%20Century%20Sex&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=A%20Girl%27s%20Guide%20to%2021st%20Century%20Sex&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Walking%20with%20Cavemen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Walking%20with%20Cavemen&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Iceberg%20that%20Sank%20the%20Titanic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Iceberg%20that%20Sank%20the%20Titanic&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Secrets%20of%20the%20Titanic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Secrets%20of%20the%20Titanic&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Through%20the%20Wormhole%20Season%202&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Through%20the%20Wormhole%20Season%202&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AHarry65&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AHarry65&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=Curiosity&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=Curiosity&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b5362c36872963c85614b83a253c660f749921f4","amp;dn":"Discovery+Ch+Curiosity+1of9+Did+God+Create+the+Universe+x264+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5362c36872963c85614b83a253c660f749921f4","infoHashBuffer":{"type":"Buffer","data":[181,54,44,54,135,41,99,200,86,20,184,58,37,60,102,15,116,153,33,244]},"announce":[],"urlList":[]}}