{"title":"The Art of the Renaissance in northern Europe (Art Ebook).pdf","uid":11031086,"size":50493629,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b53e1a71f3910dbe6ce8224aecf9ed3babc4d9d8&amp;dn=The+Art+of+the+Renaissance+in+northern+Europe+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1410729621,"description":"Pdf / English / 1965 / 195 pages / 48.1 MB\n\nThe content of this book was first presented to the public in a series of lectures delivered at the Lowell Institute in Boston in March 1944. The author wishes to express his thanks to the Trustees of the Lowell Institute, and also to Professor J. Douglas Bush. He feels particularly indebted to Dr. Arthur Burkhard for having revised the language of the text of the lectures.\nFor publication, the text has been enlarged and provided with notes. Most valuable to the author was the advice and criticism given him by Zechariah Chafee, Jr., Langdell Professor of Law at Harvard University, when he had the privilege of discussing the text with him before its revision for publication. The first edition of this book was dedicated to him as a token of the author's gratitude for furtherance in many respects. This new edition may be dedicated to his memory. The book was published in its first and second printing by Harvard University Press. It is a satisfaction to the author that the Phaidon Press, London, publish this new and revised edition, which is supplied with emendations and additions to the main text as well as to\nthe 'Notes'. The publishers have given it a new and attractive shape, to which new photographs greatly contributed. The author wishes to extend his thanks to the Phaidon Press for their endeavour to create a wider circle of readers among the EngUsh-speaking public and to evoke renewed interest in the great world of ideas which Europe on this side of the Alps presents in the sixteenth century.","torrent":{"xt":"urn:btih:b53e1a71f3910dbe6ce8224aecf9ed3babc4d9d8","amp;dn":"The+Art+of+the+Renaissance+in+northern+Europe+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53e1a71f3910dbe6ce8224aecf9ed3babc4d9d8","infoHashBuffer":{"type":"Buffer","data":[181,62,26,113,243,145,13,190,108,232,34,74,236,249,237,59,171,196,217,216]},"announce":[],"urlList":[]}}