{"title":"The Body Beautiful (The Click) (Ultimate Attraction) (1997).avi","uid":4225317,"size":1472262144,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b5ce7e5a11aa9723aa3a5f003a6923d8160b6752&amp;dn=The+Body+Beautiful+%28The+Click%29+%28Ultimate+Attraction%29+%281997%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Espada_Master","files":1,"time":1212789872,"description":"Fairly well-written and pretty well acted set of movies about being able to &quot;turn on&quot; people with the push of a button! I have seen about 4 or 5 of these and have very much enjoyed them. (They were made for cable-TV and should be considered an R-rating) Of course, I&amp;#039;ve also still got a lot of the adolescent youth running around in my cerebellum. *g* (They&amp;#039;ve also started S-L-O-W-L-Y releasing some of the titles on video/DVD)\n\nLoosely based on Milo Manara&amp;#039;s comic books and started with the feature film &quot;The Turn-On&quot;, these movies have very beautiful women (as well as men when women have it) becoming sexually aroused by a device known as the &quot;Clicker&quot; by the characters that get a hold of it. Throughout the shows, the settings and characters change, even though several of the actors reappear as someone else. Part of the running plot revolves around a scientist (Dr Fez) chasing the clicker from person to person to try and acquire it for himself. There are several times throughout the series that he has possession of it, but manages to either give it to someone whom he thinks will use it wisely, or loses it in some kind of mixup.\n\nThe plots are not the most logical, but they are well written and directed. The acting is pretty good also - better acting and plots than most sitcoms I&amp;#039;ve seen, but naturally not up to Elizabethan standards.*g* I must admit that one great advantage to this series is that in most of them, Gabriella Hall is a lead actress. This series, the Butterscotch movies, and the Sex-Files series of flicks are all really fun, campy, erotic and sexy humor - in my opinion. I&amp;#039;d give most of the individual episodes an 8 out of 10 as a guilty pleasure.\n\nIf you like very softcore movies that have a decent plot and don&amp;#039;t take themselves too seriously, you will love just about every comedy endevour that these actors are in, or Rolfe Kanefsky has directed and Alain Siritsky has produced! (My apologies if the spelling of their names is incorrect)\n\nNOTE: This description is taken from IMDb and can be found here: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0300745/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0300745/&lt;/a&gt;\nalong with other useful information about this movie.\nThis text however applies to all parts of the series (don&amp;#039;t really know how many they were, maybe 3 or 4). This episode in particular rotates around a workout company facing closure, and this little device will help spice things up and eventually save the place from the &quot;evil&quot; wanting buyer (woman).","torrent":{"xt":"urn:btih:b5ce7e5a11aa9723aa3a5f003a6923d8160b6752","amp;dn":"The+Body+Beautiful+%28The+Click%29+%28Ultimate+Attraction%29+%281997%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5ce7e5a11aa9723aa3a5f003a6923d8160b6752","infoHashBuffer":{"type":"Buffer","data":[181,206,126,90,17,170,151,35,170,58,95,0,58,105,35,216,22,11,103,82]},"announce":[],"urlList":[]}}