{"title":"Houses - A Quiet Darkness (2013) [FLAC]","uid":8495901,"size":324294470,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b5e8ccd6d06445291bfed3a78921d38a34f04b03&amp;dn=Houses+-+A+Quiet+Darkness+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"politux","files":-1,"time":1369143001,"description":"\n  Houses - A Quiet Darkness (2013) [FLAC]\n\n  Released: 2013\n  Duration: 56:59\n  Genres: Electronic, Pop/Rock\n  Styles: Indie Electronic, Ambient, Indie Rock, Shoegaze\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 850 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 The Beauty Surrounds\n  02 Beginnings\n  03 Big Light\n  04 The Tired Moon\n  05 Peasants\n  06 Carrion\n  07 What We Lost\n  08 Smoke Signals\n  09 Tenderly\n  10 The Bloom\n  11 A Quiet Darkness\n\n  After recording their 2010 debut All Night over the course of a rejuvenating stay in Hawaii, the slightly sadcore indie duo Houses not only switched environments completely for the follow-up A Quiet Darkness, but made their environment central to the creative process. Married couple Megan Messina and Dexter Tortoriello moved from Chicago to Los Angeles somewhere between albums, but along the way dipped into various abandoned houses along empty stretches of highway in southern California and elsewhere, sampling the sounds made by these somewhat haunted structures to build the foundational rhythms and ambience of A Quiet Darkness. While the group was sometimes lumped into the chillwave movement in their earliest days, the sounds here dispel that categorization with landscapes more lush and picturesque than hypnotically submerged. Album-opener &quot;Beginnings&quot; makes full use of dark and open-air samples on its plodding, melancholic lurch, but tempers the natural reverb with huge acoustic drums and slow-burning guitar tones. Messina and Tortoriello sing in unison, supporting each other's otherworldly whispers on tracks like &quot;Beginnings,&quot; and the dreamy music box and choir samples of &quot;What We Lost.&quot; \n\n  A dichotomy of death and beauty makes up much of the album, with repeated references to ghosts, mortality, and angels competing with themes of undying love in a vague, troubled narrative. Tracks like &quot;The Beauty Surrounds&quot; encapsulate the album's conflicted feel, with a beat made up of the sound of floors being swept and light switches clicking on for the first time in decades, while a heavenly melody sings of devotion over a stuttering harp sample. The song melts into a softly burnished ambient glow for its final moments, suggesting an inevitable letting go of both beauty and pain for some unknown world beyond. The piano-based sample that starts &quot;Carrion&quot; gives way to a series of sounds and percussive elements that all sound recorded from behind the walls of other rooms or other worlds. The juxtaposition of murky recording and crystal-clear voices and electronic beats mirrors the emotionally disparate vibe of the album. This grandiose set of songs cobbled together from decaying sound scraps has all the ominous mystery and majesty of a silent twilight, and all the implied struggle of the abandoned structures where and from which it was created.","torrent":{"xt":"urn:btih:b5e8ccd6d06445291bfed3a78921d38a34f04b03","amp;dn":"Houses+-+A+Quiet+Darkness+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e8ccd6d06445291bfed3a78921d38a34f04b03","infoHashBuffer":{"type":"Buffer","data":[181,232,204,214,208,100,69,41,27,254,211,167,137,33,211,138,52,240,75,3]},"announce":[],"urlList":[]}}