{"title":"Indie Classic!: The Go-Betweens - 16 Lovers Lane [1988]","uid":3973834,"size":53287606,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b60595e3f6e2bc7b9e998a56ffed6aac980f3a06&amp;dn=Indie+Classic%21%3A+The+Go-Betweens+-+16+Lovers+Lane+%5B1988%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"tigerduck","files":1,"time":1200152936,"description":"Arguably Australia&amp;#039;s greatest pop group ever, The Go-Betweens seemed to save the best for last when they split in 1989. (They reunited in 1999, and have issued two more studio recordings since that time). 16 Lovers Lane is simply breathtaking; it is a deeply moving, aurally sensual collection of songs about relationships and the broken side of love that never lapses into cheap sentimentality or cynicism. Songwriters Robert Forster and Grant McLennan had always been visionary when it came to charting personal and relational melancholy and heartbreak, but here, their resolve focused on charting the depths of the romantic&amp;#039;s soul when it has been disillusioned or crestfallen, is simply and convincingly taut. While it&amp;#039;s true that the group was going through its own version of a soap opera-styled romantic saga, that emotional quagmire seemingly fueled its energies and focus, resulting in an album so texturally rich, lyrically sharp, and musically honest, its effect is nothing less than searing on an any listener who doesn&amp;#039;t have sawdust instead of blood in his or her veins.Opening with McLennan&amp;#039;s &quot;Love Goes On,&quot; the stage is set for a kind of refined yet primal emotional transference that pop music is rarely capable of revealing. As he sings: &quot;There are times when I want you/I want you so much I could bust/I know a thing about lovers/Lovers lie down in trust/The people next door they got problems/They got things they can&amp;#039;t name/I know about things about lovers/ Lovers don&amp;#039;t feel any shame/Late not night when the light&amp;#039;s down low/The candle burns to the end/I know a thing about darkness/Darkness ain&amp;#039;t my friend/Love goes on anyway,&quot; the doorway to the heart and its secrets opens. In the grain of his voice lie the flowers in the dustbin whose names are desperation and affirmation. With its hyperactive acoustic guitars, Amanda Brown&amp;#039;s cooing string arrangements, and the deftly layered, subtly played brass instruments, the tune becomes a gauzy anthem; it celebrates the ravaged heart as a beacon of strained hope in the entryway to a hall of bewilderment. He follows it with &quot;Quiet Heart,&quot; a song whose opening was admittedly influenced in structure by U2&amp;#039;s &quot;With Or Without You,&quot; but blows it away lyrically and with its subtly shifting melody and harmony between the guitars. Brown&amp;#039;s multi-layered strings actually stride the backbeat&amp;#039;s pulse. His protagonist speaks to an absent lover. His ache offers a view of his own weakness, desperation, and an all-consuming tenderness: &quot;I tried to tell you/But I can only say when we&amp;#039;re apart/How I miss your quiet, quiet heart.&quot; Forster seems to underline McLennan&amp;#039; s raw emotionalism with his painterly, nearly baroque, &quot;Love Is A Sign,&quot; where images from visual art, remembered scenarios, and real life brokenness intermingle effortlessly with the elegance of mandolins, a string orchestra, and a shimmering bassline. With &quot;Streets Of Your Town,&quot; the Go-Betweens scored a minor hit in the U.K., and even got played on American radio for a moment, but despite the fact that it has the most memorable hook on a record filled with them, it merely underscores how constant the quality is on the record. Evidenced further by &quot;The Devil&amp;#039;s Eye,&quot; and the shattering closer &quot;Dive For Your Memory,&quot; 16 Lovers Lane is melancholy and somber in theme, but gloriously and romantically presented. Despite the fact that band has but a cult following, even in the 21st century, the Go-Betweens have nonetheless given us a far more literate, magnificently written, performed, and produced slab of pop classicism, than Fleetwood Mac&amp;#039;s wonderfully coked out, love as co-dependency fest, Rumours. - AMG\n\nTracklist:\n1.\tLove Goes On!\n2.\tQuiet Heart\n3.\tLove Is A Sign\n4.\tYou Can&amp;#039;t Say No Forever\n5.\tDevil&amp;#039;s Eye, The\n6.\tStreets Of Your Town\n7.\tClouds\n8.\tWas There Anything I Could Do?\n9.\tI&amp;#039;m Allright\n10.\tDive For Your Memory\n\nGood music NEVER gets old!\nEnjoy!\n/Duck\t","torrent":{"xt":"urn:btih:b60595e3f6e2bc7b9e998a56ffed6aac980f3a06","amp;dn":"Indie+Classic%21%3A+The+Go-Betweens+-+16+Lovers+Lane+%5B1988%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b60595e3f6e2bc7b9e998a56ffed6aac980f3a06","infoHashBuffer":{"type":"Buffer","data":[182,5,149,227,246,226,188,123,158,153,138,86,255,237,106,172,152,15,58,6]},"announce":[],"urlList":[]}}