{"title":"CBC The Nature Of Things 04of16 Untangling Alzheimers 720p x264 ","uid":10590933,"size":1067222573,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b67e2014a37e3e9efa584046c29d17aed4d51c64&amp;dn=CBC+The+Nature+Of+Things+04of16+Untangling+Alzheimers+720p+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"MVGroup","files":-1,"time":1405797384,"description":"The Nature of Things: (Collection One)\n\nScience Documentary hosted by David Suzuki, published by CBC in 2008 - 2014 - English narration\n\n\nInformation\n------------------------------\n\nThe Nature of Things: (Collection One)\nThe Nature of Things is one of the most successful series in the history of Canadian television. Hosted by the world-renowned geneticist and environmentalist, David Suzuki, the program is in its 53rd season, a landmark by any standard.\nEvery week, the influential program presents stories that are driven by a scientific understanding of the world. Stories full of adventure, drama and insight. Our programs entertain and inspire audiences by engaging with the people and personalities behind the science.\nFrom the search for other life in the universe to the psychology of babies, from the furry animals that invade your backyard to the consequences of human progress, The Nature of Things throws open the door to the wonder and accomplishments of science.\n\n\n\n4)  Untangling Alzheimers \nUntangling Alzheimer's is a dramatic and inspiring medical investigation driven by David Suzuki's journey to understand the science of Alzheimer's and the surprising new insights into its cause. David has a very personal interest in the disease because his mother, aunt and two uncles died of it. We join David on an intimate journey as he explores the newest breakthroughs in this devastating disease as well as his own chances of contracting the cruel condition. Alzheimer's today is the only leading cause of death that cannot be cured, prevented or even slowed. Worse, it's the only leading cause of death that is on the rise - and not simply because baby-boomers are getting older. Studies show that the increase is absolute across all age groups, and death rates continue to climb. With a new case developing every 69 seconds, scientists now speak of the Alzheimer's epidemic.\n\n5)  Where Am I \nWhere Am I? Is a new documentary about the skills we use to find our way around. Whether you are an Inuit hunter, a foraging insect, or just someone out for a stroll, your brain is performing one of its most fundamental services - it's navigating. Why are some of us good at finding our way, while others are not?\nGood navigators are able to use both memory and imagination...remembering where they have been, and imagining where they're going. Some researchers believe we build a cognitive or mental map when we navigate, a kind of bird's eye view of our surroundings, a view that can be rotated and examined in our mind. There has been about sixty years of argument amongst scientists about whether humans and other mammals actually form these cognitive maps or not.\nThe advent of GPS or Global Positioning Systems has changed the discussion about navigation. GPS triggers a simpler, more automatic navigational technique that does not involve building a mental map. With GPS, we simply respond to directions and may not truly understand where we are.\n\n6)  Secrets in the Bones \nHendrik Poinar is a bit of a mystery man - as in, he likes to solve them. And he's part time traveller - as in, he likes to dig up the past. Think Doctor Who meets Indiana Jones. Poinar is an evolutionary biologist - which means he studies the nature of how we humans got here and where we're going. He happily admits his childhood dream was to travel the world and travel back in time. &quot;No-one imagines that there's actually something still hidden within a bone that's been buried for a few thousand years or 100,000 years, let alone the possibility of resurrecting it or bringing it back to life,&quot; says Poinar. &quot;I mean, that's sort of completely bizarre. It's like a time machine, yeah, it's a kid's dream.&quot; Secrets in the Bones follows Poinar on an epic journey to Italy, Germany, Britain, and across the Unites States. His mission: solve one of the greatest mysteries of science, a mystery that has eluded researchers for more than six centuries: unlock the secrets of the fourteenth century killer disease that caused the Black Death and wiped out more than 50 million people.\n\n7)  Smarty Plants \nIs it possible that plants are smarter than we think?\nThey are among the world's oldest and most successful organisms and represent some of the strangest and longest living life forms on the planet. Stunningly diverse, plants have served us in many critical ways, from providing food, shelter and clothing to life-saving medicine. And yet we know very little about them.\nA luscious exploration of the natural world, Smarty Plants effortlessly integrates pioneering science with a light hearted look at how plants behave, revealing a world where plants are as busy, responsive and complex as we are. From the stunning heights of Utah's Great Basin Desert to the rainforests of Canada's west coast, Smarty Plants follows lead scientist and ecologist JC Cahill as he treks the green world and discovers that plants are a lot more like animals than we ever imagined. The world he reveals is one where plants eavesdrop on each other, talk to their enemies, call in insect allies to fight those enemies, recognize their relatives and nurture their young.\n\n8)  The Allergy Fix \nIf you've been to a children's birthday party lately, chances are at least one of the little guests had a portable needle loaded with epinephrine. Its standard equipment for a growing generation of highly allergic kids: more than three times as many children have food allergies now than twenty years ago. And one out of every three children is now allergic to foods, animals, or plants. Something puzzling, and frightening, is going on with our immune systems.\nThe Allergy Fix travels across Canada and to the US, the UK and Germany to investigate why allergies are on the rise - and what's being done about it.\n\n9)  The Brain that Changes Itself \nJoin us as we explore the revolutionary science of &quot;neuroplasticity&quot; - a concept that expands not just our knowledge of how our brains work, but how we use them. For centuries the human brain has been thought of as incapable of fundamental change. People suffering from neurological defects, brain damage or strokes were usually written-off as hopeless cases. But recent and continuing research into the human brain is radically changing how we look at the potential for neurological recovery. The human brain, as we are now quickly learning, has a remarkable ability to change itself - in fact, even to rewire itself. The Brain that Changes Itself, based on the best-selling book by Toronto psychiatrist and researcher Dr. Norman Doidge, presents a strong case for reconsidering how we view the human mind.\n\n10)  The Great Butterfly Hunt \nThe Great Butterfly Hunt tells the story of incredible journeys. The first is that of the remarkable Monarch migration, which is the longest insect migration on Earth, is. The second story is that of Fred Urquhart, the determined Canadian scientist who spent 40 years trying to discover exactly where the butterflies mysteriously disappeared when they flew south for the winter. The Great Butterfly Hunt is a beautiful and colourful one-hour program that combines the spectacular visuals from Flight of the Butterflies with the production's behind-the-scenes look at how such films get made. On Thursday, January 2, when many Canadians will be groaning about the long grey winter ahead, The Great Butterfly Hunt will remind audiences of the promise of spring. And, at a time when the monarch population is in rapid decline, viewers will have an opportunity to watch one of Nature's most dramatic feats unfold.\n\n11)  Fruit Hunters Part One \nA journey through nature, commerce and adventure, The Fruit Hunters takes us from the dawn of humanity to the cutting of edge of modern agriculture - a series that will change not just the way we look at what we eat, but what it means to be human.\nThe Fruit Hunters' first episode, &quot;The Evolution of Desire,&quot; explores the origins of fruit's diversity and tells the story of humanity and fruit's intimate co-evolution. Every variety of fruit has a story, the story of the person who cultivated an individual plant, and then shared something wonderful with the world. To preserve this diversity is to retain this living memory. A passionate few, the fruit hunters, fight to preserve this diversity in a world increasingly dominated by economically driven monoculture.\n\n12)  Fruit Hunters Part Two \nSupermarkets are stocked with fruit year round in a global permanent summertime, but despite its accessibility, have we lost the diversity that makes it so special? The second episode of The Fruit Hunters will look at what happens when we abandon the Garden of Eden for an industrialized monoculture. In lush jungles of Borneo, Bala Tingang, an elder of one of the last hunter-gatherer tribes, lives of the wild fruits that are the key to his tribe's survival. And yet, all around the world, natural diversity is being replaced with monocultures, plantations of only one variety, bred for long shelf life and transportability rather than their taste or health properties. Not only is this lost of diversity impoverishing our taste buds, but it has catastrophic implications for our food security. In the vast uniform banana fields of Honduras, Juan Aguilar, a banana scientist, frantically tries to breed a banana resistant to a deadly fungus.\n\n13)  Invasion of the Brain Snatchers \nWe like to believe we're in control. But if what we're discovering about parasites is anything to go by, who is really in control is a lot more complicated, and a lot more interesting, than we ever imagined. So let &quot;The Nature of Things with David Suzuki&quot; help you get over the ick factor, and explore the world of parasites. So let &quot;The Nature of Things with David Suzuki&quot; help you get over the ick factor, and explore the world of parasites. Scientists have collected hundreds of examples of parasites that brainwash their hosts. And now researchers are starting to untangle these parasites' evolutionary tricks of the trade. In the coastal estuaries of California, Professor Kevin Lafferty of the United States Geological Survey introduces us to a flatworm that lives in three hosts - a snail, a fish and a bird. This parasite's influence is so profound that it tips the balance of the local ecosystem\n\n14)  Survival of the Fabulous \nAre gay men actually born gay? If so, what causes this and how could homosexuality have survived the evolutionary process?\nEver since openly gay filmmaker Bryce Sage came out of the closet, he has struggled to answer these fundamental questions. Bryce sets out on a cross-country and around the world journey to ferret out the answers. Along the way, he confronts his own homosexuality and family history, exploring the nature vs. nurture side of the issue. He'll bombard his brainwaves with gay and straight erotica to determine just how fundamentally gay his brain really is and he'll talk to animal biologists about their studies of homosexuality in other species. There is documented evidence of homosexuality in over two hundred. Bryce becomes an amateur detective, trying to crack the code of his genes. He discovers that in Samoa every family has a male member who is either gay or is encouraged to become more feminine to support familial needs.\n\n15)  The Pacific Rim Americas \nThis episode focuses on the Asia-Pacific side of The Pacific Rim of Fire, which stands as a living testament to the beauty and danger that powerful geologic forces can deliver. The Pacific Rim is home to half of the world's active volcanoes and ninety percent of the world's earthquakes, yet nearly 800 million people continue to live within its violent edge. Our journey begins in New Zealand, a land of volcanoes and earthquakes, where we find a 500-kilometre long slip-strike fault deep under the Pacific Ocean. Geologist Hamish Campbell will take us to the crater of White Island, the country's most active volcano. Then we'll visit the country's southern island with John Youngson, to find out how New Zealand's longest fault-line contributes to the gold industry. Finally in Japan, viewers will hike up to Mount Fuji - the iconic peak where science and legend converge, getting up-close and personal with a fault-line witnessing firsthand what it's like to discover new ways of monitoring, and hopefully one day predicting, seismic activity onboard the world's most advanced drilling vessels.\n\n16)  The Collision Zone Asia \nWelcome to the Collision Zone - the fiery unpredictability of Indonesia's volcanoes at one end, the massive Himalayas at the other and millions of years of tectonic tension in between. The collision zone of the old world is about to be the hub of the new. India, the Himalayas and the island arc of Indonesia - these lands will form the centre of the world's next supercontinent. A story unfolds-a tale of where the earth has been and what the earth shall be: a whole new world that we'll barely recognize.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://bildr.no/image/eGYvMXYy.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/eGYvMXYy.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/VzVWS3RF.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/VzVWS3RF.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/S3B1Wlk1.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/S3B1Wlk1.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/M0U5OUgw.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/M0U5OUgw.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/eTZLSWQ0.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/eTZLSWQ0.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/MGVIeTlH.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/MGVIeTlH.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/MW1qOGVj.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/MW1qOGVj.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/REdRNEJ0.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/REdRNEJ0.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/S2VWaC9G.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/S2VWaC9G.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/ZXBYRU02.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/ZXBYRU02.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/N1NyL2xT.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/N1NyL2xT.jpeg&lt;/a&gt; &lt;a href=&quot;\nhttp://bildr.no/image/NGtPRlR1.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bildr.no/image/NGtPRlR1.jpeg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c189a8a6a9818df5eff0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2985 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: Stereo 6\n * Run-Time: average 50mins\n * Framerate: 29 FPS\n * Number of Parts: 16\n * Container Mp4\n * Part Size: average: 1,003 MB\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Nature_of_Things&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Nature_of_Things&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b67e2014a37e3e9efa584046c29d17aed4d51c64","amp;dn":"CBC+The+Nature+Of+Things+04of16+Untangling+Alzheimers+720p+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b67e2014a37e3e9efa584046c29d17aed4d51c64","infoHashBuffer":{"type":"Buffer","data":[182,126,32,20,163,126,62,158,250,88,64,70,194,157,23,174,212,213,28,100]},"announce":[],"urlList":[]}}