{"title":"Pharaohs Flowers - The Botanical Treasures of Tutankhamun (Histo","uid":9798915,"size":20370717,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6a912b0c91ff77a3af1c6b514faf37427c17516&amp;dn=Pharaohs+Flowers+-+The+Botanical+Treasures+of+Tutankhamun+%28Histo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1395355442,"description":"F. Nigel Hepper, &quot;Pharaoh's Flowers: The Botanical Treasures of Tutankhamun, 2nd Edition&quot;\nISBN: 098177363X | 2009 | PDF | 101 pages | 19 MB\n\nAs the golden face of Tutankhamun was found garlanded with fresh flowers exquisitely preserved for 3,000 years, the plants of ancient Egypt are brought back to life in this botanical exploration of the Pharaoh's tomb. Usually ignored by grave robbers intent on gold, the baskets, fabrics, papyri, timber, unguent vases, and model granaries filled to the brim with seeds that were buried with Tutankhamun have survived, completely intact, and each chapter of the book carries detailed descriptions of the plant species found or represented in the tomb, including emmer, fenugreek, chickpea, and types of reed and grass. F. Nigel Hepper groups the plants according to their uses, with categories such as Flowers and Leaves; Oils, Resins, and Perfumes; and Papyrus, Flax, and Other Fibrous Plants. This new edition of the fascinating book that was first published in 1990 has been fully updated to take into account recent finds and interpretations, and it features a revised and annotated further reading section, now with a guide to websites; a glossary of botanical terms; a new diagram of the tomb; additional illustrations; and a Bible references section, keyed to the main text and with quotations from the Old Testament that illuminate ancient botanical knowledge and practices.","torrent":{"xt":"urn:btih:b6a912b0c91ff77a3af1c6b514faf37427c17516","amp;dn":"Pharaohs+Flowers+-+The+Botanical+Treasures+of+Tutankhamun+%28Histo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a912b0c91ff77a3af1c6b514faf37427c17516","infoHashBuffer":{"type":"Buffer","data":[182,169,18,176,201,31,247,122,58,241,198,181,20,250,243,116,39,193,117,22]},"announce":[],"urlList":[]}}