{"title":"Eladio Dieste - Innovation in Structural Art (Architecture Art E","uid":11183053,"size":12208293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6af83609dced1482423461a0d487bd66bf8088e&amp;dn=Eladio+Dieste+-+Innovation+in+Structural+Art+%28Architecture+Art+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1412889189,"description":"Eladio Dieste: Innovation in Structural Art by Stanford Anderson\nEnglish | 2004 | ISBN: 1568983719 | 272 pages | PDF | 11,6 MB\n\nIn an industry so often enamored by media-coddled superstars with trendy clients, Eladio Dieste stands out as a refreshing and inspiring figure. Born in Uruguay, Dieste spent most of his long and productive career creating industrial and agrarian works, public infrastructure, commercial buildings, and small churches in his native country. \n\nDieste's unique and innovative method of design, a melding of architecture and engineering, elevated these often humble buildings to masterworks of art. Capitalizing on his revolutionary approach to building with reinforced masonry, Dieste built aesthetically stunning structures economically. If he often worked outside the architectural mainstream, he never lost sight of the modest people for whom his structures were built. Today, those familiar with his work consider him the equal of such structural innovators as Pier Luigi Nervi and Eduardo Terroja. In this, the first comprehensive analysis of his work to be published in English, both the beauty and technical innovation of Dieste's projects are examined in detail. Three essays by Dieste himself convey his thoughts on art, culture, and technology. With Dieste's death in 2000, this book serves as a tribute and a definitive reference to his extraordinary work and its brilliant union of architecture and engineering.","torrent":{"xt":"urn:btih:b6af83609dced1482423461a0d487bd66bf8088e","amp;dn":"Eladio+Dieste+-+Innovation+in+Structural+Art+%28Architecture+Art+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6af83609dced1482423461a0d487bd66bf8088e","infoHashBuffer":{"type":"Buffer","data":[182,175,131,96,157,206,209,72,36,35,70,26,13,72,123,214,107,248,8,142]},"announce":[],"urlList":[]}}