{"title":"Jello Biafra With D.O.A. - [1989] - Last Scream Of The Missing N","uid":4608993,"size":225671350,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6bee9b2c0a38440a50d0fa4fbf6c7d3ebd3d612&amp;dn=Jello+Biafra+With+D.O.A.+-+%5B1989%5D+-+Last+Scream+Of+The+Missing+N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"kislithepothead","files":-1,"time":1230573584,"description":"The first of Jello's post-Dead Kennedys collaborations was a barnburner; hooking up with Canada's legendary DOA ensured all the punk power that fans could want would be there in a big way. Even though Joey Keithley and company aren't quite as agile as Jello's ex-bandmates -- everything here is more brutally Motorhead in feel than the nervous aggro and sometimes restraint of the Kennedys -- this album can't be faulted for sheer crunch. Jello himself is in fine voice throughout, tackling his favored targets with the frenetic bile that he's made his own. Some of the songs have become outdated -- &quot;Wish I Was in El Salvador&quot; is very much of the '80s -- but &quot;Attack of the Peacekeepers,&quot; memorably tarring NATO's forces as &quot;the joke brigade,&quot; has had just as much of a point after Kosovo. &quot;Power Is Boring&quot; captures Jello at his most hilarious, pointing out how being a dictator must really stink (the job security issue alone, for one). Not much on the first side varies from song to song musically -- pounding, chunky feedback that smashes head-on, along with good gang-shout choruses from the band more than once -- but if that's the needed fix, this album provides in spades. The wild card here is a spooky, mid-paced romp through the Animals' &quot;We Gotta Get Outta This Place,&quot; with Jello's tremulous vocals suiting the lyrics perfectly and Keithley's backup on chorus fitting in, in its own rough way. The concluding, side-long &quot;Full Metal Jacket&quot; takes absolutely no prisoners, elevating Last Scream from good to great. With Keithley in particular turning in some great guitar work over a steady, snaky rhythm, Jello offers up one of the most bilious, pointed slams against Washington D.C.; this album is as &quot;city/feds-as-corrupt-institution&quot; as you could imagine. Kennedys artist Winston Smith offers up some great cover art to top it all off.\n  -AMG\n\n\nNot my rip, found on CENSORED(a very nifty site); split, tagged, replay gain scanned, added lyrics","torrent":{"xt":"urn:btih:b6bee9b2c0a38440a50d0fa4fbf6c7d3ebd3d612","amp;dn":"Jello+Biafra+With+D.O.A.+-+%5B1989%5D+-+Last+Scream+Of+The+Missing+N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6bee9b2c0a38440a50d0fa4fbf6c7d3ebd3d612","infoHashBuffer":{"type":"Buffer","data":[182,190,233,178,192,163,132,64,165,13,15,164,251,246,199,211,235,211,214,18]},"announce":[],"urlList":[]}}