{"title":"E=MC2 - A Biography of The World's Most Famous Equation - David ","uid":9580259,"size":1825823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b73cf4377ef67600a2bec53fa3d43e324acea894&amp;dn=E%3DMC2+-+A+Biography+of+The+World%27s+Most+Famous+Equation+-+David+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391748385,"description":"E=mc2. Just about everyone has at least heard of Albert Einstein's formulation of 1905, which came into the world as something of an afterthought. But far fewer can explain his insightful linkage of energy to mass. David Bodanis offers an easily grasped gloss on the equation. Mass, he writes, &quot;is simply the ultimate type of condensed or concentrated energy,&quot; whereas energy &quot;is what billows out as an alternate form of mass under the right circumstances.&quot;\n\nJust what those circumstances are occupies much of Bodanis's book, which pays homage to Einstein and, just as important, to predecessors such as Maxwell, Faraday, and Lavoisier, who are not as well known as Einstein today. Balancing writerly energy and scholarly weight, Bodanis offers a primer in modern physics and cosmology, explaining that the universe today is an expression of mass that will, in some vastly distant future, one day slide back to the energy side of the equation, replacing the &quot;dominion of matter&quot; with &quot;a great stillness&quot;--a vision that is at once lovely and profoundly frightening.\n\nWithout sliding into easy psychobiography, Bodanis explores other circumstances as well; namely, Einstein's background and character, which combined with a sterling intelligence to afford him an idiosyncratic view of the way things work--a view that would change the world. --Gregory McNamee","torrent":{"xt":"urn:btih:b73cf4377ef67600a2bec53fa3d43e324acea894","amp;dn":"E%3DMC2+-+A+Biography+of+The+World%27s+Most+Famous+Equation+-+David+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b73cf4377ef67600a2bec53fa3d43e324acea894","infoHashBuffer":{"type":"Buffer","data":[183,60,244,55,126,246,118,0,162,190,197,63,163,212,62,50,74,206,168,148]},"announce":[],"urlList":[]}}