{"title":"American Nightmare 2 MULTI BluRay 1080p 2014","uid":13521605,"size":8806777558,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b748cb0e4a05adab398ab3e9b8d258b8d8f45497&amp;dn=American+Nightmare+2+MULTI+BluRay+1080p+2014&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"annuaireweb","files":1,"time":1455367813,"description":"The.Purge.Anarchy.2014.MULTI.1080p.BluRay.DTS.x264-oo0oo\r\n\r\nLeo, un homme sombre et énigmatique, brigadier de police, est hanté par la disparition de son fils. S'armant d'un arsenal offensif et défensif, cet homme possédé est résolu à se purger de ses démons. Eva, une mère célibataire tentant tant bien que mal de joindre les deux bouts, et sa fille adolescente Cali vivent dans un quartier défavorisé et n'ont pas les moyens de s'offrir une bonne protection. Quand une poignée de «purgeurs» masqués pénètrent chez elles et les capturent, elles n'ont d'autre choix que de s'en remettre à leur libérateur fortuit, Leo. Au détriment de sa mission de vengeance «autorisée» contre celui qui a porté préjudice à sa famille, Leo, témoin de l'enlèvement d'Eva et Cali, ouvre le feu sur leurs agresseurs alors que Shane et Liz, un couple sur le point de se séparer, sont les victimes d'un acte de sabotage sur leur voiture à quelques minutes seulement du début de la Purge. Trouvant refuge dans le véhicule blindé que Leo a laissé ouvert pour porter secours à Eva et Cali, Shane et Liz s'allient alors à eux pour tenter de se défendre contre ceux qui ont la ferme intention d'exercer leur droit à la tuerie. Alors que ces cinq nouveaux alliés sont poursuivis à travers la ville, dans un sinistre jeu de «tue-moi ou je te tue» effaçant la frontière entre vengeance sponsorisée et justice humaine, tous sont amenés à remettre en question tout ce que leurs dirigeants leur ont toujours prôné","torrent":{"xt":"urn:btih:b748cb0e4a05adab398ab3e9b8d258b8d8f45497","amp;dn":"American+Nightmare+2+MULTI+BluRay+1080p+2014","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b748cb0e4a05adab398ab3e9b8d258b8d8f45497","infoHashBuffer":{"type":"Buffer","data":[183,72,203,14,74,5,173,171,57,138,179,233,184,210,88,184,216,244,84,151]},"announce":[],"urlList":[]}}