{"title":"Two.and.a.Half.Men.S11E02.720p.HDTV.X264-DIMENSION","uid":8996095,"size":994666885,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b748bfaf243c4779c265cc4309992e9934e88e64&amp;dn=Two.and.a.Half.Men.S11E02.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":2,"time":1380867565,"description":"Two and a Half Men\n\nGenre: Comedy\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: Chuck Lorre\nCast: Ashton Kutcher, Jon Cryer, Angus T. Jones, Marin Hinkle, Holland Taylor, Melanie Lynskey, April Bowlby, Conchata Ferrell\n\n.: Plot :.\nThe Harper brothers Charlie and Alan are almost opposites but form a great team. After years they had little in common except their dislike for their mundane, maternally cold but domineering mother Evelyn, Allan, a compulsively neat chiropractor and control-freak, is thrown out by his manipulative wife Judith who nevertheless gets him to pay for everything and do most jobs in the house. Charlie, a freelance jingle composer in a luxurious beach-house and irresistible Casanova who rarely gets up before brunch around noon, puts him up 'temporarily' with his son Jake, a lazy fat school kid who shuttles between his parents. This starts off the sitcom around their conflicting lifestyles, such as how to raise the boy (who now has an efficient, caring dad for the boring stuff while having a ball with his fun-loving sugar uncle who teaches him boyish things), be moralistic or have fun, a stickler or popular, what's a 'white' lie... Other fairly regular characters include Charlie's fat cleaning lady Bertha and his rich, obsessively infatuated neighbor-girl Rose who often sneaks in.","torrent":{"xt":"urn:btih:b748bfaf243c4779c265cc4309992e9934e88e64","amp;dn":"Two.and.a.Half.Men.S11E02.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b748bfaf243c4779c265cc4309992e9934e88e64","infoHashBuffer":{"type":"Buffer","data":[183,72,191,175,36,60,71,121,194,101,204,67,9,153,46,153,52,232,142,100]},"announce":[],"urlList":[]}}