{"title":"Ash Ra Tempel-Schwingungen/Seven Up (1972)","uid":3393067,"size":144589817,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b7dc55ee13bc9deee63ca4f5a6caae4a6d8b61c5&amp;dn=Ash+Ra+Tempel-Schwingungen%2FSeven+Up+%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bergmanwasa","files":9,"time":1128634019,"description":"Ash Ra Tempel\nSchwingungen/Seven Up (1972)@256kbps\nincluding artwork\n\n2 albums on one CD\nSchwingungen:\n1.\tLight- Look At Your Sun\t(6.12)\n2.\tDarkness- Flowers Must Die (11.50)\n3.\tSuche &amp; Liebe (18.57)\nSeven Up (w/ Timothy Leary)\t\n4.\tSpace (16.02)\t\n5.\tTime (21.36)\n\t\nAsh Ra Tempel's second album featured the first of several personnel \nchanges, Klaus Schulze having departed for other realms and replaced as \na result by Wolfgang Muller. A few guest players surfaced here and there \nas well, with one John L. taking the lead vocals -- another difference \nfrom the self-titled debut, which was entirely instrumental. \nThe general principle of side-long efforts continued, though the \nfirst half was split into two related songs, &quot;Light&quot; and &quot;Darkness.&quot; \n&quot;Light&quot; itself sounded halfway between the zoned-out exploration \nof &quot;Traummaschine&quot; and bluesy jamming, a weird if not totally discordant combination that still manages to sound more out there than most bands \nof the time. Gottsching's fried solo, in particular, is great, sending \nthe rest of the song out to silence that leads into &quot;Darkness.&quot; \nSaid song initially takes a far more minimal approach that bears \neven more resemblance to &quot;Traummaschine,&quot; fading out almost entirely \nby the third minute before a full band performance (including Uli \nPopp on bongos and Matthais Wehler's sudden alto sax bursts) slowly \nbuilds into a frenetic jam. John L.'s vocals become echoed screams and \nyelps not far off from Damo Suzuki's approach in Can, and the overall \nperformance is a perfect slice of Krautrock insanity, sudden swirls of \nflanging and even more on-the-edge solos from Gottsching and Wehler \nsending it over the top. &quot;Suche &amp; Liebe&quot; takes up the entire second side, \nthe performers this time around concentrating on the quiet but unsettling approach, Gottsching's massive soloing kept low in the mix but not so much \nthat it doesn't freak out listeners. The song concludes on an almost conventionally pretty band jam, something that could almost be Meddle-era \nPink Floyd, only with even a more haunting, alien air thanks to the wordless vocal keening.\n\nEven with the presence of special guest Timothy Leary, Seven Up sticks to \nits predecessor's penchant for bizarre, bluesy psychedelia on the first \nside while the second takes off into the deepest realms of space rock. \nFans of Leary may be a bit surprised, since he's but one of the five \nvoices sprinkled throughout the album and sounds more like a poor man's \nEric Burdon than an acid visionary might on tracks like \n&quot;Right Hand Lover,&quot; &quot;Downtown,&quot; and &quot;Power Drive.&quot; Side two consists \nof three drawn-out space jams that conclude with a rushing of air quite \nclose to a vacuum cleaner. Except for the last bit, Seven Up is not quite \nthe meeting of minds that acid and Kraut fans expected.\n\n(allmusic.com reviews)","torrent":{"xt":"urn:btih:b7dc55ee13bc9deee63ca4f5a6caae4a6d8b61c5","amp;dn":"Ash+Ra+Tempel-Schwingungen%2FSeven+Up+%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7dc55ee13bc9deee63ca4f5a6caae4a6d8b61c5","infoHashBuffer":{"type":"Buffer","data":[183,220,85,238,19,188,157,238,230,60,164,245,166,202,174,74,109,139,97,197]},"announce":[],"urlList":[]}}