{"title":"Antonin Artaud - Collected Works (6 books)","uid":15044656,"size":31134213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b82b4ba9e68a125bbea436128dec84124fc49248&amp;dn=Antonin+Artaud+-+Collected+Works+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":12,"time":1466631892,"description":"\nANTONIN ARTAUD (1896-1948) was a French dramatist, poet, essayist, actor, and theatre director, widely recognized as one of the major figures of twentieth-century theatre and the European avant-garde.\r\n\r\nArtaud's creative abilities were developed, in part, as a means of therapy during the artist's many hospitalizations for mental illness.  While being treated in a hospital by Edouard Toulouse, Artaud was encouraged to express himself in poetry.  Artaud's life and his work, despite the efforts of psychotherapy, reflected his mental afflictions and were further complicated by his dependence on narcotics.\r\n\r\nIn the 1920s, Artaud associated with Surrealist writers, artists, and experimental theatre  groups in Paris.  When political differences resulted in his break from the Surrealists, he founded the Theatre Alfred Jarry with Roger Vitrac and Robert Aron.  Artaud, especially, was disdainful of &quot;bourgeois&quot; classical theatre, panning the ordered plot and scripted language his contemporaries typically employed to convey ideas.  His best-known work, THE THEATRE AND ITS DOUBLE (1938), contained the two manifestos of the &quot;Theatre of Cruelty&quot; which calls for a primitive ceremonial communion between actor and audience in a magic exorcism; gestures, sounds, unusual scenery, and lighting combine to form a language, superior to words, that can be used to subvert thought and logic and to shock the spectator into seeing the baseness of his world.\r\n\r\nArtaud's own works, less important than his theories, were failures.  THE CENCI (1935), a play about a man who rapes his own daughter and is then murdered by men the girl hires to eliminate him, was an experiment too bold for its time and a commercial failure.  His vision, however, was a major influence on the Absurd theatre of Jean Genet, Eugène Ionesco, Samuel Beckett, and others and on the entire movement away from the dominant role of language and rationalism in contemporary theatre.\r\n\r\n\r\nThe following books are in PDF format:\r\n\r\n* Artaud Anthology (City Lights, 1965).  Edited by Jack Hirschman.\r\n\r\n* Collected Works of Antonin Artaud (Calder &amp; Boyars, 1968-1974).  4 volumes.  Translated by Victor Corti (vols. 1-2, 4) and Alastair Hamilton (vol. 3).\r\n\r\n* The Theater and Its Double (Grove, 1958).  Translated by Mary Caroline Richards.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                                 \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:b82b4ba9e68a125bbea436128dec84124fc49248","amp;dn":"Antonin+Artaud+-+Collected+Works+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b82b4ba9e68a125bbea436128dec84124fc49248","infoHashBuffer":{"type":"Buffer","data":[184,43,75,169,230,138,18,91,190,164,54,18,141,236,132,18,79,196,146,72]},"announce":[],"urlList":[]}}