{"title":"The Other Gospels: Accounts of Jesus... (2014) Bart D Ehrman-mul","uid":9498599,"size":37698102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b87076bb4a296c7f8ed059e13a23442adeb20aac&amp;dn=The+Other+Gospels%3A+Accounts+of+Jesus...+%282014%29+Bart+D+Ehrman-mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"7","files":-1,"time":1390165797,"description":"The Other Gospels: Accounts of Jesus from Outside the New Testament (2014) Bart D Ehrman (multi)\n\n\nThe Other Gospels: Accounts of Jesus from Outside the New Testament by Bart D. Ehrman, Zlatko Plese\n\n\nFormat: mobi/epub/azw3\nLength: 347 pages\nGenre: Non-Fiction/History/Religion\nDate: 9 January 2014\n\nBart Ehrman--the New York Times bestselling author of Misquoting Jesus and a recognized authority on the early Christian Church--and Zlatko Plese--a foremost authority on Christian Gnosticism--here offer a valuable compilation of over 40 ancient gospel texts and textual fragments that do not appear in the New Testament.\n\nThis comprehensive collection contains Gospels describing Jesus's infancy, ministry, Passion, and resurrection, and includes the controversial manuscript discoveries of modern times, such as the Gospel of Thomas and the most recent Gospel to be discovered, the Gospel of Judas Iscariot.\n\nEach translation begins with a thoughtful examination of important historical, literary, and textual issues in order to place the Gospel in its proper context. This volume is an invaluable resource for anyone interested in early Christianity and the deeper meanings of these apocryphal Gospels.\n\nAuthors:\n\nBart D. Ehrman is James A. Gray Distinguished Professor at the University of North Carolina at Chapel Hill. He is the author of numerous volumes on the early Christian Church.\n\nZlatko Plese is Associate Professor of Ancient Mediterranean Religions at the University of North Carolina at Chapel Hill. He is the author of Poetics of the Gnostic Universe: Narrative and Cosmology in the Apocryphon of John. ","torrent":{"xt":"urn:btih:b87076bb4a296c7f8ed059e13a23442adeb20aac","amp;dn":"The+Other+Gospels%3A+Accounts+of+Jesus...+%282014%29+Bart+D+Ehrman-mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b87076bb4a296c7f8ed059e13a23442adeb20aac","infoHashBuffer":{"type":"Buffer","data":[184,112,118,187,74,41,108,127,142,208,89,225,58,35,68,42,222,178,10,172]},"announce":[],"urlList":[]}}