{"title":"Inside the World of Henry VIII  (History Channel - VHS Rip)","uid":8576567,"size":306025716,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8f48a0d88cb7c506780d79f816db560c6211ee6&amp;dn=Inside+the+World+of+Henry+VIII++%28History+Channel+-+VHS+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":2,"time":1371293380,"description":"A joint collaboration between the History Channel and The Historic Royal Palaces Commision.\n\nCharles Dickens called him 'a spot of blood and grease on the history of England' - a man who achieved worldwide infamy for his cruelty, girth and six suffering wives. But King Henry VIII was also a man of energy and education. He was a scholar, a gifted musician and a sportsman. He changed the course of history and created a court of unrivalled magnificence.\n\n\nThe court was the world in which Henry lived, both moulding him and reflecting his own passions. It was the source of all power and patronage, a magnet to the talented, ambitious and calculating - a cauldron of intrigue, in which having the king's ear could mean the difference between life and death. It was also a roadshow, travelling from one stunning palace to the next. But none was so favoured by the King as Hampton Court Palace.\n\nInside The World of Henry VIII will explore the majesty and sophistication of this Tudor royal court. The programme has privileged access to the Tudor rooms of Hampton Court, represented to mark the 500th anniversary of Henry's accession in 2009. Curators take the viewer on an exclusive tour of the palace, explaining how its layout reflected its many functions - as a private royal residence, a centre of government, a pleasure palace and a statement of royal power and wealth. They explain how ritual surrounded the king, from acts of worship, to public appearances, to how he was dressed and even how he went to the toilet. Modern experts bring to life royal pastimes including falconry, jousting, and tennis. And behind it all, the enormous logistical operation that cost a royal fortune to maintain.\n\nInside The World of Henry VIII reveals a court where splendour concealed intrigue, and politics mixed with pleasure. And at its centre stood Henry VIII, whose power and majesty would make him a legend of English history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b8f48a0d88cb7c506780d79f816db560c6211ee6","amp;dn":"Inside+the+World+of+Henry+VIII++%28History+Channel+-+VHS+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f48a0d88cb7c506780d79f816db560c6211ee6","infoHashBuffer":{"type":"Buffer","data":[184,244,138,13,136,203,124,80,103,128,215,159,129,109,181,96,198,33,30,230]},"announce":[],"urlList":[]}}