{"title":"Seinfeld.S01-S09.DVDRip.x264-DiGG (RoSubbed)","uid":8794386,"size":44160758455,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b937dccb8bbc5911bd8cc2499967b96a8649301c&amp;dn=Seinfeld.S01-S09.DVDRip.x264-DiGG+%28RoSubbed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"DjGiohnny","files":343,"time":1376034890,"description":"Seinfeld is an American television sitcom that originally aired on NBC from July 5, 1989, to May 14, 1998, lasting nine seasons, and is now in syndication. It was created by Larry David and Jerry Seinfeld, the latter starring as a fictionalized version of himself. Set predominantly in an apartment block on Manhattan's Upper West Side (but shot mainly in Los Angeles), the show features a host of Jerry's friends and acquaintances, in particular best friend George Costanza, former girlfriend Elaine Benes and next door neighbor, Cosmo Kramer.\n\n Seinfeld was produced by Castle Rock Entertainment and distributed in association with Columbia Pictures Television and Columbia TriStar Television; Sony Pictures Television has distributed the series since 2002. It was largely co-written by David and Seinfeld with input from numerous script writers, including Larry Charles, Peter Mehlman, Gregg Kavet, Andy Robin, Carol Leifer, David Mandel, Jeff Schaffer, Steve Koren, Jennifer Crittenden, Tom Gammill, Max Pross, Charlie Rubin, Marjorie Gross, Alec Berg, Elaine Pope, and Spike Feresten.\n\n A critical favorite, commercial blockbuster and cultural phenomenon, the show led the Nielsen ratings in its sixth and ninth seasons and finished among the top two (along with NBC's ER) every year from 1994 to 1998. In 2002, TV Guide named Seinfeld the greatest television program of all time.\n\n\nIMDb: http://www.imdb.com/title/tt0098904/","torrent":{"xt":"urn:btih:b937dccb8bbc5911bd8cc2499967b96a8649301c","amp;dn":"Seinfeld.S01-S09.DVDRip.x264-DiGG+%28RoSubbed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b937dccb8bbc5911bd8cc2499967b96a8649301c","infoHashBuffer":{"type":"Buffer","data":[185,55,220,203,139,188,89,17,189,140,194,73,153,103,185,106,134,73,48,28]},"announce":[],"urlList":[]}}