{"title":"Metaprogramming Ruby: Program Like the Ruby Pros-2010kaiser","uid":7805499,"size":5114992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9589699b9ea2959c3edf37bb8eef0188c31c78c&amp;dn=Metaprogramming+Ruby%3A+Program+Like+the+Ruby+Pros-2010kaiser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2010kaiser","files":2,"time":1352386525,"description":"          Metaprogramming Ruby: Program Like the Ruby Pros-2010kaiser\n  \n\n\nEveryone in the Ruby world seems to be talking about metaprogramming--how you can use it to remove duplication in your code and write elegant, beautiful programs. Now you can get in on the action as well.\n\nThis book describes metaprogramming as an essential component of Ruby. Once you understand the principles of Ruby, including the object model, scopes, and eigenclasses, you're on your way to applying metaprogramming both in your daily work and in your fun, after-hours projects.\n\nLearning metaprogramming doesn't have to be difficult or boring. By taking you on a Monday-through-Friday workweek adventure with a pair of programmers, Paolo Perrotta helps make mastering the art of metaprogramming both straightforward and entertaining.\n\nThe book is packed with:\n\n\nPragmatic examples of metaprogramming in action, many of which come straight from popular libraries or frameworks, such as Rails. Programming challenges that let you experiment and play with some of the most fun, &quot;out-there&quot; metaprogramming concepts. Metaprogramming spells--34 practical recipes and idioms that you can study and apply right now, to write code that is sure to impress.\n\nWhether you're a Ruby apprentice on the path to mastering the language or a Ruby wiz in search of new tips, this book is for you.\n\n\n\nISBN:1934356476\n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:b9589699b9ea2959c3edf37bb8eef0188c31c78c","amp;dn":"Metaprogramming+Ruby%3A+Program+Like+the+Ruby+Pros-2010kaiser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9589699b9ea2959c3edf37bb8eef0188c31c78c","infoHashBuffer":{"type":"Buffer","data":[185,88,150,153,185,234,41,89,195,237,243,123,184,238,240,24,140,49,199,140]},"announce":[],"urlList":[]}}