{"title":"SocietySM  Redux - SR - Feb 08, 2015 - Daisy Marie","uid":11884293,"size":531296601,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b99f8394473fd84274a6afa46e06eebf1c1f0128&amp;dn=SocietySM++Redux+-+SR+-+Feb+08%2C+2015+-+Daisy+Marie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"merzedes","files":186,"time":1430768779,"description":"&quot;Daisy's Deep Screams&quot; \n SocietySM : Redux \n Daisy Marie \n\n Gagged and tied, lovely little Daisy Marie squirms and squeals on the dirty floor when she is rudely greeted by The Pope. Her screams start to reach an ear shattering proportion when The Pope squeezes her ultra sensitive tits and throws her over his shoulder for a good spanking. Next, The Pope ties Daisy's hands to the rafters and gets busy fingering her cunt while he peppers her ass red with open handed swats. The magic wand is introduced to Daisy's cunt and we watch as she screams and begs in the Dungeon and explodes in orgasm. WIth her pussy tender and raw, The Pope now crotch ropes his slave and leaves the room... As the leather rains down on her naked flesh, Daisy finds herself tied to the bed. As The Pope works her body over with his flogger, he pauses briefly to finger her pussy. Daisy's screams reach a deafening pitch as her Master uses his propane torch to cover his slave's torso in hot wax. As the hot liquid hits her flesh, Daisy does her very best to wriggle free but, soon comes to find that she is caught in The Pope's iron grip. The huge glass dildo is now lubed and shoved in Daisy's tight cunt and then the magic wand brings Daisy to a sopping orgasm before she is forced to lick her own juices of the big glass cock. Next, we watch Daisy chained in full suspension as The Pope canes her feet. As Daisy dangles her sides are clipped with clothespins and then her nipples are clamped. Then, The Pope takes the pole mounted dong and rams it deep inside her pussy. Tightly bound and chained, Daisy thrusts her pussy back to meet the dong until she cums... Tied to the post, Daisy takes the flogger across her naked flesh. Her screams once again reach a shattering volume when the whip strikes her tits. Next, The Pope ropes her pussy and weighs it down with a bucket. As the weight places a great bruden on Daisy, she screams in anguish as The Pope once again flogs her brutally before he leaves her drooling and alone... Tied to the cube with hands cuffed and tied overhead, Daisy is once again flogged by The Pope. Then, he breaks out the G5 and buries it against Daisy's pussy. As the vibe whirs away at Daisy's cunt, The Pope inserts a finger and brings his slave to a final orgasmic series\n\n\n Wmv 480p and Mov 240p + Pics \n\n Screens &lt;a href=&quot;\nhttp://www.dungeoncorp.com/u...s15/RED/DAI_032408/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/u...s15/RED/DAI_032408/index.php&lt;/a&gt;\n\n Uploaded by Merzedes and Shallow2 \n\n 17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\n Just keep on leaving us the nice comments below and we are happy :)\n\n Any Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\n\nCheers :-)","torrent":{"xt":"urn:btih:b99f8394473fd84274a6afa46e06eebf1c1f0128","amp;dn":"SocietySM++Redux+-+SR+-+Feb+08%2C+2015+-+Daisy+Marie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b99f8394473fd84274a6afa46e06eebf1c1f0128","infoHashBuffer":{"type":"Buffer","data":[185,159,131,148,71,63,216,66,116,166,175,164,110,6,238,191,28,31,1,40]},"announce":[],"urlList":[]}}