{"title":"Alive Text to Speech 5.3.6.6-serial incl","uid":4603345,"size":11771609,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9c24757297b66f6a59881f5ab0fa6acba6e069e&amp;dn=Alive+Text+to+Speech+5.3.6.6-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jmb2012","files":2,"time":1230354232,"description":"Alive Text to Speech is a text-to-speech software to read text in any application, and convert text to MP3, WAV, OGG or VOX files.\n\nAlive Text to Speech also enables you to listen documents, emails, news articles or web pages without conversion. It supports schedule converting. It also allow advanced users to finish the conversion of text to mp3 with Command lines. You can change the different voices and the readout speed for conversion or listening, and download more voices from Internet. \n\nFree Download cccBuy Now cccScreenshot\n\nKey Features:\n1) Read text in any application, including Emails, web pages, news articles, PDF, Word or Excel Documents, etc.\n2) Convert text to MP3, WAV, OGG, VOX files. \n3) Convert text Files to MP3, WAV, OGG, VOX files. \n4) Install Alive Text to Speech Toolbar in IE (Internet Explorer) Browser.\n5) It is very simple and easy to use. Just right click on files in the Windows Explorer, select &quot;Convert to MP3&quot;(or WAV, OGG,VOX) and convert them using your predefined settings. \n6) Command line supported.\n7) Converting text to mp3 in batches.\n8) Schedule converting support.\n9) Microsoft text-to-speech engine.\n10) High converting speed, wonderful output quality.\n11) Windows Vista compatible.\n\n\nWith a simple right click, you can complete following conversion:\nText to MP3\nText to WAV\nText to OGG\nText to VOX\tText Files to MP3\nText Files to WAV\nText Files to OGG\nText Files to VOX\n\nAlive Text to Speech lets you listen to the text in Emails, web pages, news articles, PDF, Word or Excel Documents,etc. Just highlight the text your want to hear, and then press Ctrl + C to hear it.\n\nAlive Text to Speech enables you to convert Text to MP3, WAV, OGG, or VOX files with a single right click. It is very simple and easy to use. Just right click on files in the Windows Explorer, select &quot;Convert to MP3&quot; (or WAV, OGG, and VOX) and convert them using your predefined settings. You can also download to your portable MP3 player, and listen to them while you exercise, work or commute.\n\nIt allows advanced users to finish conversions with command line. You can download more voices from the Internet.\nDownload Mike and Mary voices for Windows XP\n\n\nHardware: The minimum requirements are a Pentium 133 and 32 Mbytes of RAM.\n\nSoftware: Windows 95 or 98, Windows ME, Windows XP, Windows NT 4.x, Windows 2000, Windows 2003, Windows Vista.\n\n \n\n\n\n","torrent":{"xt":"urn:btih:b9c24757297b66f6a59881f5ab0fa6acba6e069e","amp;dn":"Alive+Text+to+Speech+5.3.6.6-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9c24757297b66f6a59881f5ab0fa6acba6e069e","infoHashBuffer":{"type":"Buffer","data":[185,194,71,87,41,123,102,246,165,152,129,245,171,15,166,172,186,110,6,158]},"announce":[],"urlList":[]}}