{"title":"Hard Choices - Hillary Clinton (Abridged, Chapterized) Audiobook","uid":10337083,"size":341645802,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba4f37fbf87267de1bd842fd43645aee365e3d80&amp;dn=Hard+Choices+-+Hillary+Clinton+%28Abridged%2C+Chapterized%29+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Squiddy82","files":-1,"time":1402486070,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS devices while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nHard Choices\n\nWritten by: Hillary Rodham Clinton\nNarrated by: Kathleen Chalfant, Hillary Rodham Clinton\nLength: 11 hrs and 45 mins\nFormat: Abridged\nRelease Date:06-10-14\nProgram Type: Audiobook\n\nHillary Rodham Clinton's inside account of the crises, choices, and challenges she faced during her four years as America's 67th Secretary of State, and how those experiences drive her view of the future.\n\nIn the aftermath of her 2008 presidential run, she expected to return to representing New York in the United States Senate. To her surprise, her former rival for the Democratic Party nomination, newly elected President Barack Obama, asked her to serve in his administration as Secretary of State. This memoir is the story of the four extraordinary and historic years that followed, and the hard choices that she and her colleagues confronted.\n\nSecretary Clinton and President Obama had to decide how to repair fractured alliances, wind down two wars, and address a global financial crisis. They faced a rising competitor in China, growing threats from Iran and North Korea, and revolutions across the Middle East. Along the way, they grappled with some of the toughest dilemmas of US foreign policy, especially the decision to send Americans into harm's way, from Afghanistan to Libya to the hunt for Osama bin Laden.\n\nDrawing on conversations with numerous leaders and experts, Secretary Clinton offers her views on what it will take for the United States to compete and thrive in an interdependent world. She makes a passionate case for human rights and the full participation in society of women, youth, and LGBT people. An astute eyewitness to decades of social change, she distinguishes the trendlines from the headlines and describes the progress occurring throughout the world, day after day.\n\nSecretary Clinton's descriptions of diplomatic conversations at the highest levels offer listeners a master class in international relations, as does her analysis of how we can best use &quot;smart power&quot; to deliver security and prosperity in a rapidly changing world - one in which America remains the indispensable nation.\t\t","torrent":{"xt":"urn:btih:ba4f37fbf87267de1bd842fd43645aee365e3d80","amp;dn":"Hard+Choices+-+Hillary+Clinton+%28Abridged%2C+Chapterized%29+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4f37fbf87267de1bd842fd43645aee365e3d80","infoHashBuffer":{"type":"Buffer","data":[186,79,55,251,248,114,103,222,27,216,66,253,67,100,90,238,54,94,61,128]},"announce":[],"urlList":[]}}