{"title":"The Lion in Winter  (1968)","uid":4614145,"size":1385765283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba94b1e1bed37f4dbe6d38be597ace7ea269d811&amp;dn=The+Lion+in+Winter++%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"sheila6","files":4,"time":1230747597,"description":"The Lion in Winter is a 1968 historical costume drama made by Avco Embassy Pictures, based on the Broadway play by James Goldman. It was directed by Anthony Harvey and produced by Joseph E. Levine from Goldman's adaptation of his own play, The Lion in Winter.\n\n\n\nSynopsis:\n\nThe Lion in Winter occurs during Christmas 1183 at Henry Plantagenet's chÃƒÂ¢teau and primary residence in Chinon, Anjou, within the Angevin Empire of medieval France. \n\nHenry wants his son Prince John (1166-1216, the future King John of England 1199-1216) to inherit his throne, while his wife Queen Eleanor of Aquitaine (whom he keeps locked in Salisbury Tower) wants their son Prince Richard the Lionheart (1157-1199, the future King Richard I of England 1189-1199). Meanwhile, King Philip II of France, the son of Eleanor's ex-husband, has given his half-sister Alais, who is currently Henry's mistress, to the future heir, and demands either the wedding or the return of her dowry.\n\nAs a ruse, Henry agrees to give Alais to Richard and make him heir. He makes a side deal with Eleanor for her freedom in return for Aquitaine, to be given to John. The deal is revealed at the wedding, making Richard refuse to go through with it. Having believed Henry's intentions, John (at the direction of his other brother Prince Geoffrey, Duke of Brittany (1158-1186)) plots with Philip to make war on England. Henry finds out, dismisses all three sons as unsuitable, and locks them in the dungeon. He makes plans to travel to Rome for an annulment, so he can have new sons with Alais, but she says he won't ever be able to release his sons from prison or they will threaten the new sons. Henry sees that she is right and condemns them to death, but can't do it and lets them escape. He and Eleanor go back to hoping for the future.\n\nThe Lion in Winter is fictional: there was no Christmas Court at Chinon in 1183; there was a Christmas court at Caen in 1182; none of the dialogue and action is historic, though the outcomes of the characters and the background are historically accurate. In reality, Henry had many mistresses and many illegitimate children; the &quot;Rosamund&quot; mentioned in the film was Henry II's mistress until she died. The article on the Revolt of 1173-1174 describes the historical events leading to the play's events.\n\n\n\nCast:\n\n* Peter O'Toole as King Henry II\n* Katharine Hepburn as Queen Eleanor\n* Anthony Hopkins as Richard the Lionheart (In his Motion Picture debut)\n* John Castle as Geoffrey\n* Nigel Terry as John\n* Timothy Dalton as King Philip II (In his Motion Picture debut)\n* Jane Merrow as Alais\n* Nigel Stock as Captain William Marshall\n* Kenneth Ives as Queen Eleanor's guard\n\n\n\nBackground and Production:\n\nThe film debuted on October 30, 1968 (December 29, 1968 London premiere).\n\nThe film was shot at Ardmore Studios in Bray, County Wicklow, Ireland and on location in Ireland, Wales, and in France at Abbaye de Montmajour, Arles, ChÃƒÂ¢teau de Tarascon, Tarascon, and Tavasson, SaÃƒÂ´ne-et-Loire.\n\nAn interesting aspect of the film was that Hepburn was 61 years old and thus the same age that her character Eleanor of Aquitaine was in 1183, the film's plot year.\n\nHepburn won an Academy Award for Best Actress for her role. The musical score by John Barry also won an Oscar, as did Goldman's adaptation of his play.\n","torrent":{"xt":"urn:btih:ba94b1e1bed37f4dbe6d38be597ace7ea269d811","amp;dn":"The+Lion+in+Winter++%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba94b1e1bed37f4dbe6d38be597ace7ea269d811","infoHashBuffer":{"type":"Buffer","data":[186,148,177,225,190,211,127,77,190,109,56,190,89,122,206,126,162,105,216,17]},"announce":[],"urlList":[]}}