{"title":"Kevin J. Anderson - The Saga of Seven Suns","uid":14053580,"size":3959498935,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bb2e6b7679a80157d566c9f1746f477a531307d9&amp;dn=Kevin+J.+Anderson+-+The+Saga+of+Seven+Suns&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"twocows","files":7,"time":1459083833,"description":"Hidden Empire - The Klikiss, a now-extinct alien civilization, left behind vast technological information that has been discovered by two xenoarchaeologists. One discovery, a device that converts gas planets into life-giving suns is quickly put to the test with unimaginable results. Arising out of the test is a new alien species that threatens every human. Mankind is left with the dim reality, either fight the new alien life form or face humiliation, death, and extinction.\r\n\r\nA Forest of Stars - Early in the 25th century, humans ignited a fierce war with the hydrogues. Now the gas-giant planets, once a major source of fuel for Earth, are off limits, and the fearsome hydrogues scour the solar system, incinerating humans and the trees of the worldforest. As political unrest spreads throughout Earth's space colonies, a possible ally is discovered: an ancient race of water-based creatures. But is it too late to stop the war?\r\n\r\nHorizon Storms - The momentous war between the powerful hydrogues and fiery faeros continues, with planets and stars being consumed in the devastation. The Terran Hanseatic League must bring all branches of the human race together to resist the threat, but not all humans are willing to concede their freedom.\r\n\r\nScattered Suns - The war between the alien hydrogues and the faeros rages, reducing suns to blackened shells - including one of the fabled seven suns of the Ildiran Empire. Instead of protecting themselves, the Ildirans engage in bloody civil war and the many factions of humanity are bitterly divided. Can mankind and Ildirans overcome their own internal fighting to face a deadly new enemy that is ready to annihilate them?\r\n\r\nOf Fire and Night - The extermination of Earth is at hand. With his increasingly irrational leadership, Basil Wenceslas, chairman of the Hansa, has driven humanity into a corner. His punitive treatment of the Hansa colonies and the Roamers, as well as his refusal to aid an embattled Theroc, have made enemies for the people of Earth. Enemies that the Hansa cannot afford - not when Wenceslas is struggling against revolt by soldier compies, who decimate the military by stealing ships and slaughtering soldiers; and betrayal by the Ildirans, led by Jora'h the Mage-Imperator, who is secretly scheming with the hydrogues to annihilate Earth.\r\n\r\nMetal Swarm - For years, the alien Klikiss robots have pretended to be humanity's friends, but their seeming &quot;help&quot; allowed them to plant an insidious Trojan Horse throughout the Earth Defense Forces. Now, in the aftermath of a devastating war, swarms of ancient black robots built by the lost insectoid Klikiss race continue their depredations on helpless worlds with stolen and heavily armed Earth battleships. Among the humans, the Hansas' brutal Chairman struggles to crush any resistance, even as King Peter breaks away to form his own new Confederation among the colonies who have declared their independence. And meanwhile, the original, voracious Klikiss race, long thought to be extinct, has returned, intent on conquering their former worlds and willing to annihilate anyone in the way.\r\n\r\nThe Ashes of Worlds - The culminating volume in The Saga of Seven Suns weaves together the myriad story lines in a spectacular grand finale. Galactic empires clash, elemental beings devastate whole planetary systems, and the factions of humanity are pitted against one another. Heroes rise and enemies make their last stands in the climax of an epic tale eight years in the making","torrent":{"xt":"urn:btih:bb2e6b7679a80157d566c9f1746f477a531307d9","amp;dn":"Kevin+J.+Anderson+-+The+Saga+of+Seven+Suns","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb2e6b7679a80157d566c9f1746f477a531307d9","infoHashBuffer":{"type":"Buffer","data":[187,46,107,118,121,168,1,87,213,102,201,241,116,111,71,122,83,19,7,217]},"announce":[],"urlList":[]}}