{"title":"Johnny Mandel-Suicide is Painless","uid":7051445,"size":6891059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bbeac80645504ff003f48c370d46171dcd1e89f3&amp;dn=Johnny+Mandel-Suicide+is+Painless&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"payodie1969","files":1,"time":1329973610,"description":"&quot;Suicide Is Painless&quot; is a song written by Johnny Mandel (music) and Mike Altman (lyrics), which is best known for being featured as the theme song for both the movie and TV series M*A*S*H. The actual title is &quot;Song from M*A*S*H&quot; (Suicide is Painless)&quot;. Mike Altman is the son of the original film's director, Robert Altman, and was 14 years old when he wrote the song's lyrics. During an appearance on The Tonight Show Starring Johnny Carson in the 1980s, Robert Altman said that his son earned more than a million US dollars for co-writing the song while he only made US $70,000 for directing the movie.\n\nThe song is played during the film's opening credits, sung by uncredited session singers John Bahler, Tom Bahler, Ron Hicklin and Ian Freebairn-Smith (the vocals are sometimes misattributed to Johnny Mandel, due to his being the only name officially credited for the song). Additionally, the movie also features a scene that begins when Walter Koskiusko Waldowski, a dentist nicknamed &quot;The Painless Pole&quot;, declares his intention to commit suicide, and the song is sung by Ken Prymus (playing Private Seidman) during the suicide scene. Several instrumental versions of the song were used as the theme for the TV series. Credited to &quot;The Mash&quot; when it appeared on the film's soundtrack album on Columbia/CBS Records in 1970,[1] it belatedly became a number one hit in the UK in 1980 after being championed by BBC Radio 1 DJ Noel Edmonds.","torrent":{"xt":"urn:btih:bbeac80645504ff003f48c370d46171dcd1e89f3","amp;dn":"Johnny+Mandel-Suicide+is+Painless","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbeac80645504ff003f48c370d46171dcd1e89f3","infoHashBuffer":{"type":"Buffer","data":[187,234,200,6,69,80,79,240,3,244,140,55,13,70,23,29,205,30,137,243]},"announce":[],"urlList":[]}}