{"title":"DARK SOULS - XPG - XBOX360 - NTSC - XGD3 {BOOBSMAN}","uid":6734595,"size":8810225479,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:bc11d9d3985356856479a0ebce65288185205e51&amp;dn=DARK+SOULS+-+XPG+-+XBOX360+-+NTSC+-+XGD3+%7BBOOBSMAN%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"boobsman","files":7,"time":1318280337,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT2.0!!!\n &lt;a href=&quot;\nhttp://www.pix2links.com/image/UHbtf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pix2links.com/image/UHbtf.jpg&lt;/a&gt;\n\nDark Souls is the spiritual successor to the widely acclaimed action RPG Demon's Souls by From Software. Dark Souls is a brand new action RPG (role playing game) set in a rich, dark fantasy universe. Tense dungeon crawling, fearsome enemy encounters and groundbreaking online features combine for a truly unique RPG experience. Dark Souls breaks down barriers with a seamless world design that encourages exploration and fosters an adaptable gameplay experience. As players encounter terrifying enemies and discover new areas, the unerring foundation of challenge and reward permeates to offer an unparalleled sense of achievement.\n\nStoryline:\nDemons, spawned by the wrath of gods, have brought darkness to the world. Stricken by the curse of the undead, many have lost their souls. Players must battle hideous demons and unimaginable monsters to collect souls and find the Eternal Flame of Life, which is losing its power to restore souls and keep the eternal night at bay.\n\nSeamless environments in a dark fantasy universe: abandoned castles infested with the undead, labyrinthine catacombs, a world of sunken ruins, haunted forests, vast dungeons and magical lakes are all there for the courageous to explore at will.\n\nExpanded RPG elements: plentiful options to customise characters with different equipment, weapons and spells will provide players a deep RPG experience.\n\nThe Beacon Fire: placed at strategic points throughout the game world, the Beacon Fire serves as a Recovery, Restart and Sharing Point.\n\nUnique online features\n\nThis release also contains a world map and mini guide (Eng, Fre, Ger)\n","torrent":{"xt":"urn:btih:bc11d9d3985356856479a0ebce65288185205e51","amp;dn":"DARK+SOULS+-+XPG+-+XBOX360+-+NTSC+-+XGD3+%7BBOOBSMAN%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc11d9d3985356856479a0ebce65288185205e51","infoHashBuffer":{"type":"Buffer","data":[188,17,217,211,152,83,86,133,100,121,160,235,206,101,40,129,133,32,94,81]},"announce":[],"urlList":[]}}