{"title":"(1985) Tears for Fears - Songs From The Big Chair [FLAC] {100.XY","uid":8392206,"size":298507115,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bce4df0126f33056d00ba39d6305b51474f6d01c&amp;dn=%281985%29+Tears+for+Fears+-+Songs+From+The+Big+Chair+%5BFLAC%5D+%7B100.XY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"100.XY","files":-1,"time":1366466873,"description":"Wikipedia:\nSongs from the Big Chair is the second album by the British rock band Tears for Fears. It was released in 1985 on Phonogram Records, and remains their highest selling album to date. The album peaked at no.2 in the UK (where it remained in the Top 10 for over six months and in the Top 40 for over a year) and reached no.1 (for five weeks) in the US. It contained a string of international hit singles, including: &quot;Mothers Talk&quot;, &quot;Shout&quot;, &quot;Everybody Wants to Rule the World&quot; and &quot;Head Over Heels&quot;.\n\n\n Review:\nThe album title was derived from the 1976 television film Sybil about a woman with multiple personality disorder who only feels safe when she is sitting in her analyst's &quot;big chair&quot;.\nIn a retrospective review published in Allmusic, Stanton Swihart commented &quot;In the loping, percolating 'Everybody Wants to Rule the World', Tears for Fears perfectly captured the zeitgeist of the mid-'80s while impossibly managing to also create a dreamy, timeless pop classic. Songs From the Big Chair is one of the finest statements of the decade.&quot;\nOnce the band had finished a lengthy touring and promotion schedule for the album, they took an extended hiatus from the music industry. In 1989, their third album, The Seeds of Love, marked their return. A companion video documentary entitled &quot;Scenes from the Big Chair&quot; was released in late 1985.\nThe album has been included in the book compilation 1001 Albums You Must Hear Before You Die.\nSlant Magazine listed the album at #95 on its list of &quot;Best Albums of the 1980s.&quot;\n\n\nCountry: UK\nGenre: New Wave, pop rock, synthpop, post-punk\nQuality: FLAC/tracks (lossless)\n\nTracklist:\nA1. Shout 6:30\nA2. The Working Hour 6:30\nA3. Everybody Wants To Rule The World 4:11\nA4. Mothers Talk 5:06\nB1. I Believe 4:50\nB2. Broken 2:38\nB3. Head Over Heels 4:12\nB4. Broken (Live) 0:50\nB5. Listen 6:49\n","torrent":{"xt":"urn:btih:bce4df0126f33056d00ba39d6305b51474f6d01c","amp;dn":"%281985%29+Tears+for+Fears+-+Songs+From+The+Big+Chair+%5BFLAC%5D+%7B100.XY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bce4df0126f33056d00ba39d6305b51474f6d01c","infoHashBuffer":{"type":"Buffer","data":[188,228,223,1,38,243,48,86,208,11,163,157,99,5,181,20,116,246,208,28]},"announce":[],"urlList":[]}}