{"title":"BBC Building Dream Homes 07of15 720p x264 AAC HDTV ","uid":10425137,"size":687534774,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bd617cbadbf234a8ea2e4bd569ddbe414948d034&amp;dn=BBC+Building+Dream+Homes+07of15+720p+x264+AAC+HDTV+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"MVGroup","files":-1,"time":1403691056,"description":"Building Dream Homes\n\nTechnology Documentary hosted by Miles Jupp, published by BBC in 2014 - English narration\n\n\nInformation\n------------------------------\n\nBuilding Dream Homes\nThis 15-part series follows some of the nation's architects leading the way in groundbreaking design, as they battle with builders, blueprints and the clients who hire them, all in the name of making dream properties become a reality. \nFrom complex million-pound residential projects to loft conversions and kitchen extensions, this series is on the ground from design to handover as the diggers arrive, the roof goes on, the cantilevered staircase is fitted, and the client walks through the door, with big reveals in every episode.\nThe show crosses the country, picking out some of the most exciting and innovative residential builds happening at the moment and showing first-hand the drama, headaches and hard work it takes to design and build them. We see the highs and lows that come with taking on such ambitious projects as our architects take on everything from tricky clients to hurricane-force winds. Budget plays a part in every story, so viewers gain an insight into how much builds cost and what can be achieved.\n\n\n1)  Part 1 \nIn this episode, architect Chris Loyn gets to grips with a budget-busting, future-proof, upside-down house near Cardiff. As owners Marianne and Jon embark on building the house they have spent years planning and the reality of the scale of the project starts to hit home, Marianne looks to her architects for reassurance. And architect David Blaikie is working on a two-storey extension for a family in Edinburgh who have outgrown their home. They have high expectations and a limited budget and, when things start going awry, it takes all of architect David's experience and negotiation skills to put things right.\n\n2)  Part 2 \nArchitect Chris Loyn gets to grips with an amazing upside-down house near Cardiff. But a disagreement over the kitchen threatens to bring conflict to the build. And in Winchester, architects Laurence Bowen and Paul Robinson are working with a family who bought a small house in their dream location. But after problems with the planners, their plans to build an ultra-modern extension before the arrival of baby number two are in jeopardy.\n\n3)  Part 3 \nThe upside-down house in Wales reaches a critical stage as Â£93,000-worth of windows are craned into place. But the project is left reeling when one of its driving forces is taken ill. And in Berkhamstead a family spots potential in an unloved 80s house. They plan a total home renovation, inside and out. But the architect has to step in when it looks like their dreams will be dashed by the planners.\n\n4)  Part 4 \nAt the upside-down house in Wales, the building is finally watertight and owner Marianne is back on site to inspect after months of illness. But will she like what she finds when she gets there? And in Dunblane, a dilapidated old mill is being restored to its former glory. But there's bad news in store for home owner Darren when the building inspector pays a visit to the site. Architect Bobby Halliday has to pull out all the stops to keep the build on track.\n\n5)  Part 5 \nIn Wales, the race is on to complete Marianne and Jon's amazing upside-down house. The kitchen goes in, and the finishing touches are added. Finally, the couple and the architects get to see what they have been working towards for almost a year. And in the New Forest, a couple knock down their old house to make room for a stunning new build. But will it measure up to its beautiful surroundings and their expectations?\n\n6)  Part 6 \nArchitects Paul Robinson and Laurence Bowen start on a project that is going to push them in a completely new direction - a state-of-the-art factory-built house. If all goes to plan then this incredible structure will go up in just five days, but even getting it on site turns out to be trickier than anyone had anticipated. And in Radlett, Hertfordshire, local architect Bob Thompson tackles the design of a new extension to a 1950s house. Will client David be able to deal with the responsibility of managing the whole project himself?\n\n7)  Part 7 \nDorset architects Laurence Bowen and Paul Robinson push ahead with their pioneering factory-built house. But will one of the worst winter storms to hit the south coast of England hamper their plans? And in the historic Scottish town of Linlithgow, architect Chris Dinnis takes on a tricky two-story extension on an old house that reveals a hidden secret behind a bedroom wall\n\n8)  Part 8 \nArchitect Paul Robinson, his client Marcus and builder Barry Bacon make a visit to the German factory where Marcus's state-of-the-art home is now on the production line. But will the build even make the shores of England when it hits an unexpected snag on the factory floor? And in Scotland, architect Gerry Hogan takes on a conservation project in Glasgow, battling an A- listed building that is starting to crumble.\n\n9)  Part 9 \nIn Dorset, architects Paul Robinson and Laurence Bowen are nervously waiting for the delivery of the factory-built home from Germany. But, with the south coast battered by exceptional high winds and rain, will they be able to erect the house against the elements? And in Edinburgh, architect David Blaikie is overseeing an unsual but very important project for his client Angelica, who has MS - a set of Â£100,000 hydraulic steps that blend seamlessly into their historic surroundings.\n\n10)  Part 10 \nArchitects Laurence Bowen and Paul Robinson travel to the Dorset countryside to meet client Marcus and see the final pieces of their factory-built home being slotted into place. But will the giant glass doors fit their frame and will Marcus like his finished home? And in the New Forest, architect Wendy Perring is taking on the build of a new cottage on a challengingly small site. She has to use every trick in the book to make it into a living space.\n\n11)  Part 11 \nIn Stirlingshire, architect Bobby Halliday is taking on a huge development of bespoke homes on the site of an old farm steading in the shadow of Stirling Castle. As if juggling the ups and downs of such a huge build wasn't enough, he has to make sure that a house is ready for a client to move in to every three weeks. In this episode he is dealing with a couple whose move in date is four days before Christmas. It all seems to be going according to plan until the building inspector turns up. And he throws a very big spanner in the works. Will Bobby be able to put things right and get the couple in in time for Christmas? In Cardiff, architect Dan Benham is designing an amazing one and half million pound family home. But as the build is delayed and deadlines fall by the wayside, will the stresses between architect and client threaten to derail the project?\n\n12)  Part 12 \nIn Stirlingshire, Bobby Halliday's ambitious ten house farm steading development in the shadow of Stirling Castle continues through the depths of winter. He is dealing with newlyweds who plan to make a four-bedroom house on the development their first home. Sounds simple, but with one half of the couple living in Indonesia and making decisions on design and interiors via the internet, tensions rise as Bobby worries what her reaction will be when she finally sees the house. When she does arrive, the kitchen is in the wrong place. Not only does the whole thing have to be dismantled, the new floor has to be dug up. In Edinburgh, David Blaikie tackles an ambitious kitchen and winter garden room extension to an Edwardian townhouse. The owners have a young family, and living on site during construction threatens to overwhelm them. But their unusual build plan eventually pays off and they finally get the kitchen of their dreams... even if they have to wait a little longer than planned for their glass extension.\n\n13)  Part 13 \nIn Stirlingshire, Bobby Halliday's ten bespoke house farm steading development nears completion. Used to designing for what his clients demand, Bobby has to design a home that has no buyer, so the pressure is on him to make it somewhere that will appeal to everyone. On the other side of the site he's dealing with the polar opposite problem, as one client's obsession with cars forces a complete redesign of the house they're moving in to. Near Edinburgh, Christopher Dinnis and Carolyn Whiteford work with a family to gain planning permission to convert an old silversmith in the heart of a conservation village into a family home. Tough negotiations with the planners ensue; will Chris and Carolyn be able to pull it off?\n\n14)  Part 14 \nIn Scotland, David Blaikie grapples with a modern extension that will double the size of an old railway station, making it a dream home for a young family. But money is tight so they cut corners at every stage. One of the cost cutting exercises involves overzealous owner Kenny getting his hands dirty. But when he and his mates take on the demolition of part of the house, their gung-ho attitude leads to costly accidents. In the New Forest, Wendy Perring designs a mobile home like you've never seen before. Not only is this state of the art bespoke house the same size as an average Victorian semi, Wendy hopes it will also be the top eco home in the country - no mean feat. The home is built in a factory in Yorkshire, but when they try to get it to site, it turns out to be less mobile than expected.\n\n15)  Part 15 \nIn Scotland, David Blaikie forges ahead with the modern extension that will double the size of a young family's historic home. But money is tight and in a desperate effort to save money they take on a lot, but the pressures of the build push the family to breaking point. In Dorset, Paul Robinson and Laurence Bowen design a state of the art modern house. But the horrific weather and complicated nature of the build which uses technology from across Europe, threatens to derail the whole project.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img855.imageshack.us/img855/4476/9loy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/img855/4476/9loy.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/9868/qeb6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/9868/qeb6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img829.imageshack.us/img829/2163/agz7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img829.imageshack.us/img829/2163/agz7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/63/3wem8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/63/3wem8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img819.imageshack.us/img819/2272/1brr.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img819.imageshack.us/img819/2272/1brr.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/6686/ugl8m.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/6686/ugl8m.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/2688/bljk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/2688/bljk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img819.imageshack.us/img819/41/mcmn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img819.imageshack.us/img819/41/mcmn.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img849.imageshack.us/img849/2827/ebj5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img849.imageshack.us/img849/2827/ebj5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img843.imageshack.us/img843/3982/48oz7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img843.imageshack.us/img843/3982/48oz7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/125/hkll7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/125/hkll7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/2495/9j14.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/2495/9j14.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/4573/jxa5s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/4573/jxa5s.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/5920/p5vjm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/5920/p5vjm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/7558/89tm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/7558/89tm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img850.imageshack.us/img850/1711/2fc1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img850.imageshack.us/img850/1711/2fc1.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3a72535d527a760e140b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2970 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 30mins\n * Framerate: 25 FPS\n * Number of Parts: 15\n * Container Mp4\n * Part Size: average 649 MB\n * Source: HDTV\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b0467j0x&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b0467j0x&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=World%27s%20Greenest%20Homes%3A%20Season%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=World%27s%20Greenest%20Homes%3A%20Season%201&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Perfect%20Home&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Perfect%20Home&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Grand%20Designs%3A%20Collection%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Grand%20Designs%3A%20Collection%201&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:bd617cbadbf234a8ea2e4bd569ddbe414948d034","amp;dn":"BBC+Building+Dream+Homes+07of15+720p+x264+AAC+HDTV+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd617cbadbf234a8ea2e4bd569ddbe414948d034","infoHashBuffer":{"type":"Buffer","data":[189,97,124,186,219,242,52,168,234,46,75,213,105,221,190,65,73,72,208,52]},"announce":[],"urlList":[]}}