{"title":"Middle School Series (1-4) by James Patterson [MU]","uid":8623399,"size":151911184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd87a901d6a0fb646fdaedce1b0951c3f523ea6e&amp;dn=Middle+School+Series+%281-4%29+by+James+Patterson+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1372437683,"description":"Middle School Series (1-4) by James Patterson in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - {spam link removed}download \nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter\n\nI Funny: A Middle School Story by James Patterson [Bonus] (December 10th 2012)\n\nJamie Grimm is a middle schooler on a mission: he wants to become the world's greatest standup comedian--even if he doesn't have a lot to laugh about these days. He's new in town and stuck living with his aunt, uncle, and their evil son Stevie, a bully who doesn't let Jamie's wheelchair stop him from messing with Jamie as much as possible. But Jamie doesn't let his situation get him down. When his Uncle Frankie mentions a contest called The Planet's Funniest Kid Comic, Jamie knows he has to enter. But are the judges only rewarding him out of pity because of his wheelchair, like Stevie suggests? Will Jamie ever share the secret of his troubled past instead of hiding behind his comedy act?\n\nMiddle School: The Worst Years of My Life (Middle School #1) by James Patterson (June 27th 2011)\n\nRafe Khatchadorian has enough problems at home without throwing his first year of middle school into the mix. Luckily, he's got an ace plan for the best year ever, if only he can pull it off: With his best friend Leonardo the Silent awarding him points, Rafe tries to break every rule in his school's oppressive Code of Conduct. Chewing gum in class-5,000 points! Running in the hallway-10,000 points! Pulling the fire alarm-50,000 points! But when Rafe's game starts to catch up with him, he'll have to decide if winning is all that matters, or if he's finally ready to face the rules, bullies, and truths he's been avoiding.\n\nMiddle School: Get Me Out of Here! (Middle School #2) by James Patterson (May 7th 2012)\n\nAfter sixth grade, the very worst year of his life, Rafe Khatchadorian thinks he has it made in seventh grade. He's been accepted to art school in the big city and imagines a math-and-history-free fun zone.Wrong! It's more competitive than Rafe ever expected, and to score big in class, he needs to find a way to turn his boring life into the inspiration for a work of art. His method? Operation: Get a Life! Anything he's never done before, he's going to do it, from learning to play poker to going to a modern art museum. But when his newest mission uncovers secrets about the family Rafe's never known, he has to decide if he's ready to have his world turned upside down.\n\nMiddle School: My Brother Is a Big, Fat Liar (Middle School #3) by James Patterson (March 18th 2013)\n\nGeorgia Khatchadorian plans to excel at Hills Village Middle School in all the places her troublemaking brother failed. She's even bet him that she'll quickly become one of the most popular girls in school. But Rafe left a big mark at HVMS, and no one will give Georgia a chance! Even worse, Rafe has sneakily signed up her band to play at the school dance, and she's terrified to embarrass herself in front of the snooty &quot;Princesses&quot; who run the school and the boy who's caught her eye. \n\nWill she be able to overcome her fears and win her bet with Rafe? Find out THE TRUTH about Rafe Khatchadorian's sister in the first Middle School story from the point of view of the hilarious Georgia--a girl who's ready to speak her mind!\n\nMiddle School: How I Survived Bullies, Broccoli, and Snake Hill (Middle School #4) by James Patterson (June 24th 2013)\n\nRafe Khatchadorian, the hero of the bestselling Middle School series, is ready for a fun summer at camp--until he finds out it's a summer school camp! Luckily, Rafe easily makes friends with his troublemaking cabin mates and bunkmate, a boy nicknamed Booger-Eater, who puts up with endless teasing from the other kids. Rafe soon realizes there's more to a person than a nickname, though, and Booger-Eater might be the kind of friend you want on your side when the boys from the Cool Cabin attack. \n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:bd87a901d6a0fb646fdaedce1b0951c3f523ea6e","amp;dn":"Middle+School+Series+%281-4%29+by+James+Patterson+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd87a901d6a0fb646fdaedce1b0951c3f523ea6e","infoHashBuffer":{"type":"Buffer","data":[189,135,169,1,214,160,251,100,111,218,237,206,27,9,81,195,245,35,234,110]},"announce":[],"urlList":[]}}