{"title":"Infinity and perspective (Philosophy Art Ebook).pdf","uid":9621306,"size":2783066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdd3c555ce8aa37ff65cb49140c059aabfd3d937&amp;dn=Infinity+and+perspective+%28Philosophy+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1392502127,"description":"Karsten Harries, &quot;Infinity and Perspective&quot; \n2001 | ISBN: 0262082926, 026258218X | 368 pages | PDF | 2,7 MB\n\nBronze Award Winner for Philosophy in the ForeWord Magazine Book of the Year Awards.\n\nMuch postmodern rhetoric, suggests Karsten Harries, can be understood as a symptom of our civilization's discontent, born of regret that we are no longer able to experience our world as a cosmos that assigns us our place. But dissatisfaction with the modern world may also spring from a conviction that modernism has failed to confront the challenge of an inevitably open future. Such conviction has frequently led to a critique of modernity's founding heroes. Challenging that critique, Harries insists that modernity is supported by nothing other than human freedom.\n\nBut more important to Harries is to show how modernist self-assertion is shadowed by nihilism and what it might mean to step out of that shadow. Looking at a small number of medieval and Renaissance texts, as well as some paintings, he uncovers the threshold that separates the modern from the premodern world. At the same time, he illuminates that other, more questionable threshold, between the modern and the postmodern.\n\nTwo spirits preside over the book: Alberti, the Renaissance author on art and architecture, whose passionate interest in perspective and point of view offers a key to modernity; and Nicolaus Cusanus, the fifteenth-century cardinal, whose work shows that such interest cannot be divorced from speculations on the infinity of God. The title Infinity and Perspective connects the two to each other and to the shape of modernity.","torrent":{"xt":"urn:btih:bdd3c555ce8aa37ff65cb49140c059aabfd3d937","amp;dn":"Infinity+and+perspective+%28Philosophy+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd3c555ce8aa37ff65cb49140c059aabfd3d937","infoHashBuffer":{"type":"Buffer","data":[189,211,197,85,206,138,163,127,246,92,180,145,64,192,89,170,191,211,217,55]},"announce":[],"urlList":[]}}