{"title":"Victor Borge Classic Collection (all 6 DVDs) Standup Musical Com","uid":6581547,"size":3992639608,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be4ef82d356df3240ded21de54e1bd2b0ca647ce&amp;dn=Victor+Borge+Classic+Collection+%28all+6+DVDs%29+Standup+Musical+Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1312434238,"description":"All DVDs ripped to Xvid AVI, no subtitles, highest resolution allowed by DVDFab. \n\nVideo Codec..........: XviD ISO MPEG-4 \nVideo Bitrate........: 1097kbps \nDuration.............: 1:15:21\nResolution...........: 600*456 \nFramerate............: 29.970 \nAudio Codec..........: 0x2000 (Dolby AC3) AC3 \nAudio Bitrate........: 192 kbps CBR \nAudio Channels.......: 2 \n\nProduct Details\nFormat: Box set, Classical, Color, DVD, NTSC\nLanguage: English\nRegion: All Regions\nAspect Ratio: 1.33:1\nNumber of discs: 6\nRated: NR (Not Rated)\nStudio: Questar\nDVD Release Date: November 18, 2008\nRun Time: 412 minutes\n &lt;a href=&quot;\nhttp://bayimg.com/EajNAAAdg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EajNAAAdg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Victor-Borge-Classic-Collection/dp/B001GLLLFK/ref=pd_cp_mov_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Victor-Borge-Classic-Collection/dp/B001GLLLFK/ref=pd_cp_mov_1&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Victor_Borge&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Victor_Borge&lt;/a&gt;\n\n\nEditorial Reviews\n\nAuthorized by Victor Borges family, this Smorges-Borge of classic comedy gathers The Great Danes most popular PBS specials and television rarities: The Best of Victor Borge Acts One &amp; Two; The Legendary Victor Borge; Victor Borges Funniest Moments; Victor Borge: Then &amp; Now; Lost Episodes of Victor Borge, Volume One; and Lost Episodes of Victor Borge, Volume Two. One of the worlds most beloved entertainers, Borge delighted audiences young and old with his unique blend of classical music and hilarious comedy. This ultimate collection contains all of Borges essential routines and greatest hits, including Phonetic Punctuation, The Timid Page Turner, The Opera Singer, and Inflationary Language.\n\n\nBBC Obituary on Victor Borge (1909-2000)\n\nVictor Borge: The Great Dane\n \nBorge was showered with awards throughout his life\nVictor Borge built a career by delighting audiences with virtuoso piano-playing and paralysing them with laughter at his irreverence towards the pomposity of classical music. A typical performance would start, not with the opening bars of a classical composition, but with a minute inspection of the piano from all angles. Pages of sheet music would get mixed up, hair and clothing would be checked and then the pianist would turn on the audience and scold imaginary latecomers.\n\nIt was Borge's opinion that the conventions and trappings of classical music were intrinsically hilarious.\n\n&quot;Look at a symphony concert on TV and turn off the sound. If you have the slightest sense of humour, you will laugh yourself silly - the musicians look and act absolutely ridiculous.&quot;\n\nMuch of his repetoire was developed from real concert situations, for instance falling off a piano stool or falling out with his page turner.\n\n&quot;Everybody who has ever tried to have a page turner knows it is terribly dangerous,&quot; he said.&quot;So, when I do that routine, the orchestra members just fall off their seats. They all know. \n\nBut one famous occasion could not be replicated, when a large fly flew on to Borge's nose while he was playing - with side-splitting consequences.When he was asked how he had arranged such a brilliant piece of comedy, Borge explained with a straight face: &quot;Well, we train flies.&quot;\n\nHe began has career at the age of 17 as a concert pianist in his native Denmark, becoming one of the country's most popular cabaret performers in the 1930s.\n\nHis lampooning of Adolf Hitler provoked the ire of Germany long before the Nazis invaded Denmark in April 1940. Fortunately, the young Victor, whose Jewish faith compounded the danger he would have been in, was performing in Sweden at the time.\n\n&quot;Churchill and I were the only ones who saw what was happening,&quot; he said in later years. &quot;He saved Europe and I saved myself.&quot;\n\nHe fled to the US with just $20, but enjoyed a rapid rise in popularity after an appearance on the Bing Crosby radio show.\n\nIn the 1950s, he went on to beat the Broadway record for a solo show - 849 performances of his Comedy in Music.\n\nAs well as his commercial success - including his three million-selling Best of Victor Borge - he was honoured many times, most notably receiving a Kennedy Center award for his outstanding contribution to American cultural life in 1999 from President Bill Clinton.\n\nInsecure funny man\n\nIn spite of his skills as a musician, Borge insisted that he got very nervous if he had to play anything &quot;straight&quot;.\n\n&quot;It's the fact that you want to do your best, but you are not at your best because you are nervous and knowing that makes you even more nervous,&quot; he said.\n\nIndeed, at his 80th birthday concert at Copenhagen's Tivoli gardens, Borge played variations on the theme of Happy Birthday to You in the styles of Mozart, Brahms, Wagner and Beethoven.\n\nThese were executed with such wit that the orchestra was convulsed with laughter - and a woman performing a piccolo solo was unable to draw breath to play.\n &lt;a href=&quot;\nhttp://news.bbc.co.uk/2/hi/entertainment/1085722.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://news.bbc.co.uk/2/hi/entertainment/1085722.stm&lt;/a&gt;","torrent":{"xt":"urn:btih:be4ef82d356df3240ded21de54e1bd2b0ca647ce","amp;dn":"Victor+Borge+Classic+Collection+%28all+6+DVDs%29+Standup+Musical+Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4ef82d356df3240ded21de54e1bd2b0ca647ce","infoHashBuffer":{"type":"Buffer","data":[190,78,248,45,53,109,243,36,13,237,33,222,84,225,189,43,12,166,71,206]},"announce":[],"urlList":[]}}