{"title":"Exploring The World Book Series - John Hudson Tiner","uid":11773214,"size":18574899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bed6e78463a6b6cea13f9f22f3d74673fd192539&amp;dn=Exploring+The+World+Book+Series+-+John+Hudson+Tiner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":5,"time":1427158310,"description":"\nTake a comprehensive survey of science with this five-book set! Whether setting the stage for advanced courses or doing an important review of concepts, these books are designed to teach a lot of information in a very concise way! Go beyond just the facts to meet the scientists and scholars who discovered and successfully paired a search for truth with solid Christian worldviews!\n\nAbout the author:\nJohn Hudson Tiner received five National Science Foundation teaching fellowships during his 12 years of teaching science and mathematics. He is a graduate of chemistry at the College of the Holy Cross (Massachusetts), graduate of astronomy at Sam Houston State University (Texas), and a graduate of mathematics at Duke University (NC). He also worked as a mathematician and cartographer for the Defense Mapping Agency, Aerospace Center (St. Louis).\n\nToday, Tiner is a full-time writer. His popular non-fiction books tell their stories through the lives of people who left the world in a better condition than they found it. He says, ?After the research is finished, a wonderful moment occurs when the story takes over and the characters come alive. No longer am I a writer, but a time traveler who stands unobserved in the shadows and reports the events as they occur.?\n\nHe has received numerous honors for his writing, including the Missouri Writer's Guild award for best juvenile book for Exploring the World of Chemistry, which was also published by Master Books.\n\nHis material has been translated into a variety of languages including Spanish, Russian, and German","torrent":{"xt":"urn:btih:bed6e78463a6b6cea13f9f22f3d74673fd192539","amp;dn":"Exploring+The+World+Book+Series+-+John+Hudson+Tiner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bed6e78463a6b6cea13f9f22f3d74673fd192539","infoHashBuffer":{"type":"Buffer","data":[190,214,231,132,99,166,182,206,161,63,159,34,243,215,70,115,253,25,37,57]},"announce":[],"urlList":[]}}