{"title":"Marvel NOW Week 92 (8-20-2014) (darkhomr) [ALL]","uid":10829109,"size":687137322,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bf1744fb9ea46dc1fba50d5d2d4b252fe6cd70d9&amp;dn=Marvel+NOW+Week+92+%288-20-2014%29+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dadrkhomr","files":-1,"time":1408603416,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 91 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, Ultimate Universe, and kids books. Those will be included (when available) in my Total Marvel pack.\n\n\n\nThis weeks' release (August 20, 2014) includes 16 issues with 1 new #1s (Wolverine Annual) \n\n\n\n\nMy release packs are as follows: \n\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\nAll New Ghost Rider #6 (CBR 8/20/2014)\n\n'LEGEND' GHOST RIDER has become a local hero Can ROBBIE REYES resist the call of street racing? Who is the mysterious figure who takes an interest in the new Ghost Rider? \n\nAll New X-Factor #12 (CBR 8/20/2014)\n\nServal holds an X-Factor press conference! Everything should be fine. It's not like any of the members have secrets, right? \n\nDaredevil #7 (CBR 8/20/2014)\n\nORIGINAL SIN TIE-IN! The man without fear braves the wilds of Wakanda! And the truth behind Matt's mother's greatest sin is finally revealed. \n\nDeadly Hands Of Kung Fu #4 (of 4) (CBR 8/20/2014)\n\nTHE STUNNING CONCLUSION! The shocking truth of Leiko Wu's murder revealed! Shang-Chi's epic showdown with the enemy he never saw coming! The jaw-dropping final twist of the knife that NO ONE will see coming! \n\nDeadpool vs. X-Force #3 (of 4) (CBR 8/20/2014)\n\nCan X-Force stop Deadpool from rewriting history? Cable chases the M w/the M to the Boxer Rebellion to try! Plus: did you know there is a character named 'Boom Boom'? \n\nElektra #5 (CBR 8/20/2014)\n\nThe critically-acclaimed and captivating story of Elektra's search for redemption reaches a bloody climax. Legendary assassins go head to head at the edge of the world, but it looks like Elektra's soul is right at Death's door. \n\nMagneto #8 (CBR 8/20/2014)\n\nMAGNETO was once arguably the most powerful mutant on the planet. But after his latest tenure with the X-Men, his powers have been reduced to a whisper of what they once were. Maddened by the fact that he struggles to safeguard mutantkind in uncertain times yet his own mutant gift wavers, to what lengths will Magneto go to become the Master of Magnetism once more? \n\nMighty Avengers #13 (CBR 8/20/2014)\n\nUnlucky for some! The moon is full, the sacrifice is ready, and the Deathwalkers are about to end humanity as we know it! The Mighty Avengers get a new member - but is that enough to stop the Four Who Rule attaining godhood? Or... is it already too late to save the Earth? \n\nMs Marvel #7 (CBR 8/20/2014)\n\nKamala may be fan-girling out when her favorite (okay maybe Top Five) super hero shows up for some help, but that won't stop her from protecting her hometown. Who is the Inventor, and what does he want with Kamala and all her friends? Maybe Wolvie can be of some help. 'If you're not reading Ms. Marvel, you're missing out on one of the best series out there.' --Says Almost Everybody \n\nNew Avengers #23 (CBR 8/20/2014)\n\n'OF ALL THAT WE ONCE WERE' We follow the members of the now-broken Illuminati through their last day on Earth. \n\nNova #20 (CBR 8/20/2014)\n\nORIGINAL SIN tie-in! GUEST-STARRING ROCKET RACCOON! The secrets of the Black Novas and Sam Alexander's dad have been revealed. Sam's world is torn apart, but can he come out of this stronger? \n\nOriginal Sins #5 (of 5) (CBR 8/20/2014)\n\nThe Young Avengers' battle with the Hood reaches its climax! The prime mover behind the Watcher's murder confesses his own Original Sin!Plus, Everybody's Got One! Find out the Original Sins and hidden secrets of dozens of other Marvel heroes and villains! \n\nSavage Wolverine #22 (CBR 8/20/2014)\n\nJohn Arcudi brings Logan's World War I story to a conclusion! Logan finds himself at the business end of 20 Germans soldiers' guns-for anyone else that might be a challenge! \n\nSecret Avengers #7 (CBR 8/20/2014)\n\n'EXECUTIVE DECISION' DEADPOOL DEADPOOL DEADPOOL DEADPOOL DEADPOOL! WE HEARD THAT DEADPOOL RAISES SALES SO WE'RE DOING THIS EARLY ON. JUST KIDDING. ALL ABOUT THE ART. YOU'RE GOING TO PAY FOR THIS, RIGHT? THE NOOSE: TIGHTENS! SECRET AVENGERS: HUNTED! MARIA HILL: INVESTIGATING! ALSO DEADPOOL! \n\nStorm #2 (CBR 8/20/2014)\n\nSTORM is on a mission to use her extraordinary powers for the betterment of not just mutantkind, but the entire world. When wayward youth start disappearing from the streets of New York, Storm is reminded of her own past as a thief and decides to investigate. But little does she suspect that the culprit behind the disappearances is one of her oldest foes: CALLISTO! \n\nWolverine Annual #1 (CBR 8/20/2014)\n\nONE MONTH TO DIE! A little Father/Adoptive Daughter/Adoptive Daughter's son time. Now that's a mouthful. Wolverine and Jubilee take Shogo on a camping trip. Hey, it's a Wolverine story in the middle of the wilderness. What could go wrong? \n","torrent":{"xt":"urn:btih:bf1744fb9ea46dc1fba50d5d2d4b252fe6cd70d9","amp;dn":"Marvel+NOW+Week+92+%288-20-2014%29+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1744fb9ea46dc1fba50d5d2d4b252fe6cd70d9","infoHashBuffer":{"type":"Buffer","data":[191,23,68,251,158,164,109,193,251,165,13,93,45,75,37,47,230,205,112,217]},"announce":[],"urlList":[]}}