{"title":"Fritz Henle - In Search of Beauty (Photography Art Ebook).pdf","uid":8589342,"size":15021190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf61312ff96ac7daf220f63198906152ede4dd88&amp;dn=Fritz+Henle+-+In+Search+of+Beauty+%28Photography+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STBGD","files":-1,"time":1371599992,"description":"Fritz Henle: In Search of Beauty (Harry Ransom Center Photography Series) by Roy Flukinger and Fritz Henle\nEnglish | 2009 | ISBN: 0292719728 | ISBN-13: 9780292719729 | 228 pages | PDF | 14,3 MB\n\nPraised as &quot;the last classic freelance photographer&quot; by photohistorian Helmut Gernsheim and as &quot;a true 'Old Master' of the reflex camera&quot; by critic Norman Rothschild, Fritz Henle (1909-1993) was one of the greatest photographers of the mid-twentieth century. \n\nUnlike most of his peers who specialized in a particular genre or style of photography, Henle ranged widely and successfully across many genres, including documentary, travel, fashion, commercial, portrait, celebrity, avant-garde, nude, industrial, landscape, and inspirational, to name only a few. He championed the square format photography of the Rolleiflex twin-lens reflex camera, becoming known later in life as &quot;Mr. Rollei.&quot; A master craftsman renowned for exceptional technique and extraordinary composition, Henle was a prolific artist who published more than twenty books of his work, from This Is Japan (1937) to Casals (1975). Beyond his mastery of the craft, however, Henle was driven by a lifelong urge &quot;to show people beauty.&quot; &quot;I am obsessed,&quot; he said, &quot;by showing them beauty.&quot;\n\nThis volume is the catalogue of a major retrospective exhibition of the life and career of Fritz Henle staged by the Harry Ransom Center at the University of Texas at Austin. It covers the entire range of Henle's work, including significant items from the photographer's archive and family. The catalogue reproduces 127 of Henle's black-and-white and color photographs, which illustrate Henle's mastery of both media. Curator Roy Flukinger's text covers the full arc of Henle's career, from his early training in Germany to his prewar travels and photography in the Mediterranean, India, China, and Japan; his freelance work for LIFE magazine; his fashion editorials for Harper's Bazaar, Mademoiselle, and Town and Country; and his later photography and books of photographs of Mexico, Hawaii, Europe, and his final home, the U.S. Virgin Islands. An extensive bibliography of Henle's publications and exhibitions, collections that own his work, and critical commentary on Henle's photography completes this volume.","torrent":{"xt":"urn:btih:bf61312ff96ac7daf220f63198906152ede4dd88","amp;dn":"Fritz+Henle+-+In+Search+of+Beauty+%28Photography+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf61312ff96ac7daf220f63198906152ede4dd88","infoHashBuffer":{"type":"Buffer","data":[191,97,49,47,249,106,199,218,242,32,246,49,152,144,97,82,237,228,221,136]},"announce":[],"urlList":[]}}