{"title":"Thorium Energy Cheaper than Coal (rev 2)","uid":8042295,"size":20645400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfb8948bcbd4da56ca0c5f712d71e4292d0d7bea&amp;dn=Thorium+Energy+Cheaper+than+Coal+%28rev+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Freeflow123","files":4,"time":1358660140,"description":"Title:  Thorium: Energy Cheaper than Coal\nAuthor: Robert Hargraves\n    Published: July 25, 2012\n    Paperback: 482 pages\n    Publisher: CreateSpace Independent Publishing Platform (July 25, 2012)\n    Language: English\n    ISBN-10: 1478161299\n    ISBN-13: 978-1478161295\n    \nTable of Contents: \n  1. Introduction\n        The story of fire, astonishing benefits of nuclear energy, energy and environment\n        issues are harsh, a market-based environmental solution. \n  2. Energy and Civilization\n        Energy, electricity, work and heat, life, humans, civilization, energy and civilization\n        summary. \n  3. An Unsustainable World\n        Global warming, new energy technology, liquid flouride thorium reactor.\n  4. Energy Sources\n        Energy demand, generation capacity, coal, natural gas, wind solar, intermittent wind and \n        solar power, solid biofuels, liquid biofuels, energy storage, hydroelectric power, \n        energy conservation, other electricity sources.\n  5. Liquid Flouride Thorium Reactor (LFTR)\n        Pressurized water reactors, liquid-fuel nuclear reactors, LFTR advantages and flexibility,\n        denatured molten salt reactor, pebble bed molten-salt-cooled reactor, \n        energy cheaper than coal, LFTR development engineering, LFTR development tasks, \n        developers, United States, China, France, other emerging LFTR developers, \n        contenders, NGNP, Westinghouse AP1000, Small Modular Reactors, Liquid Metal Fast\n        Breeder Reactors, Accelerator-driven subcritical reactor, LFTR advantages. \n  6. Safety\n        Accidents, ionizing radiation, waste, weapons proliferation\n  7. A Sustainable World\n        Coal power replacement, shiopping, oil, synthetic liquid vehicle fuels, \n        ammonia, nuclear cement, hydrogen, water and desalinization, population stability.\n  8. Energy Policy\n        Energy policy recommendations, Thorium: Energy Cheaper than Coal. \n\n\nBook Description\nPublication Date: July 25, 2012\nThorium energy can help check CO2 and global warming, cut deadly air pollution, provide \ninexhaustible energy, and increase human prosperity. Our world is beset by global warming, \npollution, resource conflicts, and energy poverty. Millions die from coal plant emissions. \nWe war over mideast oil. Food supplies from sea and land are threatened. Developing nations' \ngrowth exacerbates the crises. Few nations will adopt carbon taxes or energy policies \nagainst their economic self-interests to reduce global CO2 emissions. Energy cheaper \nthan coal will dissuade all nations from burning coal. Innovative thorium energy uses \neconomic persuasion to end the pollution, to provide energy and prosperity to developing \nnations, and to create energy security for all people for all time. &quot;This book presents \na lucid explanation of the workings of thorium-based reactors. It is must reading for \nanyone interested in our energy future.&quot; Leon Cooper, Brown University physicist and \n1972 Nobel laureate for superconductivity &quot;As our energy future is essential I can \nstrongly recommend the book for everybody interested in this most significant topic.&quot; \nGeorge Olah, 1994 Nobel laureate for carbon chemistry\n\nFormat: Single file PDF, multiple screen captures from tablet in portrait view, \n        assembled into a single linear PDF file. 169 MBytes.\n","torrent":{"xt":"urn:btih:bfb8948bcbd4da56ca0c5f712d71e4292d0d7bea","amp;dn":"Thorium+Energy+Cheaper+than+Coal+%28rev+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb8948bcbd4da56ca0c5f712d71e4292d0d7bea","infoHashBuffer":{"type":"Buffer","data":[191,184,148,139,203,212,218,86,202,12,95,113,45,113,228,41,45,13,123,234]},"announce":[],"urlList":[]}}