{"title":"Within Arm's Length: A Secret Service Agent Dan Emmett Audiobook","uid":11196680,"size":291198969,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c07c2ddaefe542b37fe00d8a030a5019803ae5ea&amp;dn=Within+Arm%27s+Length%3A+A+Secret+Service+Agent+Dan+Emmett+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413101211,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nWithin Arm's Length: A Secret Service Agent's Definitive Inside Account of Protecting the President\n\nWritten by: Dan Emmett\nNarrated by: Kevin Foley\nLength: 10 hrs and 3 mins\nUnabridged Audiobook\nRelease Date:08-26-14\n\nDan Emmett was just eight years old when President John F. Kennedy was assassinated. The events surrounding the president's death shaped the course of young Emmett's life as he set a goal of becoming a U.S. Secret Service agent-one of a special group of people willing to trade their lives for that of the president, if necessary. Within Arm's Length is a revealing and compelling inside look at the Secret Service and the elite Presidential Protective Division (PPD). Using stories from some of the author's more high-profile assignments in his twenty-one years of service, Emmett describes the professional, physical, and emotional challenges faced by Secret Service agents. Included are never-before-discussed topics such as the complicated relationship between presidents, first ladies, and their agents; the inner workings of Secret Service protective operations; and the seldom-mentioned challenges of the complex Secret Service cultural issues faced by an agent's family.","torrent":{"xt":"urn:btih:c07c2ddaefe542b37fe00d8a030a5019803ae5ea","amp;dn":"Within+Arm%27s+Length%3A+A+Secret+Service+Agent+Dan+Emmett+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07c2ddaefe542b37fe00d8a030a5019803ae5ea","infoHashBuffer":{"type":"Buffer","data":[192,124,45,218,239,229,66,179,127,224,13,138,3,10,80,25,128,58,229,234]},"announce":[],"urlList":[]}}