{"title":"Scrap Mechanic v0.1.16","uid":13381083,"size":365183459,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c09779152e191f6d2dff3bc527fd31540868c31e&amp;dn=Scrap+Mechanic+v0.1.16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dauphong","files":1,"time":1454279168,"description":"Scrap Mechanic is an all-new creative multiplayer sandbox game which drops you right into a world where you quite literally engineer your own adventures! Choose from the 100+ building parts you have at your disposal and create anything from crazy transforming vehicles to a house that moves. You’re even able to team up with your friends to create amazing things together: in Scrap Mechanic, you’re the master creator of anything you can imagine!\r\n\r\nHere’s the deal: you’re a robot maintenance mechanic en route to your posting on a fully-automated agriculture planet. Your job is to take care of the worker robots as they work the land, sending the food they produce to the metropolitan planets. Thing is, close to touchdown your spacecraft loses control and crashes, but since you’ve got luck on your side (erm…), you survive! You’re stranded though, and at first glance you find that not everything’s quite as it should be. The Farmbots working the fields have gone crazy, and now there’s only one way to stay alive: using your quick thinking, your creativity and your wily knack of turning your surroundings to your advantage","torrent":{"xt":"urn:btih:c09779152e191f6d2dff3bc527fd31540868c31e","amp;dn":"Scrap+Mechanic+v0.1.16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c09779152e191f6d2dff3bc527fd31540868c31e","infoHashBuffer":{"type":"Buffer","data":[192,151,121,21,46,25,31,109,45,255,59,197,39,253,49,84,8,104,195,30]},"announce":[],"urlList":[]}}