{"title":"Oracle Solaris 11 Express 2010.11 LiveCD for x86","uid":5998836,"size":720377856,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:c0a3693933a3376e1bf4e933336ee4ba04c6ad1b&amp;dn=Oracle+Solaris+11+Express+2010.11+LiveCD+for+x86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"silverblue74","files":1,"time":1291114909,"description":"Oracle Solaris 11 Express 2010.11 LiveCD for x86\n\n\nProduction ready release delivering leading operating system technology innovation to improve availability, efficiency, scalability, performance, and security in the data center.\n\nOracle Solaris 11 Express raises the bar on the functionality introduced in Oracle Solaris 10, continuing Oracle's leadership for providing the best choice for mission critical operating system enterprise environments. With new features such as network based package management tools to greatly decrease planned system downtime and provide for a complete safe system upgrade, built-in network virtualization and delegated administration for an unprecedented level of flexibility for application consolidation, and continued leadership for providing the highest levels of security, Oracle Solaris 11 Express is the most exciting release of the Oracle Solaris platform to date.\n\nOracle Solaris 11 Express is fully tested and supported on a variety of SPARC and x86-based systems from Oracle, including the Exadata Database machine and Exalogic Elastic Cloud, and other hardware platforms from 3rd party vendors.\n\nThe LiveCD provides administrators with an opportunity to explore the Oracle Solaris 11 Express environment without installing it on a system. The system boots off the media directly allowing administrators to start the installer should they choose to install it to a system.","torrent":{"xt":"urn:btih:c0a3693933a3376e1bf4e933336ee4ba04c6ad1b","amp;dn":"Oracle+Solaris+11+Express+2010.11+LiveCD+for+x86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a3693933a3376e1bf4e933336ee4ba04c6ad1b","infoHashBuffer":{"type":"Buffer","data":[192,163,105,57,51,163,55,110,27,244,233,51,51,110,228,186,4,198,173,27]},"announce":[],"urlList":[]}}