{"title":"Masters of the Battlefield: Great Commanders (2014) epub","uid":10303738,"size":25808757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0e462cfb1d3946b58a09c4dd96b2d05a2e44046&amp;dn=Masters+of+the+Battlefield%3A+Great+Commanders+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1402007851,"description":"Masters of the Battlefield: Great Commanders From the Classical Age to the Napoleonic Era\n\n\n &quot;The personality of a general is indispensable,&quot; Napoleon once said. &quot;He is the head, he is the all, of an army.&quot; In Masters of the Battlefield, Paul K. Davis offers vivid portraits of fifteen legendary military leaders whose brilliance on and off the battlefield embody this maxim. Hailing from the earliest days of Greek warfare to France at the turn of the nineteenth century, these men stand out for their tactical abilities--generals who made a difference in combat, grasping the way an enemy would think or move and reacting not just to ensure victory, but do so in the face of superior forces. \n\n Among the leaders discussed in this encompassing work of military history are Alexander the Great, Hannibal, Scipio Africanus, Belisarius, Chinggis Khan, Oda Nobunaga, the Duke of Wellington, and Napoleon Bonaparte. Davis briefly explores the biography of each commander, considering how his upbringing, early experiences, and social and cultural background might have translated into his leadership abilities. Relying on vast research, Davis describes the nature of armies and warfare of the time, from the phalanx battle of Ancient Greece to the artillery-heavy Swedish army under Gustavus Adolphus. He also examines the course of the wars in which each general fought as a background to the particular battles that best illustrates their abilities, and discusses each battle in detail, aided extensively by detailed battlefield maps. Davis concludes each section with an analysis of the tactical skills and principles at which each general excelled. In analyzing these remarkable leaders, Davis offers a picture of warfare throughout history, and shows this history to be directed--and oftentimes wholly decided--by the abilities of a single man. \n\n Masters of the Battlefield tells the stories of men who defined eras, reshaped nations, and who, through the introduction of new weapons and tactics, revolutionized the nature of warfare.\n","torrent":{"xt":"urn:btih:c0e462cfb1d3946b58a09c4dd96b2d05a2e44046","amp;dn":"Masters+of+the+Battlefield%3A+Great+Commanders+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e462cfb1d3946b58a09c4dd96b2d05a2e44046","infoHashBuffer":{"type":"Buffer","data":[192,228,98,207,177,211,148,107,88,160,156,77,217,107,45,5,162,228,64,70]},"announce":[],"urlList":[]}}