{"title":"Registry Workshop v5.0","uid":13243664,"size":13149025,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c1171969cb28344dd46fe9881810dd3911c8c5be&amp;dn=Registry+Workshop+v5.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZarkBit","files":1,"time":1453074867,"description":"Registry Workshop v5.0\r\n\r\nVersion 5.0.0 (January 15, 2016)\r\n    Added High DPI Support on Windows 8.1 and Windows 10.\r\n    Removed support for Windows 2000.\r\n    Added support for closing a registry tab by double clicking on it.\r\n    Minor improvements and fixes.\r\n\r\n\r\nRegistry Workshop is an advanced registry editor. It is a perfect replacement for RegEdit and RegEdt32 which shipped with Windows.\r\nIn addition to all the standard features, Registry Workshop adds a variety of powerful features that allow you to work faster and more efficiently with registry related tasks.\r\nWith Registry Workshop, registry editing becomes more safe than ever before. All changes except changing key permissions can be safely reversed (even registry replacing and importing), using multiple levels of Undo. You don't need to worry about making mistakes when editing registry.\r\nWhether you are an advanced user who needs to edit and modify your registry to remove trojan, virus, and spyware entries, a system administrator who needs a safer, more efficient tool to maintain your company's PCs, or a software developer who needs to quickly manipulate registry keys and values during system development, Registry Workshop has the tools that you need.\r\n\r\nKey Features\r\n    Multiple undo and redo. The undo history can be saved to disk and reloaded at startup. screen shot\r\n    Search and replace registry keys, values and data with super fast search algorithm. On a typical PC, you can search the entire registry in about ten seconds! screen shot\r\n    Compare registry between computers and/or .REG files with super fast speed.\r\n    Connect mobile device (Pocket PC, SmartPhone, etc.) registry via ActiveSync.\r\n    Cut, copy and paste registry keys and values.\r\n    Drag and drop to move or copy registry keys and values.\r\n    Edit .REG files and .POL files in the same way as editing system registry. screen shot\r\n    Backup and restore registry. screen shot\r\n    Defragment registry with preview. screen shot\r\n    Easy and flexible Favorites management.\r\n    Quickly browse registry with address bar, bookmarks and visitation history.\r\n    Support of linkage aware ability. You can use context menu to navigate to referenced key, open containing folder or open URL if the key or value contains a ProgID, ClassID, folder, file path or URL.\r\n    Jump to the same key in HKLM or HKCU by context menu.\r\n    Allow to open multiple local registry windows.\r\n    Allow to open secure registry keys when running under the administrator privilege.\r\n    Edit binary data in BYTE, WORD or DWORD format","torrent":{"xt":"urn:btih:c1171969cb28344dd46fe9881810dd3911c8c5be","amp;dn":"Registry+Workshop+v5.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1171969cb28344dd46fe9881810dd3911c8c5be","infoHashBuffer":{"type":"Buffer","data":[193,23,25,105,203,40,52,77,212,111,233,136,24,16,221,57,17,200,197,190]},"announce":[],"urlList":[]}}