{"title":"BBC.A.Year.at.Kew.Season.Two.02of10.Gardens.Closed.XviD.AC3..avi","uid":7077559,"size":393134080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c187efa958c72c305f2f1b8bb93e1dd5572a3fbe&amp;dn=BBC.A.Year.at.Kew.Season.Two.02of10.Gardens.Closed.XviD.AC3..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1330905277,"description":"BBC - A Year at Kew: Season Two (2009)\n\n\n\nInformation\nA Year at Kew: Series Two\nFormer student of Kew's School of Horticulture, Alan Titchmarsh, narrates this story of a year behind-the-scenes at The Royal Botanic Gardens, Kew. This UNESCO World Heritage site attracts over a million visitors each year, all eager to enjoy the beautiful gardens and magnificent glasshouses. This second series also visits Kew's country estate, Wakehurst Place, where rare creatures and plants make their home in protected woodlands and ventures as far a field as Burkino Faso and Mali where the seed collectors from the Millennium Seedbank are keen to catalogue existing plants and find new species. Back in the gardens there is a royal visit to prepare for when Her Majesty the Queen helps the gardens celebrate their World Heritage Site status although disaster strikes before the visit of Prince Charles and Prince Turki of Saudi Arabia when bad weather forces the gardens to close for the first time in 15 years There is also a unique insight into the pioneering work which is carried out in the laboratories. Each episode introduces some of the gardens monthly highlights and problems which all fall within the daily duties of Kews dedicated team of experts. These include preparing for the controversial Chihuly exhibition, creating an authentic Zen garden, a marathon pruning session and feeding the carnivorous plants.\n\nPart 2: Gardens Closed\nDisaster stikes as bad weather forces the gardens to close for the first time in 15 years. This hampers preparations for the visit of Prince Charles and Prince Turki of Saudi Arabia as they arrive to plant some new palm trees. Kath King explains her feeding regimes for the carnivorous plant collection and the display team have some leaf cutter ants to deal with.\n\nTechnical Specs\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1665 kbps\nVideo Resolution: 720 x 400\nVideo Aspect Ratio: 1.800 (16:9)\nFrames Per Second: 25\nAudio Codec: 0x2000 (Dolby AC3)\nAudio Bitrate: 128 kb/s AC3 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime Per Part: 29.Mins\nNumber Of Parts: 10\nPart Size: 370 MB\nEncoded by: Harry65\nSource: DVD\t","torrent":{"xt":"urn:btih:c187efa958c72c305f2f1b8bb93e1dd5572a3fbe","amp;dn":"BBC.A.Year.at.Kew.Season.Two.02of10.Gardens.Closed.XviD.AC3..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c187efa958c72c305f2f1b8bb93e1dd5572a3fbe","infoHashBuffer":{"type":"Buffer","data":[193,135,239,169,88,199,44,48,95,47,27,139,185,62,29,213,87,42,63,190]},"announce":[],"urlList":[]}}