{"title":"Teenage Fanclub - Grand Prix [1995]","uid":9452070,"size":305133640,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c1f5b035c9079cc84c93f09219ff1e5d1423795d&amp;dn=Teenage+Fanclub+-+Grand+Prix+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389199116,"description":"For all of the brilliance of records like Bandwagonesque and the underrated Thirteen, at times Teenage Fanclub seemed little more than a showcase for the laconic melodic genius of Norman Blake -- fairly or not, the songwriting contributions of bandmates Gerard Love and Raymond McGinley suffered mightily by comparison, mere filler when stacked alongside Blake-penned marvels like &quot;The Concept&quot; and &quot;Norman 3.&quot; That said, the superb Grand Prix is perhaps the truest group effort in the Fannies' catalog -- more than ever before, their democratic approach truly bears fruit, and it's indicative of the disc's uniform excellence that the first Blake composition, the lovely &quot;Mellow Doubt,&quot; doesn't even surface until track three, by which time McGinley's &quot;About You&quot; and Love's harmony-rich &quot;Sparky's Dream&quot; have already firmly established the set's ragged-but-right tenor. While new drummer Paul Quinn fails to recreate the buoyantly reckless abandon of the sacked Brendan O'Hare, Grand Prix otherwise captures complete creative synergy -- in particular, &quot;Don't Look Back&quot; is Love's watershed moment, a gorgeously wistful love song highlighted by wittily lovelorn lyrics like &quot;I'd steal a car to drive you home,&quot; as good a pick-up line as anything in the annals of rock &amp; roll. Not everything works (McGinley's &quot;Verisimilitude&quot; goes nowhere fast) and Blake's contributions are still the highlights (&quot;Neil Jung&quot; and &quot;I'll Make It Clear&quot; are simply perfect pop songs), but Grand Prix is ultimately the product of a band at the peak of its collective powers, not as much a landmark as Bandwagonesque but every bit as good on its own terms. (4.5/5)","torrent":{"xt":"urn:btih:c1f5b035c9079cc84c93f09219ff1e5d1423795d","amp;dn":"Teenage+Fanclub+-+Grand+Prix+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1f5b035c9079cc84c93f09219ff1e5d1423795d","infoHashBuffer":{"type":"Buffer","data":[193,245,176,53,201,7,156,200,76,147,240,146,25,255,30,93,20,35,121,93]},"announce":[],"urlList":[]}}