{"title":"Elsevier's Dictionary of Medicine and Biology.pdf","uid":11367119,"size":11669284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2177be12d590468deb2018ee6100c766340169f&amp;dn=Elsevier%27s+Dictionary+of+Medicine+and+Biology.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"interuniversal","files":-1,"time":1415053271,"description":"\nElsevier's Dictionary of Medicine and Biology: in English, Greek, German, Italian and Latin\n\nAuthor: G.Konstantinidis\n\nISBN:9780444514400\n\nPublisher:Elsevier Science\n\nDictionaries are didactic books used as consultation instruments for self-teaching. They are composed by an ordered set of linguistic units which reflects a double structure, the macrostructure which correspond to the word list and the microstructure that refers to the contents of each lemma. The great value of dictionaries nests in the fact that they establish a standard nomenclature and prevent in that way the appearance of new useless synonyms.\nThis dictionary contains a total of about 27.500 main English entries, and over of 130.000 translations that should normally sufficiently cover all fields of life sciences. The basic criteria used to accept a word a part of the dictionary during the development period in order of importance were usage, up-to-dateness, specificity, simplicity and conceptual relationships. The dictionary meets the standards of higher education and covers all main fields of life sciences by setting its primary focus on the vastly developing fields of cell biology, biochemistry, molecular biology, immunology, developmental biology, microbiology, genetics and also the fields of human anatomy, histology, pathology, physiology, zoology and botany.\nThe fields of ecology, paleontology, systematics, evolution, biostatistics, plant physiology, plant anatomy, plant histology, biometry and lab techniques have been sufficiently covered but in a more general manner. The latest Latin international anatomical terminology &quot;Terminologia Anatomica&quot; or &quot;TA&quot; has been fully incorporated and all anatomical entries have been given their international Latin TA synonym. This dictionary will be a valuable and helpful tool for all scientists, teachers, students and generally all those that work within the fields of life sciences","torrent":{"xt":"urn:btih:c2177be12d590468deb2018ee6100c766340169f","amp;dn":"Elsevier%27s+Dictionary+of+Medicine+and+Biology.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2177be12d590468deb2018ee6100c766340169f","infoHashBuffer":{"type":"Buffer","data":[194,23,123,225,45,89,4,104,222,178,1,142,230,16,12,118,99,64,22,159]},"announce":[],"urlList":[]}}