{"title":"Vendayns Ultimate Skyrim Overhaul - High end pc needed, ADULT co","uid":11177521,"size":24607606016,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c2a312dc2366e05d4c98d7c222a6af984cc5d0b7&amp;dn=Vendayns+Ultimate+Skyrim+Overhaul+-+High+end+pc+needed%2C+ADULT+co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Vendayn","files":1,"time":1412806797,"description":"This is the last overhaul, and the largest I've done, that I will do for Skyrim. Nearly everything was changed, and it is a lighter mod list (152 esps+esms)...giving this overhaul a very stable, mostly bug free (it is Bethesda...) game with a lot of changes.\n\n\nYou can see a full list of screenshots here (and I'll add onto it over time...keep in mind, there is nudity)\n &lt;a href=&quot;\nhttp://s4.photobucket.com/user/Vendayn/library/Skyrim/Ultimate%20Overhaul%20-%20Isabella&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s4.photobucket.com/user/Vendayn/library/Skyrim/Ultimate%20Overhaul%20-%20Isabella&lt;/a&gt;\n\nFirst things first, before I get to the actual content of the mod.\n\nYou'll need Steam version (or a..yaaarr a pirate life is for me...)...but seeing that I have the steam version, I can't help you if you don't.\n\nAlso, I have a gtx 660...and it is a 2gb one...and...I'm lucky enough as it is to get a constant 30+ fps. If you want a vastly more stable game, you need at least a 700 series (or the new 900 series) with 4gb of video ram. My card can't really keep up with my own overhaul.\n\nNext, after you copy the Skyrim folder over (52 gb total)\n\nAnd started up skyrim launcher to get the .ini files generated (unless they are there already)\n\nYou will want to go here:\n\nC:Users****DocumentsMy GamesSkyrim\n\nAnd add to Skyrim.ini \n\nbBorderRegionsEnabled=0\n\nSomewhere under the [general] section\n\nNext, you will want to navigate to the skyrim folder where the .exe is and open enblocal...from there, change...\n\n\nVideoMemorySizeMb=8192\n\n\nAnd change that to whatever your ram+video ram - 2048 is. So, I have 8gb ram+2gb video ram, so I end up with 8192. Don't ask what you should put, because I had to look for myself what it should be and I'm bad with math as it is.\n\nYou can also navigate to enbseries and turn some of the stuff on that I turned off. I turned off SSAO (lol, my FPS dropped to 1 with it...it is super intense, but does look amazing...you pretty much need a top end card to run SSAO in this enb mod. Maybe a new 970 or 980 or the titan itself. I doubt even 700s would run SSAO in the enb included...)\n\nNext, run LOOT (in skyrim folder) and have it organize all the mods. Make sure the merged patch is right above bashed patch.\n\nThen move PsiKotic's Ultimate Necromancy (you'll see the esp) somewhere down the mod list, closer to bashed patch. Otherwise it gets overwritten. And move vampiric thirst (including the requiem patch) far down the mod list too, I keep it with the Psikotic esp.\n\nActivate all of them, and then go to\n\nSteamSteamAppscommonSkyrimDatatools\n\nAnd run FNIS for users. Ignore any warnings if you get any.\n\nNow to the actual mod...\n\nI focused on stability first and then gameplay and content first, and after that graphics.\n\nI used a &quot;new&quot; version of tropical skyrim, which uses higher end textures (original tropical had low resolution ones) and the creator added a lot onto it.\n\nYou can go here to change tropical to Winter or Summer: https://sites.google.com/site/aceeqmodding/\n\nI personally LOVE his winter overhaul he did, and it is VERY Skyrim feeling and to be honest...better Skyrim than the creators made. I switch between tropical and winter...depending on how I feel.\n\nNow to things added\n\nNew Lands:\n\n-Wyrmstooth (this one is epic, it looks amazing and great story and voice acting)\n-Moonpath to Elsweyr (I love this one as well, not as open, but still amazing)\n-Blackland\n-Shadows of Morrowind (this one is really epic)\n-Smaller mods that add tiny portions of hammerfell, Cyrodiil and some other places...I'll leave that as a surprise :)\n\nGameplay:\n\n-Thalmor faction added, now it is a 3 way war (far better than WoW clone 2 way war...come on...everyone knows 3 factions fighting each other is the best :D...*DAOC* *DAOC*)\n\n-You can also join the Thalmor if you are Khajiit or Altmer\n\n- Zombie (apocalypse) added with 28 days mod (you can turn this off in the MCM menu in-game)\n\n- Apocalypse Spells\n\n-Civil War Overhaul (which many find it bugged...but, in this mod setup...I have no problems at all with it. Never had an issue with it...and its far better than vanilla civil war)\n\nLifeforms of Skyrim:\n\nRealistic animals that behave like they should...and a lot more kinds have been added. Lots of animals for the nature lovers and hunters. :)\n\nOver 1000 new types of monsters (not re-skinned, but actual new types)...some may not be lore friendly, but you can turn most of them off. They add a lot.\n\nI always thought it was stupid at level 5 I could already kill dragons. And I always brushed them off as kind of a lame fight that got really boring after fighting them the first 10 times. Now you can be a max level...and still have a hard time killing them! GOOD LUCK! HA...and it is vastly more strategic and fun...and rage inducing\n\nClass Enhancing Mods -\n\nHunter/Wilderness Man/Woman: Live in the wilderness and never enter a major city. Or for a hardcore experience, shy away from even villages...are you afraid of people?\n\nYou can hunt many kinds of animals, for food and to make leather equipment. Caught in a blizzard? Turn those animals into tents and a fresh stew! There are many...hundreds and hundreds...of different foods to make.\n\nTo hunt is a challenge, and if you turn off the UI...you will become a TRUE HUNTER of Skyrim\n\nBandit:\n\nOr do you prey upon those that come by your territory? Do you want to enslave the poorfolk of Skyrim? Rob them of their wordly possessions? Want to yell at rocks that roll down the road, STOP THIS HERE IS A TOLL ROAD SEE? PAY UP OR ELSE!\n\nAs a bandit, you will (assuming you start as a bandit in alternate start) have a disgustingly stupid and weak band of crew among you. But it is something, right? Just watch that back of yours...and maybe one day, you will be the leader of a bandit crew...or a pirate crew...\n\nStealth (assassin/thief)\n\nYou stalk the night, and act as one of them in the day. You know all the secret entrances to each city...you know the weak points...you know what to do. There are plenty of goods to steal...and plenty of gals to kill. Are you a robin hood? Or a thief that wants only what he wants? An Assassin that wants to create chaos upon Skyrim? Or one that kills for the good of all.\n\nThere are many tools at your disposal...pick the right one...and you shall be rewarded.\n\nDruid:\n\nIn many ways, Druids can be similar to Wilderness Men/Women.There are slight differences...you do not harm animals, but befriend them. You know all the plants of Skyrim and elsweyr...you have many animal companions that you call to mother nature to bring forth from the spirit world...and many ways to tame those of the animals still alive upon Skyrim. Mostly a pacifist, but you will protect animals and life at all costs.\n\nDo you protect animals?...or are you more sinister?\n\nAn offshoot of a Druid, is a Dark Druid...one who loves animals...but uses them for evil deeds of causing chaos upon the races of Skyrim. Your teachings have taken a dark turn, and basic necromancy is not surprising...\n\nNecromancer:\n\nMany changes have come to the Necromancer in Skyrim. Necromancers have grown desperate...killing those already living and dragging their carcasses to their evil lairs. To then reanimate into undead themselves! I must not speak more of them...for the very thought of that they do to those dead cause me great fear...\n\nBard:\n\nBecome the one everyone hates! Sing with that horrible voice of yours! PLAY THAT HORRIBLE MUSIC! AND...MAKE MONEY MONEY MONEY! Just don't get killed from an angry mob...\n\nEconomist/Trader/Strategist:\n\nBecome an economist...and possibly control the flow of goods upon Skyrim. Own property and make a constant living.\n\nThere are thousands of properties for sale, from houses, inns and even mines. It is a hard start, as of course, property is expensive...but one where, one day, you may be flowing in gold!\n\nThat isn't the only things you can spend money on...\n\nHire military troops, take over economic buildings and get both gold and goods in a Skyrim wide economic take over in a Risk style gameplay (sadly you can't actually see the effect in game, its almost like a minigame...but it is pretty sophisticated)\n\nOther things you can do? Rich beyond believe?\n\nBuild a house! You can even build more house(s) through Hearthfire! But, in this case...you can make a vastly more sophisticated (and vastly more expensive) house than anything Hearthfire provides.\n\nRaces:\n\nTons of new races are added...most don't fit lore. They are added just for fun, can freely not use them.\n\nCrafting:\nAs mentioned, tons of new food...and a bunch of smithing stuff\n\nOther things include an overhaul of smithing, enchanting and alchemy. All three to be made more realistic, more options and better overall.\n\nFactions/War changes:\nPredator from alien vs predator (I think there are aliens too, but they might still be being developed)...not lore friendly...but...OH WAIT...Predators are from space, so they flew on their ship and crashed in Skyrim from being attacked by aliens onboard. Makes total sense cheesy.gif Anything is realistic and lore friendly if its from space or time travels \n\nZombies added\n\nThalmor: You can join the Thalmor (if a Khajiit/Altmer)...or...more likely...you will be being attacked by hordes and hordes of Thalmor invading Skyrim. Now there is a 3rd faction in the war! No lame warcraft 2 way stuff...its a threeway ;)...you can even do naval warfare against the Thalmor.\n\nCivil War: On top of Skyrim being in a Civil War, they have to deal with the Thalmor. But, Imperials and Stormcloaks still hate each other. Do you not want to join the civil war? Well, it will go on without you...no lame gamey stuff where the player MUST NEED to be involved. The game will continue on without you, and eventually one side (or the Thalmor) will win the war.\n\nOther features added (that I can think of...hey lots of mods!) :\n\nControllable boats (that work in the naval warfare) and they work pretty good.\n\nSet up camp anywhere if you have the supplies\n\nThousands of NPCs added, many with quests...other NPCs are there to fill in the atmosphere. Adds a lot of life throughout Skyrim\n\nOver 1,000 new bandits added, with better AI and are far smarter/stronger\n\nFrostfall+Wet and cold are optional files\n\nMany new dungeons added\n\nFishing is added...dunno why that wasn't in to begin with. Should be up with the hunter part, but I'll just add it here cause anyone can fish.\n\nRequiem used as a base...it makes the start way way too hard in my opinion. However it is my favorite overhaul (which is probably funny seeing I try to counteract it). It does more things that I personally like than the others (didn't like ASIS or Skyre that much, and always loved Requiem). I based a lot of other mods around it...so to balance it out...and keeping Requiem in mind...a lot of things added counter-act the overly hard start of Requiem. Whether it is overpowered or not later on I have not found out quite yet...in any case...dragons will always be freakin hard as hell\n\nCombat has been overhauled. You can get injuries...fallout 3 style. More realistic melee combat (think Mount and Blade, but way more realistic)...and many changes in this area. Stealth/Archery/Melee are all part of this area, and all are a lot better. The melee does come in toward the hardcore area, and is difficult to learn...but, it is really realistic. Stealth definitely gets a boost here, and a lot more stealthy Thief like options. Archery is about the same, but more tools to use.\n\nDragons can spawn at any level, whether you do the main quest or not. :) Have run running away, cause they are pretty damn hard now...as they should be. :)\n\nTech details:\n\nAll mods need cleaning have been cleaned (only those that LOOT+BOSS says it needs cleaning, since some mods are bad to clean).\n\nMerged patch (even more compatibility/stability)\n\nBashed patch (even MORE compatibility/stability)\n\nSSME memory patch (even more stability and 2nd to merging mods) (same as the SKSE one, but to be honest, at least on my PC...it works better...and it works out of the box)\n\nAnd I'm sure I missed some big ones and what not...but hey, it can be a surprise :)\n\nEnjoy the mod guys. :) I did many hours of testing, sprinting to each major city, killing stuff, did the first few main quests...and out of 9 hours of testing, only had 3 ctds. Skyrim tends to crash eventually anyway...so that is pretty good. \n\nWhat I did not test was the whole main quest (though when I first added civil war mod to the overhaul, the entire main quest line worked...)...however when I went to the jarls castle in whiterun, the game and quest broke because everyone was sleeping and game got really weird. So do that in the day (in-game)...skyrim scripts (at least at that part) get really weird if you attempt it at night, mods or not...it expects you to do it in the day time...and whether you have a complete vanilla install, it still bugs out at night)\n\nNow...enjoy the overhaul everyone. :) It may not be the max of 200+ mods active...but it is stable (as far as my tests went) and the mods included really change up the game. :)\n\nAnd yes, the mod is rated adult...cause there is nudity...and...that is all I included as far as that goes...nothing too vulgar...just nudity. \n\nHave fun playing everyone. :)","torrent":{"xt":"urn:btih:c2a312dc2366e05d4c98d7c222a6af984cc5d0b7","amp;dn":"Vendayns+Ultimate+Skyrim+Overhaul+-+High+end+pc+needed%2C+ADULT+co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a312dc2366e05d4c98d7c222a6af984cc5d0b7","infoHashBuffer":{"type":"Buffer","data":[194,163,18,220,35,102,224,93,76,152,215,194,34,166,175,152,76,197,208,183]},"announce":[],"urlList":[]}}