{"title":"Six Machine: I Don't Like Cricket ... I Love It - Chris Gayle","uid":15140628,"size":7849473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2a419fc2514a61e7d0cd5dc93cdef7d9aba3674&amp;dn=Six+Machine%3A+I+Don%27t+Like+Cricket+...+I+Love+It+-+Chris+Gayle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ZamKhan","files":4,"time":1467198086,"description":"'If the ball's there, hit it. Don't worry about what might happen. Play for the glory. Play for the six'\r\n\r\nChris Gayle is the only man to have ever hit a six off the first ball of a Test match. But then producing the impossible is an everyday act for the West Indies legend: the first man to smash an international T20 century, the first to hit a World Cup 200, the fastest century in the history of the game. He has hit twice as many T20 sixes as any other man and scored two Test triple centuries. All this is delivered with cricket's biggest bat and an even bigger smile.\r\n\r\nOff the pitch, millions follow him on Instagram and Twitter to catch a glimpse of a globe-trotting life spent in nightclubs as much as nets, hot-tubs as often as helmets and pads. He plays late, parties later, demolishes a king-size pile of pancakes and then strolls out to mangle another hapless bowling attack.\r\n\r\nBut do we really know him? Do we know what took a shy, skinny kid from a cramped tin-roofed shack in the dusty back streets of Kingston, sharing a bed with three brothers and stealing empty bottles to buy food, to the very top of the cricket world - without losing himself along the way?\r\n\r\nOutrageous and utterly original, this unputdowneable memoir will leave you reeling. Welcome to the world of the Six Machine","torrent":{"xt":"urn:btih:c2a419fc2514a61e7d0cd5dc93cdef7d9aba3674","amp;dn":"Six+Machine%3A+I+Don%27t+Like+Cricket+...+I+Love+It+-+Chris+Gayle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a419fc2514a61e7d0cd5dc93cdef7d9aba3674","infoHashBuffer":{"type":"Buffer","data":[194,164,25,252,37,20,166,30,125,12,213,220,147,205,239,125,154,186,54,116]},"announce":[],"urlList":[]}}