{"title":"Doomsday Prepping Crash Course: The Ultimate Preppers Guide to G","uid":8136994,"size":116613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2d60af7a5ee5da4783a1ab573dea84548e9f86d&amp;dn=Doomsday+Prepping+Crash+Course%3A+The+Ultimate+Preppers+Guide+to+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DaRule762","files":-1,"time":1360730549,"description":"If you're feeling the need to get prepared for any number of the potential emergencies that our world is facing in the near future, the Doomsday Prepping Crash Course is the perfect book for you! It's written by Patty Hahne, the owner of the emergency preparedness blog called PreppersIllustrated.com. Like the blog, this is a book about prepping that is written by a prepper.\n\nIt's packed with great information about how a beginner can get started preparing for the natural or economic disasters that may be coming our way.  Not only is it full of a ton of helpful information about prepping, it provides some great tips for saving money while you are preparing to survive a doomsday event.\n\nRead this book and it will get you started on the right foot! Before long, you'll be proud to call yourself a &quot;prepper&quot; and you'll be ready for whatever might come your way.\n\nInside the Doomsday Prepping Crash Course you'll learn all kinds of great things such as:\n\n    Having Good Plans in Place Will Pave the Way to Success\n    Avoid Frustration by Starting With the Easy Things First\n    Properly Storing Water for Emergency Use\n    Collecting Water When Supplies Run Low\n    Filtering and Treating Water to Make It Safe to Drink\n    Preparing to Help Your Animals Survive Doomsday\n    Making Use of the &quot;One Extra&quot; Method When Shopping\n    Stocking Up on Medication and Medical Supplies\n    Get the Upper Hand by Storing Bartering Items\n    Leverage the Power of Buying In Bulk\n    Learn How to Obtain Food in a Post Doomsday World\n    Turn Your Survival Food into Meals That Satisfy\n    Becoming Prepared To Defend Yourself and Your Property\n    Preparing To Have Electricity after Doomsday\n    PLUS MUCH MORE!\n\nThis book is for the beginning prepper who wants to prepare for doomsday while saving money at the same time. There's no better feeling in the world than knowing that you've taken the steps to prepare your family to survive whatever crisis happens to be coming your way.","torrent":{"xt":"urn:btih:c2d60af7a5ee5da4783a1ab573dea84548e9f86d","amp;dn":"Doomsday+Prepping+Crash+Course%3A+The+Ultimate+Preppers+Guide+to+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d60af7a5ee5da4783a1ab573dea84548e9f86d","infoHashBuffer":{"type":"Buffer","data":[194,214,10,247,165,238,93,164,120,58,26,181,115,222,168,69,72,233,248,109]},"announce":[],"urlList":[]}}