{"title":"Banshee - Season 1 Complete and Season 2 - 1 thru 3","uid":9551298,"size":8345316372,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c2fd3b2b38afd4d91d21694291768c2fb4343a81&amp;dn=Banshee+-+Season+1+Complete+and+Season+2+-+1+thru+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"POtHS11","files":-1,"time":1391270331,"description":"\n\n\nBanshee takes place in the fictional small town of Banshee, Pennsylvania. After serving 15 years in prison for stealing diamonds from a Ukrainian gangster called Rabbit, the unnamed protagonist travels to Banshee to find his heist accomplice and former lover, Anastasia. When he finds her, the protagonist learns that she is now a married mother of two living under the assumed identity of Carrie Hopewell. Later, when the incoming Sheriff is killed, the protagonist takes on his identity as Lucas Hood, becoming the town's new Sheriff. Banshee sees Hood struggle with adapting to his new identity while dealing with the machinations of local crime lord Kai Proctor, and remaining hidden from Rabbit.[1][2]\n\nSeason 1 focuses on Hood's attempts to restore his relationship with Carrie under the looming threat of Rabbit eventually finding them both. Hood's attention-grabbing actions eventually draw Rabbit and his men to the town, leading to Proctor saving Hood's life and earning a favor to be called on later. Hood is later captured, tortured, and ultimate rescued by Carrie and Hood's deputies. Carrie shoots and seemingly kills Rabbit, but during a later investigation his body is not found. The season ends with the original Hood's son learning of his father's replacement by an impostor. The season also features Proctor's amish niece Rebecca who abandons her lifestyle for the freedom Proctor's life offers.\n\nSeason 2 places a larger focus on the Indian tribes and reservations in the town, including the tribal chief Alex Longshadow, whose attempts to build a casino and compete for power with Proctor draw the pair into a bloody conflict. Carrie is imprisoned for her role in the shootout that liberated Hood, and her past is publicly revealed, devastating her family and professional life. Hood and his deputies are put on probation for their involvement, but allowed to continue their duties. Hood, accepting that Carrie has focus on her family, enters into a relationship with his deputy Siobhan.[3]","torrent":{"xt":"urn:btih:c2fd3b2b38afd4d91d21694291768c2fb4343a81","amp;dn":"Banshee+-+Season+1+Complete+and+Season+2+-+1+thru+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2fd3b2b38afd4d91d21694291768c2fb4343a81","infoHashBuffer":{"type":"Buffer","data":[194,253,59,43,56,175,212,217,29,33,105,66,145,118,140,47,180,52,58,129]},"announce":[],"urlList":[]}}