{"title":"The Twentieth Century in 100 Moments - A Visual History (gnv64)","uid":14697707,"size":63496869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c38f32c4bd82ed06c464b49c402a227941c9ad27&amp;dn=The+Twentieth+Century+in+100+Moments+-+A+Visual+History+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"gnv65","files":4,"time":1464260420,"description":"The Twentieth Century in 100 Moments: A Visual History\r\nby Akim Reinhardt and Heather Rounds\r\nZenith Press | February 2016 | ISBN-10: 0760347433 | True PDF | 256 Pages | 60.5 mb\r\n\r\nExperience the twentieth century through the people and events that made headlines--a unique collection of voices, images, and unforgettable cultural touchstones.\r\nThe Twentieth Century in 100 Moments: A Visual History groups and explains the most important events of the twentieth century in the United States, creating a textured, entertaining, and riveting narrative. Images from and ideas about the twentieth century are brought into focus through the following five themes. Triumph: Great and rousing moments that signal achievement and mark monumental accomplishments. Struggle: The hard work and long odds that bring deeper meaning to life. Living: How Americans indulge their spirit of playfulness. Celebrity: The people who have captivated America's attention. Discovery: American exploration and invention.\r\nTo present this century is to tell the nation's collective story: the country's changing and shifting world views, common experiences, and discoveries on Earth and beyond, all told with the the century's rich visual imagery, photography, and film that tell the story of who we are.\r\n\r\nAbout the Authors\r\nAkim Reinhardt is an associate professor of American history at Towson University in Maryland and the author of numerous historical articles and an award-winning book, Ruling Pine Ridge: Oglala Politics from the IRA to Wounded Knee (2007).\r\nHeather Rounds is an award-winning writer and curator based in Baltimore, Maryland. After working for some years as a publications editor at Johns Hopkins University Press, she spent 2007 and 2008 as a journalist in the Kurdish region of Iraq and subsequently wrote a fictionalized account of the experience. The novel, entitled There, won Emergency Press’ International Book Award in 2011 and was published by the Press this year. She has curated multimedia arts exhibitions in New York, Maryland, and Virginia, and is co-founder of the Rotating History Project, a curatorial team dedicated to interpretations of historical themes through artistic mediums.\r\n\r\nCONTENTS\r\nINTRODUCTION . . . . . . . . . . . . . . . . . . . . . . . . . . . .6\r\nCELEBRITY . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .8\r\nDISCOVERY AND INNOVATION. . . . . . . . . . . . . . . . . . 60\r\nLIVING . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 110\r\nSTRUGGLE . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 158\r\nTRIUMPH . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 206\r\nCODA . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 248\r\nINDEX . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 254\r\n \nhttps://s33.postimg.org/4whvgib9r/The_Twentieth_Century_in_100_Moments_A_Visual.jpg","torrent":{"xt":"urn:btih:c38f32c4bd82ed06c464b49c402a227941c9ad27","amp;dn":"The+Twentieth+Century+in+100+Moments+-+A+Visual+History+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c38f32c4bd82ed06c464b49c402a227941c9ad27","infoHashBuffer":{"type":"Buffer","data":[195,143,50,196,189,130,237,6,196,100,180,156,64,42,34,121,65,201,173,39]},"announce":[],"urlList":[]}}