{"title":"[NuruMassage] Dillion Harper - My Step-Dad's Vegas Trip (1080p) ","uid":11893500,"size":1669513016,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c3bf1907445094b3120def02d56c5ae31e1b17e9&amp;dn=%5BNuruMassage%5D+Dillion+Harper+-+My+Step-Dad%27s+Vegas+Trip+%281080p%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"xuluhulu","files":1,"time":1431076178,"description":"[NuruMassage] Dillion Harper - My Step-Dad's Vegas Trip (1080p) (08.05.2015)\n\nDillion Harper and Tony DeSergio are in their hotel in the heart of Las Vegas. Tony is getting dressed as he has a business meeting he must attend to. Dillion somewhat disappointed expresses her boredom as she is under the legal age to gamble and doesn't know what she can do to pass the time. Tony emphasizes with her and recommends she order room service or go shopping on the strip. But he does promise her tickets to a great show. As time goes by, Dillion lays restless in her suite and calls room service looking for ideas as far as what to do considering her being under age in the city. The front desk mentions to Dillion the Nuru Massage equipment they have available which sounded like a great idea. Meanwhile, Tony gets a call from work saying his meeting is postponed until tomorrow, so he heads home and catches a glimpse of Dillion butt naked in the shower! When Dillion heads out of the shower, she explains to her step dad about the Nuru Massage and that she was offering it to him. Tony resists at first but is seduced by her youthful curves and gentle touch. While Dillion rubs her naked body all over her step father's, she points out that she noticed him looking at her showering. Dillion knew her step father wanted her badly. Dillion places Tony's massive cock into her mouth then between her legs. Dillion is so excited riding Tony's thick cock that it's not before long she reaches an intense orgasm, but wants more. Tony cannot hold his load and places his dick right on top on Dillion's mouth. His cum fills her mouth. What will happen if Dillion's mom finds out? Wait until you hear what Dillion has to say about that, your mind will be blown!\n\nSCREENS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=46813247299540797772.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=46813247299540797772.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=02327267752333354736.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=02327267752333354736.jpg&lt;/a&gt;\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:c3bf1907445094b3120def02d56c5ae31e1b17e9","amp;dn":"%5BNuruMassage%5D+Dillion+Harper+-+My+Step-Dad%27s+Vegas+Trip+%281080p%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3bf1907445094b3120def02d56c5ae31e1b17e9","infoHashBuffer":{"type":"Buffer","data":[195,191,25,7,68,80,148,179,18,13,239,2,213,108,90,227,30,27,23,233]},"announce":[],"urlList":[]}}