{"title":"Bert Visscher - Nee, Dan Lourdes AVI - NL - doomoo","uid":4520464,"size":1046231436,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c40c6c32bf1757a6e201f7ce850f4831716dabb6&amp;dn=Bert+Visscher+-+Nee%2C+Dan+Lourdes+AVI+-+NL+-+doomoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"R-Fam.","files":1,"time":1227139128,"description":"Bert Visscher - Nee, Dan Lourdes\ndoomoo\n \n\nBeschrijving:\n \nHet lijkt dan toch door te gaan. Een nieuwe attractie in het dorp. Ondanks enkele bezwaarschriften en verzet van slager Scheltens, is de tijd van kneuterige dorpsgezelligheid met jaarlijks terugkerende evenementjes voorbij. Het moet groter, sneller en vooral moderner. In Parijs zijn toch ook geen schaapscheerderfeesten en in Rome hebben ze al jaren geen boerenboedeldagen meer. Disneyland trekt ook geen liefhebbers van oude volksdansen. Nee, hier werd groot gedacht en zie eens wat een toeloop. Misschien dat adviesbureau Hekkelstein, de Vries, Krombach, Tesseling, Jongejans openheid van zaken kan geven. Nee, niet om het plan er door te drukken, maar gewoon even om alle voordelen op een rijtje te zetten tijdens een goudeerlijke inspraakavond. Dat de oude stadskern moet verdwijnen en een stukje unieke natuur moet wijken, mag natuurlijk geen afbreuk doen aan de saamhorigheid en burenliefde in het dorp. Maar men moet nou eenmaal mee met de tijd. Want laten we wel zijn; zij die hun klederdracht niet af durven gooien zullen eeuwig aardappelschillend verstoten blijven van verlichtend plezier.\n\n \nDVD-Rip, totale duur 01:51:44 uur.\nGrootte 997 MB.\nNL - doomoo.","torrent":{"xt":"urn:btih:c40c6c32bf1757a6e201f7ce850f4831716dabb6","amp;dn":"Bert+Visscher+-+Nee%2C+Dan+Lourdes+AVI+-+NL+-+doomoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c40c6c32bf1757a6e201f7ce850f4831716dabb6","infoHashBuffer":{"type":"Buffer","data":[196,12,108,50,191,23,87,166,226,1,247,206,133,15,72,49,113,109,171,182]},"announce":[],"urlList":[]}}