{"title":"BBC Planet Earth Special Edition 2010 Diaries 13of23 Snow Leopar","uid":10026042,"size":309548612,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c427dc9f8b154c93bfee5eb238c05a3d1bf022d1&amp;dn=BBC+Planet+Earth+Special+Edition+2010+Diaries+13of23+Snow+Leopar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":-1,"time":1398270261,"description":"Planet Earth: Special Edition (Blu-ray)\n\nNature Documentary hosted by David Attenborough, published by BBC in 2010 - English narration\n\n\nInformation\n------------------------------\n\nPlanet Earth: Special Edition\nPlanet Earth took the world by storm when it originally aired. It garnered uniformly glowing reviews, won four Emmy Awards, including Best Nonfiction Series and Best Cinematography, and its longevity on the best-seller list is legend. Now, with the addition of all new commentary and new bonus programs you can relive this incredible experience all over again! In this truly special, limited collector's edition, prepare to be overwhelmed again by the beauty and majesty of Planet Earth. This special edition of the greatest natural history series ever made, Released in 2010, features all episodes from the original series, the Planet Earth team's video diaries, and the breathtaking highlights package of the series' Greatest Moments\n\n\n1)  Pole to Pole \nThis episode journeys across the planet, from pole to pole, following the influence of the sun and discovering how its seasonal journey affects the lives of all who live on earth. As spring arrives in the Arctic, a mother polar bear emerges from her den with two tiny cubs. At the other end of the planet, winter arrives and emperor penguins are plunged into darkness for four months, enduring the coldest temperatures on the planet.\n\n2)  Mountains \nWelcome to an extreme landscape of rock, ice and snow. We tour the mightiest mountain ranges, starting with the birth of a mountain at one of the lowest places on Earth and ending at the summit of Everest. Find out how some of the most secretive animals rise to the challenge of mountain life. Share one of Earth's rarest phenomena, a lava lake that has been erupting for over 100 years. The same forces built the Simian Mountains where we find troops of gelada baboons nearly a thousand strong. In the Rockies, grizzlies build winter dens inside avalanche-prone slopes and climb the peaks to devour abundant summer moths. In another world first, the programme brings us astounding images of a snow leopard hunting on the Pakistan peaks.\n\n3)  Fresh Water \nFresh water is our most precious resource and it defines the distribution of life on land. Follow the descent of rivers from their mountain sources to the sea. Watch spectacular waterfalls, fly inside the Grand Canyon and explore the wildlife below the ice in the world's deepest lake. Witness unique and dramatic moments of animal behaviour: a showdown between smooth-coated otters and mugger crocodiles; deep-diving long tailed macaques; massive flocks of snow geese on the wing and a piranha frenzy in the perilous waters of the world's largest wetland.\n\n4)  Caves \nThe Cave of Swallows in Mexico is a 400m vertical shaft, deep enough to engulf the Empire State Building. The Lechuguilla cave system in the USA is 193km long and 500m deep with astonishing crystal formations hanging from its chambers. Although often overlooked, caves are remarkable habitats with equally bizarre wildlife. Cave angel fish cling to the walls behind cave waterfalls with microscopic hooks on their flattened fins. Cave swiftlets navigate by echo-location and build nests out of saliva. The Texas cave salamander has neither eyes nor pigment. Unique access to a hidden world of stalactites, stalagmites, snotites and troglodytes brings a wealth of surprises.\n\n5)  Deserts \nAround 30% of the land's surface is desert, the most varied of our ecosystems despite the lack of rain. Unravel the secrets of desert survival and experience the ephemeral nature of this dynamic environment. Watch Saharan sandstorms nearly a mile high and desert rivers that run for a single day. In the Gobi Desert, rare Bactrian camels get moisture from the snow. In the Atacama, guanacos survive by licking dew off cactus spines. In the USA, the brief blooming of Death Valley triggers a plague of locusts 65km wide and 160km long. A unique aerial voyage over the Namibian desert reveals elephants on a long trek for food and desert lions searching for wandering oryx.\n\n6)  Ice Worlds \nThe Arctic and Antarctic experience the most extreme seasons on Earth. Time-lapse cameras watch a colony of emperor penguins, transforming them into a single organism. The film reveals new science about the dynamics of emperor penguin behaviour. In the north, unique aerial images show a polar bear swimming more than 100km. Diving for up to two minutes at a time. The exhausted polar bear later attacks a herd of walrus in a true clash of the Titans\n\n7)  Great Plains \nAfter filming for three years, Planet Earth finally captures the shy Mongolian gazelle. Only a handful of people have witnessed its annual migration. Don't miss the bizarre-looking Tibetan fox, captured on film for the first time. Over six weeks the team follow a pride of 30 lions as they attempt to hunt elephants. Using the latest night vision equipment, the crew film the chaotic battles that ensue at close quarters\n\n8)  Jungles \nJungles cover roughly three per cent of our planet yet contain 50 per cent of the world's species. High-definition cameras enable unprecedented views of animals living on the dark jungle floor. In the Ngogo forest the largest chimpanzee group in the world defends its territory from neighbouring groups. Other jungle specialists include parasitic fungi which infiltrate an insect host, feed on it, and then burst out of its body.\n\n9)  Shallow Seas \nA humpback whale mother and calf embark on an epic journey from tropical coral paradises to storm ravaged polar seas. Newly discovered coral reefs in Indonesia reveal head-butting pygmy seahorses, flashing 'electric' clams and bands of sea kraits, 30-strong, which hunt in packs. Elsewhere plagues of sea urchins fell forests of giant kelp. Huge bull fur seals attack king penguins, who despite their weight disadvantage, put up a spirited defence.\n\n10)  Seasonal Forests \nThe Taiga forest, on the edge of the Arctic, is a silent world of stunted conifers. The trees may be small but filming from the air reveals its true scale. A third of all trees on Earth grow here and during the short summer they produce enough oxygen to change the atmosphere. In California General Sherman, a giant sequoia, is the largest living thing on the planet, ten times the size of a blue whale. The oldest organisms alive are bristlecone pines. At more than 4,000 years old they pre-date the pyramids. But the baobab forests of Madagascar are perhaps the strangest of all.\n\n11)  Ocean Deep \nLife goes to extraordinary lengths to survive this immense realm. A 30 tonne whale shark gorges on a school of fish and the unique overhead heli-gimbal camera reveals common dolphins rocketing at more than 30km an hour. Descending into the abyss, deep sea octopus fly with wings and vampire squid use bioluminescence to create an extraordinary colour display. The first ever time-lapse footage taken from 2,000m down captures eels, crabs and giant isopods eating a carcass, completely consuming it within three hours.\n\n12)  Planet Earth Diaries: Eye in the Sky \nThe Planet Earth Diaries segment shows how the wild dog hunt was filmed unobtrusively with the aid of the Heligimbal, a powerful, gyro-stabilised camera mounted beneath a helicopter\n\n13)  Planet Earth Diaries: Snow Leopard Quest \nPlanet Earth Diaries explains how difficult it was to get close-up footage of snow leopards; it was a three-year process and is the world's first-ever video footage of snow leopards\n\n14)  Planet Earth Diaries: Diving with Piranhas \nPlanet Earth Diaries shows how a camera crew filmed a piranha feeding frenzy in Brazil-after a two-week search for the opportunity\n\n15)  Planet Earth Diaries: Into the Abyss \nPlanet Earth Diaries reveals how a camera team spent a month among the cockroaches on the guano mound in Gomantong Cave and describes the logistics required to photograph Lechuguilla. Permission for the latter took two years and local authorities are unlikely to allow another visit\n\n16)  Planet Earth Diaries: Wild Camel Chase \nPlanet Earth Diaries explains how the hunt for the elusive Bactrian camels necessitated a two-month trek in Mongolia\n\n17)  Planet Earth Diaries: Shot in the Dark \nPlanet Earth Diaries explains how the lion hunt was filmed in darkness using infrared light.\n\n18)  Planet Earth Diaries: Trouble in Paradise \nPlanet Earth Diaries looks at filming displaying birds of paradise, focusing mainly on the filming of the six-plumed bird of paradise\n\n19)  Planet Earth Diaries: Shark Quest \nPlanet Earth Diaries shows the difficulties of filming the one-second strike of a great white shark, filmed by Simon King.\n\n20)  Planet Earth Diaries: Alive in the Freezer \nPlanet Earth Diaries tells of the battle with the elements to obtain the penguin footage and of unwelcome visits from polar bears\n\n21)  Planet Earth Diaries: Forest Fliers \nPlanet Earth Diaries explains how aerial shots of the baobab were achieved by the use of a cinebulle, an adapted hot air balloon.\n\n22)  Planet Earth Diaries: Ocean Wanderers \nPlanet Earth Diaries shows the search in the Bahamas for oceanic whitetip sharks\n\n23)  Great Planet Earth Moments \nGreat Planet Earth Moments: Relive the greatest moments of this revolutionary series and discover how these scenes were captured on film!\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/7391/w9mf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/7391/w9mf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img836.imageshack.us/img836/4995/5gkh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img836.imageshack.us/img836/4995/5gkh.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/6964/iu4e.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/6964/iu4e.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/8677/aifg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/8677/aifg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/3999/rikz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/3999/rikz.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img845.imageshack.us/img845/6259/edua.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img845.imageshack.us/img845/6259/edua.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img835.imageshack.us/img835/8106/j8wa.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img835.imageshack.us/img835/8106/j8wa.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/8232/zd52.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/8232/zd52.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/350/yifp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/350/yifp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/7605/brqk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/7605/brqk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img835.imageshack.us/img835/6590/ddac.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img835.imageshack.us/img835/6590/ddac.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img835.imageshack.us/img835/1822/oo8h.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img835.imageshack.us/img835/1822/oo8h.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/9784/cj9i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/9784/cj9i.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img841.imageshack.us/img841/1610/cnge.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img841.imageshack.us/img841/1610/cnge.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img836.imageshack.us/img836/1332/o2ja.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img836.imageshack.us/img836/1332/o2ja.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/6640/57lt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/6640/57lt.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n1)  720p \n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e6ae8f818ea6aad2c8d7&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 3220 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280 x 720\n * Audio Codec: AAC LC\n * Audio English\n * Audio Bitrate: 160 Kbps ABR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 52mins\n * Framerate: 23 FPS\n * Number of Parts: 11\n * Container Mkv\n * Part Size: 1.15 GB\n * Source: Blu-ray DVD\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\n\n\n2)  576p \n * Technical Specs for Planet Earth Diaries\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;6921000e0129255a4758&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 4278 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1024 x 576\n * Audio Codec: AAC LC\n * Audio Bitrate: 160 Kbps ABR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 10mins\n * Framerate: 25 FPS\n * Number of Parts: 12\n * Container Mkv\n * Part Size: 306 MB\n * Source: Blu-ray DVD\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b006mywy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b006mywy&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:c427dc9f8b154c93bfee5eb238c05a3d1bf022d1","amp;dn":"BBC+Planet+Earth+Special+Edition+2010+Diaries+13of23+Snow+Leopar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c427dc9f8b154c93bfee5eb238c05a3d1bf022d1","infoHashBuffer":{"type":"Buffer","data":[196,39,220,159,139,21,76,147,191,238,94,178,56,192,90,61,27,240,34,209]},"announce":[],"urlList":[]}}