{"title":"The Dreaming (Sandman Neil Gaiman) (Fixed)","uid":8756680,"size":484211647,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c47b27deed86ed69ca65e2739174e8ba3ebe5c3b&amp;dn=The+Dreaming+%28Sandman+Neil+Gaiman%29+%28Fixed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1375160971,"description":"This upload corrects the problems with issues 15-18 (reversed numbers and corrupt files) and allows me to seed it at will again (because I had accidentally removed the old .torrent file from utorrent and my pc). (Both of the old uploads - the original full series run and the issue 15-18 fix - will be deleted from TPB.) The naming conventions are exactly the same, so if you are in mid-download, when you start with this new download it should finish just fine if you've left the folder in the same place. If you've already started downloading the old torrent and issues 15-18 are complete, delete them from the folder before starting/finishing with this new upload and they'll be replaced with the properly named, non-corrupt files. If you're downloading this for the first time, ignore everything I just said.\n\n-----------------------------------------------------------------------------------------\n\n\nIssues 1-60 of 'The Dreaming'\nVertigo/DC Comics, 1996-2001\nWritten by Caitlin R Kiernan, Terry LaBan, Alisa Kwitney, Bryan Talbot\nIllustrated by Peter Snejbjerg, Steve Parkhouse, Dick Giordano, Michael Zulli, Dave Taylor, Tayyar Ozkan, Jill Thompson, Jeff Nicholson, Gary Amaro, Peter Doherty, Al Davison, Duncan Fegredo, Chris Weston, Gary Amaro, Scott Hampton, Paul Lee, Shawn McManus, Jamie Tolagson, John T. Totleben, Marc Hempel, Rebecca Guay, Christian Hojgaard, Teddy H. Kristiansen, Ron Randall, Bo Hampton, Charles Vess, Cameron Stewart, Zander Cannon, Peter Gross, Adam Hughes, Phil Jimenez, Michael Wm Kaluta, Marc Laming, Linda M. Medley, Albert Monteys, Paul Pope, Daniel Torres, Bill Willingham, Steve Leialoha, \nColored by Daniel Vozzo, Allen Jamison\n\nThe Dreaming is a fictional place, a comic book location published by DC Comics. The Dreaming first appeared in the Sandman vol. 2 #1, (January 1989), and was created by Neil Gaiman and Sam Kieth. The Dreaming is the domain of Dream of the Endless.\n\nThe Dreaming was a monthly comic series that ran for 60 issues (June 1996 to May 2001). It is set in the same dimension of the DC universe as The Sandman and the stories occurred primarily within Dream's realm, The Dreaming, concentrating on characters who had played minor roles in The Sandman, including The Corinthian, Matthew the raven, Cain and Abel, Lucien the dream librarian, the faerie Nuala, Eve, and Mervyn Pumpkinhead (janitor of The Dreaming). It also introduced a number of new characters, most notably Echo and a new (white) dream raven, Tethys. There were brief (but often important) appearances by The Endless during the series, including cameos by Dream (both Morpheus and Daniel), Death, Destiny, and Desire.\t\t","torrent":{"xt":"urn:btih:c47b27deed86ed69ca65e2739174e8ba3ebe5c3b","amp;dn":"The+Dreaming+%28Sandman+Neil+Gaiman%29+%28Fixed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c47b27deed86ed69ca65e2739174e8ba3ebe5c3b","infoHashBuffer":{"type":"Buffer","data":[196,123,39,222,237,134,237,105,202,101,226,115,145,116,232,186,62,190,92,59]},"announce":[],"urlList":[]}}