{"title":"Handbook of Advanced Magnetic Materials","uid":15458291,"size":136274649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4f9b4ce7c6e218a64ca9fec2ca20d89e051f613&amp;dn=Handbook+of+Advanced+Magnetic+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"clouderone","files":1,"time":1470015098,"description":"Handbook of Advanced Magnetic Materials - Yi Liu et al. (Springer, 2006).pdf\r\n\r\nIn December 2002, the world's first commercial magnetic levitation super-train went into operation in Shanghai. The train is held just above the rails by magnetic levitation (maglev) and can travel at a speed of 400 km/hr, completing the 30km journey from the city to the airport in minutes. Now consumers are enjoying 50 GB hard drives compared to 0.5 GB hard drives ten years ago. Achievements in magnetic materials research have made dreams of a few decades ago reality. The objective of the four volume reference, Handbook of Advanced Magnetic Materials, is to provide a comprehensive review of recent progress in magnetic materials research. \r\nEach chapter will have an introduction to give a clear definition of basic and important concepts of the topic. The details of the topic are then elucidated theoretically and experimentally. New ideas for further advancement are then discussed. Sufficient references are also included for those who wish to read the original work. \r\nIn the last decade, one of the most significant thrust areas of materials research has been nanostructured magnetic materials. There are several critical sizes that control the behavior of a magnetic material, and size effects become especially critical when dimensions approach a few nanometers, where quantum phenomena appear. The first volume of the book, Nanostructured Advanced Magnetic Materials, has therefore been devoted to the recent development of nanostructured magnetic materials, emphasizing size effects. \r\nOur understanding of magnetism has advanced with the establishment of the theory of atomic magnetic moments and itinerant magnetism. Simulation is a powerful tool for exploration and explanation of properties of various magnetic materials. Simulation also provides insight for further development of new materials. Naturally, before any simulation can be started, a model must be constructed. This requires that the material be well characterized. Therefore the second volume, Characterization and Simulation provides a comprehensive review of both experimental methods and simulation techniques for the characterization of magnetic materials. After an introduction, each section gives a detailed description of the method and the following sections provide examples and results of the method. Finally further development of the method will be discussed. \r\nThe success of each type of magnetic material depends on its properties and cost which are directly related to its fabrication process. Processing of a material can be critical for development of artificial materials such as multilayer films, clusters, etc. Moreover, cost-effective processing usually determines whether a material can be commercialized. In recent years processing of materials has continuously evolved from improvement of traditional methods to more sophisticated and novel methods. The objective of the third volume, Processing of Advanced Magnetic Materials, is to provide a comprehensive review of recent developments in processing of advanced magnetic materials. Each chapter will have an introduction and a section to provide a detailed description of the processing method. The following sections give detailed descriptions of the processing, properties and applications of the relevant materials. Finally the potential and limitation of the processing method will be discussed. The properties of a magnetic material can be characterized by intrinsic properties such as anisotropy, saturation magnetization and extrinsic properties such as coercivity. The properties of a magnetic material can be affected by its chemical composition and processing route. With the continuous search for new materials and invention of new processing routes, magnetic properties of materials cover a wide spectrum of soft magnetic materials, hard magnetic materials, recording materials, sensor materials and others. The objective of the fourth volume, Properties and Applications of Advanced Magnetic Materials, is to provide a comprehensive review of recent development of various magnetic materials and their applications. Each chapter will have an introduction of the materials and the principles of their applications. The following sections give a detailed description of the processing, properties and applications. Finally the potential and limitation of the materials will be discussed","torrent":{"xt":"urn:btih:c4f9b4ce7c6e218a64ca9fec2ca20d89e051f613","amp;dn":"Handbook+of+Advanced+Magnetic+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f9b4ce7c6e218a64ca9fec2ca20d89e051f613","infoHashBuffer":{"type":"Buffer","data":[196,249,180,206,124,110,33,138,100,202,159,236,44,162,13,137,224,81,246,19]},"announce":[],"urlList":[]}}