{"title":"FotoMagico Version 4.2.1 with SN","uid":8246732,"size":110145858,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c5201f3f769e6e6450c22cd5fd3e1d721191882a&amp;dn=FotoMagico+Version+4.2.1+with+SN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"polisdavid","files":-1,"time":1363078940,"description":"Official Web Site: &lt;a href=&quot; http://boinx.com/fotomagico&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://boinx.com/fotomagico&lt;/a&gt;\n\nFotoMagico lets you create professional slideshows from your photos and music with just a few, simple mouse clicks. It sports a very clean and intuitive yet powerful user interface. High image quality, fast performance, and user flexibility were some of the design goals for this application.\n\nCreate the most spectacular slideshows:\n\n* Scale, move, rotate, zoom or pan around your images to highlight that \n  part that matters the most.\n\n* Your slides fit together perfectly with the new, gorgeous transitions.\n\n* Provide more meaning with subtle titles here and there.\n\nPerform a breathtaking show:\n\n* Your slideshow uses the best possible resolution of your presentation\n   device.\n\n* Use large displays, HDTV screens and other high resolution devices.\n\n* Even on a VGA projector, your photos will look better with \n  FotoMagico.\n\nYour audience will want to take it home:\n\n* Burn DVDs of your slideshow with iDVD or Roxio Toast.\n\n* Put your slideshow on the new iPod.\n\n* Export in almost any QuickTime format.\n\nYour audience will never fall asleep again.\n\nWhat's New:\n\n* Masks in the Stage are now correctly updated as various options like \n  size, position, zoom, or rotation are changed.\n\n* Assigning masks via the popup menu now works correctly.\n\n* Rotating masks used to be weird in some cases. Now it always\n   behaves correctly.\n\n* The zoom and rotation jog-wheels now behave correctly when\n   working with masks.\n\n* Resizing masks in the Stage by dragging the selection frame handles\n   is now more reliable. Pressing the Shift key keeps a mask centered\n   while resizing it.\n\n* A mask selection frame is now drawn in blue, so it is more easily\n   distinguished from a layer selection frame.\n\n* The background and watermark layers are now once again displayed \n  correctly during authoring.\n\n* Layout glitches in the Stage when adding or removing layers have\n   been fixed.\n\n* Ducking now respects manual audio fades with custom offsets.\n\n* Ducking for movies now works again.\n\n* Custom audio fades are now fixed when dragging or copying/pasting\n   audio to a different location and those custom audio fades no longer\n   work.\n\n* File size limitations for uploading to YouTube have been removed.\n\n* Make sure that the system doesn't go to sleep while an export is in\n   progress.\n \n* Make sure that pressing the spacebar key while we are editing a \n   numeric value in a textfield, actually starts preview playback instead\n   of causing an invalid value error message.\n\n* Make sure that deleting everything in a numeric textfield doesn't cause \n  FotoMagico to enter an invalid state. Instead revert to the previous \n  value.\n\n* Made the file format more efficient for the OS X sandbox\n   environment.\n\n* A bug has been fixed where auto-expanded stacks (slides with \n  multiple layers) in the Storyboard occasionally failed to collapse again \n  when the mouse left the stack. Some users mistook this for an\n  application freeze.\n\n* Make sure that a full save is performed when the app is quit without\n   first closing a document.\n\n* The visibility and animation controls now display seconds tick-marks\n   when a single slide is selected. This helps to position the fade-in or\n   fadeout triangles more precisely.\n\n* Various small fixes.\n\nSystem Requirements: \n\nIntel Mac OS X.7.4 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:c5201f3f769e6e6450c22cd5fd3e1d721191882a","amp;dn":"FotoMagico+Version+4.2.1+with+SN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5201f3f769e6e6450c22cd5fd3e1d721191882a","infoHashBuffer":{"type":"Buffer","data":[197,32,31,63,118,158,110,100,80,194,44,213,253,62,29,114,17,145,136,42]},"announce":[],"urlList":[]}}