{"title":"Understanding Chemistry through Cars","uid":15564017,"size":14431257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5519d937686fdc184fd6712d7d294a73cc2f56e&amp;dn=Understanding+Chemistry+through+Cars&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1471172417,"description":"Understanding Chemistry through Cars - Geoffrey M. Bowers, Ruth A. Bowers (CRC, 2015).pdf\r\n\r\nAs the car anticipates its dance around the racetrack, the engine growls and pops, and all senses become immersed in the smell of exhaust vapors and the sounds of raw speed and excitement. As it turns out, these also are the sights, sounds, and smells of chemistry! The car is a great example of an everyday device with an abundance of chemistry hiding in plain sight. In fact, almost everything in a car can be described from a chemical perspective.\r\n\r\n\r\nUnderstanding Chemistry through Cars guides novice chemists and car enthusiasts in learning basic chemical principles in an engaging context. It also supports upper-level chemists in synthesizing knowledge gained over a chemistry curriculum and seeing how it can manifest in the real world.\r\n\r\n\r\nThis book provides an overview of chemistry in relation to cars. Various topics are discussed including the ideal gas law, materials chemistry, thermochemistry, solution chemistry, mass transport, polymerization, light/matter interactions, and oxidation and reduction.\r\n\r\n\r\n\r\nThe book incorporates expected learning outcomes at the beginning of each section, detailed and easy-to-follow example problems, appendices reviewing basic chemical topics, suggestions on how to use the resource in upper-level courses. Ancillary materials, such as a Twitter account and an associated blog, allow readers to explore the latest in the world of car chemistry, ask questions, and interact directly with the authors and other experts","torrent":{"xt":"urn:btih:c5519d937686fdc184fd6712d7d294a73cc2f56e","amp;dn":"Understanding+Chemistry+through+Cars","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5519d937686fdc184fd6712d7d294a73cc2f56e","infoHashBuffer":{"type":"Buffer","data":[197,81,157,147,118,134,253,193,132,253,103,18,215,210,148,167,60,194,245,110]},"announce":[],"urlList":[]}}