{"title":"SaHa Hentai MEGAPACK (All English Translated March 2013)","uid":8594164,"size":47487995341,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c59784e6176afa7f25ce3b81c0eff27557e6ce0a&amp;dn=SaHa+Hentai+MEGAPACK+%28All+English+Translated+March+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":6,"uploader":"harry711","files":1587,"time":1371713722,"description":"SaHa hentai pack ....... all the work has been done by http://www.sahadou.com/?page_id=207 !! Just trying to spread the word around. This is all 44ish gigs. Yes, EVERY translated doujin or manga that has ever been released here [on SaHa]. EVERYTHING!!!\n\nClick the file-list to see the comics in the torrent; description was too long to include it.\n\n\nAlso the piece-size of this torrent is much bigger than the one on SaHa's site. I had to repackage it so TPB's software would accept the torrent. This means pretty much nothing to you as an end-user, other than some really old torrent clients may not work. I suggest qBittorrent if you are using MS Windows, and Transmission if you are using Mac or Linux. (IF YOUR TORRENT IS STUCK AT 0% OR LOADING METADATA FOR MORE THAN A COUPLE HOURS, CHANCES ARE YOUR TORRENT CLIENT DOES NOT SUPPORT THIS BIG PIECES AND YOU SHOULD TRY THE CLIENTS SUGGESTED ABOVE)\n\n\nIf this torrent ever dies, you can download the one from SaHa's blog and then verify the data on this torrent and it will seed it. It's an exact duplicate of the one on SaHa's blog but optimized piece-size to be able to be uploaded to TPB.\n\n\n\n\nEnjoy, and please remember to seed and keep your upload speed high so it goes faster for everyone!","torrent":{"xt":"urn:btih:c59784e6176afa7f25ce3b81c0eff27557e6ce0a","amp;dn":"SaHa+Hentai+MEGAPACK+%28All+English+Translated+March+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59784e6176afa7f25ce3b81c0eff27557e6ce0a","infoHashBuffer":{"type":"Buffer","data":[197,151,132,230,23,106,250,127,37,206,59,129,192,239,242,117,87,230,206,10]},"announce":[],"urlList":[]}}