{"title":"Applied Economics - Thinking Beyond Stage One{BBS}","uid":6636327,"size":11718421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5dffe506b5c6ab3b2d5841baa1b3c3c84d116c2&amp;dn=Applied+Economics+-+Thinking+Beyond+Stage+One%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314570014,"description":"While politicians squabble over the pros and cons of price controls on prescription drugs, onlooking citizens are often left scratching their heads. Many of today's economic issues are obscured by their inherent complexity and the blarney coming from political talking heads. In his follow-up to Basic Economics, Sowell, a leading conservative spokesman and a senior fellow at the Hoover Institution, seeks to alleviate this confusion. He highlights the major differences between politicians (who act for the short term, i.e., reelection) and economists (who look at the long-range ramifications of policy), and urges voters to keep these differences in mind. Sowell then focuses on a few issues, including some political hot potatoes: medical care, housing, discrimination, insurance and the development of nations. He urges readers to consider not only the intended, immediate goal of a particular policy, but also its unintended, long-range impact. For instance, he says, supporters of nationalized health care overlook the fact that it often results in health-care shortages, reduced quality of services and black markets. The great achievement of Sowell's book is its simplicity. His writing is easy and lucid, an admirable trait considering the topic at hand. This book will not satisfy hard-core economic junkies, and Sowell does not pretend it will. His target audience is the average citizen who has little or no economics background, but would like the tools to think critically about economic issues. Some readers will be turned off by Sowell's preference for free-market principles, but the author is an esteemed economist and his explanations fit well within the mainstream. As a basic primer for the economically perplexed, this volume serves very well.\nCopyright 2003 Reed Business Information, Inc.\nReview\n&quot;Thomas Sowell is one of the fine scholars of our time.&quot; -- Ideas On Liberty\n\n\n    * Hardcover: 256 pages\n    * Publisher: Basic Books; 2nd edition (November 11, 2003)\n    * Language: English\n    * ISBN-10: 0465081436\n    * ISBN-13: 978-0465081431","torrent":{"xt":"urn:btih:c5dffe506b5c6ab3b2d5841baa1b3c3c84d116c2","amp;dn":"Applied+Economics+-+Thinking+Beyond+Stage+One%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5dffe506b5c6ab3b2d5841baa1b3c3c84d116c2","infoHashBuffer":{"type":"Buffer","data":[197,223,254,80,107,92,106,179,178,213,132,27,170,27,60,60,132,209,22,194]},"announce":[],"urlList":[]}}