{"title":"Star Trek Original Series Soundtrack Collection 320kb mp3","uid":15926294,"size":2538219767,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5fa4bf5ddfbbfdcc8f86c8717601715c91cf26b&amp;dn=Star+Trek+Original+Series+Soundtrack+Collection+320kb+mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"OddioVizyule","files":637,"time":1475304825,"description":"The complete 15 cd set of soundtrack music from the original Star Trek series. 320 kbps mp3.\r\n\r\n&quot;Every note of music that was created for the show, whether it was used or not&quot; is here, according to the producers of the set. \r\n\r\nIn the 1960s and 70s many television series brought in multiple composers who would create a library of moods and accents. \r\n\r\nOriginal series composers Alexander Courage, George Duning, Jerry Fielding, Gerald Fried, Sol Kaplan, Samuel Matlovsky, Joseph Mullendore and Fred Steiner are all represented in this deluxe collection, their historic work meticulously assembled, restored, and remastered.\r\n\r\nThe series did not hire composers for every episode. Instead, the producers brought in composers for several early episodes every year, and then tracked cues from those scores into all the following episodes as appropriate. In rare cases, the producers would bring a composer back late in the season to deal with a specific episode. It is a testament to the abilities of the composers that they were in many cases able to address the specific needs of the episode at hand, while also providing mood pieces that could be plugged into multiple episodes with similar situations as the season progressed.\r\n\r\nOver the course of the series the music covered a wide range of atmospheric landscapes, from serious drama and tragedy to wild farce.\r\n\r\nAll complete episode scores are here, as well as partials, along with alternate intros and outros, sound effects, unused sound effects, alternates and outtakes of episode cues, library cues/music used in various episodes, etc.\r\n\r\nThis is an incredible job of re-mastering from reel-to-reel tape originals. A true aural treasure trove for fans of the series.\r\n\r\nCredit where credit is due: Produced by Lukas Kendall, Neil S. Bulk and Jeff Bond, restored by Chris Malone and mastered by Doug Schwartz. La-La Land record label","torrent":{"xt":"urn:btih:c5fa4bf5ddfbbfdcc8f86c8717601715c91cf26b","amp;dn":"Star+Trek+Original+Series+Soundtrack+Collection+320kb+mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5fa4bf5ddfbbfdcc8f86c8717601715c91cf26b","infoHashBuffer":{"type":"Buffer","data":[197,250,75,245,221,251,191,220,200,248,108,135,23,96,23,21,201,28,242,107]},"announce":[],"urlList":[]}}