{"title":"Why Planes Crash TV Documentary Mini Series","uid":10076132,"size":1706611697,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c63e421ab37c8f7bced914be57e1671df2a7e96b&amp;dn=Why+Planes+Crash+TV+Documentary+Mini+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MaxiDownloads","files":5,"time":1398920854,"description":"In Why Planes Crash pilots and passengers relive the rare and horrifying occasions in which malice, human error or technical faults turn routine flights into nightmares! Why Planes Crash takes you inside some of the most terrifying situations imaginable with the aid of shocking archive footage and dramatic animated reconstructions.\n\nWhy Planes Crash: Brace For Impact\nThe series kicks off with a look at what causes some pilots to risk ditching their planes in the water, and how they and their passengers can survive the experience. This episode includes film of a hijacked 767 being forced into the ocean.\n\nWhy Planes Crash: Fire In The Sky\nThe Federal Aviation Administration has found that up to three flights out of 100,000 are diverted due to smoke or fire in flight, but the situation is no less dangerous for being commonplace. Witness some of the disastrous consequences in this episode.\n\nWhy Planes Crash: Human Error\nMistakes, oversights and distractions can have consequences. This show features the jet which ran out of fuel and smashed into a hillside just miles from a runway.\n\nWhy Planes Crash: Breaking Point\nNine passengers are sucked out of a 747 flying over the Pacific when a cargo door explodes. This is just one of the sudden structural failures in this episode, which also sees a DC-10 lose an engine on take-off!\n\nWhy Planes Crash: Collision Course\nSituations in which planes collide with each others in the air.\n\n\nContainer: MP4\nVideo: H.264 MPEG\nAudio: AAC\n\n\n\n\n\n--- ALSO ---\n\nDo you like oldies? Check out MaxiMusic! MaxiMusic is a collection of popular and rare oldies from the 1910-2000's. Either search &quot;MaxiMusic&quot; on The Pirate Bay or Kickass Torrents, or head over to this link:\n &lt;a href=&quot;\nhttp://thepiratebay.org/user/MaxiMusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.org/user/MaxiMusic/&lt;/a&gt;","torrent":{"xt":"urn:btih:c63e421ab37c8f7bced914be57e1671df2a7e96b","amp;dn":"Why+Planes+Crash+TV+Documentary+Mini+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63e421ab37c8f7bced914be57e1671df2a7e96b","infoHashBuffer":{"type":"Buffer","data":[198,62,66,26,179,124,143,123,206,217,20,190,87,225,103,29,242,167,233,107]},"announce":[],"urlList":[]}}