{"title":"CopyTrans Suite 4.20 latest","uid":5977039,"size":3326070,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c66bb1d9e474b100af62d8d78637305828716388&amp;dn=CopyTrans+Suite+4.20+latest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"BLACKTROY","files":1,"time":1290468945,"description":"Complete transfare software to replace itunes\n6 Programs for all your transfare needs from and to ipod/phone inc\n\nCopytrans 4\nYour iTunes library is empty, but your music is still on your iPod? Do not connect your iPod to iTunes without an iPod backup and risk an unwanted synchronization and deletion! \nCopy iPod to computer and safely recover iPhone or iPod library. \nCopyTrans transfers: music, videos, podcasts, audiobooks, smart playlists, artworks, ratings, playcounts, date added and many more! \nBackup iPod to PC and iPhone to iTunes the correct way!\n\nCopyTrans Photo\nmakes transferring and sharing iPod photos as easy as taking them! This two-way iPod photo transfer tool lets you move pictures to iPod or PC. CopyTrans Photo transfers iPod photos to PC and back and lets you quickly navigate, create or edit iPod photo albums on iPhone or computer. Organize iPod photos, rotate and backup iPhone pictures. \nTake a seat and enjoy your iPod Touch images in stunning iPod photo slideshows!\n\ncopytrans manager\nSick of iTunes? Is it too complex and slow for your needs? Looking for a faster, lighter and free alternative iPod manager? CopyTrans Manager is the perfect iTunes replacement for your iPhone or iPod. Add music &amp; videos to iPod, edit song tags and artworks, create and organize iPhone playlists, preview tracks with the integrated music player. It has never been this simple!\n\nicloner\nCreate full backup images of your iPod \nRestore entire iPod contents incl. notes, contacts &amp; games\n\nilibs\nManage multiple iTunes libraries without risk or confusion \nSwitch between iPods and iPod users safely &amp; comfortably\n\ncopytrans dctor\nRepair &amp; fix corrupted iPod problems \nFind &amp; recover iPod missing songs\n\ncomes complete with all keygens.\ntested and working on iphone 3gs running 4.1\n","torrent":{"xt":"urn:btih:c66bb1d9e474b100af62d8d78637305828716388","amp;dn":"CopyTrans+Suite+4.20+latest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c66bb1d9e474b100af62d8d78637305828716388","infoHashBuffer":{"type":"Buffer","data":[198,107,177,217,228,116,177,0,175,98,216,215,134,55,48,88,40,113,99,136]},"announce":[],"urlList":[]}}