{"title":"Art and Eternity - The Nefertari Wall Paintings Conservation Pro","uid":11234549,"size":19904676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6857e70368347c0f232b2182f04f783cbb32667&amp;dn=Art+and+Eternity+-+The+Nefertari+Wall+Paintings+Conservation+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1413586093,"description":"Miguel Angel, Mahasti Afshar, &quot;Art and Eternity: The Nefertari Wall Paintings Conservation Project 1986-1992&quot;\nOUP | 1993 | ISBN: 0892361301 | English | PDF | 160 pages | 18.98 Mb\n\nThis is the final report on the conservation of the wall paintings in the tomb of Nefertari in the Valley of the Queens, Egypt. This highly successful collaborative venture launched by the Getty Conservation Institute and the Egyptian Antiquities Organization brought together scientists and conservators from all over the world to address the problems facing one of the most beautiful monuments of antiquity. The painstaking process that saved this cultural treasure in situ is documented in the text written by those who were most intimately involved in its rescue. Paolo and Laura Mora worked with and trained the team of conservators who carried out the consolidation and cleaning of the paintings. An international group of scientists carried out the analysis that was essential to the conservation process. Others contribute articles on the archaeology of the Valley, the iconography of the tomb, the original techniques and materials used by the artists, photographic documentation of the wall paintings, and literary sources for their study","torrent":{"xt":"urn:btih:c6857e70368347c0f232b2182f04f783cbb32667","amp;dn":"Art+and+Eternity+-+The+Nefertari+Wall+Paintings+Conservation+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6857e70368347c0f232b2182f04f783cbb32667","infoHashBuffer":{"type":"Buffer","data":[198,133,126,112,54,131,71,192,242,50,178,24,47,4,247,131,203,179,38,103]},"announce":[],"urlList":[]}}