{"title":"(2013) Explosions in the Sky &amp; David Wingo - Prince Avalanch","uid":8784155,"size":109803531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c68e9f0ddae7bfcc60fdb6efb57353351558fb61&amp;dn=%282013%29+Explosions+in+the+Sky+%26amp%3B+David+Wingo+-+Prince+Avalanch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"100.XY","files":-1,"time":1375785754,"description":"Explosions in the Sky &amp; David Wingo - Prince Avalanche OST\n\n\n\nimage Review:\nThe sprawling instrumental rock of Explosions in the Sky has so often been called &quot;cinematic&quot; that it's easy to forget they've done little actual soundtrack work. One reason may be that their music, where intricate layers of effects-laden guitar build to cathartic crescendos, threatens to overshadow any but the hardiest onscreen action. It's all well and good for the colliding shoulder pads of Friday Night Lights, but harder to imagine as fodder for the subdued character beats of a David Gordon Green film. Nevertheless, Explosions in the Sky have teamed up with fellow Austinite David Wingo, leader of indie rock band Ola Podrida and musical contributor to Green films such as All the Real Girls, to score Prince Avalanche, where two men repaint a wildfire-ravaged highway-- hardly a natural fit for starry guitar pyrotechnics.\nBut Explosions in the Sky have been hunkered down in the extreme loud/soft dynamics of post-rock for almost 15 years now, and the consistency of their maximalist glare, which can only be done so many ways, makes it easy to overlook the area where they have shown real growth: the nuance of their softer side. Over the course of their discography, you can hear the band's interest shifting away from soaring peaks and toward the more finely textured valleys between them. On the Prince Avalanche OST, they get to delve into more microscopic composition without tacking on perfunctory climaxes. The result is a collection of emotive, melodious themes that makes for excellent around-the-house mood music. The band's diaphanous electric guitars are discerningly shaped in collaboration with Wingo, who understands how movie music sounds and also knows his way around a line of melodic counterpoint, as proven on Ola Podrida's excellent Ghosts Go Blind earlier this year.\nOn Prince Avalanche, the enormous, trembling tremolo chords that usually hang like supernovas in Explosions' sky diffuse into a variety of subtler constellations, mostly made of acoustic guitar and piano in counterpoint with electric shimmers and hums. There are taut, crackling ambient pieces (&quot;Fires&quot;, &quot;Wading&quot;). There are haunting e-bowed meditations, like the melody for saturated overtones on &quot;Theme from Prince Avalanche&quot; or the plaintive theme on &quot;Passing Time&quot;, which recurs on later tracks to give the record its elegiac emotional center. There is a waltz (&quot;Dear Madison&quot;), an eloquently slow and sad flamenco-like tune (&quot;Hello, Is This Your House?&quot;), a misty piano interlude that wouldn't sound out of place on an Eluvium record. There are also a handful of more driving tracks, especially deep cuts &quot;Join Me on My Avalanche&quot; and &quot;Send Off&quot;, where a subdued skyward gallop pays deference to the fans who have supported Explosions for so long. It's still questionable how this pretty, solemn music will work in the quirky context of Green's film, but it makes for a nice little album on its own.\nReview by Brian Howe\n\n\nTracklist:\n\n01 - Fires.mp3\n02 - Theme From Prince Avalanche.mp3\n03 - Dear Madison.mp3\n04 - Passing Time.mp3\n05 - Rain.mp3\n06 - Alone Time.mp3\n07 - Hello, Is This Your House?.mp3\n08 - Can't We Just Listen to the Silence.mp3\n09 - Wading.mp3\n10 - Dear Alvin.mp3\n11 - The Lines on the Road That Lead You Back Home.mp3\n12 - An Old Peasant Like Me.mp3\n13 - Join Me on My Avalanche.mp3\n14 - The Adventures of Alvin and Lance.mp3\n15 - Send Off.mp3\n\n\nSummary:\nCountry: USA (Texas)\nGenre: Sountrack\nStyles: Post-Rock\n\n\n\nMedia Report:\nFormat : MPEG Audio\nFormat version : Version 1\nFormat profile : Layer 3\nBit rate mode : Constant\nBit rate : 320 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nCompression mode : Lossy\n\n\n","torrent":{"xt":"urn:btih:c68e9f0ddae7bfcc60fdb6efb57353351558fb61","amp;dn":"%282013%29+Explosions+in+the+Sky+%26amp%3B+David+Wingo+-+Prince+Avalanch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c68e9f0ddae7bfcc60fdb6efb57353351558fb61","infoHashBuffer":{"type":"Buffer","data":[198,142,159,13,218,231,191,204,96,253,182,239,181,115,83,53,21,88,251,97]},"announce":[],"urlList":[]}}