{"title":"Paisiello - Il Barbiere di Siviglia","uid":4116541,"size":291465134,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c8052892a1b203cdbfa0be1b0f17ae9ee54fef2b&amp;dn=Paisiello+-+Il+Barbiere+di+Siviglia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"YowzaTheBear","files":33,"time":1207340318,"description":"Il Barbiere di Siviglia\novvero\nLa precauzione inutile\nDrama giocoso in four scenes\n\nComposer:  Giovanni Paisiello\nLibrettist:  Giuseppe Petrosellini, adapted from Pierre Beaumarchais\n\nFirst performance:  September 26, 1782 for the Imperial Court at St. Petersburg, Russia\n\nRosina, an heiress:  Krisztina Laki, soprano\nCount Almaviva, in love with Rosina:  Denes Gulyas, tenor\nFigaro, a barber:  Istvan Gati, baritone\nBartolo, Rosina&amp;#039;s guardian:  Jozsef Gregor, bass\nBasilio, a music master and friend of Bartolo:  Sandor solyom-Nagy, baritone\nGiovinetto:  Csaba Reti, tenor\nLo Svegliato:  Miklos Mersei, baritone\nNotario:  Attila Fulop, tenor\nAlcade:  Attila Fulop, tenor\n\nHungarian State Orchestra \nConductor:  Adam Fischer\n\nLabel:  Hungaraton\nIssued:  1985\n\nRip:  mp3 @ 320 kbps\n\nSorry, I can&amp;#039;t find a listing of the tracks but the mp3s are tagged.\n\nThe ORIGINAL Il Barbiere di Siviglia!\n\n&quot;This welcome reissue of Adam Fischer?s sparkling 1985 recording of Paisiello?s unjustly eclipsed Barbiere offers a strong case for its continued toe-hold in the repertory. The Hungarian cast even sings with enough style and relish to overlook Hungaraton?s neglect in providing an Englished libretto.&quot;  -Antony Bye, BBC Music Magazine\n\nSynopsis\n\nAct I Scene 1\nThe colourful Count Almaviva has fallen in love with a stranger whilst on holiday in Spain. Six months later he?s tracked her down, discovered her name, and now hopes ? disguised as the impoverished Lindoro - to serenade her outside the holiday-camp caravan where she?s kept incarcerated by the her over-protective guardian, Dr Bartolo. Unexpectedly he bumps into Figaro, who once worked for him and is now odd-jobbing as a barber. Rosina manages to appear at a window and she drops a message to Lindoro. Bartolo, who has his own designs on Rosina, is deeply suspicious of her excuse that it?s merely a tune from a comic opera she&amp;#039;s learning, Deceit Outwitted, but fails to intercept it. Figaro proposes a ploy to the Count: since he?s conveniently barber to Bartolo, he suggests Almaviva should dress up as a soldier, who will be billeted on Bartolo, and leave the rest to him.\n\nScene 2\nLocked indoors, Rosina writes again to Lindoro. When her friend Figaro enters, the sounds of Bartolo?s approach forces him to hide. Bartolo is livid because Figaro has administered sleeping and sneezing potions to his two servants, Sprightly and Lively. Bartolo is visited by Rosina?s music-teacher, Don Basilio, who warns him that Almaviva has arrived in town, incognito, but is confident that a well-planted slander will settle the matter. Bartolo resolves to marry Rosina that very evening. Figaro emerges, and warns Rosina of Bartolo?s marital intentions. Almaviva arrives, disguised and drunk, and manages to reveal to Rosina that he?s actually Lindoro, and receives her letter. He threatens to fight Bartolo, but is persuaded to leave. Bartolo has spotted the exchange but is foiled when Rosina swaps the letter; the discovery that it is indeed from her cousin reduces him to apology. Rosina, alone, reflects on her plight\n\nAct II Scene 1\nAlmaviva tries out a new disguise: Don Alonso, come to give Rosina a singing lesson as replacement for the ?sickly? Basilio. His tedious and sanctimonious greeting is deeply aggravating to Bartolo, but Alonso wins favour when he (foolishly as it turns out) hands over Rosina?s letter to Almaviva, pretending that Basilio has asked him to do so: his suggestion of slander proves him to be a true follower of Basilio. When Rosina discovers her new teacher is actually Lindoro she is more than happy to run through her repertory. Figaro steals the key to Rosina?s window and promises to arrive at midnight for their elopement. Unexpectedly, a perfectly healthy Basilio turns up. However, even Bartolo has his reasons for trying to get rid of Basilio, and so everyone gangs up to convince him that he is really ill. Figaro shaves Bartolo to distract him, but with limited success.\n\nScene 2\nMidnight approaches with a fierce storm. Bartolo finds Rosina is still up, and to her horror he produces her letter to Lindoro: maliciously he claims that Lindoro was merely acting for another, namely Almaviva, who?s passed it on to a new girlfriend as a trophy. Rosina is devastated by Lindoro?s deviousness, and reveals the elopement plot ? unhappily she agrees to marry her guardian in order to be revenged on Lindoro. Bartolo leaves to get the mayor.\n\nAlmaviva and Figaro arrive, as planned, by ladder. Rosina, still thinking he is Lindoro, repudiates him, until he reveals that he and Almaviva are the same. Their romance duet comes to an abrupt end when Figaro discovers that the ladder, their means of escape, has been removed. Fortunately Basilio turns up with the Registrar to conduct the marriage to Bartolo, but is very quickly bribed by the Count to marry the young lovers instead. When Bartolo arrives, he is just too late ? and his deceit has been outwitted.\n\nGood commentary on this classical opera, and source of synopsis: &lt;a href=&quot;\nhttp://www.bamptonopera.org/repertory/paisiellobarberdetail.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bamptonopera.org/repertory/paisiellobarberdetail.htm&lt;/a&gt;\n\nPlease help seed so that others may enjoy this hard-to-find music, too!","torrent":{"xt":"urn:btih:c8052892a1b203cdbfa0be1b0f17ae9ee54fef2b","amp;dn":"Paisiello+-+Il+Barbiere+di+Siviglia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8052892a1b203cdbfa0be1b0f17ae9ee54fef2b","infoHashBuffer":{"type":"Buffer","data":[200,5,40,146,161,178,3,205,191,160,190,27,15,23,174,158,229,79,239,43]},"announce":[],"urlList":[]}}