{"title":"The Mark, Tom and Travis Show (The Enema Strikes Back) [320 Kbit","uid":4603846,"size":172449276,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c855803d02f228611a528b97e80b5918172502a3&amp;dn=The+Mark%2C+Tom+and+Travis+Show+%28The+Enema+Strikes+Back%29+%5B320+Kbit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Since1928","files":49,"time":1230386454,"description":"The Mark, Tom, and Travis Show (The Enema Strikes Back!) is Blink-182's only official live album. Released worldwide in 2000, only a million copies of this album were made. For those fans who discovered the band after its release, the CD became sought after by many and was renowned for its lack of availability. However, in July 2006 many copies appeared in shops like HMV[citation needed]. It has since then gone back into print in Australia since January 2007 with as many as 3 copies being in stock at JB Hi-Fi music outlets across the country packaged in the original Digipak with the original limited edition sticker. It is believed this was a move conducted by their former record label to combat scalpers of the original 2000 issue selling their old copies on online auction site eBay for hundreds of dollars a copy. Online retailer Amazon.com is sourcing new copies from Australia for sale through their website. The record is also available on the Scandinavian e-store CDON.\n\nThe album contains songs from three of the band's studio albums: Cheshire Cat, Dude Ranch and Enema of the State, mainly focusing upon Enema tracks as they were currently touring that album release. &quot;Man Overboard&quot; was a newly released song, which soon became a single. It was originally written for the Enema of the State album, and is available on the Enema of the State Demo. Following &quot;Man Overboard&quot;, the album returns to a live environment with twenty-nine hidden tracks collectively known as Words of Wisdom. These document examples of Mark and Tom's stage banter towards one another. Their toilet humor jokes are something the band was renowned for and are exampled here. The album also features previously unreleased material, including toilet humor songs, such as &quot;Family Reunion&quot; (released on Short Music for Short People in 1999), &quot;Blow Job&quot; and &quot;The Country Song&quot;. &quot;Dick Lips&quot; is censored as &quot;Rich Lips&quot;, and &quot;Blow Job&quot; is censored as &quot;Blew Job&quot; on the track listing.\n\n(Wikipedia)\n\nEnjoy !! This is the best live ever !\n\nIt's gonna be legen... wait for it... dary ! Legendary !!!","torrent":{"xt":"urn:btih:c855803d02f228611a528b97e80b5918172502a3","amp;dn":"The+Mark%2C+Tom+and+Travis+Show+%28The+Enema+Strikes+Back%29+%5B320+Kbit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c855803d02f228611a528b97e80b5918172502a3","infoHashBuffer":{"type":"Buffer","data":[200,85,128,61,2,242,40,97,26,82,139,151,232,11,89,24,23,37,2,163]},"announce":[],"urlList":[]}}