{"title":"Styx.Master.of.Shadows- RELOADED","uid":11170994,"size":6129025024,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8c7a5b14d4b8067f39eb0586437bc6186c277bd&amp;dn=Styx.Master.of.Shadows-+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Taker009","files":-1,"time":1412705903,"description":"nERv \n\nStyx: Master of Shadows (c) Focus Home Interactive \n\n10/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n:.......... DISC(S) .. GAME.TYPE ........: Action \n\nStyx: Master of Shadows is an infiltration game with RPG elements taking\nplace in a dark fantasy universe, where you sneak, steal and assassinate\nyour way through as Styx, a Goblin two-centuries of age. \n\nDeep inside the vertiginous and multi-layered forsaken Tower of Akenash,\nwhere Humans and Elves protect the World-Tree, source of the Amber\n- a powerful and magical golden sap - is hidden Styx' chance to\nunderstand his true origin... and to make a fortune at the same time. \n\nProwl through the huge, miles-high Tower of Akenash, completing various\nmissions (assassination, information recovery, etc.) and avoiding\ndetection. Progress in the shadows, assassinate your targets in close\ncombat, or orchestrate accidents. RPG mechanics let you unlock new\npowerful skills, impressive special moves, and an optimized equipment\nAmber will grant you spectacular powers such as invisibility,\namber vision, and the ability to clone yourself. Explore the levels\nto discover every bit of information about your past, and steal prized\ntreasures to acquire equipment upgrades. Embrace the shadows \n\nMission areas featuring truly organic player path-finding \n\nA strong focus on hardcore stealth and infiltration: progress through\nthe shadows with a sense of verticality, and explore to find hidden\ntreasures \n\nUpgrade your skills along six unique skill-trees to improve your\nstealth, assassination, and technique. \n\nDistract, solve, smother and prowl with your clone \n\nAn intricate story full of twists and revelations \n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:c8c7a5b14d4b8067f39eb0586437bc6186c277bd","amp;dn":"Styx.Master.of.Shadows-+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c7a5b14d4b8067f39eb0586437bc6186c277bd","infoHashBuffer":{"type":"Buffer","data":[200,199,165,177,77,75,128,103,243,158,176,88,100,55,188,97,134,194,119,189]},"announce":[],"urlList":[]}}