{"title":"Lemony_Snicket_A_Series_Of_Unfortunate_Events-ELEGANCE","uid":6784551,"size":529318721,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8d5f4d0f50a395c725d741610504176945da5d9&amp;dn=Lemony_Snicket_A_Series_Of_Unfortunate_Events-ELEGANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1320042798,"description":"Lemony Snicket: A Series Of Unfortunate Events (c) Activision\n\nsupplier..: Elegance\nrelease date...: 11/10/2004\ncracker...: Elegance\ngame type......: Adventure\nprotection: -\nimage format...: BIN/CUE\n\nAfter Violet,  Klaus and Sunny Baudelaire's parents perished in a fire,\nthey were  placed in the  care  of Count Olaf,  an actor  and master of\ndisguise. Now Olaf is out to do anything he can to get his hands on the\norphans' fortune, even plotting to kill them,  and he won't let  anyone\nstand in his way. Based on  the popular books and the movie of the same\ntitle,  you  can  follow  the  Baudelaire  orphans  as  this  eccentric\nadventure unfolds.\n\nYou'll feel  like  you've stumbled into  the pages of the popular books\nwith  familiar adventures and locations.  Explore Count Olaf's mansion,\nnavigate Uncle Monty's  hedge maze and run from  Aunt Josephine's house\nbefore it  collapses into Lake Lachrymose.  As you  work  through  each\nadventure, you'll encounter puzzles and strange situations. Use each of\nthe orphan's unique skills to outwit Count Olaf and  his band of creepy\ncohorts.  You must help  the orphans  avoid more bad  luck and save the\nfamily fortune.\n\n* Use wild inventions, such as the Bopper to clear enemies,  the Stilts\nto maneuver  through  a toxic  mess  and the Booster  for jet-powered \njumping  \n* Utilize each  of the orphan's  unique skills:  Violet,  the inventor;\nKlaus, the brave intellect and Sunny, the biting baby  \n* Based on the  Lemony Snicket's  book series and the movie of the same\ntitle  \n* Collect objects  to build inventions  for solving p uzzles or fending\noff Olaf and his cohorts  \n* Follow the misfortunes of the Baudelaire orphans - Violet,  Klaus and\nSunny  \n* Beat Count Olaf and  his wicked henchmen  before they take the family\nfortune  \n* Experience more  than 20 missions based on adventures  from the books\n\nINSTALLATION INSTRUCTIONS:\n- unpack game with your favorite extraction tool\n- either burn/mount image\n- install\n- play\n","torrent":{"xt":"urn:btih:c8d5f4d0f50a395c725d741610504176945da5d9","amp;dn":"Lemony_Snicket_A_Series_Of_Unfortunate_Events-ELEGANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d5f4d0f50a395c725d741610504176945da5d9","infoHashBuffer":{"type":"Buffer","data":[200,213,244,208,245,10,57,92,114,93,116,22,16,80,65,118,148,93,165,217]},"announce":[],"urlList":[]}}