{"title":"DRAGON BALL Z: ULTIMATE TENKAICHI - IMARS - XBOX360 - PAL {BOOBS","uid":6773467,"size":6196803316,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:c9022d3cf5ede024c8f1254b57d0a8198d909210&amp;dn=DRAGON+BALL+Z%3A+ULTIMATE+TENKAICHI+-+IMARS+-+XBOX360+-+PAL+%7BBOOBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"boobsman","files":69,"time":1319650811,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-C8B7_4EA827F1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-C8B7_4EA827F1.jpg&lt;/a&gt;\n\nIn Dragon Ball Z: Ultimate Tenkaichi prepare to dive into the world of the Dragon Ball manga, TV anime, films and video games head first, with brand new content and game play, a comprehensive character line up and faithful manga style graphics.\n\nDevelopment team Spike Co. Ltd. in Japan, the talented people responsible for sustaining the incredible worldwide success of the franchise over the past 6 years, have taken a new approach this time round, with the aim of creating a new landmark in the Dragon Ball videogame series. They've poured all their ki energy into upgrading the character and environment graphics, with character designs drawn straight from the original DBZ manga series, and totally destructible battle fields, including realistic craters and Kamehameha tracers cutting across the sky, delivering a heightened sensation of realism and dynamic immediacy.\n\nFeaturing the original Japanese voiceover and music, the enhanced story mode will immerse players in the rich variety of the Dragon Ball universe, where every element of the battle will thrill. The game will also include a special mode which allows the player to experience the brand new age of Dragon Ball Z. The controls are being designed to bring the experience closer to the previous Tenkaichi series, making the play accessible to all, but retaining all the tactical depth in battle.\n\nTHIS IS A SCENE RELEASE, ALL CREDIT GOES TO THE ORIGINAL RIPPER!!!\n","torrent":{"xt":"urn:btih:c9022d3cf5ede024c8f1254b57d0a8198d909210","amp;dn":"DRAGON+BALL+Z%3A+ULTIMATE+TENKAICHI+-+IMARS+-+XBOX360+-+PAL+%7BBOOBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9022d3cf5ede024c8f1254b57d0a8198d909210","infoHashBuffer":{"type":"Buffer","data":[201,2,45,60,245,237,224,36,200,241,37,75,87,208,168,25,141,144,146,16]},"announce":[],"urlList":[]}}