{"title":"Marvel Universe Trading Cards - Series I-V (1990-1994) (Reiu-DCP","uid":9243842,"size":490768770,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c9c0f4951bde9c7a54d4246eec0573c06e0531ed&amp;dn=Marvel+Universe+Trading+Cards+-+Series+I-V+%281990-1994%29+%28Reiu-DCP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"blackcanary","files":-1,"time":1385336995,"description":"English | CBR | 5 Sets\n\nMarvel Universe Trading Cards Series 1-5\nPublisher:  Marvel\nPublication Date:  1990 - 1994\n\nMarvel Universe Cards were collectible trading cards based on the characters and events of the Marvel Universe.\n\nSeries I - 1990\nOn the front of each card in the 1990 series, a character or event was featured. The back of the card displayed a short biography and statistics such as Real Name, Battles Fought, First Appearance, etc. The series included 162 normal cards, and five limited edition hologram cards inserted randomly throughout the packs.\n\nThis series offered several things that future series would not include. Such features were the 12 &quot;Spider-Man Presents:&quot; cards. In these cards, Spider-Man would conduct a humorous interview with other characters in the Marvel Universe, such as Doctor Doom, Doctor Octopus, the Hulk, Silver Surfer, Thor, the Punisher, Magneto, Captain America, Dr. Strange, Iron Man, Wolverine and, of course, himself. This is also the only series that offered nicknames, win/loss records, and a trading card of Stan Lee.\n\nOther categories in the series included Super Heroes, Super Villains, Rookies, Famous Battle, Most Valuable Comics and Team Pictures. In Series I, unique to this series, characters could have multiple cards in the same category. For example, Spider-Man has three cards under the Super Hero category (Cosmic Spider-Man, his Symbiote Costume and the Classic Spider-Man).\n\nSeries II - 1991\n\nThe following year, Marvel followed up with Series II. Once again there were 167 cards in total of this set, including five Holograms.\n\nIn this series, win/loss records were removed in favor of having Power Ratings. Each attribute, such as Speed, Stamina, Intelligence, Strength, Agility and Durability was rated for each character on a scale of 1 through 7. Series II also included three trading cards explaining what each rating meant. Later, these explanation were simply printed on the inside of the wrapper in which the cards were packaged.\n\nThe Famous Battle category was now renamed Arch-Enemies, to highlight particular rivalries as opposed to single confrontations. Spider-Man Presents was also removed. Instead, two new categories were introduced, but would not appear again in the future. These one time only categories were Legends and Weapons. Legends paid tribute to characters that had died such as Kraven the Hunter or Bucky. Weapons gave a statistical look at weaponry such as Spider-Man's Web Shooters, Wolverine's Claws, Daredevils Billy Club and the Ultimate Nullifier.\n\nThe Marvel Universe Series II Hologram Cards (unlike Series I) featured artwork that was different from the feature character's regular card.\n\nSeries III - 1992\n\nDuring this year, there were 205 trading cards including the traditional five Holograms. Each hologram was tinted a different color, for example Wolverine was tinted blue and Hulk was tinted green.\n\nThis series introduced new elements of design. Instead of having the &quot;Did You Know?&quot; fun fact on the back of each card (like series I and II both did), Series III featured a quote from each character.\n\nSeveral new categories were also introduced. Team-ups (cards displaying interesting pairings of two particular characters), Cosmic Being (cards showcasing characters that hail from outer space), the Origins card category that focused on specific character origins, and Milestones, which emphasized events in the Marvel Universe.\n\nThe background artwork for each card was an outer space scene which fitted together across adjacent cards.\n\nLimited edition factory tins(numbered to 10,000) were later sold that contained the full set of cards as well as an additional &quot;power ratings&quot; card.\n\nSeries IV - 1993\n\nThis set featured 179 base cards plus the checklist. It also had a 9 card red foil chase set featuring characters from the Marvel 2099 comics. It also had one very rare hologram featuring a Spider-Man vs Venom battle (with either red, green, or the highly sought-after blue tint). This card was inserted into 1 of every 180 packs, or 1 in every 5 boxes. This set was noteworthy because 135 of the 180 base set cards were portions of larger 9 card pictures. Thus, when the cards were put into standard 9 card sheets, the cards formed a large, contiguous, image. There were also 9 cards of &quot;Unsolved Mysteries&quot; such as Wolverine's origin or the identity of the 6th member of the Infinity Watch. The remaining cards featured famous battles of heroes vs villains and also heroes vs heroes.\n\nSeries V - 1994\n\nThis set continued the tradition set by Series IV in that it had some larger nine card artwork panels. However, these focused on specific comic book crossovers such as Fatal Attractions and Maximum Carnage. The backs of the cards summarized the progression of the plot of the crossover, sometimes related to the character on the front of the card, sometimes not. However, only 81 of the base set cards (200 cards total) were of this style. The majority of the cards were simply an alphabetic organization of heroes and villains (including Marvel 2099 cards, which played a more prominent role here).\n\nFor chase cards, this set had four holograms, 10 &quot;suspended animation&quot; cards (characters printed on clear plastic cards, used to promote the animated series running at the time), and nine &quot;power blast&quot; cards (foil/holofoil). The power blast cards came in three variants, having gold, silver, or rainbow backgrounds, depending on where the cards were purchased. The holograms came in three variants, red/dark orange tint, orange/green tint, and orange/red tint.\n\nAn uncut &quot;Promo Sheet&quot; was distributed featuring Sabertooth, Rogue, Hawkeye and Punisher.\n\nThanks goes to Reiu for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9226334&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9226334&lt;/a&gt;","torrent":{"xt":"urn:btih:c9c0f4951bde9c7a54d4246eec0573c06e0531ed","amp;dn":"Marvel+Universe+Trading+Cards+-+Series+I-V+%281990-1994%29+%28Reiu-DCP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c0f4951bde9c7a54d4246eec0573c06e0531ed","infoHashBuffer":{"type":"Buffer","data":[201,192,244,149,27,222,156,122,84,212,36,110,236,5,115,192,110,5,49,237]},"announce":[],"urlList":[]}}