{"title":"Empire TV Tycoon v1.0.2","uid":13675708,"size":252109704,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ca8265cd9c2b73f8237d13d7d0c60458f41beaea&amp;dn=Empire+TV+Tycoon+v1.0.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"jiawibia","files":1,"time":1456401024,"description":"Empire TV Tycoon v1.0.2\r\n\r\nTitle: Empire TV Tycoon\r\nGenre: Casual, Indie, Simulation, Strategy\r\nDeveloper: Dreamsite Games\r\nPublisher: Dreamsite Games\t\r\nRelease Date: 20 Oct, 2015\r\n\r\nAbout This Game\r\n\r\nEmpire TV Tycoon is a game for PC, Mac, and Linux in which you manage a TV channel and fight for audiences taking decisions that will project your channel to fame and fortune.You will decide the content of your channel, select advertisers, hire workers, make your own productions, hire actors, and engage in much more activities! It's inspired by games such as Mad TV, Mud TV, and other movie management games, with a modern approach on how to produce custom content such as movies or tv-shows.\r\n\r\nEmpire TV is a big corporation having serious losses, and It can't afford to maintain three channels, but only one, any longer. You have been hired to lead one of the channels to achieve fame and be the one that remains.\r\n\r\nKey Features\r\n\r\nManage your channel and determine the best content for the current audience. Also, increase your fame and win the war between the three Empire TV channels.\r\nEach audience group has its likes and dislikes. Make them happy and your fame will increase; make them sad and your channel will sink into the TV deeps.\r\nBuy and sell movies or TV shows that suit your audience best. Also, you can select your favorite movies from about 1000 movies.\r\nDon't be tempted to use illegal content. While pirated movies are cheaper, the risk is high and police is always watching.\r\nIf you can help the advertisers to reach your audience, you will win some money. But be careful: Sometimes, their requests and deadlines are hard to fulfill.\r\nHire workers who will help you to execute different tasks, and each one with their own level and skill.\r\nMake your own productions, movies or tv-shows. Distribute your resources effectively for each available movie genre.\r\nEnjoy a personalized and randomized movie script for each production. Lots of combinations for each movie genre.\r\nHire actors, knowing their own strengths and weakness, to act in your production. Do your best to keep them happy and utilize their skills efficiently.\r\nAs the director, you will have to take prudent decisions during the production, and these decisions will affect the final quality of the production.Submit your productions to the industry awards in different categories. Try to be the best and win glory and fame.\r\nAnd discover many secrets and other surprises related to the film industry in the last 50 years.\r\n\r\nSystem Requirements\r\n\r\nMinimum:\r\nOS: Windows XP\r\nMemory: 1024 MB RAM\r\nDirectX: Version 9.0\r\nHard Drive: 200 MB available space","torrent":{"xt":"urn:btih:ca8265cd9c2b73f8237d13d7d0c60458f41beaea","amp;dn":"Empire+TV+Tycoon+v1.0.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8265cd9c2b73f8237d13d7d0c60458f41beaea","infoHashBuffer":{"type":"Buffer","data":[202,130,101,205,156,43,115,248,35,125,19,215,208,198,4,88,244,27,234,234]},"announce":[],"urlList":[]}}