{"title":"O prisioneiro da grade de ferro","uid":4532936,"size":734259200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:caa8200d434223d93c3548f2573a4cfb31f165cc&amp;dn=O+prisioneiro+da+grade+de+ferro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"emmanuelptorres","files":1,"time":1227629164,"description":"Hell on Earth (as It Should Be), 10 February 2007\n\n\nAuthor: Claudio Carvalho from Rio de Janeiro, Brazil \n\nIn 2002, the greatest prison in Latin America, Complex Carandiru, was demolished. With a population of about 7,000 prisoners distributed in nine pavilions of five floors, this prison became known worldwide after the famous massacre of one hundred and eleven prisoners in 1992, inclusive subject of Hector Babenco&amp;#039;s film &quot;Carandiru&quot; (2003), awarded with eleven wins and eight nominations.\n\nA couple of months before its implosion, director Paulo Sacramento trained some inmates and together with his crew, they produced many hours of footage, showing the daily life in prison. Their internal rules, punishment, entertainment, weapons, death, drugs, booze, life conditions, food, sexual life, religion, creeds, families, hopes and dreams are exposed and disclosed along 123 minutes running time of documentary probably creating a sort of sympathy with many viewers that might feel sorrow for the situation.\n\nHowever, the documentary never shows the reasons why each of the inmates has been sentenced to such place, actually hell on earth. In a country where salaries are very low, unemployment rate is high, and many of honest workers live in slums, without sewage and water service and exposed to sub-human conditions of living, I am not surprised with the critical conditions of criminals, drug dealers and other outlaws sentenced to places like Carandiru as it should be. In a violent country like Brazil, where criminals are becoming sadistic, places like Carandiru must exist. Further, many corrupt politicians, embezzlers, entrepreneurs, wealthy people also deserves to be sent to places like that but unfortunately in Brazilian justice system only the poor people go to jail. Last but not the least, we do not live in an ideal perfect world, where prisons would not be necessary, and rehabilitation would happen for those who break the society&amp;#039;s laws.\n","torrent":{"xt":"urn:btih:caa8200d434223d93c3548f2573a4cfb31f165cc","amp;dn":"O+prisioneiro+da+grade+de+ferro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa8200d434223d93c3548f2573a4cfb31f165cc","infoHashBuffer":{"type":"Buffer","data":[202,168,32,13,67,66,35,217,60,53,72,242,87,58,76,251,49,241,101,204]},"announce":[],"urlList":[]}}