{"title":"Oxford Case Histories in TIA and Stroke [PDF] [StormRG]","uid":10293794,"size":5104955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:caec4ecc3ac72340880ca9f11f875f30ff1664d9&amp;dn=Oxford+Case+Histories+in+TIA+and+Stroke+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401895497,"description":"Author: Sarah T. Pendlebury, Ursula G. Schulz, Aneil Malhotra, Peter M. Rothwell\nSeries: Oxford Case Histories\nPaperback: 312 pages\nPublisher: Oxford University Press; 1 edition (March 24, 2012)\nLanguage: English\nISBN-10: 0199539340\nISBN-13: 978-0199539345\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nBased around the core curriculum for specialist trainees, Oxford Case Histories in Stroke features 51 well-structured, peer-reviewed cases from the Oxford Hospitals giving detailed coverage of the specialty, including diagnostic and management dilemmas.\n\nEach case comprises a brief clinical history and the relevant examination findings; details of investigations undertaken, followed by questions on differential diagnosis and management; and detailed answers and discussion. The question-and-answer format is designed to enhance the reader's diagnostic ability and clinical understanding.\n\nAs part of the Oxford Case Histories series, this book is aimed at post-membership trainees and consultants and will be a useful resource for those preparing for exit examinations or revalidation. It will also be of interest to those who wish to improve their skills in diagnosis and management of a broad range of stroke disorders.\n","torrent":{"xt":"urn:btih:caec4ecc3ac72340880ca9f11f875f30ff1664d9","amp;dn":"Oxford+Case+Histories+in+TIA+and+Stroke+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caec4ecc3ac72340880ca9f11f875f30ff1664d9","infoHashBuffer":{"type":"Buffer","data":[202,236,78,204,58,199,35,64,136,12,169,241,31,135,95,48,255,22,100,217]},"announce":[],"urlList":[]}}