{"title":"Joe &amp; Charlie - Alcoholics Anonymous Big Book Study","uid":8587001,"size":155503488,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cb26ac8850b89cf3c27707aa9dc66b8ec307edd3&amp;dn=Joe+%26amp%3B+Charlie+-+Alcoholics+Anonymous+Big+Book+Study&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":null,"files":34,"time":1371515085,"description":" \tJoe &amp; Charlie - Alcoholics Anonymous Big Book Study [32kbps] - D2\nDescription An Early History of the Joe &amp; Charlie Big Book Studies:\n\nJoe McQ. &amp; Charlie P. met in 1973 when Joe introduced Charlie as the AA speaker at an Al-Anon Convention. Joe had wondered if Charlie might be the country-western singer Charlie Pride. &quot;He wasn't even the right color,&quot; Joe laments. They instantly discovered their mutual fascination with AA's basic text &quot;The Big Book&quot;. What interested them most was that The Big Book was written in a particular sequence to convey certain ideas. That interest began a close friendship which has lasted to this day. They would frequently meet to discuss the book, often driving 225 miles to meet in each other's homes.\n\nSoon they were planning meetings in hotel rooms at AA conventions in Oklahoma and Arkansas, and within a few years, the meetings grew in popularity. In 1977, some members met in a Tulsa, OK hotel room for a discussion of the Big Book. One asked Joe &amp; Charlie to come to his home group to present a program on the book. An AA taper made a four tape set of their presentation and called it &quot;The Big Book Study&quot;. The tapes were gradually circulated throughout the fellowship and invitations were received for Joe &amp; Charlie to present the study at AA conventions, roundups and special events. By 1980, there had been about eight studies offered.\n\nAt the 1980 International AA Convention in New Orleans, Westly P. an impassioned Big Booker from Pompano Beach, Florida, organized a lunch for 1,500 AAs from all over the world and gave away 100 Joe &amp; Charlie tape sets as door prizes. Invitations exploded and within a couple of years, Joe &amp; Charlie were presenting about 36 studies a year worldwide. Obviously, the seminars struck a deep chord within AA members ... for the reaffirmation of &quot;this message&quot; as written in April 1939 with the publication of the first edition of Alcoholics Anonymous.\n\nStudies have been given in 48 states and most Canadian provinces. Additionally, Australia, New Zealand, England, Scotland, Ireland, Germany, Switzerland, Sweden and the Netherlands have all hosted the Big Book Study seminars with Joe &amp; Charlie.\n\nThe original Joe McQ. has had to curtail his travels in recent years. Oddly enough, another Joe -- Joe McC., active in the study group since the beginning -- has been able to pick up the slack. &quot;Where God guides, God provides,&quot; as some members say.\n\nAll this growth has not come without a measure of turbulence. What spiritual journey does not encounter obstacles? Some fellow AAs have termed the duo, &quot;self-appointed gurus&quot;. Others have accused them of making money on these weekends. Actually, only travel expenses, meals and lodging are paid for by the independent AA host committee sponsoring the study. This is in accordance with the AA Guidelines for Conferences and Conventions (MG4), published by the General Service Office. Since 1977, an estimated 200,000 AA Members have experienced the spiritual benefits of these collective studies.\nFile type: mp3\nbitrate: 32kbps","torrent":{"xt":"urn:btih:cb26ac8850b89cf3c27707aa9dc66b8ec307edd3","amp;dn":"Joe+%26amp%3B+Charlie+-+Alcoholics+Anonymous+Big+Book+Study","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb26ac8850b89cf3c27707aa9dc66b8ec307edd3","infoHashBuffer":{"type":"Buffer","data":[203,38,172,136,80,184,156,243,194,119,7,170,157,198,107,142,195,7,237,211]},"announce":[],"urlList":[]}}