{"title":"Al-Jazeera The Secret of the Seven Sisters 1of4 Desert Storms PD","uid":9821653,"size":596124928,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cb3ab00a18f7f18046bc288b2df0c0b5b8349c45&amp;dn=Al-Jazeera+The+Secret+of+the+Seven+Sisters+1of4+Desert+Storms+PD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"MVGroup","files":-1,"time":1395705177,"description":"The Secret of the Seven Sisters\n\nSociopolitical Documentary with no narration published by Al-Jazeera in 2014 - English language\n\n\nInformation\n------------------------------\n\nA four-part series that reveals how a secret pact formed a cartel that controls the world's oil.\nOn August 28, 1928, in the Scottish highlands, began the secret story of oil. Three men had an appointment at Achnacarry Castle - a Dutchman, an American and an Englishman. The Dutchman was Henry Deterding, a man nicknamed the Napoleon of Oil, having exploited a find in Sumatra. He joined forces with a rich ship owner and painted Shell salesman and together the two men founded Royal Dutch Shell. The American was Walter C. Teagle and he represents the Standard Oil Company, founded by John D. Rockefeller at the age of 31 - the future Exxon. Oil wells, transport, refining and distribution of oil - everything is controlled by Standard oil. The Englishman, Sir John Cadman, was the director of the Anglo-Persian oil Company, soon to become BP. On the initiative of a young Winston Churchill, the British government had taken a stake in BP and the Royal Navy switched its fuel from coal to oil. With fuel-hungry ships, planes and tanks, oil became &quot;the blood of every battle&quot;.\nThe new automobile industry was developing fast, and the Ford T was selling by the million. The world was thirsty for oil, and companies were waging a merciless contest but the competition was making the market unstable. That August night, the three men decided to stop fighting and to start sharing out the world's oil. Their vision was that production zones, transport costs, sales prices - everything would be agreed and shared. And so began a great cartel, whose purpose was to dominate the world, by controlling its oil. Four others soon joined them, and they came to be known as the Seven Sisters - the biggest oil companies in the world.\n\n\n1)  Desert Storms \nWe travel across the Middle East, through both time and space. Throughout the region's modern history, since the discovery of oil, the Seven Sisters have sought to control the balance of power. They have supported monarchies in Iran and Saudi Arabia, opposed the creation of OPEC, profiting from the Iran-Iraq war, leading to the ultimate destruction of Saddam Hussein and Iraq. The Seven Sisters were always present, and almost always came out on top. Since that notorious meeting at Achnacarry Castle on August 28, 1928, they have never ceased to plot, to plan and to scheme.\n\n2)  The Black El Dorado \nAt the end of the 1960s, the Seven Sisters, the major oil companies, controlled 85 percent of the world's oil reserves. Today, they control just 10 percent. New hunting grounds are therefore required, and the Sisters have turned their gaze towards Africa. With peak oil, wars in the Middle East, and the rise in crude prices, Africa is the oil companies' new battleground. But the real story, the secret story of oil, begins far from Africa. In their bid to dominate Africa, the Sisters installed a king in Libya, a dictator in Gabon, fought the nationalisation of oil resources in Algeria, and through corruption, war and assassinations, brought Nigeria to its knees. Oil may be flowing into the holds of huge tankers, but in Lagos, petrol shortages are chronic. The country's four refineries are obsolete and the continent's main oil exporter is forced to import refined petrol - a paradox that reaps fortunes for a handful of oil companies. Encouraged by the companies, corruption has become a system of government - some $50bn are estimated to have 'disappeared' out of the $350bn received since independence. But new players have now joined the great oil game. China, with its growing appetite for energy, has found new friends in Sudan, and the Chinese builders have moved in. Sudan's President Omar al-Bashir is proud of his co-operation with China - a dam on the Nile, roads, and stadiums. In order to export 500,000 barrels of oil a day from the oil fields in the South - China financed and built the Heglig pipeline connected to Port Sudan - now South Sudan's precious oil is shipped through North Sudan to Chinese ports. In a bid to secure oil supplies out of Libya, the US, the UK and the Seven Sisters made peace with the once shunned Colonel Muammar Gaddafi, until he was killed during the Libyan uprising of 2011, but the flow of Libyan oil remains uninterrupted. In need of funds for rebuilding, Libya is now back to pumping more than a million barrels of oil per day. And the Sisters are happy to oblige.\n\n3)  The Dancing Bear \nIn the Caucasus, the US and Russia are vying for control of the region. The great oil game is in full swing. Whoever controls the Caucasus and its roads, controls the transport of oil from the Caspian Sea. Tbilisi, Erevan and Baku - the three capitals of the Caucasus. The oil from Baku in Azerbaijan is a strategic priority for all the major companies. From the fortunes of the Nobel family to the Russian revolution, to World War II, oil from the Caucasus and the Caspian has played a central role. Lenin fixated on conquering the Azeri capital Baku for its oil, as did Stalin and Hitler. On his birthday in 1941, Adolf Hitler received a chocolate and cream birthday cake, representing a map. He chose the slice with Baku on it. On June 22nd 1941, the armies of the Third Reich invaded Russia. The crucial battle of Stalingrad was the key to the road to the Caucasus and Baku's oil, and would decide the outcome of the war. Stalin told his troops: &quot;Fighting for one's oil is fighting for one's freedom.&quot; After World War II, President Nikita Krushchev would build the Soviet empire and its Red Army with revenues from the USSR's new-found oil reserves. Decades later, oil would bring that empire to its knees, when Saudi Arabia and the US would conspire to open up the oil taps, flood the markets, and bring the price of oil down to $13 per barrel. Russian oligarchs would take up the oil mantle, only to be put in their place by their president, Vladimir Putin, who knows that oil is power. The US and Putin's Russia would prop up despots, and exploit regional conflicts to maintain a grip on the oil fields of the Caucusus and the Caspian. But they would not have counted on the rise of a new, strong and hungry China, with an almost limitless appetite for oil and energy. Today, the US, Russia and China contest the control of the former USSR's fossil fuel reserves, and the supply routes. A three-handed match, with the world as spectators, between three ferocious beasts - The American eagle, the Russian bear, and the Chinese dragon.\n\n4)  A Time for Lies \nPeak oil - the point in time at which the highest rate of oil extraction has been reached, and after which world production will start decline. Many geologists and the International Energy Agency say the world's crude oil output reached its peak in 2006. But while there may be less oil coming out of the ground, the demand for it is definitely on the rise. The final episode of this series explores what happens when oil becomes more and more inaccessible, while at the same time, new powers like China and India try to fulfill their growing energy needs. And countries like Iran, while suffering international sanctions, have welcomed these new oil buyers, who put business ahead of lectures on human rights and nuclear ambitions. At the same time, oil-producing countries have had enough with the Seven Sisters controlling their oil assets. Nationalisation of oil reserves around the world has ushered in a new generation of oil companies all vying for a slice of the oil pie. These are the new Seven Sisters.\nSaudi Arabia's Saudi Aramco, the largest and most sophisticated oil company in the world; Russia's Gazprom, a company that Russia's President Vladimir Putin wrested away from the oligarchs; The China National Petroleum Corporation (CNPC), which, along with its subsidiary, Petrochina, is the world's second largest company in terms of market value; The National Iranian Oil Company, which has a monopoly on exploration, extraction, transportation and exportation of crude oil in Iran - OPEC's second largest oil producer after Saudi Arabia; Venezuela's PDVSA, a company the late president Hugo Chavez dismantled and rebuilt into his country's economic engine and part of his diplomatic arsenal; Brazil's Petrobras, a leader in deep water oil production, that pumps out 2 million barrels of crude oil a day; and Malaysia's Petronas - Asia's most profitable company in 2012. Mainly state-owned, the new Seven Sisters control a third of the world's oil and gas production, and more than a third of the world's reserves. The old Seven Sisters, by comparison, produce a tenth of the world's oil, and control only three percent of the reserves. The balance has shifted.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img600.imageshack.us/img600/2655/vzb4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img600.imageshack.us/img600/2655/vzb4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img401.imageshack.us/img401/818/ch80.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img401.imageshack.us/img401/818/ch80.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img59.imageshack.us/img59/5301/dabd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img59.imageshack.us/img59/5301/dabd.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img22.imageshack.us/img22/2331/gkwp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img22.imageshack.us/img22/2331/gkwp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/6286/p3lw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/6286/p3lw.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img850.imageshack.us/img850/860/s2lq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img850.imageshack.us/img850/860/s2lq.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img22.imageshack.us/img22/7956/c036.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img22.imageshack.us/img22/7956/c036.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img34.imageshack.us/img34/1876/iudg.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img34.imageshack.us/img34/1876/iudg.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img62.imageshack.us/img62/734/rjjx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img62.imageshack.us/img62/734/rjjx.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e7aa868e89a7abd4c9d6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: CRF 20 (~1295Kbps)\n * Video Resolution: 832x432\n * Video Aspect Ratio: 1.93:1\n * Frames Rate: 25 FPS\n * Audio Codec: AAC-LC\n * Audio Bitrate: Q=0.42 VBR 48KHz (~128Kbps)\n * Audio Channels: 2\n * Run-Time: 47 mins\n * Number Of Parts: 4\n * Part Size: 493 MB (average)\n * Source: PDTV\n * Encoded by: JungleBoy\n\n\n\nLinks\n------------------------------\n\n1)  Further Information\n\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Return%20to%20Saudi%20Arabia&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Return%20to%20Saudi%20Arabia&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=We%20Were%20Warned%3A%20Tomorrow%27s%20Oil%20Crisis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=We%20Were%20Warned%3A%20Tomorrow%27s%20Oil%20Crisis&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Arabia%3A%20A%20Story%20of%20the%20Golden%20Ages&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Arabia%3A%20A%20Story%20of%20the%20Golden%20Ages&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Blowout%20-%20The%20Deepwater%20Horizon%20Disaster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Blowout%20-%20The%20Deepwater%20Horizon%20Disaster&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=BP%20-%2030%20Billion%20Blowout&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=BP%20-%2030%20Billion%20Blowout&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=A%20Crude%20Awakening%20-%20The%20Oil%20Crash&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=A%20Crude%20Awakening%20-%20The%20Oil%20Crash&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Gulf%20Oil%20Spill&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Gulf%20Oil%20Spill&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Crude%20Reality%20-%20%28Exxon%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Crude%20Reality%20-%20%28Exxon%29&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Toxic%20Legacy%20-%20%28BP%20Gulf%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Toxic%20Legacy%20-%20%28BP%20Gulf%29&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Gasland&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Gasland&lt;/a&gt;\n\n3)  ed2k Links \n\n\n&quot;ed2k://|file|Al-Jazeera.The.Secret.of.the.Seven.Sisters.1of4.Desert.Storms.PDTV.x264.AAC.MVGroup.Forum.mkv|596124928|b9d1a3068b74f8f6a0ea30d988364570|/&quot;\n&quot;ed2k://|file|Al-Jazeera.The.Secret.of.the.Seven.Sisters.2of4.The.Black.El.Dorado.PDTV.x264.AAC.MVGroup.Forum.mkv|533317991|52653dc7d9980335fa4cbe3d9f3cc5c5|/&quot;\n&quot;ed2k://|file|Al-Jazeera.The.Secret.of.the.Seven.Sisters.3of4.The.Dancing.Bear.PDTV.x264.AAC.MVGroup.Forum.mkv|496998532|5528d704f61eb68c1643b0a3faafbd90|/&quot;\n&quot;ed2k://|file|Al-Jazeera.The.Secret.of.the.Seven.Sisters.4of4.A.Time.for.Lies.PDTV.x264.AAC.MVGroup.Forum.mkv|440568002|cfd328a8cdd0cdaa67461fe85587a6ff|/&quot;\n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AJungleBoy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AJungleBoy&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=The_Secret_of_the_Seven_Sisters&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=The_Secret_of_the_Seven_Sisters&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cb3ab00a18f7f18046bc288b2df0c0b5b8349c45","amp;dn":"Al-Jazeera+The+Secret+of+the+Seven+Sisters+1of4+Desert+Storms+PD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb3ab00a18f7f18046bc288b2df0c0b5b8349c45","infoHashBuffer":{"type":"Buffer","data":[203,58,176,10,24,247,241,128,70,188,40,139,45,240,192,181,184,52,156,69]},"announce":[],"urlList":[]}}