{"title":"Schopenhauer: The World as Will and Representation: V1","uid":6387225,"size":3629946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb6fa26acb29e0c1ad6847e87b542ee399286f20&amp;dn=Schopenhauer%3A+The+World+as+Will+and+Representation%3A+V1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1305243645,"description":"Schopenhauer: The World as Will and Representation: Volume 1 (The Cambridge Edition of the Works of Schopenhauer)\n\nFirst published in 1818, The World as Will and Representation contains Schopenhauer's entire philosophy, ranging through epistemology, metaphysics, philosophy of mind and action, aesthetics and philosophy of art, to ethics, the meaning of life and the philosophy of religion, in an attempt to account for the world in all its significant aspects. It gives a unique and influential account of what is and is not of value in existence, the striving and pain of the human condition and the possibility of deliverance from it. This new translation of the first volume of what later became a two-volume work reflects the eloquence and power of Schopenhauer's prose and renders philosophical terms accurately and consistently. It offers an introduction, glossary of names and bibliography, and succinct editorial notes, including notes on the revisions of the text which Schopenhauer made in 1844 and 1859. \nBook Description\nThis new translation is the first volume of Schopenhauer's major work, which was highly influential on subsequent thinkers including Nietzsche, Freud and Beckett. \n\nHardcover: 696 pages \nPublisher: Cambridge University Press; 1 edition (November 29, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:cb6fa26acb29e0c1ad6847e87b542ee399286f20","amp;dn":"Schopenhauer%3A+The+World+as+Will+and+Representation%3A+V1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6fa26acb29e0c1ad6847e87b542ee399286f20","infoHashBuffer":{"type":"Buffer","data":[203,111,162,106,203,41,224,193,173,104,71,232,123,84,46,227,153,40,111,32]},"announce":[],"urlList":[]}}