{"title":"Unborn - The Life and Teachings of Zen Master Bankei.pdf","uid":11801905,"size":739356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbb05175c86c94400193cdb81b63ae85b4bff73a&amp;dn=Unborn+-+The+Life+and+Teachings+of+Zen+Master+Bankei.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"alongway","files":1,"time":1428420013,"description":"Unborn: The Life and Teachings of Zen Master Bankei, 1622-1693\n\n\n\nIn 1633, at age eleven, Bankei Yotaku was banished from his family's home because of his consuming engagement with the Confucian texts that all schoolboys were required to copy and recite. Using a hut in the nearby hills, he wrote the word Shugyo-an, or &quot;practice hermitage,&quot; on a plank of wood, propped it up beside the entrance, and settled down to devote himself to his own clarification of &quot;bright virtue.&quot;\n\nHe finally turned to Zen and, after fourteen years of incredible hardship, achieved a decisive enlightenment, whereupon the Rinzai priest traveled unceasingly to the temples and monasteries of Japan, sharing what he'd learned.\n\n&quot;What I teach in these talks of mine is the Unborn Buddha-mind of illuminative wisdom, nothing else. Everyone is endowed with this Buddha-mind, only they don't know it.&quot; Casting aside the traditional aristocratic style of his contemporaries, he offered his teachings in the common language of the people. His style recalls the genius and simplicity of the great Chinese Zen masters of the T'ang dynasty","torrent":{"xt":"urn:btih:cbb05175c86c94400193cdb81b63ae85b4bff73a","amp;dn":"Unborn+-+The+Life+and+Teachings+of+Zen+Master+Bankei.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbb05175c86c94400193cdb81b63ae85b4bff73a","infoHashBuffer":{"type":"Buffer","data":[203,176,81,117,200,108,148,64,1,147,205,184,27,99,174,133,180,191,247,58]},"announce":[],"urlList":[]}}