{"title":"Polynomial Chaos Methods for Hyperbolic Partial Differential","uid":11805430,"size":5547929,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc2c50b28fca6620cacf5feee79646cc6f35c69c&amp;dn=Polynomial+Chaos+Methods+for+Hyperbolic+Partial+Differential&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"zombie_rox","files":1,"time":1428559479,"description":"This monograph presents computational techniques and numerical analysis to study conservation laws under uncertainty using the stochastic Galerkin formulation. With the continual growth of computer power, these methods are becoming increasingly popular as an alternative to more classical sampling-based techniques. The text takes advantage of stochastic Galerkin projections applied to the original conservation laws to produce a large system of modified partial differential equations, the solutions to which directly provide a full statistical characterization of the effect of uncertainties.\n\n\nPolynomial Chaos Methods of Hyperbolic Partial Differential Equations focuses on the analysis of stochastic Galerkin systems obtained for linear and non-linear convection-diffusion equations and for a systems of conservation laws; a detailed well-posedness and accuracy analysis is presented to enable the design of robust and stable numerical methods. The exposition is restricted to one spatial dimension and one uncertain parameter as its extension is conceptually straightforward. The numerical methods designed guarantee that the solutions to the uncertainty quantification systems will converge as the mesh size goes to zero.\n\n\nExamples from computational fluid dynamics are presented together with numerical methods suitable for the problem at hand: stable high-order finite-difference methods based on summation-by-parts operators for smooth problems, and robust shock-capturing methods for highly nonlinear problems.\n\nAcademics and graduate students interested in computational fluid dynamics and uncertainty quantification will find this book of interest. Readers are expected to be familiar with the fundamentals of numerical analysis. Some background in stochastic methods is useful but notnecessary.\n\nPublisher: Springer; 2015 edition (March 11, 2015)\nLanguage: English\nISBN-10: 3319107135\nISBN-13: 978-3319107134\n\nEditorial Reviews\nFrom the Back Cover\n\nThis monograph presents computational techniques and numerical analysis to study conservation laws under uncertainty using the stochastic Galerkin formulation. With the continual growth of computer power, these methods are becoming increasingly popular as an alternative to more classical sampling-based techniques. The approach described in the text takes advantage of stochastic Galerkin projections applied to the original conservation laws to produce a large system of modified partial differential equations, the solutions to which directly provide a full statistical characterization of the effect of uncertainties.\n\nPolynomial Chaos Methods of Hyperbolic Partial Differential Equations focuses on the analysis of stochastic Galerkin systems obtained for linear and non-linear convection-diffusion equations and for a systems of conservation laws; a detailed well-posedness and accuracy analysis is presented to enable the design of robust and stable numerical methods. The exposition is restricted to one spatial dimension and one uncertain parameter as its extension is conceptually straightforward. The numerical methods designed guarantee that the solutions to the uncertainty quantification systems will converge as the mesh size goes to zero.\n\nExamples from computational fluid dynamics are presented together with numerical methods suitable for the problem at hand: stable high-order finite-difference methods based on summation-by-parts operators for smooth problems, and robust shock-capturing methods for highly nonlinear problems.\nAcademics and graduate students interested in computational fluid dynamics and uncertainty quantification will find this book of interest. Readers are expected to be familiar with the fundamentals of numerical analysis. Some background in stochastic methods is useful but not necessary","torrent":{"xt":"urn:btih:cc2c50b28fca6620cacf5feee79646cc6f35c69c","amp;dn":"Polynomial+Chaos+Methods+for+Hyperbolic+Partial+Differential","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc2c50b28fca6620cacf5feee79646cc6f35c69c","infoHashBuffer":{"type":"Buffer","data":[204,44,80,178,143,202,102,32,202,207,95,238,231,150,70,204,111,53,198,156]},"announce":[],"urlList":[]}}