{"title":"Island of Death Uncut Xvid.avi","uid":3228175,"size":1042837504,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc3424a21bc2164757de88c68d85c8b2961a65ee&amp;dn=Island+of+Death+Uncut+Xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"aabbccdd","files":1,"time":1091204769,"description":"DVDrip\n\nSet on the island of Mykonos. A young couple (Christopher and Celia) arrive on this quaint Greek Island for a winter break. They rent a house, and initially seem like ordinary, swinging thrill seekers, who enjoy having sex in a phone booth. But all of these rather innocent, initial impressions are shattered when Chris wanders outside one sunny morning, stumbles across a lost lamb, has sex with it, and then slaughters the poor creature with a handy knife! Celia seduces a local house painter, and screws him in a field as Christopher captures a few Kodak moments from afar. And together, they torture the poor guy by nailing his hands to the ground, urinate on him and force feeding him a bucket of paint. Then they invade the home of a gay shop keeper (a &quot;filthy creature&quot;), while a middle-aged lesbian slut gets torched from Chris and winds up decapitated by a bulldozer! There's also a black private eye on their trail, a creepy crime novelist, and a pair of degenerate hippies who rape Celia in her bathtub. One amusing scene is where Chris invades a gay party wielding a sword. Chris chases one of the guys through the middle of town with a sword and no one else in the town seems to notice. These two don't simply kill somebody--they also have to burn their faces off by lighting a handy aerosol bottle. The couple believe they are helping God punish the perverse by torturing and killing visiting (and local) sexual deviants. Or as Christopher puts it, &quot;I am his angel, with a flaming sword, sent to kill dirty worms&quot;.\nhttp://www.imdb.com/title/tt0188527/","torrent":{"xt":"urn:btih:cc3424a21bc2164757de88c68d85c8b2961a65ee","amp;dn":"Island+of+Death+Uncut+Xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc3424a21bc2164757de88c68d85c8b2961a65ee","infoHashBuffer":{"type":"Buffer","data":[204,52,36,162,27,194,22,71,87,222,136,198,141,133,200,178,150,26,101,238]},"announce":[],"urlList":[]}}