{"title":"Shamanism: An Encyclopedia of World Beliefs, Practices, and Cult","uid":4708411,"size":8287531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc4b42da3190bc6544892c0bfc13df640710001f&amp;dn=Shamanism%3A+An+Encyclopedia+of+World+Beliefs%2C+Practices%2C+and+Cult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"timnehguy","files":2,"time":1233936457,"description":"Shamanism: An Encyclopedia of World Beliefs, Practices, and Culture \nby Mariko Walter (Editor), Eva Fridman (Editor) \n\nPDF, 1081 pp. (printed in two volumes)\n\nShamanism is, arguably, the oldest form of religious experience, and the least understood. Almost every religious tradition has shamans, although they may be called prophets, healers, mystics, or miracle workers. The broad definition of shamanism used for this encyclopedia is &quot;a religious belief system in which the shaman is a specialist in the knowledge required to make a connection to the world of the spirits in order to bring about benefits for the other members of the community.&quot;\n\nVolume 1 contains 55 A-Z entries on &quot;General Themes in World Shamanism.&quot; These include Demonic possession and exorcism, Fire and hearth, Initiation, Music in world shamanism, and Offerings and sacrifice in shamanism, among others. Following the general entries, volume 1 has sections on North America, Central and South America, and Europe. Volume 2 looks at Eurasia, Korea and Japan, China, South Asia and Tibet, Southeast Asia, Australia and Oceania, and Africa. Within each of these sections, an introduction is followed by between 6 (for Australia and Oceania) and 27 (for Eurasia) articles on various aspects of shamanism among the cultures of the region. Every article is signed and has a bibliography as well as see also references. The articles vary in size from less than a page to several pages. There are many black-and-white photographs (one of Zora Neale Hurston as a Voudou dancer) and drawings. \n\nCheck my torrents for more reference works on shamanism and other spiritual topics, as well as other topics.  I have found on archive.org an introductory talk on shamanism that you can stream or download - http://www.archive.org/details/ShamanismTheOldestInwardPath/","torrent":{"xt":"urn:btih:cc4b42da3190bc6544892c0bfc13df640710001f","amp;dn":"Shamanism%3A+An+Encyclopedia+of+World+Beliefs%2C+Practices%2C+and+Cult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc4b42da3190bc6544892c0bfc13df640710001f","infoHashBuffer":{"type":"Buffer","data":[204,75,66,218,49,144,188,101,68,137,44,11,252,19,223,100,7,16,0,31]},"announce":[],"urlList":[]}}