{"title":"SwissKnife Premium v3.37 [mindcrasher]","uid":8952552,"size":4460767,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cc4ed19eae927e1f8b31e3c425cad9978337106d&amp;dn=SwissKnife+Premium+v3.37+%5Bmindcrasher%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mindcrasher","files":-1,"time":1379918458,"description":"SwissKnife Premium v3.37 -Tested- *Supports 2TB on External Hard Drives!* \n\nSwissKnife Premium Version adds support for higher capacity harddrives upto 2TB and new Windows OS like Windows 7\nand Windows Vista to the already popular SwissKnife.\n\nIf you are looking for an external hard disk drive solution that can be used interchangeably between Win 7 OS, Windows Vista,\nWindows XP, Mac OS and Linux, there is only one way to prepare the hard disk and SwissKnife does it for you. You can create,\ndelete and format partitions on your hard disk drives in one smooth, simple process. While the product has been tested up to\n2TB, it should support hard disks of up to 2TB. SwissKnife allows creation of FAT32 &amp; NTFS partitions. FAT16 option is provided\nfor compatibility. It Supports External interfaces such as Hi-Speed USB, Parallel port, PCMCIA, USB On-The-Go, Firewire.\nCreates Fixed and Removable Disk Format types. Support includes NTFS and features resizable windows. Upon completion,\nthe drive icons will be dynamically updated on your computer!\n\nSwissKnife allows creation of partitions in external Hard drives only. It will not allow altering the internal HDD.\n\nKey Features:\n\n* Formats faster than the OS (click on chart for details)\n* Allows change of cluster size during Full format or Quick Format\n* Divides a single hard drive into one or more partitions\n* Supports Hi-Speed USB, PCMCIA and FireWire external drives\n* Supports Fixed and Removable disk formats\n* Supports FAT, FAT32 &amp; NTFS systems\n* Allows creation of a single partition of up to 2TB of FAT32 or NTFS file systems.\n* Full format or Quick Format of existing partitions\n* Selective partitions can be modified for optimum flexibility\n\n{Supported Operating Systems: Windows 7/ Windows Vista/ XP (Home, MCE, Professional and Server edition, all service packs)}\n","torrent":{"xt":"urn:btih:cc4ed19eae927e1f8b31e3c425cad9978337106d","amp;dn":"SwissKnife+Premium+v3.37+%5Bmindcrasher%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc4ed19eae927e1f8b31e3c425cad9978337106d","infoHashBuffer":{"type":"Buffer","data":[204,78,209,158,174,146,126,31,139,49,227,196,37,202,217,151,131,55,16,109]},"announce":[],"urlList":[]}}