{"title":"[FakeHospital] Jana Prochazkova (Doctor prescribes an erotic mas","uid":11822396,"size":895262259,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cca2161de443fcc6ae0276fbbc1632585db56bd3&amp;dn=%5BFakeHospital%5D+Jana+Prochazkova+%28Doctor+prescribes+an+erotic+mas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chkm8te","files":1,"time":1429315956,"description":"[FakeHospital] Jana Prochazkova (Doctor prescribes an erotic massage for sexy blonde patient / fh1140 / 04.17.2015)\n\nI was taking a nap on the examining tale when there came a knock on the door and in walked a very sexy blonde indeed. I have a thing for blondes and this one looked incredible. Slim, beautiful and an ass that was begging to be out of those confining jeans. She complained of back pain and migraines, and said she might even be suffering from some whiplash when she braked hard in a car the other day. I walked round to her and felt her neck and spine. Having her head so close to my groin was making me hard and I hoped I didn't start stabbing her in the back of the head with my junior doctor. I told her to remove her top and climb onto the examining table. I began to massage the afflicted area and I turned the conversation to erotic massages. There something about oil and a pair of skilful hands that gets women turned on faster then a lightning bolt. I offered to give her a full body massage and she readily agreed. You all know where this is leading, it wasn't long before my cock was between her delicious lips and my fingers were sunk into her moist tight pussy. This healing session was in full swing and I fucked her in different positions on the examining table. She was an amazing fuck, she groaned and moaned as my cock sawed into her splendid tightness. All of her pain had disappeared as she lay impaled on the end of my cock. I knew I had another patient arriving soon, so as much as I was enjoying myself, I had to end this healing session. I bent her over the table and fucked her hard from behind before pulling out and splashing her ass cheeks with my well earned cumshot. Another successful healing session with my amazing cock cure. I do like to help my patients, especially the blonde ones.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=u286s966r095x06eyji7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=u286s966r095x06eyji7.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5dvo8bdcmyuutbi5y5az.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5dvo8bdcmyuutbi5y5az.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:cca2161de443fcc6ae0276fbbc1632585db56bd3","amp;dn":"%5BFakeHospital%5D+Jana+Prochazkova+%28Doctor+prescribes+an+erotic+mas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca2161de443fcc6ae0276fbbc1632585db56bd3","infoHashBuffer":{"type":"Buffer","data":[204,162,22,29,228,67,252,198,174,2,118,251,188,22,50,88,93,181,107,211]},"announce":[],"urlList":[]}}