{"title":"Essential Practical NMR for Organic Chemistry","uid":6520248,"size":6843817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdbd19d566954487512c2529a4d518e95bd061fd&amp;dn=Essential+Practical+NMR+for+Organic+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"_F1_","files":-1,"time":1309966473,"description":"S. A. Richards, &quot;Essential Practical NMR for Organic Chemistry&quot;\n Publisher: Wiley | 2011 | ISBN: 0470710926 | PDF | 228 pages | 6.53 MB\n\n This book describes the use of NMR spectroscopy for dealing with problems of small organic molecule structural elucidation. It features a significant amount of vital chemical shift and coupling information but more importantly, it presents sound principles for the selection of the techniques relevant to the solving of particular types of problem, whilst stressing the importance of extracting the maximum available information from the simple 1-D proton experiment and of using this to plan subsequent experiments. Proton NMR is covered in detail, with a description of the fundamentals of the technique, the instrumentation and the data that it provides before going on to discuss optimal solvent selection and sample preparation. This is followed by a detailed study of each of the important classes of protons, breaking the spectrum up into regions (exchangeables, aromatics, heterocyclics, alkenes etc.). This is followed by consideration of the phenomena that we know can leave chemists struggling; chiral centres, restricted rotation, anisotropy, accidental equivalence, non-first-order spectra etc. Having explained the potential pitfalls that await the unwary, the book then goes on to devote chapters to the chemical techniques and the most useful instrumental ones that can be employed to combat them.\n A discussion is then presented on carbon-13 NMR, detailing its pros and cons and showing how it can be used in conjunction with proton NMR via the pivotal 2-D techniques (HSQC and HMBC) to yield vital structural information. Some of the more specialist techniques available are then discussed, i.e. flow NMR, solvent suppression, Magic Angle Spinning, etc. Other important nuclei are then discussed and useful data supplied. This is followed by a discussion of the neglected use of NMR as a tool for quantification and new techniques for this explained. The book then considers the safety aspects of NMR spectroscopy, reviewing NMR software for spectral prediction and data handling and concludes with a set of worked Q&amp;As.","torrent":{"xt":"urn:btih:cdbd19d566954487512c2529a4d518e95bd061fd","amp;dn":"Essential+Practical+NMR+for+Organic+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbd19d566954487512c2529a4d518e95bd061fd","infoHashBuffer":{"type":"Buffer","data":[205,189,25,213,102,149,68,135,81,44,37,41,164,213,24,233,91,208,97,253]},"announce":[],"urlList":[]}}