{"title":"Byzantium by Michael Ennis","uid":9719098,"size":744952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdbef0b8dcbbf96912e77aaafe13b9c2e6680ff0&amp;dn=Byzantium+by+Michael+Ennis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":1,"time":1394151193,"description":"\nThe hero of this long, densely written saga is the dispossessed Viking prince Haraldr Sigurdarson, a real historical figure who participated in the power struggles of the Byzantine Empire, where he served incognito as an imperial bodyguard. Most of the other characters are plucked from history too, among them vain Empress Zoe and her vacillating, guilt-ridden emperor husband; the power-mad monk Joannes, Theodora, Constantine and fiery Maria of the Robes.\n\nEnnis, whose first novel this is, elaborates on actual historic events to create a mosaic of conspiracies and betrayals, sexual excess, battle scenes. Yet beneath the chic, glittery decadence he rings changes on time-worn themes: the redeeming power of love, lust for power versus statecraft, the conflict between desire and duty. Readers undeterred by the overly ornate prose and long descriptive passages may take to this 11th-century debauch.\n\nThe dialogue, at times stilted, is now and then wonderfully theatrical. In their cynicism, closeness to death and philosophy of living for the moment, these Byzantines have a contemporary feel.\n\nGenre: Fiction/Historical","torrent":{"xt":"urn:btih:cdbef0b8dcbbf96912e77aaafe13b9c2e6680ff0","amp;dn":"Byzantium+by+Michael+Ennis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbef0b8dcbbf96912e77aaafe13b9c2e6680ff0","infoHashBuffer":{"type":"Buffer","data":[205,190,240,184,220,187,249,105,18,231,122,170,254,19,185,194,230,104,15,240]},"announce":[],"urlList":[]}}