{"title":"Acupuncture for Body, Mind and Spirit","uid":10838320,"size":4416931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce4ce02e485a08efe87593b4ef2fab539aa35bdb&amp;dn=Acupuncture+for+Body%2C+Mind+and+Spirit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1408719211,"description":"Acupuncture for Body, Mind and Spirit by Peter Mole\n\nHow to Books Ltd | May 15, 2008 | English | ISBN: 190586213X | 166 pages | PDF | 4 MB\n\nAcupuncture is a holistic therapy which originated in China over 5000 years ago. It is now widely practised in the Western world to relieve the symptoms of a wide range of physical and psychological conditions. Acupuncture, as in all Chinese medicine, views the patient as a 'whole' and treats nearly all chronic disease as a manifestation of the individual's particular weaknesses. When acupuncture is directed at these long-standing weaknesses or 'imbalances', the patient is often amazed to find that not only is his or her main complaint improving, but many secondary complaints are too. By inserting very fine needles into specific points on the body, the life force or 'Qi' in the body is stimulated, enabling it to return to health, balance and harmony in body, mind and spirit. AUTHOR BIOG: Peter Mole is one of the UK's leading practitioners of acupuncture and is the Dean of Studies at the College of Integrated Chinese Medicine in Reading. Peter practises at the Oxford Natural Health Centre and is a member of the Executive Committee of the British Acupuncture Council.","torrent":{"xt":"urn:btih:ce4ce02e485a08efe87593b4ef2fab539aa35bdb","amp;dn":"Acupuncture+for+Body%2C+Mind+and+Spirit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce4ce02e485a08efe87593b4ef2fab539aa35bdb","infoHashBuffer":{"type":"Buffer","data":[206,76,224,46,72,90,8,239,232,117,147,180,239,47,171,83,154,163,91,219]},"announce":[],"urlList":[]}}