{"title":"SexArt Gold Card With Anna Rose 1080p ","uid":12359860,"size":1266965829,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ce91e1c87231d2171dedebe7537f2fc5b2285c8b&amp;dn=+SexArt+Gold+Card+With+Anna+Rose+1080p+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Chinu685","files":1,"time":1441519200,"description":" Anna Rose, in her first performance in a Sexart erotic feature, is on a mission. Armed with the Gold Card that gives Andrej Lupins film its name, she moves purposefully from one high end designer boutique to the next, accumulating items at every stop. When she returns to her luxe hotel suite Maxmilian Dior, in his Sexart debut is waiting for her, and she proceeds to model a few of her new purchases. But when Dior seems more interested in his smartphone than in her designer outfits Anna emerges from the dressing room completely nude, throws the phone aside, and demands her lovers full attention. There is a subtle, brooding chemistry at work here as the petite, sloe eyed beauty proceeds with her seduction. Rose takes a deliberate, calculated approach while stroking and sucking Dior initially. She eyes her partner with a focused yet ambiguous expression, as if daring him to resist her advances. And once she was straddled Dior she slides her wet pussy up and down the length of his erection in a manner that teases him while increasing her own pleasure. The fucking that eventually follows is something of a slow burn, punctuated by intervals of sucking, stroking, a passionate kiss, a tender touch of the noses. With her back turned and a foot up on the coffee table Rose gets licked and fingered from behind, and then she pushes Dior back on the couch, mounts him, and rides. Her skin glowing with exertion, Rose soon arrives at orgasm, and her reaction, both physical and vocal, beautifully expresses the power and intensity of her release. After a final bit of oral Rose locks her eyes on Diors, wraps her hand around his tool, and skillfully strokes him until he erupts. Then Dior returns to his phone, and Anna Rose gets dressed to leave for another round of shopping, but not before Maxmilian hands over the plastic. Viewers with a taste for the finer things in life will get a charge out of Gold Card.\n &lt;a href=&quot;\nhttp://sexyimage.org/img-55ebbac1c7b83.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexyimage.org/img-55ebbac1c7b83.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://milfimage.org/img-55ebbac8ed378.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://milfimage.org/img-55ebbac8ed378.html&lt;/a&gt;\n\n\n\nâ—†â—†â—†..:For more awesome stuff please click below:..â—†â—†â—†\n                                                        &lt;a href=&quot;\nhttps://thepiratebay.la/user/Chinu685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.la/user/Chinu685/&lt;/a&gt;","torrent":{"xt":"urn:btih:ce91e1c87231d2171dedebe7537f2fc5b2285c8b","amp;dn":"+SexArt+Gold+Card+With+Anna+Rose+1080p+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce91e1c87231d2171dedebe7537f2fc5b2285c8b","infoHashBuffer":{"type":"Buffer","data":[206,145,225,200,114,49,210,23,29,237,235,231,83,127,47,197,178,40,92,139]},"announce":[],"urlList":[]}}