{"title":"Oscar Peterson &amp; Itzhak Perlman - Side By Side (1994) [Jazz][mp3","uid":4825816,"size":150275744,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ced0ad24c1e2262531f841ac398c739fe5b5e006&amp;dn=Oscar+Peterson+%26+Itzhak+Perlman+-+Side+By+Side+%281994%29+%5BJazz%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"schon55","files":18,"time":1238941880,"description":"Oscar Peterson &amp; Itzhak Perlman - Side By Side\nYear: 1994\nLabel: Telarc\nTotal time: 62:22\nBitrate: 320 kbps\n\nClassical violinist Itzhak Perlman is not a jazz improviser so this meeting with the Oscar Peterson Quartet is more a loving tribute to the melodies ( ten veteran standards plus two Peterson originals ) than a strong jazz date.  While Perlman sticks closely to the themes, one's attention focuses much more on Peterson who had suffered a serious stroke a few years earlier and had been inactive ever since.  Peterson sounds healthy in his supportive role and, although it is doubtful if he sweated much during this relaxed music, his apparent comeback is great news. Guitarist Herb Ellis has the most rewarding solos ( although his spots are short ) but overall this is a so-so effort.  It's better to acquire Oscar Peterson's earlier records. ~ Scott Yanow, AMG\n\nOscar Peterson teaming up with a fine and distinguished classical musician, Itzhak Perlman, is one of the most ingenious collaborations the legendary pianist had ever done in the course of his glowing musical career.  The result is ear-catching and inspiring.  The novelty will never wear off. \n\nThe nimble-fingered pianist shares the spotlight with the virtuoso of the violin and multi-Grammy Award winner in presenting a dozen of classically-infused jazz tunes from this remarkable album,  'Side By Side.'  Joining them is a trio of talented musicians - guitarist Herb Ellis, bassist Ray Brown and drummer Grady Tate sharing their wealth of experience in their respective craft to bring to the listeners an innovative and enjoyable listening adventure. \n\nThe charms of these melodies are enhanced by the way Perlman plays his sweepingly beautiful violin.  'Yours Is My Heart Alone' completely captivated my ears. It is adapted from a classical piece 'Dein Ist Mein Ganzes Herz' composed by Franz LehÃƒÂ¡r from the operetta 'The Land of Smiles.'  It's one of my most magical listening moments. While 'Misty' has that tranquil beauty that will penetrate your heart and soul, 'Blue Skies' is all jazzed-up, it will put a smile on your face and will add spark to your listening experience.  The interplay between Peterson and Perlman in 'I Loves You Porgy' is so enchanting. They allow each other to have their own shining moments. I've never thought a piano and a violin will produce an utterly entrancing sound. Piano and violin combination is a sheer delight. I can imagine George Gershwin listening to this gorgeous piece with a big smile on his face. \n\nFans of Peterson and Perlman should not miss out on this recording. What makes this album so special to me is that two of my all-time favorite melodies which are seldom recorded are here, 'Dark Eyes' and 'Yours Is My Heart Alone.'  My ears are grateful and blissful! \n\nWith my heartfelt recommendation. ~ Rebecca*rhapsodyinblue*\n\nPersonnel:\nOscar Peterson (Piano) \nItzhak Perlman (Violin) \nHerb Ellis (Guitar) \nRay Brown (Double Bass) \nGrady Tate (Drums) \n\nOscar Peterson &amp; Itzhak Perlman - Side By Side Tracks:\n01  Dark Eyes (Traditional) 6:12 \n02  Stormy Weather (Harold Arlen/Ted Koehler) 4:54 \n03  Georgia on My Mind (Hoagy Carmichael/Stuart Gorrell) 5:46 \n04  Blue Skies (Irving Berlin) 4:45 \n05  Misty (Erroll Garner) 5:41 \n06  Mack the Knife (Kurt Weill) 3:32 \n07  Nighttime (Oscar Peterson) 6:18 \n08  I Loves You Porgy (George Gershwin) 4:51 \n09  On the Trail (Ferde GrofÃƒÂ©) 4:37 \n10  Yours is My Heart Alone (Franz Lehar) 5:29 \n11  Makin' Whoopee (Gus Kahn/Walter Donaldson) 4:49 \n12  Why Think About Tomorrow? (Oscar Peterson) 5:22 \n\n","torrent":{"xt":"urn:btih:ced0ad24c1e2262531f841ac398c739fe5b5e006","amp;dn":"Oscar+Peterson+%26+Itzhak+Perlman+-+Side+By+Side+%281994%29+%5BJazz%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced0ad24c1e2262531f841ac398c739fe5b5e006","infoHashBuffer":{"type":"Buffer","data":[206,208,173,36,193,226,38,37,49,248,65,172,57,140,115,159,229,181,224,6]},"announce":[],"urlList":[]}}