{"title":"Minimally Invasive and Robotic Thyroid and Parathyroid Surgery [","uid":10030124,"size":8920499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ced8c8da7125e4c69d3c47e4dd793699df49d78b&amp;dn=Minimally+Invasive+and+Robotic+Thyroid+and+Parathyroid+Surgery+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1398326865,"description":"Author: David J. Terris, Michael C. Singer\nHardcover: 242 pages\nPublisher: Springer; 2014 edition (January 21, 2014)\nLanguage: English\nISBN-10: 1461490103\nISBN-13: 978-1461490104\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nMinimally Invasive and Robotic Thyroid and Parathyroid Surgery is the first textbook which includes a comprehensive review of both minimally invasive and robotic thyroid and parathyroid techniques. Over the last several years there has been a rapid expansion in the number of different surgical approaches available to patients undergoing thyroid and parathyroid surgery. This book consolidates these in one source and focuses on both the philosophy and techniques of these procedures. For thyroid surgery, the text covers the full range of minimally invasive procedures and several of the most widely adopted remote access techniques. Several related procedures are also discussed, including minimally invasive approaches to central and lateral neck dissection. For parathyroid surgery, several minimally invasive techniques are covered, including radioguided surgery.\n\nWritten by experts in the field of thyroid and parathyroid surgery, Minimally Invasive and Robotic Thyroid and Parathyroid Surgery serves as a critical resource for both experienced and less experience surgeons, fellows, residents, and students interested in understanding the breadth of this field or learning the specific steps of a particular technique.","torrent":{"xt":"urn:btih:ced8c8da7125e4c69d3c47e4dd793699df49d78b","amp;dn":"Minimally+Invasive+and+Robotic+Thyroid+and+Parathyroid+Surgery+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced8c8da7125e4c69d3c47e4dd793699df49d78b","infoHashBuffer":{"type":"Buffer","data":[206,216,200,218,113,37,228,198,157,60,71,228,221,121,54,153,223,73,215,139]},"announce":[],"urlList":[]}}