{"title":"Lonely Planet - Slovenia - 8th Edition (2016).pdf Gooner","uid":14745147,"size":23115756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf36651abb12a27979242db538f9b983fd6d5d87&amp;dn=Lonely+Planet+-+Slovenia+-+8th+Edition+%282016%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464715637,"description":"Lonely Planet - Slovenia (Travel Guide) - 8th Edition (2016).pdf Gooner\r\n\r\nPublisher: Lonely Planet; 8 edition (13 May 2016)\r\nLanguage: English\r\nISBN-10: 174321572X\r\nISBN-13: 978-1743215722\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Slovenia is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Stroll the leafy streets of Ljubljana, dive into the great outdoors at Lake Bled or sip some of the world's best Merlot in Vipava; all with your trusted travel companion. Get to the heart of Slovenia and begin your journey now!\r\n\r\nInside Lonely Planet Slovenia Travel Guide:\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - history, art, literature, cinema, music, architecture, politics, sport, cuisine, wine, customs\r\n\r\n* Over 30 maps\r\n\r\n* Covers Ljubljana, Skofja Loka, Lake Bled, Bohinj, Kranjska Gora, Triglav National Park, Soca Valley, Vipava Valley, Lipica, Piran, Postojna, Rogaska Slatina, Prekmurje and more\r\n\r\nThe Perfect Choice: Lonely Planet Slovenia , our most comprehensive guide to Slovenia, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet's Eastern Europe, Central Europe or Mediterranean Europe guide.\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:cf36651abb12a27979242db538f9b983fd6d5d87","amp;dn":"Lonely+Planet+-+Slovenia+-+8th+Edition+%282016%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf36651abb12a27979242db538f9b983fd6d5d87","infoHashBuffer":{"type":"Buffer","data":[207,54,101,26,187,18,162,121,121,36,45,181,56,249,185,131,253,109,93,135]},"announce":[],"urlList":[]}}