{"title":"The Roches - Moonswept [2007][EAC,log,cue. FLAC]","uid":8622894,"size":317352204,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf5f0a6ea1749d266affacabcdbac1d5fafbdcde&amp;dn=The+Roches+-+Moonswept+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":17,"time":1372427122,"description":"Artist: The Roches\nRelease: Moonswept\nReleased: 2007\nLabel: 429 Records\nCatalog#: FTN 17636\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: folk\n\n1 Us Little Kids 3:10\n2 Only You Know How 4:24\n3 No Shoes 4:10\n4 Moonswept 2:58\n5 Family of Bones 3:00\n6 The Naughty Lady of Shady Lane 3:34\n7 Long Before 3:16\n8 The Piggy Mask 3:35\n9 Huh 2:15\n10 Stop Performing 3:10\n11 Gung Ho 3:12\n12 Instead I Chose 3:28\n13 September Eleventh at the Shambhala Center 4:21\n14 Jesus Shaves 4:16\n\nIt's all in the chord of voices. Right, &quot;chord.&quot; The imprint the Roches brought to popular music when they issued their self-titled debut in 1979 was as three voices forming a chord rather than as a lead vocalist with backing. The emotional quality in the grain of that chord has been a trademark for the group, but more than this is the poetic unspeakable notion of how all of everyday life -- with its losses, loves, noble aspirations, and petty resentments -- exists in the space between those voices, resulting in an authenticity that is utterly seductive in its warmth, quark strangeness, and mysterious charm. \n\nAfter ten albums together, the trio took an 11-year hiatus to become individuals again, &quot;normal&quot; people -- they performed as duos (Maggie and Suzzy) and various solos (Terre and Suzzy) during that time. (Maggie and Suzzy recorded the brilliant Zero Church album in 2002, and Terre recorded a finely wrought solo album and wrote John Kerry's campaign song.) The Roches come back together on Moonswept, which brings the chord of those voices back into popular culture again. While you may not have noticed they were gone, you missed them anyway. For all its immediate recognizable quality as a Roches record -- it's immediate and unmistakable -- there are key differences, too. The Roches chose to play almost all the instruments themselves this time out with the exception of percussion, some guitars, and &quot;heart strings&quot; by Stewart Lerman, who co-produced the album with the trio, and some piano by Terre's partner, Garry Dial. Oh, and there's a vocal solo by Lucy Wainwright Roche -- Suzzy's daughter -- on &quot;Long Before,&quot; which she authored. By the quality of the written and sung performance registered here by Lucy, perhaps the group will someday become a quartet. The album begins audaciously enough with &quot;Us Little Kids,&quot; a shuffling slow rock tune by Suzzy. It sounds like a tome to a lost love and it is, but of a different kind because there's too much innocence in it. This is a song about childhood and its regrets and trying to seesaw alone. Terre's unabashed folksy paean to love -- self and collective (it's a very Buddhist song) -- creates possibilities for this violent world to pass away and become something else: &quot;Did you ever ask yourself how did we get here/Floating on a sea of sorrow/Nothing else is clear...When the day is over/And you put down your plow/Only love can save you/And only you know how.&quot; &quot;No Shoes&quot; is one of two wonderful tunes by a friend of the sisters named &quot;Paranoid Larry.&quot; It's got that rondelet quality that the three engage in with one another with fine high-spirited guitars in a bluesy swing style. It's one of the funniest songs about gratitude ever! Paranoid Larry also wrote the album's closer, &quot;Jesus Shaves,&quot; which is funny but hardly irreverent. Like the songs on Rickie Lee Jones' Sermon on Exposition Boulevard, it places Christ inside the current era as a man who finds work, loses work, finds better work, and knows what it's like to be both misunderstood and received for who he is. \n\nMoonswept is one of those records where the musical literacy of the Roches comes to bear in virtually every song. The history of American popular music is felt in the title track by Suzzy, with its beautiful folk, doo wop, and soft rock feel in another song about innocence and childhood, and the chord wraps itself not so much around reverie, but the commonality of the experience that children make the best of things no matter where they are. It's a way of seeing the world that is captured in the in-between spaces; time melts away and becomes the here and now completely present in the past. The collective musical history is there in the old Gypsy swing barroom nugget &quot;The Naughty Lady of Shady Lane,&quot; by Roy Bennett and Sid Tepper. Snipping and popping guitars, both plucked and strummed, and a tough little bassline prod those voices toward euphoria as they celebrate this naughty lady rather than chide her. There is something approaching envy in the way the verses come down from the trio. &quot;Piggy Mask,&quot; by Terre and Suzzy, brings the Andrews Sisters into the lounge era at a sleepy tropical nightspot. Its glorious ukulele sounds underscore the unmasking of a fantasy and the wish that it were still alive, or perhaps that the reality behind the fantasy were real. And while the song addresses one person speaking to another about a relationship that is crumbling, it serves as an allegory, too, for those who think about America and its current relationship to the world as opposed to its mythical past. The rest of the album's 14 songs bear up as well. As the listener engages Moonswept, the title itself becomes the very descriptor of the experience of taking it in. The songs don't bleed into one another so much as the listener is taken both into and out of the current mental time/space continuum and plunged fully into a universe where the world's troubles, its pleasures, its losses, and its gifts become part and parcel of one's own fabric by virtue of the Roches' chord transmission. These songs are done with the sassy bravado listeners have come to expect from the Roche sisters. But inherent is a sense of humor that reveals humility and vulnerability to things so big that one can only approach them in small ways. As American musical traditions are channeled, synthesized, and evolved into others, with digital approximations of music serving as music itself -- and who says they aren't? -- and becoming more globally textured and nuanced, this synthesis seems to make profound sense as a way of hearing what has come before and what continues to inform and influence, with the grace of a muddy-kneed child and an aged sage who has experienced much and learned to appreciate the magic and terror of everyday life with wonder. Few recordings can accomplish this much. Moonswept does.","torrent":{"xt":"urn:btih:cf5f0a6ea1749d266affacabcdbac1d5fafbdcde","amp;dn":"The+Roches+-+Moonswept+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf5f0a6ea1749d266affacabcdbac1d5fafbdcde","infoHashBuffer":{"type":"Buffer","data":[207,95,10,110,161,116,157,38,106,255,172,171,205,186,193,213,250,251,220,222]},"announce":[],"urlList":[]}}