{"title":"10 Minute Solution 30 Day System - x264 - MP4 - DVDrip","uid":9057813,"size":2018025120,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cf6c8b49617d48fc5a7498ca336a67579128938d&amp;dn=10+Minute+Solution+30+Day+System+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MrTVGuy","files":-1,"time":1381986232,"description":"10 Minute Solution - Xpress Workouts 30-Day System\n\nAll workouts are in x264, DVDrip in the MP4 container. Encoded for maximum compatibility, small file size and good quality. Fully Softmodded Wii compatible.\n\nNO TIME TO EXERCISE?\nWe have the solution for you- the 10 Minute Solution! Everyone can find at least 10 minutes in their day, and we've developed over 25 workouts that are just 10 minutes each. Compact and ultra-efficient, the 10 minute workouts fit into even the busiest of schedules. Split them into separate workouts or mix and match your favorites to fit your schedule each day.\n\nIncludes:\n*Over 25 Workouts\n*30 Day Workout Calendars\n*30 Day Lean Extreme Meal Plan\n*10 Day Belly Blasting Meal Plan\n\nGET A SLIMMER, LEANER BODY WITH MORE MUSCLE TONE IN JUST 30 DAYS!\n\nThis comprehensive Xpress Workouts 30 Day System gives you a step by step guide to rapid results! With over 25 different workout routines, the combinations are endless. You also get two (2) 30 day workout calendars that outlines exactly which workout segments to do on each of the 30 days for the right kind of variety to keep challenge you muscle groups in the most effective ways which is key to optimizing results.\n\nAdditionally included as part of the 30-Day System is the Lean Extreme Meal Plan-designed to help you reduce body fat, increase lean muscle mass, and boost your metabolism. This meal plan combined with the workout calendar will jump start your weight loss and put you on the fast tract to a slim and sculpted midsection, tank top sexy arms and shoulders, and a high, tight tush.\n\nThink you don't have time to workout? Think again. Each workout fits into even the busiest of schedules. They not only torch tons of calories and tone muscle with maximum efficiency, they are also totally schedule flexible. If the workout calendar calls for three workouts today, you can do all 30 minutes in the morning, do 10 minutes before lunch and 20 before dinner, do 20 minutes in the morning and 10 minutes after dinner or any other breakdown that works for you.\n\nThat is it. Your weight is over. If you want to shed fat, sculpt lean muscle, and transform your body, start the Xpress Workouts 30 Day System today!","torrent":{"xt":"urn:btih:cf6c8b49617d48fc5a7498ca336a67579128938d","amp;dn":"10+Minute+Solution+30+Day+System+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6c8b49617d48fc5a7498ca336a67579128938d","infoHashBuffer":{"type":"Buffer","data":[207,108,139,73,97,125,72,252,90,116,152,202,51,106,103,87,145,40,147,141]},"announce":[],"urlList":[]}}