{"title":"CWTS Certified Wireless Technology Specialist Official Study Gui","uid":8668944,"size":45823849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf9bc78e875c0ec4a91c0e1a681f5d9dd370f79b&amp;dn=CWTS+Certified+Wireless+Technology+Specialist+Official+Study+Gui&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"d347hBy73","files":-1,"time":1373463647,"description":"CWTS: Certified Wireless Technology Specialist Official Study Guide: (PW0-071), 2nd Edition\n\nBook Details:\n\nPages: 600 \nPublisher: Sybex; 2nd Edition (September 2012)\nLanguage: English\nISBN-10: 1118359119\nISBN-13: 978-1118359112\nFormat: PDF\n\nFlashcards, practice exams, etc. available here: http://as.wiley.com/WileyCDA/WileyTitle/productCd-1118359119,miniSiteCd-SYBEX,descCd-DOWNLOAD.html\n\nBook Description:\n\nPass the CWTS exam with the help of this fully updated official guide.\n\nCompletely updated to cover the latest Certified Wireless Technology Specialist exam, this best-selling guide is the only Official Study Guide for the popular wireless certification. This foundation-level certification is in high demand for wireless networking professionals, and you can master all the exam topics with this Official guide. It covers all the exam objectives and helps you study with hands-on exercises, chapter review questions, an objective map, a pre-assessment test, and additional study tools on the companion website.\n\nThe only official study guide endorsed by CWNP\nThoroughly covers all exam objectives, including Wi-Fi Technology, Standards, and Certifications; Hardware and Software; Radio Frequency (RF) Fundamentals; Site Surveying and Installation; Applications, Support, and Troubleshooting; and Security &amp; Compliance\nIncludes hands-on exercises and real-world scenarios to increase understanding\nStudy aids include review questions, glossary, objective map, sample tests, and electronic flashcards\n\nCWTS: Certified Wireless Technology Specialist Official Study Guide, 2nd Edition is the study buddy that will enhance your chances for exam success.\n\nTable of Contents:\n\nChapter 1. Introduction to Computer Networking\nChapter 2. Introduction to Wireless Local Area Networking\nChapter 3. Wireless LAN Infrastructure Devices\nChapter 4. Wireless LAN Client Devices\nChapter 5. Physical Layer Access Methods and Spread-Spectrum Technology\nChapter 6. Radio Frequency Fundamentals for Wireless LAN Technology\nChapter 7. Wireless LAN Antennas and Accessories\nChapter 8. Wireless LAN Terminology and Technology\nChapter 9. Wireless LAN Security Basics\nChapter 10. Wireless LAN Site Survey Basics\nChapter 11. Performing an RF Wireless LAN Site Survey\nChapter 12. Troubleshooting and Maintaining IEEE 802.11 Wireless Local Area Networks\n\nAppendix A. Answers to Review Questions\nAppendix B. About the Additional Study Tools\n","torrent":{"xt":"urn:btih:cf9bc78e875c0ec4a91c0e1a681f5d9dd370f79b","amp;dn":"CWTS+Certified+Wireless+Technology+Specialist+Official+Study+Gui","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9bc78e875c0ec4a91c0e1a681f5d9dd370f79b","infoHashBuffer":{"type":"Buffer","data":[207,155,199,142,135,92,14,196,169,28,14,26,104,31,93,157,211,112,247,155]},"announce":[],"urlList":[]}}