{"title":"A$AP Rocky - Long.Live.A$AP (2013) [FLAC]","uid":8031748,"size":442262580,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cfbc4022f5a6601113d0e68f6fa777c661004442&amp;dn=A%24AP+Rocky+-+Long.Live.A%24AP+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1358435329,"description":"\n  A$AP Rocky - Long.Live.A$AP (2013) [FLAC]\n\n  Released: 2013\n  Duration: 49:12\n  Genre: Rap\n  Style: Underground Rap\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Long Live A $ AP \n  02 Goldie \n  03 PMW (All I Really Need)\n  04 LVL \n  05 Hell \n  06 Pain \n  07 Fuckin 'Problems  \n  08 Wild for the Night \n  09 1 Train \n  10 Fashion Killa \n  11 Phoenix \n  12 Suddenly \n  13 Jodye \n  14 Ghetto Symphony \n  15 Angels \n  16 I Come Apart\n\n  While his lyrics are thug-informed and filled with a snotty swagger, rapper A$AP Rocky cloaked himself in the crackle and reverb of witch house, and then connected the dots to hip-hop's druggy past, offering chopped (cut-up) and screwed (slowed-down) hooks that recalled the hypnotic world of DJ Screw, Three 6 Mafia, and Swishahouse. Mixtapes and the Internet were his platforms, while goth and Masonic designs were his imagery, and then somehow, some way, this polar opposite to what was poppin' in 2012 wound up in a Lana Del Rey video, performing next to Rihanna at the MTV Video Music Awards, starring in an EA Sports video games commercial, and on the RCA label with a three-million dollar contract. The reason is, he can create a batch of tracks as solid and addictive as the ones found on Long.Live.A$AP, his official debut album, which lands as a more ambitious, more polished alternative to his 2011 mixtape Live Love A$AP. Here, the album rolls out with the fan-tested title track and the near-perfect &quot;Goldie,&quot; a calling-card single with all the wooziness, hypnosis, ambitiousness, and pimp talk (&quot;Cause my chain came from Cuba, got a lock up on the link/And them red bottom loafers just to complement the mink&quot;) at proper levels. Later, the magic of &quot;Goldie&quot; will be punched up and reborn as an A$AP track that can welcome Drake, 2 Chainz, and Kendrick Lamar (&quot;F**kin' Problems&quot;), while Skrillex and Birdy Nam Nam bring dubstep and techno bleeping into the picture with ease (&quot;Wild for the Night&quot;); then there's &quot;1 Train,&quot; where Kendrick, Yelawolf, Danny Brown, Action Bronson, Joey Bada$$, and Big K.R.I.T. help reclaim the posse cut for the dark side. \n\n  With all the major-label-flavored bits tasting delicious, this debut goes the extra mile, anchoring it all with rich album cuts like &quot;LVL,&quot; where Clams Casino coats A$AP in a beautiful nightmare. It's the closing &quot;Suddenly&quot; that seals the deal, coming off as haunted hip-hop jazz musically, but lyrically, the rapper is at his least abstract here, &quot;thuggin' like Eazy-E in his prime,&quot; kicking &quot;conscious rap&quot; to the curb, and dropping some Master P quotes to prove he's &quot;'bout it, 'bout it.&quot; In the end, A$AP Rocky comes off as rap's Jim Morrison, offering an accessible, attractive, and brutish journey into darkness while remaining true to his spirit. Same danger, same swagger, same dynamic tension, and the same bust-a-nut/blow-your-mind duality, so think of the Lizard King as a No Limit soldier and you are just about there.","torrent":{"xt":"urn:btih:cfbc4022f5a6601113d0e68f6fa777c661004442","amp;dn":"A%24AP+Rocky+-+Long.Live.A%24AP+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfbc4022f5a6601113d0e68f6fa777c661004442","infoHashBuffer":{"type":"Buffer","data":[207,188,64,34,245,166,96,17,19,208,230,143,111,167,119,198,97,0,68,66]},"announce":[],"urlList":[]}}