{"title":"Dominic Lieven - The Cambridge History of Russia, Vol. 2 -  Impe","uid":9922010,"size":9119300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfec3b1d8178d6d3ac445b92e238883947d2426e&amp;dn=Dominic+Lieven+-+The+Cambridge+History+of+Russia%2C+Vol.+2+-++Impe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Anette14","files":4,"time":1397007251,"description":"Description\nProduct Details\nBook Title: The Cambridge History of Russia, Vol. 2: Imperial Russia, 1689-1917\t\nBook Author: Dominic Lieven (Editor)\nHardcover: 794 pages\nPublisher: Cambridge University Press; 1 edition (September 18, 2006)\nLanguage: English\nISBN-10: 0521815290\nISBN-13: 978-0521815291\n\nThe second volume of The Cambridge History of Russia covers the imperial period (1689-1917). It encompasses political, economic, social, cultural, diplomatic, and military history. All the major Russian social groups have separate chapters and the volume also includes surveys on the non-Russian peoples and the government's policies towards them. It addresses themes such as women, law, the Orthodox Church, the police and the revolutionary movement. The volume's seven chapters on diplomatic and military history, and on Russia's evolution as a great power, make it the most detailed study of these issues available in English. The contributors come from the USA, UK, Russia and Germany: most are internationally recognised as leading scholars in their fields, and some emerging younger academics engaged in cutting-edge research have also been included. No other single volume in any language offers so comprehensive, expert and up-to-date an analysis of Russian history in this period.\n\nReview\n&quot;The present collection of essays is the middle volume of three on Russia's history from early Rus' to the end of the twentieth century, giving Russia far more sustained attention than in any previous Cambridge History, and in remarkably wide-ranging and variegated way.&quot;\nMark D. Steinberg, Canadian Slavonic Papers\n\nBook Description\nAn examination of the imperial period in Russia, encompassing political, economic, cultural, diplomatic, and military history. It addresses issues such as major Russian social groups, women, the Orthodox Church and the police. No other single volume in any language offers such a comprehensive analysis of Russian history in this period.\n\nMost Helpful Customer Review\n5.0 out of 5 stars Another Incredible Collection of Scholarship December 8, 2011\nBy Jarrod Brown\nThe second volume of The Cambridge History of Russia offers another incredible collection of scholarship, and despite editor Dominic Lieven's assertions that &quot;only a few martyrs&quot; will read the book cover to cover, I did and with relish. Leiven has done an excellent job in arranging the thematic organization of a stupendous text in a way that provides both contextual continuity as well as a diversity of subjects and approaches.\nAs I also read the first volume &quot;in one sitting&quot; and immediately began the second, I did find the transition between the volumes a little jarring. The first volume, The Cambridge History of Russia, Volume 1, traces their history from about the ninth century up to the beginning of Peter I's (&quot;The Great&quot;) rule in 1682. The second volume stretches from Peter The Great to the fall of the tsarist empire in 1917. However, one distinctly feels that the first volume ends with Peter's rule and the second begins after his rule. As such, one cannot help but feel the critical period of The Great Reforms under Peter is neglected. This is likely attributable to the fact there is no series editor, and each volume has been largely left to its individual editors to treat as a separate work constrained only by the time frame. Each editor explains how they have sought to organize the text and considerations of topics, and this reinforces this idea.\nThe first section, Empire, also has a bit of a jarring, choppy feeling between articles (all by individual scholars, experts in the subject they address). However, this soon smooths out and one feels by the second section, &quot;Culture, Ideas and Identities&quot; that the volume has really come together in something cohesive and more than one might expect given its roughly chronological but certainly thematic arrangement.\nLike the other volumes of this set, the second is an exquisite and fascinating collection of scholarship. The section on Non-Russian Nationalities, particularly the article by Bobrovnikov, &quot;Islam in the Russian Empire,&quot; were excellent for their erudite scholarship. And if scholarly articles can be gripping then Daly's &quot;Police and revolutionaries&quot; is certainly an example. In fact, only Baberowski's article, &quot;Law, the judicial system and the legal profession&quot; was in any way lacking in my mind, and not for any lack of excellence in Baberowski's scholarship but rather for the pedantic tone of the article with remarks such as &quot;The peasants, of course, had no idea what the concept of separation of powers meant&quot; (p.355). The typical reader probably would not even notice such remarks.\nThis text will not disappoint those who share my interest and love of these vast and complex peoples, and despite the editor's concern that &quot;only the occasional martyr [will] read this book from cover to cover&quot; I am sure I am not the only one, and I am sure others who do as well will feel not a sense of martyrdom but of delight, and certainly thankful to Lieven's remarkable work in taking so many disparate threads and weaving them into a cohesive scholarly yarn.\nOf course, these volumes are quite pricy--the entire set is over $600 at the time of writing this, and this single volume is available used for $99 at the time of writing. This means they are out of the price range for most individuals who would not be using institutional money to purchase them. As a library acquisition, though, even for an institution that might not support Slavic/Russian studies, these are excellent resources to have. The bibliographies, which focus on Anglophone scholarship, realizing that its audience may not be able to read academic Russian texts, is extensive--collectively, it runs to several hundred pages across all three volumes. As a starting point for research or scholarship, I can think of no better place than this collection of texts.\n","torrent":{"xt":"urn:btih:cfec3b1d8178d6d3ac445b92e238883947d2426e","amp;dn":"Dominic+Lieven+-+The+Cambridge+History+of+Russia%2C+Vol.+2+-++Impe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfec3b1d8178d6d3ac445b92e238883947d2426e","infoHashBuffer":{"type":"Buffer","data":[207,236,59,29,129,120,214,211,172,68,91,146,226,56,136,57,71,210,66,110]},"announce":[],"urlList":[]}}