{"title":"The Truth About Trust by David Desteno","uid":9635009,"size":1242142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cff1995afc8f918d86b0258f8fa3ee97e6dee9b3&amp;dn=The+Truth+About+Trust+by+David+Desteno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"PirateBook","files":1,"time":1392835845,"description":"\nWhat really drives success and failure?\n\nCan I trust you? It's the question that strikes at the heart of human existence. Whether we're talking about business partnerships, romantic relationships, child-parent bonds, or the brave new world of virtual interaction, trust, when correctly placed, is what makes our world spin and lives flourish.\n\nRenowned psychologist David DeSteno brings together the latest research from diverse fields, including psychology, economics, biology, and robotics, to create a compelling narrative about the forces that have shaped the human mind's propensities to trust. He shows us how trust influences us at every level, from how we learn, to how we love, to how we spend, to how we take care of our own health and well-being. Using cutting edge research from his own lab, he also unlocks, for the first time, the cues that allow us to read the trustworthiness of others accurately.\n\nAppealing to readers of Dan Ariely, Dan Gilbert, and David Eaglemen, The Truth About Trust offers a new paradigm that will change not only how you think about trust, but also how you understand, communicate, and make decisions in every area of your life.\n\nGenre: Non fiction, Medical Books, Psychology","torrent":{"xt":"urn:btih:cff1995afc8f918d86b0258f8fa3ee97e6dee9b3","amp;dn":"The+Truth+About+Trust+by+David+Desteno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cff1995afc8f918d86b0258f8fa3ee97e6dee9b3","infoHashBuffer":{"type":"Buffer","data":[207,241,153,90,252,143,145,141,134,176,37,143,143,163,238,151,230,222,233,179]},"announce":[],"urlList":[]}}