{"title":"GI Joe Vs Transformers","uid":6861077,"size":223598561,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d006f65f48ffd5a7ea36adc31feabae33c12187c&amp;dn=GI+Joe+Vs+Transformers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":12,"time":1322903603,"description":"This torrents contain V2, V3, and V4 of the GI Joe Vs Transformers crossovers\n\nThe second mini-series was a sequel to the first story. Cybertronian technology has augmented both G.I. Joe and Cobra's forces, who are still fighting each other. During a battle, an accident causes several Joes and members of Cobra to be accidentally transported to Cybertron. The backlash of the accident also pulls several Transformers to Earth, as well as scattering them through time. The Joes and Cobra must travel into the past and future, to retrieve the missing Autobots and Decepticons before the Earth is destroyed. This is complicated by the fact that most of Cybertron is under the control of the Decepticon Shockwave.\n\nThe third mini-series, entitled The Art of War, followed on from the second mini-series, using elements of the first. The new story focused on a re-imagined version of Serpentor, in this continuity a cyborg created from the DNA of great war leaders, and the mechanical components of Megatron. Inadvertently freed by a Cobra raid, Serpentor journeyed to Cybertron. Now Hawk, Grimlock and the other Autobots and Joes must stop him before he takes the Autobot Matrix of Leadership for himself.\n\nA fourth mini-series consisting of two double-sized issues, entitled Black Horizon, was released in early 2007. After Hawk resigned from G.I. Joe in the wake of the events of &quot;The Art of War&quot;, he formed a loose alliance with the Autobots to stop the spread of Cybertronian technology. However, a much bigger threat looms: the serpent cult Cobra-La and the dark god of the Transformers Unicron. Hawk, Flint, and Optimus Prime go the Himalayas to confront Cobra-La, and find a long lost hero: Joe Colton, the original G.I. Joe.","torrent":{"xt":"urn:btih:d006f65f48ffd5a7ea36adc31feabae33c12187c","amp;dn":"GI+Joe+Vs+Transformers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d006f65f48ffd5a7ea36adc31feabae33c12187c","infoHashBuffer":{"type":"Buffer","data":[208,6,246,95,72,255,213,167,234,54,173,195,31,234,186,227,60,18,24,124]},"announce":[],"urlList":[]}}