{"title":"Phil Collins - Hits 320cbr 1998 Atlantic Records","uid":9440442,"size":180701896,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d032756fad08e786e468a45f4f79c36cdd4f0e3d&amp;dn=Phil+Collins+-+Hits+320cbr+1998+Atlantic+Records&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389002047,"description":"Phil Collins - Hits 320cbr (Big Papi) 1998 Atlantic Records (Size: 172.33 MB)\n\n\n\n01 Phil Collins - Another Day in Paradise.mp3\t12.46 MB\n02 Phil Collins - True Colors.mp3\t10.62 MB\n03 Phil Collins - Easy Lover.mp3\t11.7 MB\n04 Phil Collins - You Can't Hurry Love.mp3\t6.73 MB\n05 Phil Collins - Two Hearts.mp3\t7.96 MB\n06 Phil Collins - I Wish It Would Rain Down.mp3\t12.68 MB\n07 Phil Collins - Against All Odds (Take a Look at Me Now).mp3\t7.98 MB\n08 Phil Collins - Something Happened on the Way to Heaven.mp3\t11.27 MB\n09 Phil Collins - Separate Lives.mp3\t9.56 MB\n10 Phil Collins - Both Sides of the Story.mp3\t15.3 MB\n11 Phil Collins - One More Night.mp3\t11.08 MB\n12 Phil Collins - Sussudio.mp3\t10.14 MB\n13 Phil Collins - Dance into the Light.mp3\t10.18 MB\n14 Phil Collins - A Groovy Kind of Love.mp3\t8.14 MB\n15 Phil Collins - In the Air Tonight.mp3\t12.77 MB\n16 Phil Collins - Take Me Home.mp3\t13.6 MB\n\nSource: 1998 CD\n\n\n\nBy Tim Brough TOP 1000 REVIEWERVINE VOICE\nPhil Collins was one in a rather select club of pop-meisters in the 80's that just seemed to turn all they touched into gold. Along with Madonna, Prince and Michael Jackson, it seemed that every time you turned on the radio, you would hear something either by them or a pale imitation. For Phil Collins, that meant being the cottage cheese of British nice-guy pop for most of the decade, and into the early 90's.\n\nHis divorce in 1980 was the grist that created &quot;Face Value,&quot; and before you could say &quot;mike up those drums,&quot; &quot;In The Air Tonight&quot; became the new sound of percussionists everywhere. Only Phil and Peter Gabriel had this kind of pummel in their music, and the song's inclusion in &quot;Miami Vice&quot; burned it into the national subconscious...even enough to start an urban legend about the lyric's subject matter.\n\nThere was still some left-over emotional baggage for &quot;Hello, I Must Be Going,&quot; but it was Collin's choice of a Motown cover that landed him on the charts. &quot;You Can't Hurry Love&quot; was the beginning of his nascent blue-eyed soul string of hits. By the time the monster album &quot;No Jacket Required&quot; appeared, Phil was making songs that aped Prince (&quot;Sussudio&quot;) and carried a full-on horn section that was reminiscent of Earth Wind and Fire. He even became an in-demand producer, and gave EWF's Phillip Bailey his only major solo hit by duetting on &quot;Easy Lover.&quot;\n\nThat demand extended into films. He added the Oscar nominated &quot;Separate Lives&quot; and &quot;Against All Odds&quot; to his resume and starred in &quot;Buster.&quot; (He also had a memorable cameo in the HBO AIDS drama &quot;And The Band Played On.&quot;) But he was also beginning to push for larger things. On the next album, &quot;But Seriously,&quot; he tried to get - well - serious. &quot;Another Day In Paradise&quot; took a look at homelessness, but it was balanced by the peppy &quot;Something Happened On The Way To Heaven&quot; and the more rocking &quot;I Wish It Would Rain Down,&quot; featuring Eric Clapton.\n\nBut on the increasingly introspective and world-weary &quot;Both Sides,&quot; the title track addressed urban and domestic violence...perhaps a bit too much for the popsters awaiting another catchy &quot;Sussudio&quot; or a dreamy ballad like &quot;One More Night.&quot; It took three more years for &quot;Dancing Into The Light&quot; to appear, but by 1996 Phil's hitmaking days had passed. It was a good album, and the title track appears on &quot;Hits.&quot; But the time had passed.\n\nThere is one new song here, the Babyface produced cover of Cyndi Lauper's &quot;True Colors.&quot; It won't make you forget Cyndi's version. How much you need &quot;Hits&quot; will likely depend on how nostagic you are for Phil's 80's omnipresnce. Also, since this &quot;Hits&quot; set was released in 1998, there have been a few missing links since then. His album &quot;Testify&quot; was a strong return (even without the mammoth commercial success) and Phil won an Oscar for &quot;You'll Be In My Heart&quot; from the Disney version of &quot;Tarzan.&quot; There were enough omissions from the earlier albums that were hit singles to merit an eventuall &quot;Ultimate&quot; two disc set (&quot;I Missed Again,&quot; &quot;Everyday,&quot; &quot;I Don't Care Anymore&quot; to list three), so maybe it's time for Rhino to raid the remastering vaults.\n\n(PS = Why &quot;Face Value&quot; or &quot;No Jacket Required&quot; haven't yet been remastered is beyond me.)","torrent":{"xt":"urn:btih:d032756fad08e786e468a45f4f79c36cdd4f0e3d","amp;dn":"Phil+Collins+-+Hits+320cbr+1998+Atlantic+Records","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d032756fad08e786e468a45f4f79c36cdd4f0e3d","infoHashBuffer":{"type":"Buffer","data":[208,50,117,111,173,8,231,134,228,104,164,95,79,121,195,108,221,79,14,61]},"announce":[],"urlList":[]}}