{"title":"Ken Wilber Kosmic Consciousness-Brief History Everything","uid":4563698,"size":758395241,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d03cf26b30a92d1a6b667e8b980623d81b8a2e88&amp;dn=Ken+Wilber+Kosmic+Consciousness-Brief+History+Everything&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tazmaniat","files":91,"time":1228780626,"description":"A Brief History of Everything\nThis account of men and women&amp;#039;s place in a universe of sex and gender, self and society, spirit and soul is written in question-and-answer format, making it both readable and accessible. Wilber offers a series of original views on many topics of current controversy, including the gender wars, multiculturalism, modern liberation movements, and the conflict between various approaches to spirituality.\n\n\nKosmic Consciousness [UNABRIDGED] (from 10 Audio CDs\n&quot;Just who is Ken Wilber?&quot; For more than 30 years, a rising tide of readers enthralled by this visionary philosophers map of human potential have asked this question about the famously &quot;low profile&quot; author. Finally, early this year, Wilber the author of A Brief History of Everything and Grace and Grit agreed to create a series of in-depth dialogues on audio for the first time ever. The result is Kosmic Consciousness: a landmark recording that invites us to experience a full-length audio learning course with this celebrated thinker.\nListeners will be surprised and delighted to discover the Ken Wilber behind the writer spontaneous, irreverent, and incredibly passionate about how each of us can participate in the unfolding of human consciousness. Through over 12 hours of revelatory insights, Kosmic Consciousness explores: The integral map of the Kosmos (the universe that includes the physical cosmos as well as the realms of consciousness and Spirit), the pursuit of the Good, the True, and the Beautiful, discovering your &quot;multiple intelligences&quot;, using altered states, male and female sexuality, how meditation accelerates personal growth, prayer, does it work?, integral perspectives on individuals spanning Jung to Piaget, Baryshnikov to Nietzsche, Jesus to the Buddha, and much more.","torrent":{"xt":"urn:btih:d03cf26b30a92d1a6b667e8b980623d81b8a2e88","amp;dn":"Ken+Wilber+Kosmic+Consciousness-Brief+History+Everything","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03cf26b30a92d1a6b667e8b980623d81b8a2e88","infoHashBuffer":{"type":"Buffer","data":[208,60,242,107,48,169,45,26,107,102,126,139,152,6,35,216,27,138,46,136]},"announce":[],"urlList":[]}}