{"title":"Hitler's Last Day: Minute by Minute (2015) epub","uid":11825632,"size":1557005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d067d6c2270a1ee8b79c97e623e262b5c29e948c&amp;dn=Hitler%27s+Last+Day%3A+Minute+by+Minute+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1429485187,"description":"\n On 30th April 1945 Germany is in chaos...\n\n Russian troops have reached Berlin. All over the country, people are on the move - concentration camp survivors, Allied PoWs, escaping Nazis - and the civilian population is fast running out of food. The man who orchestrated this nightmare is in his bunker beneath the capital, saying his farewells.\n\n Hitler's Last Day: Minute by Minute is pure chronological narrative, as seen through the eyes of those who were with Hitler in those last tumultuous hours; those fighting in the streets of Germany; and those pacing the corridors of power in Washington, London and Moscow. It was a day of endings and beginnings when ordinary people were placed in extraordinary situations.\n\n Take Sisi Wilczek, fleeing the advancing Russians with her family's vast fortune in a shoebox; President Truman, weighing up whether to use the atomic bomb that his Secretary of War calls 'the most terrible weapon ever known in human history'; German officer Claus Sellier, on a last mission across the country to deliver vital documents; or Allied aircrews dropping food parcels to feed the starving Dutch population.\n\n 30th April 1945 was a day that millions had dreamed of, and millions had died for","torrent":{"xt":"urn:btih:d067d6c2270a1ee8b79c97e623e262b5c29e948c","amp;dn":"Hitler%27s+Last+Day%3A+Minute+by+Minute+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d067d6c2270a1ee8b79c97e623e262b5c29e948c","infoHashBuffer":{"type":"Buffer","data":[208,103,214,194,39,10,30,232,183,156,151,230,35,226,98,181,194,158,148,140]},"announce":[],"urlList":[]}}