{"title":"Chris Thomas King - Rise [2006][ FLAC]","uid":8700930,"size":283808273,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d06d4036af6e476049ae35340169f10410c4af19&amp;dn=Chris+Thomas+King+-+Rise+%5B2006%5D%5B+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":13,"time":1374066875,"description":"Artist:Chris Thomas King\nRelease:Rise\nReleased: 2006\nLabel: 21st Century Blues Records\nCatalog#: 612114\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:blues\n\n1\tWhat Would Jesus Do?\t4:06\n2\tFaith\t5:25\n3\tBaptized in Dirty Water\t5:07\n4\tFlow Mississippi Flow\t4:11\n5\tSt. James Infirmary\t4:38\n6\tWhen Magnolias Bloom\t3:44\n7\tBig Yellow Taxi 3:24\n8\tLike a Hurricane (Ghost of Marie Laveau)\t5:06\n9\tDeepest Ocean\t4:32\n10\t'Tis the Last Rose of Summer\t4:13\n11\tWhat a Wonderful World 2:25\n\nNew Orleans musician Chris Thomas King lost both a home and a recording studio when Hurricane Katrina had landfall at the close of summer in 2005, and it's hardly startling that his album Rise takes Katrina and the devastating aftermath of the storm as a central theme. The result is a tremendously elegiac outing, and even when King goes up-tempo, as he does on a cover of Joni Mitchell's &quot;Big Yellow Taxi,&quot; the song itself is all about incalculable loss and the incredible indifference of contemporary America to its own personal history. Things are drowning and washing away in song after song on Rise, and King isn't afraid to name names. In &quot;Faith,&quot; the song's narrator clings to a rooftop as bodies float by and he realizes that President Bush is in a plane over New Orleans in the same instant, and it is a powerful moment that literally defines the notion of differing perspectives. Does he really care, the narrator wonders. Rise deals with loss, death and the hope for rebirth in mostly hushed tones, and while many still think of King as primarily a blues artist, the album is really closer to a kind of pop gospel outing, only stripped of much of the certainty and joy that gospel usually conveys. Rise is King's personal revaluation of America, and the truths he examines are unclear, as perhaps they have always been. Although it works as one long and mostly melancholy suite, a few of Rise's songs do stand out, like the ominous and ultimately resigned &quot;Flow Mississippi Flow,&quot; a lightly rewritten version of &quot;St. James Infirmary&quot; (certainly one of the most death-haunted songs in the whole history of American music) and the elegant &quot;'Tis the Last Rose of Summer,&quot; which is dedicated to King's mother, who passed in December of 2005. King didn't record this album to further his career so much as a way to stumble towards an understanding of America in the 21st century, using Katrina as a necessary lens. Again, he doesn't come up with answers, but sometimes it's the questions that matter most, although asking why, King suggests, isn't particularly useful when everything has been washed away. What now, is the real question, and the answer to that question is still up in the air. The nature of modern media is to move on to the next thing. King and others whose lives were forever changed by Katrina and its aftermath don't have that option.","torrent":{"xt":"urn:btih:d06d4036af6e476049ae35340169f10410c4af19","amp;dn":"Chris+Thomas+King+-+Rise+%5B2006%5D%5B+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d06d4036af6e476049ae35340169f10410c4af19","infoHashBuffer":{"type":"Buffer","data":[208,109,64,54,175,110,71,96,73,174,53,52,1,105,241,4,16,196,175,25]},"announce":[],"urlList":[]}}