{"title":"Dead Space: Extraction [Wii-PAL] [MULTI5]","uid":6975774,"size":4605345792,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:d0b3106fbca9ed38cf9a75ea0e91b72a1c998e6d&amp;dn=Dead+Space%3A+Extraction+%5BWii-PAL%5D+%5BMULTI5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Sp2010","files":-1,"time":1327245975,"description":"Amazon Link: http://www.amazon.co.uk/Electronic-Arts-Dead-Space-Extraction/dp/B0021AEKOO\n\nHardcore sci-fi action comes to the Wii, with an exclusive prequel that shows just how the necromorph outbreak began. Playing as a new female character you must try to halt the terrifying alien menace and save as many people as you can.\nRather than a slower paced survival horror, this is an on-the-rails lightgun style adventure. That means your character moves automatically as you aim and shoot at the screen with the Wii remote. There\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s much more to the gameplay than other similar games though, with the ability to choose multiple different paths and solve challenging in-game puzzles.\n\nThe action and atmosphere is still as intense as ever too, as you\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'re forced to dismember the necromorph in order to ensure they stay (un)dead. It\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s not the sort of game you usually see on the Wii, but that could all change once gamers get their hands on this all-action thriller.\n\nKey Features\nGround zero: The only official prequel to the smash hit survival horror - find out what happened before the events of the original game and the animated movie.\nOff-the-rails: Longer, deeper and more involved than any other lightgun game, with multiple routes to choose from and unique environmental puzzles to solve.\nTwist and shoot: Use new and familiar weapons such as the plasma cutter, ripper and line gun, now with more accurate motion-sensitive controls.\nGraphic violence: Stunning graphics and award-winning sound design live up to the standards of the Xbox 360 and PlayStation 3 game.\nSafety in numbers: Drop-in/drop-out co-operative play allows a friend to join or leave the action at any time.\nAbout the Developer: Visceral Games\nEA Redwood Shores used to be just another Electronic Arts studio, making games like The Godfather and The Simpsons. Then they were given free rein to work on original projects such as Dead Space and Dante\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\'s Inferno. EA were so impressed they even let them change their name...\n\n\n5 European Languages\nfor Wii only\nPAL\n\nTested on Configurable USB Loder, using 247.","torrent":{"xt":"urn:btih:d0b3106fbca9ed38cf9a75ea0e91b72a1c998e6d","amp;dn":"Dead+Space%3A+Extraction+%5BWii-PAL%5D+%5BMULTI5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0b3106fbca9ed38cf9a75ea0e91b72a1c998e6d","infoHashBuffer":{"type":"Buffer","data":[208,179,16,111,188,169,237,56,207,154,117,234,14,145,183,42,28,153,142,109]},"announce":[],"urlList":[]}}