{"title":"It's a Jungle in There: How Competition Shape the Mind (2014)","uid":11775779,"size":2239064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0d08c3c4ed91a98488471345bc229719ae2f81e&amp;dn=It%27s+a+Jungle+in+There%3A+How+Competition+Shape+the+Mind+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1427281493,"description":"It's a Jungle in There: How Competition and Cooperation in the Brain Shape the Mind\n\nepub\n\nDistinguished professor and cognitive psychologist David Rosenbaum takes this metaphor of surviving in the wild and applies it to the competitive arena within the brain. He argues that the overarching theory of biology, Darwin's theory, should be the overarching theory of cognitive psychology, the science of mental functioning. He explores this new and intriguing idea by showing how neural elements compete and cooperate in a kind of inner jungle, where only the fittest survive. Competition within your brain does as much to shape who you are as the physical and figurative competition you face externally. \n\n Just as the jungle night seethes with noisy creatures beckoning their mates, issuing their warnings, and settling their arguments, you might have trouble falling asleep at night because the thoughts in your head are fighting for their chance at survival. Rosenbaum's pursuit of this bold idea explains why we are shaped into who we are, for better or worse, because we are the hosts of inner battlefields.\n\n Written in a light-hearted tone and with reference to hypothetical neural &quot;creatures&quot; making their way in a tough environment, Rosenbaum makes cognitive psychology and his theory easy to understand and exciting to ponder. Rather than rely on the series of disconnected phenomena and collection of curiosities that often constitute cognitive psychology, It's a Jungle in There provides a fascinating way to place all cognitive phenomena under one flourishing tree","torrent":{"xt":"urn:btih:d0d08c3c4ed91a98488471345bc229719ae2f81e","amp;dn":"It%27s+a+Jungle+in+There%3A+How+Competition+Shape+the+Mind+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d08c3c4ed91a98488471345bc229719ae2f81e","infoHashBuffer":{"type":"Buffer","data":[208,208,140,60,78,217,26,152,72,132,113,52,91,194,41,113,154,226,248,30]},"announce":[],"urlList":[]}}