{"title":"The Incredible Human Journey - Dr Alice Roberts - Epub - Yeal","uid":9385965,"size":3692162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d106e9045a7d4ffa2d233ec2f3bf7587bef52158&amp;dn=The+Incredible+Human+Journey+-+Dr+Alice+Roberts+-+Epub+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1387758384,"description":"\n\nThe Incredible Human Journey\n\nBy Dr Alice Roberts\n\n384 pages - Publisher: Bloomsbury Publishing PLC\nYear - 2010 - Language: English - Epub\nISBN-10: 1408802880 - ISBN-13: 978-1408802885\n\nAlice Roberts has been travelling the world - from Ethiopian desert to Malay peninsula and from Russian steppes to Amazon basin - in order to understand the challenges that early humans faced as they tried to settle continents. On her travels she has witnessed some of the daunting and brutal challenges our ancestors had to face: mountains, deserts, oceans, changing climates, terrifying giant beasts and volcanoes. But she discovers that perhaps the most serious threat of all came from other humans. When our ancestors set out from Africa there were already two other species of human on the planet: Neanderthal in Europe and Homo erectus in Asia. Both (contrary to popular perception) were intelligent, adept at making tools and weapons and were long adapted to their environments. So, Alice asks, why did only Homo sapiens survive? Part detective story, part travelogue, and drawing on the latest genetic and archaeological discoveries, Alice examines how our ancestors evolved physically in response to these challenges, finding out how our colour, shape, size, diet, disease resistance and even athletic ability have been shaped by the range of environments that our ancestors had to survive. She also relates how astonishingly closely related we all are. As a lecturer in Anatomy at Bristol University, Alice Roberts is eminently qualified to write this book. As a talented artist, she is perfectly qualified to illustrate it, and dotted throughout this lively book are many of the sketches and photographs from her travels.","torrent":{"xt":"urn:btih:d106e9045a7d4ffa2d233ec2f3bf7587bef52158","amp;dn":"The+Incredible+Human+Journey+-+Dr+Alice+Roberts+-+Epub+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d106e9045a7d4ffa2d233ec2f3bf7587bef52158","infoHashBuffer":{"type":"Buffer","data":[209,6,233,4,90,125,79,250,45,35,62,194,243,191,117,135,190,245,33,88]},"announce":[],"urlList":[]}}