{"title":"Blueprint High Quality","uid":4113952,"size":5228211200,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d1e2daebde54349b3e847ccdc6ac982e229b8f47&amp;dn=Blueprint+High+Quality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pelon_pirate","files":41,"time":1207202555,"description":"Believe The Hype?\nFour Life Altering Days Of\nBrain Hemorrhaging Immersion ? Traveling\nDEEP Down The ?Rabbit Hole? To The Most Advanced Understanding Of Dating, Social Dynamics, And Self-Actualization In Existence\nThe Program That I Practically Murdered Myself To Create?\nThat In Spite Of Impossible Expectations Has ROCKED Live Audiences\nIn Sydney, New York, London, And Los Angeles ? And Now Recorded In Room-Rocking High Definition For YOU To Experience\n\nFROM TYLER:\n\nHey what?s up, it?s Tyler, and I?d like to tell you a little-known story about what I?ve been up to the last few years.\n\nYou might find this story to be a little bit crazy? You might find it to be literally insane.\n\nI really haven?t spoken about this much, but what I?m about to reveal to you is absolutely true.\n\nBack in 2004 I had this dream?\n\nTo put it bluntly, I wanted to create something that would forever alter the terrain of how men related to women ? and so I set out to produce the most extensively researched, ultra advanced, 110% field-explosive ?Success With Women? program ever done.\n\nThis was going to be the program that really left my mark in this area.  The program that would basically be my legacy after I?m dead and gone.\n\nNow if you know me, you know that when I decide on a goal, I go after it like an all-out crazy person.\n\nWould that mean going out and sharpening my skills with women, over and over, virtually seven nights a week ever since 2002??\n\nCheck?\n\nWould that mean teaching live in-field ?bootcamps? weekend after weekend, sparking reality-shattering breakthroughs for ecstatic clients all over the world??\n\nCheck?\n\nAnd would that mean searching with obsessive hunger for the absolute core truth of all attraction and sexual chemistry? working my mind to the break-point to discover how to get these ?killer insights? to go ?click? in your head??\n\nCh, ch, ch, CHECK?\n\nI mean, I spend very little time doing publicity or pushing my ?image? into the public eye.\n\nInstead I?ve been building RSD, the dating workshop company that?s privileged to work with the highest number of clients every year worldwide.\n\nMy day-to-day focus has always been on mastering my craft and refining my teaching ability to a level of dangerous sharpness ? so you know that the continued demand for my time and attention is based PURELY on the quality of the material and the personal transformations that I?ve been able to produce.\n\nSo?\n\nObviously the type of program to fulfill my vision here would have to be EXTREMELY AMBITIOUS (to say the least).\n\nIn order for me to be happy with it, it would have to be a TRUE REFLECTION of the level of time and energy that I?ve put into this over all these years.\n\nIt would have to be like a B52 Bomber flying overhead, dropping a bomb that inspired an intense, powerful change in every single sane-minded person who experienced it (to the point where you?d look back on this for the rest of your days as being a catalyst for an EPIC EVOLUTION in every aspect of your day-to-day life).\n\nThere was only one problem, little did I know...\n\nAnd that was that to create this soon-to-be ?masterpiece? was going to require a level of intensity that I had never really experienced.\n\nThis would be of the massive magnitude that I, myself, could never have foreseen when I dreamed this up back in 2004.\nThis Is The Program That Nearly Destroyed Me...  But Finally...  The Deepest Secrets Of My Journey Into The Heart Of Seduction And Self-Mastery Are Laid Bare\n\nNow in a lot of ways I really screwed up?\n\nI basically bit off more than I could chew ? and wound up taking years and years to get this done, making a lot of folks ?a little bit antsy? to get their hands on it.\n\nMost people thought that this was never really going to be complete.\n\nThe general consensus was it would go down in history as an urban legend like the never-released ?Chinese Democracy? album by Guns ?N Roses ? where the goal of making it ?perfect? drove me insane and caused me to never put it out.\n\nAnd you know what?  I really don?t blame them.\n\nI DID want it to be perfect... or at least as air tight as I could damn well manage. \n\nAnd if you want to go a bit deeper, maybe I wanted to prove something ? and not to all the people out there, but to myself.\n\nHonestly though?\n\nMost of the time, my motivation was just the fact that I found this journey into undiscovered territory to be the most fascinating and rewarding of my entire life.\n\nSee, while everyone was waiting for this blueprint to finally come out, I wasn?t ?creatively stifled? or ?stuck in the mud?.\n\nI was working? writing? theorizing? testing? and teaching live programs in the field to see how the new ideas impacted all of the people I worked with.\n\nThe thing was, as I started to lay down every hard-hitting dating principle and technique that I knew existed, I realized more and more that there was just so much that I didn?t know.\n\nI had CRAZY EPIPHANIES? I came up with VAULTS worth of brand new concepts and principles, stuff that was totally ?outside the box?.\n\nIt got to the point where it really started to drive me nuts?\n\nI was working constantly.  I?d roll out of bed in the morning, start working on the project, and oftentimes not go back to bed until the sun was back up the next day.\n\nIt was a lot like being a mad scientist, oftentimes to the point that I became kind of socially-weird because I was in my head thinking and thinking and thinking all the time.\n\nI?d be at the store and have a new realization and I?d be jotting down notes up against the wall, or wake up in the middle of the night and scream over to my girlfriend ?GIVE ME A PEN!!?\n\nYou should see the stash of notes that I have, it?s unreal.\n\nA lot of the time I?d go to sleep frustrated and confused because the ideas that I wanted to communicate were so subtle and advanced that I couldn?t find the right way to explain them (even after working on it the entire day).\n\nI dedicated at least 10 hours a week to this project over the past four years, but there were also months at a time that I went ?underground? to work on this non-stop.\n\nThere were a lot of tough times where I wanted to put it off or just release it at a ?decent? level just to get it out.\n\nBut as funny as it sounds, there was ONE THING that pushed me through...\n\nThe prospect of being able to reveal to you the most intricate-secrets and hard-earned wisdom necessary to get the level of results (and subsequent MORE FUN quality of life) that are enjoyed by the absolute ?top guys?.\n\nI knew that it was possible, and more than anything, I knew that if I could NAIL this thing that it was in fact PROBABLE.\n\nSo I kept at it, for several years, ignoring the continual frantic prodding and pushing from EVERYONE (especially my business team) to put it out.\n\nAnd the pressure mounted?\n\nBecause the longer this took to come out, the more the anticipation built, and the EXPECTATIONS of this program became SO RIDICULOUSLY INSANE that most people thought the final product could never live up to the impossible hype.\n\nFor a while it even messed with me a bit?\n\nBut as I continued ?down the rabbit hole? of this new deeper, more powerful understanding of success with women I was gaining I felt a silent confidence that everything was going to be JUST FINE.\n\nAnd you know what??\n\nAs you?ll soon discover, sticking to my guns was the best decision I ever made.\n\nBecause the result is now sitting in front of you in the form of ?The Blueprint Decoded?.\n\nAnd this program, or better put, this EXPERIENCE, has not only enriched my own life (in terms of OBVIOUS MEASURABLE RESULTS) to the point where my own mastery with women and over ?the self? has rocketed upwards easily 500% or 1000%...\n\nIt is also going to set off a NUCLEAR EXPLOSION of fierce, powerful epiphanies for YOU ? which will be the seed of the most drastic (not to mention FAST and SUDDEN) improvements in your own life that you?ve ever experienced.\nThe Blueprint Decoded Will AWAKEN YOU To The Most Profound Secrets Of ?Dating Mastery And Actualization? Like A Syringe Of Adrenaline Punched Straight Into Your Heart\n\nAlright so by now you probably ?get it? that this is a big deal.\n\nBut really, what you want here are STRAIGHT FACTS about the program.\n\nSo onto the million dollar question...\n\nWHAT THE HECK *IS* THE BLUEPRINT DECODED??\n\nRight off the bat, you?ve probably noticed in all of the success stories that even the people who attended have a hard time breaking everything down you?re about to experience into words.\n\nThat?s because this program is very much ?experiential?.\n\nThe Blueprint Decoded not only pummels you mercilessly with laser-specific knowledge, arming you to the teeth with every theoretical and practical golden-nugget that you need to hit the ?next level? ? but it is also going to ACTIVELY push you through the types of emotional experiences  that invoke IDENTITY LEVEL CHANGE.\n\nI accomplish this very much through ?leading by example?, or, as they say in hypnosis ?going first?.\n\nHave you ever had a night out meeting women where you were ?dragging? or ?not in state???\n\nWell throughout the four epiphany-saturated days of this program I am CARRYING YOUR STATE THROUGH THE ENTIRE EXPERIENCE.\n\nI?ve learned how to do this from years and years of going out ? to the point where I can carry the energy not only of myself but an entire audience for pretty much as long as it takes.\n\n(If this sounds like an ability that might come in extremely handy for you ?in the field? you?re absolutely right).\n\nHow is this possible??\n\nWell it comes down to one of the major breakthroughs you will experience in this program, which is to ?Draw your state from within, not from your ever-changing environment...? (which many people theoretically understand but few can actually ACCOMPLISH).\n\nFollow me here...\n\nThe key understanding is you have to find your sense of feeling GOOD and SUPER CONFIDENT independent of ANY external-circumstances.\n\nWomen can feel this coming off of you on a level where they feel a ?masculine polarity? and become exceedingly attracted to you pretty much instantly.\n\nIt?s what gives you the power to ?draw women into your reality? and pass their ?congruence tests? automatically without even trying.\n\nI?ve been going out and meeting women for years and years, and at this point holding myself in an awesome ?100% internally based? state is just second-nature (frankly a joke) ? and this program is going to teach YOU the shortcuts to doing the same.\n\n(This also by-passes the need for most ?tactics and techniques? and transforms you into a ?true natural?).\n\nNow one of the reasons this program had to be FOUR DAYS TOTAL IMMERSION is that, being very blunt, by LIVING the experience day after day it will finally click to you ?THIS GUY IS *NOT* KIDDING...?\n\nIt?s not like on Day 1 I?m feeling great and by Day 4 I?m worn out.\n\nNope...\n\nWith The Blueprint Decoded the first day is chill and laid back, and by the FOURTH DAY I?ve pushed myself and YOU THE AUDIENCE so deeply ?into the moment? that the energy in the room is just SURGING.\n\nThe experience builds and builds...\n\nThe major epiphany here is that ?Drawing your state from within is not only ACTUALLY POSSIBLE but actually EASIER than dealing with the day-to-day nonsense of trying leech it from your environment like 99% of guys try to do.?\n\nBy the end of this program you will fully understand what it means to be in alignment with your world, and to fully experience your power as a man.\n\nAnd this results that this will give you with women??\n\nWe?re not just talking THEORETICAL (like a lot of programs that teach this type of stuff).\n\nIt means MEASURABLE ? as in once you have it down, you are pretty much guaranteed to have those ?on nights? where you just OWN IT out there with women ALL THE TIME.\n\n(And if you don?t, you?ll still be able to precisely pin-point exactly where you went wrong and fix it for next time).\n\nThis is going to make being attractive to women ?Something you ARE, not just something you DO...?\n\nIt?s going to teach you how to create massive attraction with women not just in SUDDEN SPIKES (like when you launch off a single ?pick up line? and wait for the reaction) but in a CONSISTENT SIMMER where your ENTIRE PERSONALITY is creating the attraction for you at all times ? not just a finite number of lines that?s bound to run out very soon.\n\nSound like fun??\n\nWell that?s really just the tip of the iceberg...\n?See The Entire Matrix? And Gain GLOBAL UNDERSTANDING To Calibrate Social Interaction Like A F18 Fighter Pilot In Real Time\n\nHave you ever been curious about all the ADVANCED CONCEPTUAL IDEAS that exist when it comes to success with women??\n\nI mean, obviously being good with girls is about ?getting in the field? and APPLYING the skills.\n\nOF COURSE...\n\nBut at the same time, there are all these ADVANCED PICKUP ARTISTRY CONCEPTS that the ?top guys? seem to possess, which on some level DO make a big fat increase in their results.\n\nWhy??\n\nBecause it?s like the ?software? that they?re operating on...\n\nThe ?program? that?s running up in their heads during every second that they?re interacting with women.\n\nNow think of it this way...\n\nI hate to use the played-out ?Neo In The Matrix? analogy, but that is EXACTLY what this is.\n\nOne of the reasons the most skilled players have the ability to ?attract any girl in any situation? is because they SEE THE PLAY A MILE OFF.\n\nI know this might sound strange, but when you really ?get? this stuff you can see layers upon layers, levels upon levels of social communication going on at all times.\n\nIt?s not tough or scary or anything, it?s just a new level of input.\n\nYou develop an understanding of the ?programs that people are running on? ? their predictable thought-loops, their belief-systems, their models of how the world works, and the types of stimuli that pushes their buttons.\n\nTHAT is why when you see a dangerously skilled player he seems to possess such staggering power and social-control.\n\nHe?s cultivated the ability to ?see the matrix? (like when Neo finally discovers his powers and everything looks like fluorescent-green computer code) and then he?s developed the ability to navigate it in his day-to-day life over the years.\n\nWell, up until now, the ability to read the play on this level has really been something you?ve had to earn through YEARS of hardcore field-work.\n\nAnd you know, going out and interacting with people (especially hot women) is always going to be the cornerstone of improving at this...\n\nAt the same time though, with The Blueprint Decoded now you?ve got the WHOLE MATRIX broken down for you ? which instantly cuts years away from your steep learning curve.\n\nExactly HOW is this possible??\n\nLook at the title of the program:  The Blueprint Decoded.\n\nThat?s exactly what this is ? a highly advanced ?blueprint? that?s been ?decoded? for you in vivid, meticulous detail.\n\nEvery concept, definition, principle, and terminology that?s necessary for mind-blowing, rocket-fuelled, SHOCKING SUCCESS with women is pummeled up into your thick skull.\n\nNow obviously this is really about LIVING these concepts, so bear the following in mind...\n\nMany of these concepts and definitions I worked on and refined for YEARS, updating and re-doing them over 100 times (as my understanding got better and better) until they were LASER precise.\n\nThere?s also a ton of BRAND NEW absolutely cutting-edge concepts and terminology that you have never, ever been exposed to before that will ROCK YOUR WORLD.\n\nThis might not sound glamorous but let me make this absolutely clear...\n\nGetting this stuff ?down pat? will literally THRUST you to a point of full CONSCIOUS COMPETENCE and AUTOCONTROL over all of your social interaction.\n\nRight off the bat this is going to give you a freaky-genius THEORETICAL understanding of this entire game, from top to bottom, which is a great place to start.\n\nMoving beyond that though, you?re also going to learn how EVERY CONCEPT relates to one another so that you can calibrate flawlessly like an F18 fighter pilot in REAL TIME.\n\nThis will make all social interaction so OBVIOUS to you that you can make extremely subtle distinctions about EVERYTHING that?s going on between men and women (and people in general) WHILE IT?S HAPPENING.\n\nSound kind of freaky-intense??\n\nWell here?s the best part.\n\nThere are two different kinds of learning.  The kind that makes things more complex, and the kind that makes things simple.\n\nThe Blueprint Decoded is of the second kind.\n\nThis program is ABSOLUTELY VAST, but simultaneously, it will simplify social interaction for you ? not complicate it.\n\nIt?s all about taking the confusion and breaking it down to total simplicity so you never need to think about the ?social matrix? ever again.\n\nThis is crucial ? it?s not just something ?about? this program...\n\nIt is in fact THE WHOLE POINT OF THE PROGRAM.  To shatter the binds that the ?social matrix? has on you and hook you into a genuine authenticity and self-esteem.\n\nThis is going to grab you by the neck, and shake all ?nonsense? and ?inner noise? out of your head MERCILESSLY until all that?s left is a massive, surging skillset with women and a deep, potent sense of inner calm.\n\nThat?s the deal.\n\nAnd you know what??  There?s still more for you to discover here...\nDiscover RSD?s Most Insanely Field Tested, Ragingly Powerful, Never-Revealed Principles ? That Will Make 80-90% Of Old Pickup-Up Techniques Redundant, And In Many Cases, Utterly Obsolete\n\nOK, so what are these ?ragingly powerful? principles you?re now hearing about??\n\nWell first up, ragingly powerful is easily an UNDERSTATEMENT (as you?ve seen in the countless rabid testimonials about the skills of instructors in the RSD bootcamp reviews, especially in recent years).\n\nThis is the type of ?veteran insight? that takes most people a good half a decade to realize and internalize and understand.\n\nThe key you ?need to know? here is this:\n\nWhenever you?re learning something new there?s really TWO major factors you have to figure out:\n\n1) The TECHNIQUES\n\n...and\n\n2) The PRINCIPLES\n\nWith dating and ?success with women?, the techniques are like the specific ways of opening, the lines, the humor, the flirtation, the extraction back to your place, etc.\n\nAn example of a technique would be like starting a conversation with ?You?re either the coolest girl I?ve ever met, or you?re a total weirdo...? or teasing with silly nonsense like ?You?re such a diva... What?s up MISS THANG???\n\nYou can learn techniques like this in a few minutes, or maybe a couple of hours...\n\nGo out and use them, and you get the girls giggling and happy ? just to get yourself a bit of ?instant gratification? and give yourself a quick pat on the back.\n\nPrinciples, on the other hand, are like the overarching rules of social interaction that MAKE THE TECHNIQUES WORK.\n\nSo for example, from reading the RSD newsletter or the forum you might recognize principles like:\n\n?In any social interaction, there is always one person reacting more to the other person than that person is reacting to them...?\n\n...or\n\n?Any time that you?re amusing yourself and pumping your own state it?s offering value, any time that the other person becomes a part of your ego structure and your state depends on their reaction it?s taking value...?\n\nUsually these types of principles take a few years to go ?click? in your head, like on a really deep level.\n\nThey personally took me about six years...\n\nWhy??\n\nBecause I was never aware of them before...\n\nAnd for a lot of people it really takes around 10 years, just because when you?re taking the pursuit of ?total mastery? to a level that?s THIS ADVANCED it?s extremely difficult to find a teacher who?s qualified to explain it all to you.\n\nNow as you?ve probably figured out, the pattern for learning a new skill usually goes something like this:\n\n   1. You find a new area you want to learn about (in this case dating) and you chase after the ?surface level techniques? and ?magic pills? for instant gratification and fast results.\n   2. You use your new techniques for a while until you realize you can never maintain your initial level of improvement that way, and then you get frustrated and maybe quit or drop out for a while.\n   3. You COME FULL CIRCLE and seek out the PRINCIPLES that you should really have known ALL ALONG in order to make the techniques actually WORK, and in the process you even wind up DISCARDING a lot of your old techniques because they?re now redundant and obsolete.\n   4. You reach a level of total mastery and internalization, where you?ve got the new skill-set you want and you can enjoy maintaining it in the course of your day-to-day life.\n\nNow just by the law of averages, most people reading this are probably in phase #1 or #2.\n\n(Which is absolutely solid because it?s ?not too late? to cut STRAIGHT TO THE GOOD STUFF here, and spare yourself a bunch of wasted time on supposed ?shortcuts? that wind up being the long, annoying SCENIC ROUTE that doesn?t actually have any nice views).\n\nBut guess what??\n\nEVEN IF you?re in phase #3 or #4 you?re probably GASPING at the prospect of an ultra advanced program like this.\n\nThat?s because you?re experienced enough to know how dangerously effective it is, and if nothing else, it?s pure, massive reinforcement of your existing skills.\n\nSo yes... The Blueprint Decoded is a program that will speak to you on a lot of levels.\n\nThe value and epiphanies you?ll take from it will have ENTIRELY DIFFERENT MEANINGS the first year that you watch it, the second, and every year after for the rest of your life.\n\nIt?s called ?sucking the marrow? out of it, which happens when you come back to it every few weeks and you?re FREAKING OUT like, ?Damn, I didn?t even understand what he was saying before!!  I didn?t even notice!!?\n\nThat?s because The Blueprint Decoded is about YOU and YOUR DEEP IDENTITY LEVEL CHANGE.\n\nIt?s an experience that inspires a deep, FREAKY change in you, and as a result the principles that are contained will continue to evolve and change as YOU DO.\n\nFreaky??\n\nWell keep reading what?s crammed in here, because that?s what?s REALLY going to freak you out.\nThis Is About YOU And Living A Lifestyle Of YOUR Design ? An Entirely New Body Of Knowledge For ?Rapid Identity Level Change? That Will Live On For Years To Come\n\nThe key understanding here is that The Blueprint Decoded is not just an ?inner game? program where you learn how to be confident or feel good about yourself or whatever.\n\nWe?ve ALL been bombarded with that sort of thing ? and while it?s fantastic, this is literally about 1000X more potent and hard hitting.\n\nThis is ALL-ENCOMPASSING, and will teach you the PRACTICAL STEPS to making the ?rubber? of this knowledge ?meet the road?.\n\nYou will be exposed to hardcore PRACTICAL knowledge that takes you from Point-A to Point-B.\n\nThe first rehearsal for the HD-recorded final official event was in Sydney Australia ? and as you?ve probably seen in all the rabid testimonials it was a runaway success (leaps and bounds ahead of anything I?d ever done).\n\nI did another event in New York and another in London ? and each kept getting better and better.\n\nFinally we did the official recording in Los Angeles...\n\nThe production value on the project on this was ABSURD, with the room covered top to bottom in uber-high-tech cameras and audio to create an experience like you?re literally at the live event.\n\nWhy did I go this route??\n\nVery simply, this is the most important piece of work I?ve ever done and will basically define my legacy in self-development in my twenties.\n\nThis is the program that people are going to associate my name with for years to come.  It?s the sum of all the intense work I did, my masterpiece and my pride and joy.\n\nLet?s put it this way: For years people have been saying to me ?With all the delays there?s just no possible way that The Blueprint can live up to the impossible hype...?\n\nWell as you?ve probably seen, every single review that?s come in from the four events have stated one thing in common:\n\nThe Blueprint Decoded takes the overblown expectations and stomps them into the ground.\n\nExperiencing this program is going to change your entire life.\n\nYour life will NEVER be the same after this. Point blank period.\n\nEvery aspect, from how you interact with women to how you walk through the world in general ? it?s all about to change.\n\nThis is going to teach you to see the truth of your life, how it relates to women, and how to get the type of massive success that?s normally reserved for the top guys (who?ve not only gone out for years and years, but who also had the mastermind group to ?decode? in detail all of their experiences).\n\nExpect that your brain will melt out of your ears after this...\n\nMost people in attendance couldn?t sleep during the program (as you?ll see on video, at one point I asked ?Who hasn?t been able to sleep during this program? and over half of the room shot their hands up), and many couldn?t sleep for several days after the experience.\n\nWhy??\n\nBecause this program is going re-wire your reality, re-wire the way you interact (and get massive success) with women, and re-wire the way that you experience the world.\n\nThe last thing that I?d leave you with is this...\n\nI created this program for myself and myself only.\n\nThe time I spent, I couldn?t have cared less what anyone else thought of it.  I created this because I wanted to live my own life to the fullest.\n\nI needed to know this stuff... for me.\n\nWhat I?m about to reveal to you... these are the secrets that have carried me through a lot of tough times, through crippling challenges, and to a level of success with women that?s enabled me full choice and abundance for the rest of my life.\n\nIf you?ve taken value from any of my writings on the blog and RSD Nation, in the newsletters, or any of my past speaking engagements...\n\nWell, that stuff is like a pale joke compared to what you?re about to experience (so be ready for it).\n\nThis is the secret knowledge that I use to train my instructors, the stuff that I use to do rapid-fire ?change work? with everyone who takes my live programs... and ultimately, the keys that I?ve used to demonstrate a world-class level of skill with women on a professional level that blows people away every time.\n\nYou?ve been waiting for this a long time...  You will not be disappointed.","torrent":{"xt":"urn:btih:d1e2daebde54349b3e847ccdc6ac982e229b8f47","amp;dn":"Blueprint+High+Quality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e2daebde54349b3e847ccdc6ac982e229b8f47","infoHashBuffer":{"type":"Buffer","data":[209,226,218,235,222,84,52,155,62,132,124,205,198,172,152,46,34,155,143,71]},"announce":[],"urlList":[]}}