{"title":"Worthy Fights: A Memoir of Leadership .. Leon Panetta Audiobook","uid":11196685,"size":561521557,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1ed3206e06fbaa921c709be3e53fe4657998cff&amp;dn=Worthy+Fights%3A+A+Memoir+of+Leadership+..+Leon+Panetta+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413101295,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nWorthy Fights: A Memoir of Leadership in War and Peace\n\nWritten by: Leon Panetta, Jim Newton\nNarrated by: Leon Panetta\nLength: 20 hrs\nUnabridged Audiobook\nRelease Date:10-07-14\n\nIt could be said that Leon Panetta has had two of the most consequential careers of any American public servant in the past 50 years. His first career, beginning as an army intelligence officer and including a distinguished run as one of Congress' most powerful and respected members, lasted 35 years and culminated in his transformational role as Clinton's budget czar and White House chief of staff. He then &quot;retired&quot; to establish the Panetta Institute with his wife of 50 years, Sylvia; to serve on the Iraq Study Group; and to protect his beloved California coastline. But in 2009, he accepted what many said was a thankless task: returning to public office as the director of the CIA, taking it from a state of turmoil after the Bush-era torture debates and moving it back to the vital center of America's war against Al Qaeda, including the campaign that led to the killing of Osama bin Laden. And then, in the wake of bin Laden's death, Panetta became the U.S. secretary of defense, inheriting two troubled wars in a time of austerity and painful choices.\n\nLike his career, Worthy Fights is a reflection of Panetta's values. It is imbued with the frank, grounded, and often quite funny spirit of a man who never lost touch with where he came from: his family's walnut farm in beautiful Carmel Valley, California. It is also a testament to a lost kind of political leadership, which favors progress and duty to country over partisanship. Panetta is a Democrat who pushed for balanced budgets while also expanding care for the elderly and sick; a devout Catholic who opposes the death penalty but had to weigh every drone strike from 2009 through 2011. Throughout his career, Panetta's polestar has been his belief that a public servant's real choice is between leadership or crisis. Troubles always come about through no fault of one's own, but most can be prevented with courage and foresight.","torrent":{"xt":"urn:btih:d1ed3206e06fbaa921c709be3e53fe4657998cff","amp;dn":"Worthy+Fights%3A+A+Memoir+of+Leadership+..+Leon+Panetta+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ed3206e06fbaa921c709be3e53fe4657998cff","infoHashBuffer":{"type":"Buffer","data":[209,237,50,6,224,111,186,169,33,199,9,190,62,83,254,70,87,153,140,255]},"announce":[],"urlList":[]}}