{"title":"Assassins Creed II","uid":6882838,"size":6810935296,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d20272bff8395c15e1c07bddbe9d64c1f67416e3&amp;dn=Assassins+Creed+II+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AbhishekJonwal123607","files":-1,"time":1323706393,"description":"Infomation\nAssassins Creed II / Ubisoft\n\nRELEASE DATE : 21-04-2010\nPROTECTION : Ubisoft DRM\nGAME TYPE : Action\nDISKS : 1 DVD\n\n\n\nAssassin's Creed 2 is the follow-up to the title that became\nthe fastest-selling new IP in video game history. The highly\nanticipated title features a new hero, Ezio Auditore da\nFirenze, a young Italian noble, and a new era, the\nRenaissance.\n\n\n\nAssassin's Creed 2 retains the core gameplay experience that\nmade the first opus a resounding success and features new\nexperiences that will surprise and challenge players.\n\nAssassin's Creed 2 is an epic story of family, vengeance and\nconspiracy set in the pristine, yet brutal, backdrop of a\nRenaissance Italy. Ezio befriends Leonardo da Vinci, takes on\nFlorence's most powerful families and ventures throughout the\ncanals of Venice where he learns to become a master assassin.\n\nEZIO, A NEW ASSASSIN FOR A NEW ERA Ezio Auditore da Firenze is\na young Italian noble who will learn the ways of the assassins\nafter his family was betrayed and he looks to seek vengeance.\nHe is a lady's man, a free soul with panache yet has a very\nhuman side to his personality. Through him, you become a\nmaster assassin.\n\nRENAISSANCE ITALY Italy in the 15th century was less a country\nand more a collection of city-states where families with\npolitical and economic strength began to take leadership roles\nin cities like Florence and Venice. This journey through some\nof the most beautiful cities in the world takes place in a\ntime in history where culture and art were born alongside some\nof the most chilling stories of corruption, greed and murder.\n\nA NEW-FOUND FREEDOM You will be able to perform missions when\nyou want and how you want in this open-ended world that brings\nback free-running and adds elements such as swimming and even\nflying to the adventure. The variety in gameplay adds another\nlayer for you to truly play through the game any way you\nchoose.\n\nDYNAMIC CROWD Discover a living, breathing world where every\ncharacter is an opportunity for the player. Blending in with\nthe crowd is easier, working with in-game characters provide\nample rewards but can also lead to surprising consequences.\n\nBECOME A MASTER ASSASSIN Perfect your skills to become a\nmaster assassin where you brandish new weapons, learn to\ndisarm enemies then use their weapons against them, and\nassassinate enemies using both hidden blades.\n\n\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Run the v1.01 update exe from UPDATE folder on the DVD or\nlet the game auto update by itself\n5. Copy the content from the SKIDROW folder on the DVD to\nthese locations and overwrite. 32 bit is for both XP, Vista\nand Win7 editions. 64 bit for Vista and Win7 locations.\n\n32 bit version:\n\nC:Program FilesUbisoftUbisoft Game Launcher folder\n\n64 bit version:\n\nC:Program Files (x86)UbisoftUbisoft Game Launcher folder\n\n6. Play the game\t","torrent":{"xt":"urn:btih:d20272bff8395c15e1c07bddbe9d64c1f67416e3","amp;dn":"Assassins+Creed+II+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d20272bff8395c15e1c07bddbe9d64c1f67416e3","infoHashBuffer":{"type":"Buffer","data":[210,2,114,191,248,57,92,21,225,192,123,221,190,157,100,193,246,116,22,227]},"announce":[],"urlList":[]}}