{"title":"A Simple, Practical Method for Long-Term Storage of Yeast","uid":4604671,"size":2828508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d22eef220161b991a906a3ca9ec0c7da2471f420&amp;dn=A+Simple%2C+Practical+Method+for+Long-Term+Storage+of+Yeast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"fratermus","files":5,"time":1230416467,"description":"Page scans of an Article from the now-defunct Brewing Techniques magazine.  \n\nA Simple, Practical Method for Lont-Term Storage of Yeast, by Michael D. Graham. \n\n\n\nA description of the article by Joseph Kish:  \n\n&quot;I came upon an article written by Michael D.Graham,a microbiologist at ATCC (1) that described the storage of yeast in sterile distilled water. What a brilliant idea! If that method stores yeast, It should work well on gourmet mushroom cultures, too. It's easy to do, very space efficient, allows the cultures to be stored at room temperature, and maintains thier viability for years. I contacted the author, he indicated that edible fungi stores even better than yeast, and you can store the spores as well as the hyphae often for decades!\n\n\nSterile water was first used to preserve cultures by Castellani in 1939 (2). Since then, many scientists have used this method; McGinnis et al. in 1974 (3) and Odds in 1991 (4) reported that they were able to maintain viable cultures for more than three years, without degradation.\n\nThis technique satisfies many different interests: Castellani's pathogenic fungi, Odds interest was in pathogenic yeast, and McGinnis' interest was in a wide range of fungi, yeast, and bacteria. The distilled water preserved all of them. &quot;\n\n","torrent":{"xt":"urn:btih:d22eef220161b991a906a3ca9ec0c7da2471f420","amp;dn":"A+Simple%2C+Practical+Method+for+Long-Term+Storage+of+Yeast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d22eef220161b991a906a3ca9ec0c7da2471f420","infoHashBuffer":{"type":"Buffer","data":[210,46,239,34,1,97,185,145,169,6,163,202,158,192,199,218,36,113,244,32]},"announce":[],"urlList":[]}}