{"title":"The Incredible Shrinking Woman [1981] Lily Tomlin","uid":6457314,"size":727292239,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d243d52252407d170c590c9519553ef3cd46cb2b&amp;dn=The+Incredible+Shrinking+Woman+%5B1981%5D+Lily+Tomlin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1307580660,"description":" &lt;a href=&quot;http://bayimg.com/EAKlgaace&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/EAKlgaace&lt;/a&gt;\n\nThe Incredible Shrinking Woman (1981) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0082558/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0082558/&lt;/a&gt;\n\nThe Incredible Shrinking Woman is a 1981 science fiction/comedy film, starring Lily Tomlin, Charles Grodin, Ned Beatty, John Glover and Elizabeth Wilson, and directed by Joel Schumacher. The film was written by Tomlin's longtime life partner and frequent collaborator, Jane Wagner. The original music score was composed by Suzanne Ciani. This film is a take-off on the 1957 science fiction classic The Incredible Shrinking Man, and credited as based on Richard Matheson's novel, The Shrinking Man.  Lily Tomlin plays three characters in this film: lead character Pat Kramer, her neighbor Judith Beasley (from her Broadway shows), and Tomlin's Laugh-In character &quot;Ernestine&quot; (a telephone operator). \n\n Lily Tomlin ...  Pat Kramer \n Lily Tomlin ...  Judith Beasley\n Lily Tomlin ...  Telephone Operator\n Charles Grodin ...  Vance Kramer \n Ned Beatty ...  Dan Beame \n Henry Gibson ...  Dr. Eugene Nortz \n Elizabeth Wilson ...  Dr. Ruth Ruth \n Mark Blankfield ...  Rob \n Maria Smith ...  Concepcion \n Pamela Bellwood ...  Sandra Dyson \n John Glover ...  Tom Keller \n Nicholas Hormann ...  Logan Carver \n Jim McMullan ...  Lyle Parks (as James McMullan) \n Shelby Balik ...  Beth Kramer \n Justin Dana ...  Jeff Kramer \n Rick Baker ...  Sidney (as Richard A. Baker) \n Mike Douglas ...  Himself \n\nThis film carries an anti-consumer message, since a collection of perfumes, cleansers, and assorted household products is what caused Pat to shrink, and some consider it an early acknowledgment of multiple chemical sensitivity disorder.  Prop products shown in the film include &quot;Cheese Tease&quot;, an aerosol cheese spray; &quot;Galaxy Glue&quot;, a household super glue; &quot;Breathe Easy&quot;, a feminine hygiene spray; and the prototype for a new perfume called &quot;Sexpot&quot;.  The attack on consumerism has also been associated with early criticism of the Reagan Administration and Corporate America that was present during the 1980s, although at the time of the film's release, Reagan had only been president for ten days, and the movie was largely completed prior to Reagan winning the Presidency in November 1980.\n\nThis was originally planned to be a 3-D film, but the idea was ultimately scrapped. \n\nActor Dick Wilson plays a fussy supermarket manager - much like his famous Charmin tissue TV commercial character: Mr. Whipple. Mike Douglas sings the song &quot;Little Things Mean a Lot&quot; on his show before Pat Kramer comes out on stage. A scene was cut where Pat Kramer shrinks some more while backstage at the Mike Douglas Show. Judith Beasley comes to the rescue by fashioning a tiny dress for Pat to wear from the cut sleeve of her own blouse. In the final version, Judith is shown in the studio audience with one of her sleeves missing, and Pat's outfit matches Judith's blouse. \n\nRick Baker played Sidney the Gorilla. In 1981, he was the very first recipient of the Oscar for Best Make-Up for &quot;An American Werewolf in London&quot; when the category was first introduced. Baker's career, especially his early fascination with gorillas and his work in three movies featuring them is told in the TV documentary &quot;Gorillas: Primal Contact&quot;. \n ","torrent":{"xt":"urn:btih:d243d52252407d170c590c9519553ef3cd46cb2b","amp;dn":"The+Incredible+Shrinking+Woman+%5B1981%5D+Lily+Tomlin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d243d52252407d170c590c9519553ef3cd46cb2b","infoHashBuffer":{"type":"Buffer","data":[210,67,213,34,82,64,125,23,12,89,12,149,25,85,62,243,205,70,203,43]},"announce":[],"urlList":[]}}