{"title":"Pearl Jam - Rearviewmirror: Greatest Hits [24 bit FLAC] vinyl","uid":8194066,"size":3236617220,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2b856ab6a9cbc3fdaf2c6b55b16341ef7ee3c38&amp;dn=Pearl+Jam+-+Rearviewmirror%3A+Greatest+Hits+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"24.96","files":-1,"time":1361886791,"description":"  Pearl Jam - Rearviewmirror: Greatest Hits 1991-2003 [24 bit FLAC] vinyl\n\n  Released: 2004\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Once (Remixed)\n  A2. Alive (Remixed)\n  A3. Even Flow (Re-Recorded, original single version)\n  A4. Jeremy\n\n  B1. State of Love and Trust (different mix from Singles Soundtrack Version)\n  B2. Animal\n  B3. Go\n  B4. Dissident\n\n  C1. Rearviewmirror\n  C2. Spin The Black Circle\n  C3. Corduroy\n  C4. Not For You\n\n  D1. I Got ID (AKA I Got Shit)\n  D2. Hail, Hail\n  D3. Do The Evolution\n  D4. Save You\n\n  E1. Black (Remixed)\n  E2. Breath\n  E3. Daughter\n  E4. Elderly Woman Behind The Counter In A Small Town\n\n  F1. Immortality\n  F2. Betterman\n  F3. Nothingman\n  F4. Who You Are (Features a slight lyric change from the original)\n\n  G1. Off He Goes\n  G2. Given To Fly\n  G3. Wishlist\n  G4. Last Kiss\n  G5. Nothing As It Seems\n\n  H1. Light Years\n  H2. I Am Mine\n  H3. Man Of The Hour\n  H4. Yellow Ledbetter\n\n  Joe Strummer once claimed that the Clash had stardom in their hands, then they dropped it on the floor and broke it. Pearl Jam took the opposite tact: they purposely left stardom behind. Nirvana may have ushered in the age of grunge and alternative rock, but Pearl Jam were the biggest band in the land during the first half of the '90s, dominating radio airwaves, MTV, and college dorms alike. Most bands would have embraced such widespread acclaim, but the quintet bristled at this vein, and started to restlessly explore new musical territory, a move that eventually whittled their fan base down to just the hardcore by the beginning of the next decade. That hardcore following was still large, and the band could still have the occasional surprising crossover hit, like the 1999 cover of J. Frank Wilson's teen tragedy classic &quot;Last Kiss&quot; that went to number two on the Billboard charts, but they were no longer the biggest band in the land. Spanning two discs, Rearviewmirror (Greatest Hits 1991-2003) chronicles that journey and it does an expert job not only of capturing the moment when Pearl Jam were monstrously popular, but proving that they still turned out good music even when they were fading from the spotlight. Unlike most career-spanning, multi-disc retrospectives, Rearviewmirror does not emphasize latter-day albums in order to achieve a sense of balance that's inherently phony. Of the 33 tracks, only 12 date from the post-Vitalogy era, which means that the bulk of the collection concentrates on their early-'90s heyday, and nearly every radio hit and concert staple is here, outside of the Victoria Williams cover &quot;Crazy Mary&quot; and &quot;Tremor Christ.&quot; While their presence would have been nice, they're not terribly missed, partially because such non-LP cuts like &quot;State of Love and Trust,&quot; &quot;I Got ID,&quot; &quot;Last Kiss,&quot; and &quot;Man of the Hour&quot; are collected here, but mainly because the compilation plays so well. The songs are divided into the &quot;Up Side&quot; and &quot;Down Side,&quot; meaning the first disc has all the rockers and the second disc has all the ballads. At first, this seems like a questionable strategy, since it's usually preferable to have all the hits follow in chronological order, but what makes this work is that the songs on each disc are presented in chronological order, and they sustain their mood quite well (this is partially helped by Brendan O'Brien's new mixes of &quot;Once,&quot; &quot;Alive,&quot; and &quot;Black,&quot; which retain the feeling of the original songs but remove much of the dated glossy sheen in the production). Distilled to their hits and anthems, all of Pearl Jam's best qualities shine through and they sound bigger, better, and frankly more coherent than they do on their full-length albums. And that's why Rearviewmirror is a cut above most '90s hits collections: it not only gives casual fans all the hits, but it captures why the band mattered, while providing a better listen than their proper LPs in the process.","torrent":{"xt":"urn:btih:d2b856ab6a9cbc3fdaf2c6b55b16341ef7ee3c38","amp;dn":"Pearl+Jam+-+Rearviewmirror%3A+Greatest+Hits+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2b856ab6a9cbc3fdaf2c6b55b16341ef7ee3c38","infoHashBuffer":{"type":"Buffer","data":[210,184,86,171,106,156,188,63,218,242,198,181,91,22,52,30,247,238,60,56]},"announce":[],"urlList":[]}}