{"title":"Prophecy and the Last Pope-Allen-Skye(2013) pdf","uid":10940952,"size":919774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d31b399c73ce372e2cdd208ca111558584d27cb4&amp;dn=Prophecy+and+the+Last+Pope-Allen-Skye%282013%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eboneezer","files":-1,"time":1409514378,"description":"By-Dace Allen,Sarah Skye\nIsbn-1482568926 Feb.2013 128 pages\n\n The Last Pope: - Saint Malachy, Nostradamus, the Antichrist, and End Times\n\n\nWas Benedict XVI the last Pope? Who will follow him, and what marks the true beginning of End Times? In this book, you'll discover the eerily accurate prophecies of Saint Malachy. You'll see what Nostradamus and Mother Shipton said, along with many other mystics who predicted the final days... and your future. We'll share the two very different ways to read Malachy's 112th prediction (the Petrus Romanus one), and why punctuation makes all the difference if you're counting Popes after Benedict XVI. We'll explain why Comet ISON may signal when the antichrist will appear, and what political headlines -- especially which dynamic Papal duo -- should make you nervous. No matter who follows Benedict XVI, we'll tell you who to watch even more closely. The real power -- and Petrus Romanus -- may be someone you least expect. (After all, the Wizard of Oz was usually concealed behind the curtain.) But -- we promise -- we won't make everything sound like a conspiracy that will end very badly. We'll point to the silver linings in many prophecies about the end times. Sure, you'll discover the truth about the 666 tiara, and what numerology might tell us about the last Pope... and the darkness that may follow him. You'll also learn fascinating trivia about the first Borgia Pope, the legend of the White Pope and the Black Pope, and how Benedict's resignation may fulfill a very unlikely prophecy. (If we're right, this could get very weird.) If you're looking for well-researched history with a dash of flippant humor, and a &quot;last Pope&quot; explanation that doesn't take itself too seriously... this is the book you want! Discover the prophecies. See how they fit together. Learn what to watch for in world headlines. Read this book and be ready for what's ahead!","torrent":{"xt":"urn:btih:d31b399c73ce372e2cdd208ca111558584d27cb4","amp;dn":"Prophecy+and+the+Last+Pope-Allen-Skye%282013%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d31b399c73ce372e2cdd208ca111558584d27cb4","infoHashBuffer":{"type":"Buffer","data":[211,27,57,156,115,206,55,46,44,221,32,140,161,17,85,133,132,210,124,180]},"announce":[],"urlList":[]}}