{"title":"Not Peace but a Sword - Robert Spencer","uid":11727069,"size":354372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d32e0a59cddf14fd1a6e679a2405343113f128c2&amp;dn=Not+Peace+but+a+Sword+-+Robert+Spencer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1425113491,"description":"\n Islam...Is it a religion of peace?...Are Muslims an easy ally in the fight against global secularization and the culture of death?...Are their beliefs really so different than our own? New York Times best-selling author, Robert Spencer, of more than a dozen books dealing with Islam and the West, warns Christians against the danger of thinking that Islam is an easy ally and shines the light of truth on areas where Christians and Muslims don t just quibble over small details but fundamentally disagree. Many Christian groups, including the Catholic Church, do recognize whatever is good and true in Islam, and their leaders rightly pursue peaceful accord and common ground with all religions. Spencer argues, however, that real peace can come only from truth. Where there is falsehood in Islamic doctrine, morals, and practice, papering over the truth actually hurts the cause of peace. He demonstrates how these differences are not academic but real-world. They are critical and drive Muslim behavior toward Christians and others. If we fail to open our eyes to these differences, we do so at our peril.\n\n\nAbout the author:\nRobert Spencer is the director of Jihad Watch, a program of the David Horowitz Freedom Center, and the author of eight books on Islam and jihad. Spencer is a weekly columnist for Human Events and the website Front-Page Magazine, and has led seminars on Islam and jihad for the United States Central Command, United States Army Command and General Staff College, the Joint Terrorism Task Force, and the U.S. intelligence community","torrent":{"xt":"urn:btih:d32e0a59cddf14fd1a6e679a2405343113f128c2","amp;dn":"Not+Peace+but+a+Sword+-+Robert+Spencer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32e0a59cddf14fd1a6e679a2405343113f128c2","infoHashBuffer":{"type":"Buffer","data":[211,46,10,89,205,223,20,253,26,110,103,154,36,5,52,49,19,241,40,194]},"announce":[],"urlList":[]}}