{"title":"Hawaii.Five-0.2010.S04E15.HDTV.x264-LOL","uid":9680332,"size":401795348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d357a7e431250b6e8a7604db7d32a03b60c3a4d0&amp;dn=Hawaii.Five-0.2010.S04E15.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Thhaque","files":2,"time":1393656800,"description":"[b]Hawaii Five-0\n\nvisit: thhaque.blogspot .com\n\nGenre: Action, Crime, Drama, Family, Thriller\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Alex Kurtzman\nCast: Scott Caan, Daniel Dae Kim, Alex O'Loughlin, Grace Park, Michelle Borth\n\n.: Plot :.\nHAWAII FIVE-0 is a contemporary take on the classic series about a new elite federalized task force whose mission is to wipe out the crime that washes up on the Islands' sun-drenched beaches. Detective Steve McGarrett (Alex O'Loughlin), a decorated Naval officer turned cop, returns to Oahu to investigate his father's murder and stays after Hawaii's governor persuades him to head up the new team: his rules, her backing, no red tape and full blanket immunity to hunt down the biggest &quot;game&quot; in town. Joining McGarrett is Detective Danny &quot;Danno&quot; Williams (Scott Caan), a newly relocated ex-New Jersey cop who prefers skyscrapers to the coastline but is committed to keeping the Islands safe for his 8-year-old daughter; and Chin Ho Kelly (Daniel Dae Kim), an ex-Honolulu Police Detective wrongly accused of corruption and relegated to a federal security patrol, who is also a former protege of McGarrett's father. Chin's cousin, Kono (Grace Park), is a beautiful and fearless native, fresh out of the academy and eager to establish herself among the department's elite. McGarrett vows to bring closure to his father's case while the state's brash new FIVE-0 unit, who may spar and jest among themselves, is determined to eliminate the seedy elements from the 50th state. Peter Lenkov, Alex Kurtzman and Roberto Orci are executive producers for CBS Television Studios.[/b]","torrent":{"xt":"urn:btih:d357a7e431250b6e8a7604db7d32a03b60c3a4d0","amp;dn":"Hawaii.Five-0.2010.S04E15.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d357a7e431250b6e8a7604db7d32a03b60c3a4d0","infoHashBuffer":{"type":"Buffer","data":[211,87,167,228,49,37,11,110,138,118,4,219,125,50,160,59,96,195,164,208]},"announce":[],"urlList":[]}}