{"title":"AVENGERS - SEASON ONE hardcover (2012) (digital) (Zone-Empire)","uid":8252706,"size":146070655,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d4a9e7255ecf355a396b3cc4d109ad07ecfe2c5d&amp;dn=AVENGERS+-+SEASON+ONE+hardcover+%282012%29+%28digital%29+%28Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1363194134,"description":"English\nCBR\n112 pages\n139.30 MB\n\n------\n\nWriter Peter David talks about Avengers: Season One, available exclusively with the 'Marvel's The Avengers' Blu-ray at Walmart\n\nUpdated Sep 28, 2012 3:36 pm\n\nEarth's Mightiest Heroes assemble in your home when &quot;Marvel's The Avengers&quot; hits Blu-ray, Blu-ray 3D and DVD on September 25! We'll be celebrating the upcoming release with new interviews and features every day right here on Marvel.com, so check back daily for all things Avengers!\n\n&quot;Marvel's The Avengers&quot; assembles onto shelves everywhere September 25, and if you're purchasing a Blu-ray copy at Wal-Mart you'll notice a little something extra to check out -- AVENGERS: SEASON ONE, an exclusive new Marvel Comic Book Universe graphic novel available while supplies last!\n\nTo celebrate the book's exclusive release, we thought it appropriate to chat with the man who brought this entirely original story to life, writer Peter David!\n\n&quot;It's set in what I would call a continuity bubble in the already-established Avengers history,&quot; David said. &quot;There's a specific time in history this story slides into, and [it] also serves the needs of a project created [as] a companion piece to the movie.&quot;\n\n&quot;It's a Silver Age tale told in a modern-age manner. I broke it up into individually titled chapters, like in the old days. And every single one of the heavy hitters gets equal time in terms of page count. You've got classic heroes and classic villains (yes, Loki is there to set things off),&quot; he revealed.\n\n&quot;The other nice thing is that we have five different pencillers on it, but each of them handles a single chapter, so the art doesn't vary from page-to-page.&quot;\n\nWhile he worked on AVENGERS: SEASON ONE, David wanted to find a good balance between updating Earth's Mightiest Heroes' origins while keeping their Silver Age spirit alive.\n\n&quot;It was great playing with the Silver Age iterations of the heroes, but trying to give them a bit of a modern-day sensibility,&quot; the writer shared. &quot;Plus it was set very early in their history, when they still weren't entirely sure of each other.&quot;\n\nHe also chose to highlight and maintain the character dynamics of two original Avengers that don't always see eye-to-eye: Thor and Iron Man.\n\n&quot;You've got one of the big dichotomies of humanity epitomized right there,&quot; explained David. &quot;Thor, the essence of religion who Vikings prayed to and worshipped, and Iron Man, the man of science who thinks it's preposterous to have someone going around saying he's a god. They're both arrogant in their own way, and each of them thinks the other is nothing special.&quot;\n\nReaders unfamiliar with Earth's Mightiest Heroes' roots overall were taken into account in AVENGERS: SEASON ONE, which the creators designed to be wholly accessible by new fans coming into the comics from the movie.\n\n&quot;We wanted it to seem familiar to non-readers of the comic,&quot; David told. &quot;We left Rick Jones, Hank Pym and Janet Van Dyne out of the story, [though] they are referred to. We didn't want newcomers wondering who these guys were. On the other hand, the Hulk is perfectly articulate, as he was in those early Avengers comics. We tried to strike a balance and I think we succeeded.&quot;\n","torrent":{"xt":"urn:btih:d4a9e7255ecf355a396b3cc4d109ad07ecfe2c5d","amp;dn":"AVENGERS+-+SEASON+ONE+hardcover+%282012%29+%28digital%29+%28Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4a9e7255ecf355a396b3cc4d109ad07ecfe2c5d","infoHashBuffer":{"type":"Buffer","data":[212,169,231,37,94,207,53,90,57,107,60,196,209,9,173,7,236,254,44,93]},"announce":[],"urlList":[]}}