{"title":"Doctor Who - Season 19 - (1982) - 26 Episodes","uid":9171483,"size":5783824348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d52392d11dfb0176eaae0288ffb6134e06e761f0&amp;dn=Doctor+Who+-+Season+19+-+%281982%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"bnaron","files":26,"time":1384079241,"description":"The nineteenth season of British science fiction television series Doctor Who began with 'Castrovalva', and ended with 'Time-Flight'. The entire season was broadcast from 4 January 1982 to 30 March 1982.\n\nSeason 19 introduces Peter Davison as The Fifth Doctor. Tegan Jovanka (Janet Fielding), Nyssa (Sarah Sutton), Adric (Matthew Waterhouse) are his companions. 'Earthshock' is the rare instance, in the series, where one of the companions actually die.\n\nAnthony Ainley returns again in 'Castrovalva' and 'Time-Flight' as the Master.\n\n'Black Orchid' was the first purely historical story, with no science-fiction elements save for the TARDIS and its crew, since 'The Highlanders' from Season 4; it was also the first two-part serial since 'The Sontaran Experiment' in Season 12, and the first of a regular run of a two-parter every season until the change of format to 45 minute episodes in Season 22.\n\n26 Episodes Total:\n\n01 - Castrovalva - 4 Episodes\n\n     Synopsis: The newly regenerated Doctor is in a vulnerable state. His\n     regeneration failing, the Doctor and his companions go to the city of\n     Castrovalva to let him recover.\n\n02 - Four to Doomsday - 4 Episodes\n\n     Synopsis: The Fifth Doctor, Nyssa, Tegan and Adric arrive on a spaceship\n     which is headed for Earth. On board they meet natives of Earth from various\n     eras.\n\n03 - Kinda - 4 Episodes\n\n     Synopsis: When Tegan sleeps near the wind chimes she is confronted by the\n     true evil that threatens Deva Loka.\n\n04 - The Visitation - 4 Episodes\n\n     Synopsis: The TARDIS arrives in 1666. Villainous creatures known as\n     Terileptils are hatching an evil plan and the Doctor and his friends must\n     stop them before the whole village is wiped out.\n\n05 - Black Orchid - 2 Episodes\n\n     Synopsis: At a masked ball at Cranleigh Hall a series of murders begins. The\n     Doctor must uncover the secret the Cranleigh family is hiding from the world.\n\n06 - Earthshock - 4 Episodes\n\n     Synopsis: The TARDIS drops the Fifth Doctor and his companions in the middle\n     of an investigation into the murder of a team of scientists in a complex of\n     caves. Deadly androids are patrolling the tunnels, but what are they\n     protecting... and for whom are they working?\n\n07 - Time-Flight - 4 Episodes\n\n     Synopsis: Missing Concordes lead the Fifth Doctor on a curious mission back\n     in time where a deadly foe is seeking to seize control of the ancient powers\n     of the Xeraphin.\n\n","torrent":{"xt":"urn:btih:d52392d11dfb0176eaae0288ffb6134e06e761f0","amp;dn":"Doctor+Who+-+Season+19+-+%281982%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d52392d11dfb0176eaae0288ffb6134e06e761f0","infoHashBuffer":{"type":"Buffer","data":[213,35,146,209,29,251,1,118,234,174,2,136,255,182,19,78,6,231,97,240]},"announce":[],"urlList":[]}}