{"title":"Landon Pigg - Falling In Love At A Coffee Shop","uid":5158690,"size":151701508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5278c86da81a3ad66d16cffc30a0a384b047e43&amp;dn=Landon+Pigg+-+Falling+In+Love+At+A+Coffee+Shop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1258008788,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nLandon Pigg (born August 6, 1983) is a singer and songwriter from Nashville, Tennessee.\n\nAfter one of his songs was featured on Grey's Anatomy and subsequently went into national rotation, Pigg began a publicity tour in summer 2006 which found him booked on Late Night with Conan O'Brien, Last Call with Carson Daly, and other media outlets including a radio tour and appearances in Teen Vogue, Glamour, and Performing Songwriter. In late August, Landon appeared with his band on The Early Show where he played &quot;Can't Let Go&quot;, the first track from his latest album, LP.\n\nOn February 14, 2007 his song &quot;Great Companion&quot; was played throughout several scenes of the One Tree Hill (TV series) episode &quot;Sad Songs for Dirty Lovers&quot;.\n\nOn February 26, 2008, he kicked off his first show of the year, opening for Gavin DeGraw at Common Grounds in Gainesville, Florida.\n\nOn March 12 Pigg performed on the Tonight Show with Jay Leno.\n\nOn September 22, 2009, Pigg performed on Late Night with Jimmy Fallon.\n\nIn 2007, his song &quot;Falling in Love at a Coffee Shop&quot; was featured in a De Beers commercial. It can also be found on an AT&amp;T telephone commercial playing as of June, 2009.\n\nLandon appeared in Drew Barrymore's roller derby movie &quot;Whip It!&quot;. The movie is based on the Shauna Cross novel &quot;Derby Girl&quot;. Landon was cast as Ellen Page's guitar-playing love interest, Oliver.\n\nPigg made his feature-film debut in Whip It, also Drew Barrymore's first outing as a director, opened wide Oct. 2, 2009. He played &quot;a musician in the big city&quot; who becomes romantically involved with the heroine, portrayed by Juno's Ellen Page. Others in the cast include Marcia Gay Harden, Juliette Lewis and Jimmy Fallon.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d5278c86da81a3ad66d16cffc30a0a384b047e43","amp;dn":"Landon+Pigg+-+Falling+In+Love+At+A+Coffee+Shop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5278c86da81a3ad66d16cffc30a0a384b047e43","infoHashBuffer":{"type":"Buffer","data":[213,39,140,134,218,129,163,173,102,209,108,255,195,10,10,56,75,4,126,67]},"announce":[],"urlList":[]}}