{"title":"Metal Gear Solid The Legacy Collection PS3-ANTiDOTE","uid":8731678,"size":68860678506,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d5833a8cfaa08148952485ce95c28f759834d070&amp;dn=Metal+Gear+Solid+The+Legacy+Collection+PS3-ANTiDOTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":15,"uploader":"IAmsoICan","files":173,"time":1374616982,"description":"From the critically acclaimed director, Hideo Kojima, METAL GEAR SOLID: The Legacy Collection offers the most complete METAL GEAR SOLID experience ever. Featuring eight complete games, METAL GEAR, METAL GEAR 2, METAL GEAR SOLID 1, METAL GEAR SOLID 2: HD Edition, METAL GEAR SOLID 3: HD Edition METAL GEAR SOLID 4: Trophy Edition, METAL GEAR SOLID: Peace Walker HD Edition, and METAL GEAR SOLID: VR MISSIONS along with two Ashley Wood Digital Graphic, the Legacy Collection offers Metal Gear and stealth action fans a chance to experience all the heroic game play, compelling design and immersive storytelling of the MGS franchise in one complete package.\n\nThe &quot;Metal Gear&quot; series is the seminal work of Hideo Kojima, Japan's master game creator, and the progenitor of the stealth action game genre. The series has become a global phenomenon, with over 33 million copies sold worldwide. The player controls a secret agent from an elite special forces unit who is sent on solo sneaking missions through enemy installations, vast jungles, and sometimes even the thick of battle. Alone and surrounded by the enemy, even a special forces agent will find it tough to come out alive. But that is the secret behind the series' popularity-the cerebral challenge of figuring out how to avoid combat, and the thrill of sneaking through enemy territory undetected.\n\nThe MGS series is also known for its storyline, which blends seamlessly with the gameplay. The scenarios are based on extensive research and incorporate the drama of actual developments in society.\n\nThese elements have made MGS what it is today: a mature work of entertainment that transcends national borders and the confines of video games, and one of the leading products of the Japanese content business.\n\nNTSC-U\n\n &lt;a href=&quot;\nhttp://image.bayimg.com/8af5e66f99e16661ce268b19585bcdec24002aff.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/8af5e66f99e16661ce268b19585bcdec24002aff.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d5833a8cfaa08148952485ce95c28f759834d070","amp;dn":"Metal+Gear+Solid+The+Legacy+Collection+PS3-ANTiDOTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5833a8cfaa08148952485ce95c28f759834d070","infoHashBuffer":{"type":"Buffer","data":[213,131,58,140,250,160,129,72,149,36,133,206,149,194,143,117,152,52,208,112]},"announce":[],"urlList":[]}}