{"title":"Lawrence M. Krauss - A Universe from Nothing - Why There Is Some","uid":6994493,"size":319703994,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d5963ae4102ec8932c3fc7ef359142f5a258f174&amp;dn=Lawrence+M.+Krauss+-+A+Universe+from+Nothing+-+Why+There+Is+Some&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ProfaneMan","files":-1,"time":1327824605,"description":"A Universe from Nothing: Why There Is Something Rather Than Nothing\n(Unabridged) (2012)\n\n    by Lawrence M. Krauss\n    Narrated by Lawrence M. Krauss, Simon Vance \n\nLength: 5 hrs and 32 mins\nPublisher: Blackstone Audio, Inc.\n\n==Publisher's Summary==\n\nWhere did the universe come from? What was there before it? What will the future bring? And finally, why is there something rather than nothing? \n\nKrauss' answers to these and other timeless questions, in a wildly popular lecture on YouTube, has attracted almost a million viewers. The last of these questions in particular has been at the center of religious and philosophical debates about the existence of God, and it's the supposed counterargument to anyone who questions the need for God. Scientists have, however, historically focused on more pressing issues-such as figuring out how the universe actually functions, which could help us to improve our quality of life. \n\nIn this cosmological story that rivets as it enlightens, pioneering theoretical physicist Lawrence Krauss explains groundbreaking scientific advances that turn the most basic philosophical questions on their head. One of the few prominent scientists to have actively crossed the chasm between science and popular culture, Krauss reveals that modern science is indeed addressing the question of why there is something rather than nothing-with surprising and fascinating results. The beautiful experimental observations and mind-bending theories are all described accessibly, and they suggest that not only can something arise from nothing, something will always arise from nothing. \n\nWith his characteristic wry humor and clear explanations, Krauss takes us back to the beginning of the beginning, presenting recent evidence for how our universe evolved-and the implications for how it will end. It will provoke, challenge, and delight listeners as it looks at the most basic underpinnings of existence in a whole new way. And this knowledge that our universe will be quite different in the future has profound consequences and directly affects how we live in the present. As Richard Dawkins described it, this could potentially be the most important scientific book with implications for supernaturalism since Darwin. \n\n==What the Critics Say==\n\n&quot;Nothing is not nothing. Nothing is something. That's how a cosmos can be spawned from the void-a profound idea conveyed in A Universe from Nothing that unsettles some yet enlightens others. Meanwhile, it's just another day on the job for physicist Lawrence Krauss.&quot; (Neil deGrasse Tyson, astrophysicist, American Museum of Natural History) \n\n\n==Metadata==\nFormat                           : MPEG Audio\nOverall bit rate mode            : Constant\nOverall bit rate                 : 128 Kbps\nWriting library                  : LAME3.98\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nCompression mode                 : Lossy\n\n==Alternative download sources==\nYou can also download this audiobook from(and extract the 7z archive with the password bqxK8lysa3v2O5pS ), or from binsearch.info/?server=&amp;b=A_Universe_from_Nothing&amp;g=alt.binaries.boneless&amp;p=connectome%40connectomics.com+%28Connectome%29&amp;max=250 if you've a Usenet subscription.","torrent":{"xt":"urn:btih:d5963ae4102ec8932c3fc7ef359142f5a258f174","amp;dn":"Lawrence+M.+Krauss+-+A+Universe+from+Nothing+-+Why+There+Is+Some","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5963ae4102ec8932c3fc7ef359142f5a258f174","infoHashBuffer":{"type":"Buffer","data":[213,150,58,228,16,46,200,147,44,63,199,239,53,145,66,245,162,88,241,116]},"announce":[],"urlList":[]}}