{"title":"Skyfall (2012) HD","uid":7985121,"size":1494465212,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d60537c77b29811e0190ebcc1afc43385b0146cc&amp;dn=Skyfall+%282012%29+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"tasovac","files":-1,"time":1357265981,"description":"Skyfall (2012) in HD!!!\n\n\n\nPlot\n\n\n\nIn Istanbul, MI6 agents James Bond and Eve chase a mercenary, Patrice, who has stolen a computer hard drive containing details of undercover agents placed in terrorist organisations by NATO states. Patrice wounds Bond in the shoulder and, as the two men fight atop a train, Eve inadvertently shoots Bond, allowing Patrice to escape. Bond falls into a river and goes missing, presumed dead.\n\nIn the aftermath of the operation, M, the head of MI6, comes under political pressure to retire from Gareth Mallory, the Intelligence and Security Committee Chairman. On her return from the meeting, MI6's servers are breached and M receives a taunting message via computer moments before the offices explode, killing a number of employees. MI6 relocates to its emergency offices underground. Bond, having used his supposed death to retire, learns of the attack and returns to London. Although he fails a series of physical and psychological examinations, M approves his return to the field. Shrapnel taken from Bond's shoulder wound helps identify Patrice, and intelligence places him in Shanghai, where he is planning an assassination. Bond is ordered to identify Patrice's employer, recover the stolen hard drive and kill Patrice.","torrent":{"xt":"urn:btih:d60537c77b29811e0190ebcc1afc43385b0146cc","amp;dn":"Skyfall+%282012%29+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d60537c77b29811e0190ebcc1afc43385b0146cc","infoHashBuffer":{"type":"Buffer","data":[214,5,55,199,123,41,129,30,1,144,235,204,26,252,67,56,91,1,70,204]},"announce":[],"urlList":[]}}