{"title":"Led Zeppelin - 1975.02.12 MSG, NY (Matrix)","uid":15635474,"size":402490355,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d609cb41a3d2857a7ce78bb498e732cd70f707b5&amp;dn=Led+Zeppelin+-+1975.02.12+MSG%2C+NY+%28Matrix%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mysterioso","files":18,"time":1471983684,"description":"Led Zeppelin - 1975.02.12 MSG, NY (Matrix)   \r\n\r\nLed Zeppelin\r\nFebruary 12th, 1975\r\nMadison Square Garden\r\nNew York, New York\r\nFour Blocks in the Snow V.2\r\nA Bluecongo Production\r\n\r\nMatrix (Audience and Soundboard sources blended into a single audio stream)\r\nSB Source: Heartbreakers Back in Town\r\nAud Source: Can’t Take Your Evil Ways\r\n\r\nAudience Source: \r\nAlmost complete excellent audience recording. This source will remain as one \r\nof the best sources ever recorded. The quality is comparable with soundboard \r\nat times but there is much better atmosphere. It was taped on center rear \r\norchestra six rows behind soundboard. Microphones were on pole two feet above \r\nhead level.\r\n\r\nSoundboard Source: \r\nAlmost complete excellent soundboard recording.\r\nThe recording is a very good balanced professional board tape.\r\n\r\nTracklist:\r\n\r\nIntro\r\nRock n Roll\r\nSick Again\r\nOver the Hills &amp; Far Away\r\nIn My Time of Dying\r\nThe Song Remains the Same\r\nRain Song\r\nKashmir\r\nNo Quarter\r\nTrampled Underfoot\r\nMoby Dick\r\nDazed &amp; Confused\r\nStairway to Heaven\r\nWhole Lotta Love\r\nBlack Dog\r\nHeartbreaker\r\n\r\nComments:\r\nThis is the all new, extended &amp; repaired version of this show.  All SBE's have \r\nbeen fixed, and I have added in more in between song banter and changed a few \r\ntransitions.  This was my first attempt at a matrix, and I learned a lot since \r\nthen. You can discard your previous copies, this is the definitive version.\r\n\r\nComments: \r\nA great show! It may have been a blizzard outside but the Garden was rocking this night! &quot;We came four blocks in the snow to get here ... you realise that? People were calling me on the telephone today and saying 'Is it gonna be on?' For a minute I was wondering about my anatomy, then I realised there was some discrepancy about the weather. Isn't it good though that it snows? Doesn't it change the vibe of the city? I think it's great!&quot; The band is in excellent form and delivers a great show. Robert sounds good and strong, Jonesy and Bonzo are amazing as always, and Jimmy is incendiary tonight, especially at the end of Sick Again. He extends the solo in Over The Hills And Far Away to an incredible length and soars. No Quarter is dedicated to Jones that &quot;...made Monthy Python's Flying Circus a flop in New York&quot; tonight and his imppecably clean fingernails. Moby Dick is like a hurricane and Dazed And Confused \r\njust blows everybody out to the cosmic level! A bunch of heavy solid encores with an excellent Heartbreaker with some lyrics of Elvis Presley's That's Alright Mama thrown in closing this amazing evening. This is definitely a triumph for the entire band and, not only a strong concert but also probably the best from the 1975 US Tour. &quot;Ladies and gentlemen of New York ... you're too much ... and we ain't so bad ourselves!&quot; and the show was over","torrent":{"xt":"urn:btih:d609cb41a3d2857a7ce78bb498e732cd70f707b5","amp;dn":"Led+Zeppelin+-+1975.02.12+MSG%2C+NY+%28Matrix%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d609cb41a3d2857a7ce78bb498e732cd70f707b5","infoHashBuffer":{"type":"Buffer","data":[214,9,203,65,163,210,133,122,124,231,139,180,152,231,50,205,112,247,7,181]},"announce":[],"urlList":[]}}