{"title":"Die Less Often - Interface of Gun, Knife and Empty Hand  1-2","uid":4750612,"size":1465348096,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d623f842f64b986d535bcb1daad43a1ff138d128&amp;dn=Die+Less+Often+-+Interface+of+Gun%2C+Knife+and+Empty+Hand++1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Defendu","files":2,"time":1236166295,"description":"Introduction to the Interface of Gun, Knife, and Empty Hand\n\nfeaturing the synergy of Crafty Dog and Gabe Suarez\n\nEvolutionary leaps occur when two or more structures band together in new ways. With this double/triple DVD the synergistic convergence of two men, each from different worlds, unveils a new paradigm -- the interface of gun, knife and empty hand.\n\nWhen facing any of these dangerous possibilities, you want to have the cutting edge, high IQ responses that come from the synergy of Marc &quot;Crafty Dog&quot; Denny and Gabe Suarez.\n\nIn this DVD you will be shown how to frame the approach of potential problems and fence close quarter situations using &quot;the Kali Fence&quot; and how to intercept and defend against attacks from this position. Principal amongst these defenses is the innovative &quot;Dog Catcher&quot; which allows for one initial default response to the most common high and mid line attacks of empty hand and knife from which one can either access one's own weapons or respond empty handed. Your understanding of the material will be intensified by seeing it all tested in high pressure scenario testing. &quot;If you see it taught, you see it fought.&quot;\n\n-----------\n\nThe guy who did the rip from DVD to AVI didn't know how to rip the third disc, so this torrent only includes the first two parts of a three disc set.","torrent":{"xt":"urn:btih:d623f842f64b986d535bcb1daad43a1ff138d128","amp;dn":"Die+Less+Often+-+Interface+of+Gun%2C+Knife+and+Empty+Hand++1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d623f842f64b986d535bcb1daad43a1ff138d128","infoHashBuffer":{"type":"Buffer","data":[214,35,248,66,246,75,152,109,83,91,203,29,170,212,58,31,241,56,209,40]},"announce":[],"urlList":[]}}