{"title":"Babylon 5 - Stagione 1 - DVD Mux ITA","uid":5694955,"size":8903579500,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d6ad79b59e9d84cf48b55ad169fb3eb0adefdb64&amp;dn=Babylon+5+-+Stagione+1+-+DVD+Mux+ITA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":null,"files":25,"time":1279272702,"description":"Storia e ambientazione:\n\nEra l'alba della Terza Era dell'umanitÃƒÂ . Il Progetto Babylon era la nostra ultima, migliore speranza di pace...  \n\nMetÃƒÂ  del ventitreesimo secolo, la situazione ÃƒÂ¨ delicata. Solo da un secolo i Terrestri viaggiano al di fuori del proprio sistema solare, grazie ai Centauri, che hanno introdotto gli Umani alla tecnologia dei jumpgate, portali per l'accesso all'iperspazio. Le distanze si sono accorciate, i viaggi in altri sistemi solari sono finalmente rapidi e l'umanitÃƒÂ  non deve piÃƒÂ¹ ricorrere alle navi con equipaggio in animazione sospesa. E grazie alla vittoriosa guerra contro i Dilgar, iniziata venendo in aiuto ad alcune specie meno potenti, i Terrestri si impongono come una tra le principali potenze della galassia.\n\nMa un primo contatto andato male scatena la guerra con i Minbari, una potentissima specie aliena, che inspiegabilmente si arrende alla vigilia della conquista della Terra, dopo avere praticamente sbaragliato anche l'ultima, disperata linea difensiva terrestre nella Battaglia della Linea.\n\nIl Progetto Babylon nasce dalle ceneri della guerra con i Minbari. Un luogo in cui umani ed alieni possono incontrarsi, discutere e risolvere le reciproche differenze in maniera pacifica. Una stazione spaziale in una regione di spazio ai confini dei territori delle cinque maggiori specie, in territorio neutrale.\n\nLe prime tre stazioni costruite dall'Alleanza Terrestre vengono distrutte da sabotaggi durante la costruzione, la quarta svanisce nel nulla solo ventiquattro ore dopo essere divenuta operativa. Grazie all'assistenza economica e all'intervento delle altre specie, i Terrestri costruiscono una quinta stazione.\n\nBabylon 5 ÃƒÂ¨ la storia dell'ultima delle stazioni del Progetto Babylon. Un luogo di commercio e diplomazia, popolato da 250.000 umani ed alieni. Un faro risplendente nello spazio, tutto solo nella notte. Tutto ha inizio nell'anno 2256, con l'inaugurazione di Babylon 5...\n","torrent":{"xt":"urn:btih:d6ad79b59e9d84cf48b55ad169fb3eb0adefdb64","amp;dn":"Babylon+5+-+Stagione+1+-+DVD+Mux+ITA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ad79b59e9d84cf48b55ad169fb3eb0adefdb64","infoHashBuffer":{"type":"Buffer","data":[214,173,121,181,158,157,132,207,72,181,90,209,105,251,62,176,173,239,219,100]},"announce":[],"urlList":[]}}