{"title":"The Divide (audiobook) by Matt Taibbi 2014 English mp3","uid":9984978,"size":403845396,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d6b7d7b7dda6879e1ba9d509f84f1c6eecf6508b&amp;dn=The+Divide+%28audiobook%29+by+Matt+Taibbi+2014+English+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"bobpocket","files":11,"time":1397776977,"description":"The Divide: American Injustice in the Age of the Wealth Gap (Audiobook) by Matt Taibbi and Ray Porter\nEnglish | 2014 | ISBN: n/a | ASIN: B00J4RSMJQ | 14 hours | MP3 64 kbps | 385 MB\n\nA scathing portrait of an urgent new American crisis.\nOver the last two decades, America has been falling deeper and deeper into a statistical mystery:\nPoverty goes up. Crime goes down. The prison population doubles. Fraud by the rich wipes out 40 percent of the world's wealth. The rich get massively richer. No one goes to jail.\n\nIn search of a solution, journalist Matt Taibbi discovered the Divide, the seam in American life where our two most troubling trends - growing wealth inequality and mass incarceration - come together, driven by a dramatic shift in American citizenship: Our basic rights are now determined by our wealth or poverty. The Divide is what allows massively destructive fraud by the hyperwealthy to go unpunished, while turning poverty itself into a crime - but it's impossible to see until you look at these two alarming trends side by side.\n\nIn The Divide, Matt Taibbi takes readers on a galvanizing journey through both sides of our new system of justice - the fun-house-mirror worlds of the untouchably wealthy and the criminalized poor. He uncovers the startling looting that preceded the financial collapse; a wild conspiracy of billionaire hedge fund managers to destroy a company through dirty tricks; and the story of a whistleblower who gets in the way of the largest banks in America, only to find herself in the crosshairs. On the other side of the Divide, Taibbi takes us to the front lines of the immigrant dragnet; into the newly punitive welfare system which treats its beneficiaries as thieves; and deep inside the stop-and-frisk world, where standing in front of your own home has become an arrestable offense. As he narrates these incredible stories, he draws out and analyzes their common source: a perverse new standard of justice, based on a radical, disturbing new vision of civil rights.","torrent":{"xt":"urn:btih:d6b7d7b7dda6879e1ba9d509f84f1c6eecf6508b","amp;dn":"The+Divide+%28audiobook%29+by+Matt+Taibbi+2014+English+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6b7d7b7dda6879e1ba9d509f84f1c6eecf6508b","infoHashBuffer":{"type":"Buffer","data":[214,183,215,183,221,166,135,158,27,169,213,9,248,79,28,110,236,246,80,139]},"announce":[],"urlList":[]}}