{"title":"Studs Terkel's Working: A Graphic Adaptation","uid":7810078,"size":204019058,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d735797e0b3a28aa871b6f526ef258c06191e590&amp;dn=Studs+Terkel%27s+Working%3A+A+Graphic+Adaptation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352502503,"description":"English | PDF | 208 Pages\n\nStuds Terkel's Working: A Graphic Adaptation\nPublisher:  The New Press\nPublication Date:  April 28, 2009\n\n&quot;Working has been a book, a radio drama, a Broadway musical, and now a gripping graphic novel. I can't speak for Studs, but I suspect he would have been tickled to see it adapted by a former government file clerk and wage slave, who knows all about working.&quot; --Roger Ebert\n\nIn the thirty-five years since Pulitzer Prize-winner Studs Terkel's Working was first published, it has captivated millions of readers with lyrical and heartbreaking accounts of how their fellow citizens earn a living. Widely regarded as a masterpiece of words, it is now adapted into comic book form by comics legend Harvey Pekar, the blue-collar antihero of his American Book Award-winning comics series American Splendor.\n\nIn Studs Terkel's Working, Pekar offers a brilliant visual adaptation of Terkel's verbatim interviews, collaborating with both established comics veterans and some of the comic underground's brightest new talent. Here are riveting accounts of the lives of ordinary Americans--farmers, miners, barbers, hookers, box boys, stockbrokers--depicted with unsurpassed dignity and frankness. A visual treat with a visceral impact, Studs Terkel's Working will delight Terkel fans everywhere, and introduce his most powerful work to a new generation.","torrent":{"xt":"urn:btih:d735797e0b3a28aa871b6f526ef258c06191e590","amp;dn":"Studs+Terkel%27s+Working%3A+A+Graphic+Adaptation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d735797e0b3a28aa871b6f526ef258c06191e590","infoHashBuffer":{"type":"Buffer","data":[215,53,121,126,11,58,40,170,135,27,111,82,110,242,88,192,97,145,229,144]},"announce":[],"urlList":[]}}