{"title":"Sharon Lee, Steve Miller - I Dare (Liaden Universe #13)","uid":12398788,"size":330199929,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d765f3a72fbd7a4cea220ff89c1467ee0469a584&amp;dn=Sharon+Lee%2C+Steve+Miller+-+I+Dare+%28Liaden+Universe+%2313%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cybotage","files":1,"time":1441989137,"description":"\nThe dynamic conclusion to the Agent of Change series in Lee and Miller's Liaden Universe!\n\nVal Con yos'Phelium: a Scout, former Agent of Change, husband, brother to Turtles, and designated heir to Clan Korval's fortune and mission... Whether you considered him respectable or not, no one would call him a gambling man. When he reappears demanding Balance and retribution, he looks exactly like the kind of leader his clan has been producing for generations. On his capable shoulders the fate of his Clan, his world, and his civilization.... Pat Rin yos'Phelium: fond father, bon vivant, ne'er-do-well... and a professional gambler. The enemies of Korval have offered Pat Rin the Ring that would make all of Korval's holdings his own and a Juntavas Judge has offered Pat Rin a world....\n\nWhen he appears with hired guns in tow, no one is expecting him and no one knows what he'll do. Pat Rin is a gambling man, and on his wild-card shoulders the fate of his Clan, his world, his civilization....\n\nThis long-awaited culmination of the Agent of Change sequence of Sharon Lee and Steve Miller's internationally acclaimed Liaden Universe novels pits unexpected friends and unexpected enemies against each other in a war that spans planets and races - and threatens to bring interstellar violence to the very surface of fabled Liad.\n\n\n\nNarrated by: Andy Caploe\nLength: 20 hrs and 56 mins \nFormat: M4A\nBitrate: 32 Kbps\nUnabridged Audiobook\nRelease Date:09-04-12\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:d765f3a72fbd7a4cea220ff89c1467ee0469a584","amp;dn":"Sharon+Lee%2C+Steve+Miller+-+I+Dare+%28Liaden+Universe+%2313%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d765f3a72fbd7a4cea220ff89c1467ee0469a584","infoHashBuffer":{"type":"Buffer","data":[215,101,243,167,47,189,122,76,234,34,15,248,156,20,103,238,4,105,165,132]},"announce":[],"urlList":[]}}