{"title":"One Little Pill (Treatment for Alcohol Addiction)","uid":11139293,"size":1743047906,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d7d1067e6fd325cd12a6ac0fe78edd3efbd78d6a&amp;dn=One+Little+Pill+%28Treatment+for+Alcohol+Addiction%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Cheetah59","files":1,"time":1412151107,"description":"The treatment for alcoholism they don't want you to know about. &quot;Your alcoholism will kill you before your HIV does,&quot; says a doctor to one of the characters. Worldwide, alcohol abuse kills more people than HIV, nearly 2.5 million per year. Yet what the public believes, and Alcoholics Anonymous purports, &quot;Once an alcoholic, always an alcoholic,&quot; is not as true as you think. Nor is the fundamental principle for treating alcoholism that we all take as truth; abstinence. Science has shown that abstinence not only doesn't take away the addiction, but also increases the craving. So why has one modality dominated our thought since the 1930's? Why are profitable rehab facilities reluctant to change? And why are millions of people still being denied the opportunity of a simple life saving method and drug that have been FDA approved since 1994? One Little Pill takes an in depth look at a simple, safe method with success rates of 78%, the suppressing obstacles surrounding it, and those people just now finding it. ","torrent":{"xt":"urn:btih:d7d1067e6fd325cd12a6ac0fe78edd3efbd78d6a","amp;dn":"One+Little+Pill+%28Treatment+for+Alcohol+Addiction%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d1067e6fd325cd12a6ac0fe78edd3efbd78d6a","infoHashBuffer":{"type":"Buffer","data":[215,209,6,126,111,211,37,205,18,166,172,15,231,142,221,62,251,215,141,106]},"announce":[],"urlList":[]}}