{"title":"Roc Marciano - Marcberg (2010) 320 kbps","uid":7154925,"size":140967513,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d969450db337d4a07fc81829e06b9b75f2bd3afe&amp;dn=Roc+Marciano+-+Marcberg+%282010%29+320+kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"willrobd","files":15,"time":1333429033,"description":"Artist: Roc Marciano\n\nAlbum: Marcberg\n\nYear Released: 2010\n\nQuality: 320 kbps\n\nGenre: Rap/Hip-hop (Real Rap/Hip-hop)\n\nRoc Marciano is an American rapper, songwriter and producer from Hempstead, Long Island (New York). Originally a member of Busta Rhymes' crew, Flipmode Squad becoming the sixth member after the departure of Lord Have Mercy, Roc left in 2001 to form the UN, a hardcore underground hip hop group consisting of three other MCs (Dino Brave, Laku &amp; Mic Raw) with whom released an album on Carson Daly's 456 Entertainment in 2004. Notably, Roc appeared in the 2005 Wu-Tang Clan compilation album, Wu-Tang Meets the Indie Culture, and in Pete Rock's 2008 album, NY's Finest, drawing acclaim for such performances. Since 2008, Roc Marciano has been working on his solo career, and to widespread internet acclaim, released his entirely self-produced debut LP, Marcberg in the Spring of 2010. The album was applauded for its throwback 90s east coast style, coming as a breath of fresh air amongst the various other hip hop albums released that year. His stream of consciousness narrative and boom-bap, rugged beats have also been the subject to many compliments from critics and bloggers alike. In 2011, Roc Marciano collaborated with Gangrene, the duo of rapper/producers Oh No and The Alchemist, to release the collaborative EP Greneberg. Roc Marciano is currently signed to Decon Records.","torrent":{"xt":"urn:btih:d969450db337d4a07fc81829e06b9b75f2bd3afe","amp;dn":"Roc+Marciano+-+Marcberg+%282010%29+320+kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d969450db337d4a07fc81829e06b9b75f2bd3afe","infoHashBuffer":{"type":"Buffer","data":[217,105,69,13,179,55,212,160,127,200,24,41,224,107,155,117,242,189,58,254]},"announce":[],"urlList":[]}}