{"title":"mr bean ultimate disaster movie","uid":5479441,"size":738404352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da079954d018900d35dcfc14e7699f95e62a37f9&amp;dn=mr+bean+ultimate+disaster+movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"EvIlAdrEnAlInE","files":1,"time":1270326759,"description":"Bean: The Ultimate Disaster Movie is een komische Britse film uit 1997, gebaseerd op de televisieserie Mr. Bean, met in de hoofdrol Rowan Atkinson. De film werd geregisseerd door Mel Smith.\n\nMr. Bean is suppoost in een Engels museum. Hij wordt gezien als de slechtste werknemer van het museum aller tijden. Daarom stuurt het bestuur hem voor drie maanden naar Amerika, waar het Grierson Museum iemand zoekt die het dure schilderij Whistler's Mother kan presenteren. In Amerika wordt Bean ontvangen door David Langley, een werknemer van het Grierson Museum. Al snel wordt in alles duidelijk dat Dr. Bean geen enkel verstand heeft van kunst. Hij verkiest bijvoorbeeld de kermis boven een cultureel middagje in L.A. Als Bean alleen gelaten wordt met het schilderij, weet hij het door toedoen van zijn eigen onhandigheid dusdanig te verminken, dat het niet meer te herstellen is. Alleen David weet hiervan. Vlak voordat het schilderij onthuld moet worden, vindt Bean echter een creatieve oplossing; hij vervangt het beschadigde doek door een poster.\n\nEen andere verhaallijn is het gezinsleven van David. Zijn vrouw en kinderen zijn erop tegen dat Bean bij hen logeert en vertrekken. De naÃƒÂ¯eve Bean heeft natuurlijk niets in de gaten. Op het einde komt hij erachter wat hij heeft aangericht in het gezin. Hij betrekt dit ook in de indrukwekkende speech die hij houdt, als hij het doek onthult. Zo komt alles op zijn pootjes terecht. Bean vertrekt weer naar Engeland, maar niet zonder het originele doek van Whistler's Mother, dat een mooi plekje boven zijn bed krijgt.\n\n\nEnjoy\n\nSEED","torrent":{"xt":"urn:btih:da079954d018900d35dcfc14e7699f95e62a37f9","amp;dn":"mr+bean+ultimate+disaster+movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da079954d018900d35dcfc14e7699f95e62a37f9","infoHashBuffer":{"type":"Buffer","data":[218,7,153,84,208,24,144,13,53,220,252,20,231,105,159,149,230,42,55,249]},"announce":[],"urlList":[]}}