{"title":"The Walls of Rome","uid":11836093,"size":28947597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db25829dab694f19bea826d4b7866d7bd995b2fe&amp;dn=The+Walls+of+Rome&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429741217,"description":"Having defeated a Germanic invasion of northern Italy, the Emperor Aurelian surrounded Rome with a powerful circuit of walls. This great fortification is one of the best preserved of all city walls in the Roman Empire and remains a dramatic feature of Rome today, representing the most emblematic and the most enduring monument of Aurelian's age. Nothing else so eloquently demonstrates that, by Aurelian's day, the empire was on the defensive. Although embellished, strengthened and restored many times down the ages, Aurelian's original structure remained the basis of the city's defences through to the mid-19th century, when the Republican forces under Giuseppe Garibaldi managed for some time to withstand the French, and is still discernible today along much of the walls' circuit.\n\nThis title describes Aurelian's Wall in detail with cut-away cross sections, and investigates its historical purpose and military effectiveness within the general context of late Roman fortifications. A final section follows the history of the Wall's continued use beyond the Romano-Byzantine period, and provides an invaluable tourist aid","torrent":{"xt":"urn:btih:db25829dab694f19bea826d4b7866d7bd995b2fe","amp;dn":"The+Walls+of+Rome","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db25829dab694f19bea826d4b7866d7bd995b2fe","infoHashBuffer":{"type":"Buffer","data":[219,37,130,157,171,105,79,25,190,168,38,212,183,134,109,123,217,149,178,254]},"announce":[],"urlList":[]}}