{"title":"PrettyDirty - Jade Nile, Rebel Lynn (Sugar Babies - Part Three","uid":14661632,"size":1447296463,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:db71fa51e6ed06f2024801f25cad2984237f3eac&amp;dn=PrettyDirty+-+Jade+Nile%2C+Rebel+Lynn+%28Sugar+Babies+-+Part+Three&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"SudoSu","files":1,"time":1463760739,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――  \nhttp://imgkiss.com/image/0Z7b4 \nhttp://imgkiss.com/image/0ZaLL\r\n\r\nPreviously on Sugar babies we saw Jesse get revenge for his girlfriend penny's disgusting slutty ways with Jaclyn Taylor. Penny begged that her lesson was learned and that she'd never do it again! I'm left wondering if Penny is done with her friend Jade's game, or will she be back for a second helping?\r\n\r\nJade is at home hanging with her little sister Rebel. Jade is in the middle of a texting fiasco with Xander over the virgin he wants her to bring. she has to make a big choice, whether to keep her secret life as a sugar baby a secret from her virgin sister, Rebel, or to expose that she's been sleeping with Rebel's rock idol, Xander, behind her back, all in order to invite her along for a ride on her favorite idol's famous big stiff cock. Rebel is pissed she didn't tell her sooner, but understands the secrecy. Rebel can't wait to show up and have her first ever sexual experience with her one true idol, she proves it by kissing her stepsister, and stripping to take pictures for Xander to approve.\r\n\r\nJade inches closer and closer to her innocent virgin step-sister, and through her body language begs Rebel to go further and further, all for the sake of eventually getting to meet her hero Xander. Rebel isn't sure what to do, or how to act, but Jade is sure to help her find her way. Jade leans in and promises to show Rebel how it's done. she takes off Rebels' shorts and leans her back against the bed, allowing her to spread her legs to be given her first ever orgasm with anyone else. Jade quickly brings Rebel to orgasm.\r\n\r\nIn order to ensure that Rebel is prepared for the night, Jade makes Rebel show her what she's learned, and if she does well Jade will help her level up with a new lesson in lesbian tribbing. Will it be Xander who's surprised by his new virgin's lesbian abilities, or will it be Rebel who will be surprised with Xander's crazy entourage of rough sexual vices.\r\n\r\nSail to another one:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:db71fa51e6ed06f2024801f25cad2984237f3eac","amp;dn":"PrettyDirty+-+Jade+Nile%2C+Rebel+Lynn+%28Sugar+Babies+-+Part+Three","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db71fa51e6ed06f2024801f25cad2984237f3eac","infoHashBuffer":{"type":"Buffer","data":[219,113,250,81,230,237,6,242,2,72,1,242,92,173,41,132,35,127,62,172]},"announce":[],"urlList":[]}}