{"title":"Recording on a Budget - How to Make Great Audio Recordings Witho","uid":11555363,"size":6011251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db7e4af1860ab2473455a8c6d25cd0aeafc4ed61&amp;dn=Recording+on+a+Budget+-+How+to+Make+Great+Audio+Recordings+Witho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"FrankFoo2","files":-1,"time":1416819184,"description":"\nRecording on a Budget - How to Make Great Audio Recordings Without Breaking the Bank (2011)\n\nAudio recordings are the calling card with which musicians share and promote their work so a knowledge of recording techniques and \n\ntechnologies is essential to the 21st century musician. \n\nRecording On a Budget provides a comprehensive introduction to the recording arts from a budget-conscious perspective. \n\nWritten by a professional musician and educator, this book is ideal for musicians, educators, music students, songwriters and hobbyists.\n\nA central theme of the book is that it is possible to make quality recordings with a modest selection of recording tools. \n\nChapters cover the selection and use of all of the components of a project studio including microphones, mixer, computer, digital audio \n\nworkstation software, and signal processors. \n\nAdditional chapters provide a solid foundation in acoustics, audio recording, podcasting, mixing and mastering. \n\nThe final chapter of the book features do-it-yourself projects that can be completed with a modest selection of tools.\n\nMost musicians have developed their ears to a high level so a special focus is placed on the development of recording technique through \n\nexperimentation and the application of critical listening skills. \n\nThe book is supported by an online resource of nearly 250 audio excerpts detailing all of the primary topics of the book.\n\nRecording on a Budget is ideal for:\n\nÂ· Musicians who are interested in recording a quality CD or demo\nÂ· Choir, orchestra, and band directors who want to record vocal or instrumental ensemble\nÂ· Student performers and composers who wish to record a performance or produce their own music\nÂ· Bands interested in recording live concerts or recording an album in a home studio\nÂ· Videographers interested in recording location sound, voice-overs or music\nÂ· Songwriters who wish to produce a quality demo\nÂ· Podcasters\nand ALL who want to make quality recordings without spending fortunes on equipment.\n\n\nReaders will learn\n\nÂ· to cut budget corners without sacrificing audio quality\nÂ· to choose the right microphone for the job (and where to place it)\nÂ· to assemble an equipment rack, mixing desk, and speakers stand\nÂ· to avoid common mistakes\nÂ· And to be creative and have fun with recording technology\n\nVisit the companion website at www.oup.com/us/recordingonabudget for free selection of sample recordings!","torrent":{"xt":"urn:btih:db7e4af1860ab2473455a8c6d25cd0aeafc4ed61","amp;dn":"Recording+on+a+Budget+-+How+to+Make+Great+Audio+Recordings+Witho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db7e4af1860ab2473455a8c6d25cd0aeafc4ed61","infoHashBuffer":{"type":"Buffer","data":[219,126,74,241,134,10,178,71,52,85,168,198,210,92,208,174,175,196,237,97]},"announce":[],"urlList":[]}}