{"title":"TPB-AFK","uid":8178888,"size":3749422455,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db8bac5321804cc92452ae44eaf2bfc0f869c0e6&amp;dn=TPB-AFK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"hypercenter666","files":1,"time":1361587068,"description":"TPB - AFK\n\n\nI have uploaded this torrent mainly as I had been seeding but accidentally deleted my seed and wasn't and believe in helping to continue the release of this film through my own channel which in itself, owes everything to The Pirate Bay.\n\nThe Pirate Bay is my fundamental source of spreading my art, a vital cog in our modern digital culture and a misunderstood extension of the digital generation. \n\nI am a writer, artist, philosopher and musician and I believe entirely in providing my art for free and should people choose, they can make donations to support the art but just as the art existed before they listened or read, it will continue long after, for this reason, especially as a writer, to withhold a story for the sake of ownership or profiteering is simply absurd. Our culture, our society or world was born on story telling.\n\nAll we know of ourselves, of our world and the extension of our conscious and subconscious selves is based on information. This information should not be tagged and shelved. This information belongs to the collective conscious.\n\nAs an artist, I owe the fanbase I have now, those who follow my work, download my art and feed me their thanks, I owe it entirely to The Pirate Bay and more so, to the curiosity of downloaders and Buccaneers of whom are entirely misunderstood by the current generation of industrialists, artists and seasoned moralists. \n\nThe nature of communication is changing. We have left the age of oil and are entrenched now, discovering ourselves in the age of information; an age where age does not command respect, where one is respected on effort and not age, for all things age without effort. Where there is no ownership to thought, outside of communal participation. An idea is not bound or limited by patent or ownership, it is more important than the person who profits from its existence that like a child, it can continue to grow through its influence in community, outside of its familiar peculiararities. \n\nOur history is born on taking stories and re--telling them in our own tongues, with our own voices and with our children's names as the heroes or the villains. This is the nature of our culture as humans. To ensure the survival of culture we must allow the stories to be re-told. We must allow the teller to tell it in their own voice and in their own unique accent. We must allow the information to pass from hand to hand so another hand might find a new life or a new extension to its base idea.\n\nLong Live The Pirate Bay. Long Live Free Art\n\nC. Sean McGee\n\n","torrent":{"xt":"urn:btih:db8bac5321804cc92452ae44eaf2bfc0f869c0e6","amp;dn":"TPB-AFK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db8bac5321804cc92452ae44eaf2bfc0f869c0e6","infoHashBuffer":{"type":"Buffer","data":[219,139,172,83,33,128,76,201,36,82,174,68,234,242,191,192,248,105,192,230]},"announce":[],"urlList":[]}}