{"title":"Neal Asher - War Factory (Transformation #2)","uid":14917650,"size":499502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc0653be96195b14992d3d78b489ee42fec9c64d&amp;dn=Neal+Asher+-+War+Factory+%28Transformation+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":1,"time":1465910717,"description":"Thorvald Spear, resurrected from his death over 100 years earlier, continues to hunt Penny Royal, the rogue AI and dangerous war criminal on the run from Polity forces. Beyond the Graveyard, a lawless and deadly area in deep space, Spear follows the trail of several enemy Prador, the crab-like alien species with a violent history of conflict with humanity.\r\n\r\nSverl, a Prador genetically modified by Penny Royal and slowly becoming human, pursues Cvorn, a Prador harboring deep hatred for the Polity looking to use him and other hybrids to reignite the dormant war with mankind.\r\n\r\nBlite, captain of a bounty hunting ship, hands over two prisoners and valuable memplants from Penny Royal to the Brockle, a dangerous forensics entity under strict confinement on a Polity spaceship that quickly takes a keen interest in the corrupted AI and its unclear motives.\r\n\r\nPenny Royal meanwhile continues to pull all the strings in the background, keeping the Polity at bay and seizing control of an attack ship. It seeks Factory Station Room 101, a wartime manufacturing space station believed to be destroyed. What does it want with the factory? And will Spear find the rogue AI before it gets there?\r\n\r\nWar Factory, the second book in the Transformation trilogy, is signature space opera from Neal Asher: breakneck pacing, high-tech science, bizarre alien creatures, and gritty, dangerous far-future worlds","torrent":{"xt":"urn:btih:dc0653be96195b14992d3d78b489ee42fec9c64d","amp;dn":"Neal+Asher+-+War+Factory+%28Transformation+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0653be96195b14992d3d78b489ee42fec9c64d","infoHashBuffer":{"type":"Buffer","data":[220,6,83,190,150,25,91,20,153,45,61,120,180,137,238,66,254,201,198,77]},"announce":[],"urlList":[]}}