{"title":"Total Drama Series","uid":8878329,"size":19028364758,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dcacbb0ccd072192308492808c94bb6a9e8fc452&amp;dn=Total+Drama+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":9,"uploader":"kShields","files":98,"time":1378266506,"description":"Total Drama is a Canadian animated reality television series which lampoons the conventions commonly found in reality television. The show and its sequel seasons are collectively referred to as the Total Drama series. It premiered on the Canadian cable television specialty channel, Teletoon on July 8, 2007 and on the American cable television channel, Cartoon Network on June 5, 2008. All of the contestants have distinct personalities that serve as a main plot point with the characters consisting of the eponymous fictional reality series and the contestants therein. The style of this series is similar to that of Survivor, Fear Factor and The Amazing Race. The Total Drama series currently consists of four seasons that have aired in the past six years; the first season, Total Drama Island, the second season, Total Drama Action, the third season, Total Drama World Tour, and the fourth season, Total Drama: Revenge of the Island, while a fifth season, Total Drama All-Stars, is currently in production for a January 2014 air date and a sixth season called Total Drama: Pahkitew Island is planned for later that year. However, Tom McGillis, the creator of the series, expects Total Drama to make it past ten seasons well into the future.","torrent":{"xt":"urn:btih:dcacbb0ccd072192308492808c94bb6a9e8fc452","amp;dn":"Total+Drama+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcacbb0ccd072192308492808c94bb6a9e8fc452","infoHashBuffer":{"type":"Buffer","data":[220,172,187,12,205,7,33,146,48,132,146,128,140,148,187,106,158,143,196,82]},"announce":[],"urlList":[]}}