{"title":"Head first java script","uid":4483067,"size":53051957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcd99ae32f689b82ae4d6e329b656c15823a760f&amp;dn=Head+first+java+script&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"myriadmagus","files":3,"time":1225650040,"description":"Product Description\nSo you&amp;#039;re ready to make the leap from writing HTML and CSS web pages to creating dynamic web applications. You want to take your web skills to the next level. And you&amp;#039;re finally ready to add &quot;programmer&quot; to the resume. It sounds like you&amp;#039;re ready to learn the Web&amp;#039;s hottest programming language: JavaScript. Head First JavaScript is your ticket to going beyond copying and pasting the code from someone else&amp;#039;s web site, and writing your own interactive web pages.\n\nWith Head First JavaScript, you learn:\n\n    * The basics of programming, from variables to types to looping\n    * How the web browser runs your code, and how you can talk to the browser with your code\n    * Why you&amp;#039;ll never have to worry about casting, overloading, or polymorphism when you&amp;#039;re writing JavaScript code\n    * How to use the Document Object Model to change your web pages without making your users click buttons\n\nIf you&amp;#039;ve ever read a Head First book, you know what to expect -- a visually rich format designed for the way your brain works. Head First JavaScript is no exception. It starts where HTML and CSS leave off, and takes you through your first program into more complex programming concepts -- like working directly with the web browser&amp;#039;s object model and writing code that works on all modern browsers.\n\nDon&amp;#039;t be intimidated if you&amp;#039;ve never written a line of code before! In typical Head First style, Head First JavaScript doesn&amp;#039;t skip steps, and we&amp;#039;re not interested in having you cut and paste code. You&amp;#039;ll learn JavaScript, understand it, and have a blast along the way. So get ready... dynamic and exciting web pages are just pages away.\n\nAbout the Author\nMichael Morrison is a writer, developer, toy inventor, and author of a variety of books covering topics such as Java, Web scripting, game development, and mobile devices. Some of Michael&amp;#039;s notable writing projects include JavaScript Bible, 6th Edition (Wiley, 2006),Teach Yourself HTML and CSS in 24 Hours, 7th Edition (Sams Publishing, 2005), Beginning Mobile Phone Game Programming (Sams Publishing, 2004) and Java Unleashed (Sams Publishing, 1997). Michael is the intructor of several Web-based courses, including DigitalThink&amp;#039;s Introduction to Java 2 series, JavaBeans for Programmers series, and Win32 Programming series (www.digitalthink.com).\n\nIn addition to his primary profession as a writer and technical consultant, Michael is the founder of Stalefish Labs (www.stalefishlabs.com), an entertainment company specializing in games, toys, and interactive media. When not glued to his computer, skateboarding, playing hockey, or watching movies with his wife, Masheed, Michael enjoys hanging out by his koi pond.","torrent":{"xt":"urn:btih:dcd99ae32f689b82ae4d6e329b656c15823a760f","amp;dn":"Head+first+java+script","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd99ae32f689b82ae4d6e329b656c15823a760f","infoHashBuffer":{"type":"Buffer","data":[220,217,154,227,47,104,155,130,174,77,110,50,155,101,108,21,130,58,118,15]},"announce":[],"urlList":[]}}