{"title":"Thomas Jefferson's Qur'an (2013 - Retail epub and mobi)","uid":9056546,"size":8009935,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd7a2138e896b559c81d06683274138a0e704dd7&amp;dn=Thomas+Jefferson%27s+Qur%27an+%282013+-+Retail+epub+and+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Robin1966","files":5,"time":1381962285,"description":"Books : History : English\n\nThomas Jefferson's Qur'an: Islam and the Founders By Denise A. Spellberg, D. A. Spellberg\n2013 | 384 Pages | ISBN: 0307268225 | EPUB | 6 MB\n\n\n\nA fascinating new understanding of the birth of American religious freedom and of how Islam shaped the thinking of the Founding Fathers.\n\nIn 1765, eleven years before composing the Declaration of Independence, Thomas Jefferson bought a Qur'an. His interest in Islam did not belie his personal disdain for the faith, a sentiment then rampant among his Protestant contemporaries. But unlike most of them, by 1776 Jefferson could imagine Muslims as future citizens of his new country. In this original and illuminating book, Denise A. Spellberg reveals a little known but crucial dimension of the birth of American religious freedom, a drama in which Islam played a surprising role. She recounts how a handful of the Founders, Jefferson foremost, drew upon Enlightenment ideas about the toleration of Muslims--then deemed the ultimate outsiders in Western society--to fashion from what had been a purely speculative debate a practical foundation for governance in America. In this way, Muslims, who were not even known to exist in the colonies, became the imaginary outer limit for an unprecedented, uniquely American religious pluralism that would also encompass the actual despised minorities of Jews and Catholics. The rancorous public dispute concerning the inclusion of Muslims, for which principle Jefferson's political foes would vilify him to the end of his life, thus became decisive in the Founders' ultimate judgment not to establish a Protestant nation, as they might well have done. Their radical ideal is being tested to this day, as popular suspicions about Islam persist and Muslim citizens number in the millions.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:dd7a2138e896b559c81d06683274138a0e704dd7","amp;dn":"Thomas+Jefferson%27s+Qur%27an+%282013+-+Retail+epub+and+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd7a2138e896b559c81d06683274138a0e704dd7","infoHashBuffer":{"type":"Buffer","data":[221,122,33,56,232,150,181,89,200,29,6,104,50,116,19,138,14,112,77,215]},"announce":[],"urlList":[]}}