{"title":"Facing the Giants (DvDRip)","uid":3795919,"size":734296064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd84e9a9b04bf362db15230fa8f5e12aefcb3ba4&amp;dn=Facing+the+Giants+%28DvDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"stever_","files":1,"time":1188966807,"description":"From the award winning producers of FLYWHEEL, comes an action-packed drama about a Christian high school football coach who uses his undying faith to battle the giants of fear and failure. In six years of coaching, Grant Taylor has never led his Shiloh Eagles to a winning season. \n\nAfter learning that he and his wife Brooke face infertility, Grant discovers that a group of fathers are secretly organizing to have him dismissed as head coach. Devastated by his circumstances, he cries out to God in desperation. When Grant receives a message from an unexpected visitor, he searches for a stronger purpose for his football team. He dares to challenge his players to believe God for the impossible on and off the field. \n\nWhen faced with unbelievable odds, the Eagles must step up to their greatest test of strength and courage. What transpires is a dynamic story of the fight between faith and fear. Facing the Giants is a powerful experience for the whole family inspiring viewers to live with faith, hope, and love!","torrent":{"xt":"urn:btih:dd84e9a9b04bf362db15230fa8f5e12aefcb3ba4","amp;dn":"Facing+the+Giants+%28DvDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd84e9a9b04bf362db15230fa8f5e12aefcb3ba4","infoHashBuffer":{"type":"Buffer","data":[221,132,233,169,176,75,243,98,219,21,35,15,168,245,225,42,239,203,59,164]},"announce":[],"urlList":[]}}