{"title":"Aster 2.11 Multiseat - Multiuser on same pc","uid":14467582,"size":20982543,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:de54e3ef03cb855738567b53fadd0056ed4b09e4&amp;dn=Aster+2.11+Multiseat+-+Multiuser+on+same+pc+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Nikola9","files":1,"time":1461877638,"description":"Aster 2.11 Multiseat - Multiuser on same pc\r\nInclude crack and read me file for instruction.\r\n\r\nASTER is a multiseat software for Windows XP/7/8/10. ASTER does not use any thin clients and terminal stations, i.e. ASTER is analog of such multiseat programs, as MS MultiPoint, SoftXpand, Betwin, Userful, etc. ASTER is being successfully used not only for equipping of computer classes, libraries, offices and Internet cafes, but even for games and video!\r\n\r\nTo create an additional workplace, you just need to connect to system block an additional monitor, keyboard and mouse (and if it is needed - microphone, speaker, joystick or gamepad). Monitors may be connected by VGA/DVI/HDMI/DP cables. Other devices - by USB cables.\r\nForget about thin clients and terminals! ASTER is a program (and only a program!), which allows several users to work with one computer independently as if each of them had their own PC.\r\nASTER is a shared computer access software solution and does not use hardware thin clients or terminal stations.\r\nDue to availability of several shared computer software editions designed for a different number of workstations, ASTER is being successfully used not only for equipping of computer classes, libraries, accounting departments, offices and Internet cafes, but also for home use!\r\nThe program ensures stable operation with a standard set of office, accounting, and training software, graphic applications, and even net games.\r\nTo set up each workplace, you just need to connect another monitor, keyboard and an extra mouse to the available shared computer. After the installation and start-up process, ASTER will present a separate desktop on each monitor (dual screen) and users will be able to work with the computer as independently as if each of them had their own PC","torrent":{"xt":"urn:btih:de54e3ef03cb855738567b53fadd0056ed4b09e4","amp;dn":"Aster+2.11+Multiseat+-+Multiuser+on+same+pc+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de54e3ef03cb855738567b53fadd0056ed4b09e4","infoHashBuffer":{"type":"Buffer","data":[222,84,227,239,3,203,133,87,56,86,123,83,250,221,0,86,237,75,9,228]},"announce":[],"urlList":[]}}