{"title":"Il Processo - Franz Kafka - 1925 - ITA.epub","uid":15874832,"size":257392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de58b629dcf6047092d7e49870cd589910e30f37&amp;dn=Il+Processo+-+Franz+Kafka+-+1925+-+ITA.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nlsrvr","files":1,"time":1474488104,"description":"DA WIKIPEDIA:\r\n\r\nIl processo (Der Prozess) è un romanzo incompiuto di Franz Kafka, pubblicato per la prima volta nel 1925. Oggetto dell'opera è la passiva accettazione, da parte degli altri personaggi, dell’ineluttabilità di una giustizia che funziona come un fenomeno fisico, con sue logiche autoreferenziali e insondabili, contro cui a nulla servono la razionalità e la lucidità di Josef K., accusato, arrestato e processato per motivi misteriosi.\r\n\r\n\r\nTrama\r\nIl protagonista del romanzo, Josef K., è impiegato come procuratore presso un istituto bancario. Una mattina, due uomini a lui sconosciuti si presentano presso la sua abitazione, dichiarandolo in arresto, senza tuttavia porlo in stato di detenzione. K. scopre così di essere imputato in un processo. Pensando ad un errore, decide di intervenire con tempestività per risolvere quello che ritiene essere uno spiacevole (ma temporaneo) malinteso.\r\n\r\nBen presto, K. si rende conto che il processo intentato nei suoi confronti è effettivamente in corso. K. tenta inizialmente di affrontare la macchina processuale con la logica e il pragmatismo che gli derivano dal suo lavoro presso la banca. Tuttavia, tempi e modi di svolgimento del processo, né altri aspetti del suo funzionamento, vengono mai pienamente rivelati all'imputato, neppure durante le sue deposizioni al cospetto dei giudici. A K. non verrà mai comunicato il capo di imputazione che pende su di lui.\r\n\r\nAnche dietro consiglio di personale in servizio al tribunale, K. affida a un avvocato il mandato di difenderlo. Pur rassicurando K. in merito all'impegno profuso per il suo caso, l'avvocato pare tuttavia procedere con la medesima opacità che è propria del tribunale, mettendo in atto iniziative la cui efficacia K. non è in grado di valutare appieno. Dopo un breve periodo di riflessione, K. decide di rimuovere il mandato all'avvocato, a dispetto delle raccomandazioni dello stesso legale difensore.\r\n\r\nQuesta rinuncia alla difesa prelude all'epilogo della vicenda. Senza preavviso, Josef K. viene infatti prelevato da due agenti del tribunale e condotto in una cava, dove viene giustiziato con una coltellata. K. muore in conseguenza di una condanna inflittagli da un tribunale che non lo ha mai informato in merito alla natura delle accuse a suo carico, e che non gli ha mai fornito alcun riferimento per attuare una vera difesa","torrent":{"xt":"urn:btih:de58b629dcf6047092d7e49870cd589910e30f37","amp;dn":"Il+Processo+-+Franz+Kafka+-+1925+-+ITA.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de58b629dcf6047092d7e49870cd589910e30f37","infoHashBuffer":{"type":"Buffer","data":[222,88,182,41,220,246,4,112,146,215,228,152,112,205,88,153,16,227,15,55]},"announce":[],"urlList":[]}}