{"title":"Using Humor To Maximize Learning - Mary Kay Morrison.pdf","uid":9498074,"size":3161699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de71d647536b78a6e4b6e257674a392918f6acd3&amp;dn=Using+Humor+To+Maximize+Learning+-+Mary+Kay+Morrison.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1390157434,"description":"What is humor exactly? How do you use it to maximize learning? If it is so important, why is it rarely mentioned in teacher preparation without some clues for finding and using it? The purpose of this book is to affirm, sustain, and encourage educators in the practice of humor not only as a personal tool to optimize a healthy lifestyle, but to maximize the benefits of humor in education. These benefits include current research-based data on the use of humor to nurture creativity, to increase the capacity for memory retention, to support an optimal learning environment and to build safe communities that reflect the relational trust necessary for collaborative learning. An environment of fun is an indicator of a culture of trust. Each chapter of this book includes a study group format and powerful practice ideas for leaders. These tools can facilitate creative data analysis for educational leaders interested in understanding the relatively new field of positive psychology and how it can contribute to a joyful learning environment that promotes collaborative relationships.","torrent":{"xt":"urn:btih:de71d647536b78a6e4b6e257674a392918f6acd3","amp;dn":"Using+Humor+To+Maximize+Learning+-+Mary+Kay+Morrison.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de71d647536b78a6e4b6e257674a392918f6acd3","infoHashBuffer":{"type":"Buffer","data":[222,113,214,71,83,107,120,166,228,182,226,87,103,74,57,41,24,246,172,211]},"announce":[],"urlList":[]}}