{"title":"Kundalini yoga - Anna Brett - Solar power DVDRip-AVC","uid":8839737,"size":769399127,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dee4f62c60e3f4bbccab47f6850ca7025a39e76f&amp;dn=Kundalini+yoga+-+Anna+Brett+-+Solar+power+DVDRip-AVC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"acer47x","files":-1,"time":1377211830,"description":"Be flexible and free! Shine like the sun, energize, stretch, and transform your life! Experience an all-in-one Kundalini Yoga workout you will love for life! In addition to upper and lower body toning, Solar Power features techniques which target the all-important solar plexus, known as the Moving Center, for balance on all levels, energy, and the ability to open yourself to fulfillment and live in the rhythm and flow of life. Here is the best of the ancient and new: Kundalini Yoga's spiritual depth and knowledge of body and mind, with the newest innovations in body mechanics and effective fitness. From yoga newbie to expert, this is the yoga experience you've been waiting for! Workouts include, Energy &amp; Vitality, Awaken Your Senses, Solar Power Express, as well as the design your own workout Matrix Menu option, Pre-Sets, and Bonus Material. Kundalini Yoga is the perfect practice to help you live long, look amazing, seize the day and prosper! As in all the Ana &amp; Ravi DVD's, super inspiring music will enhance your workout.","torrent":{"xt":"urn:btih:dee4f62c60e3f4bbccab47f6850ca7025a39e76f","amp;dn":"Kundalini+yoga+-+Anna+Brett+-+Solar+power+DVDRip-AVC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee4f62c60e3f4bbccab47f6850ca7025a39e76f","infoHashBuffer":{"type":"Buffer","data":[222,228,246,44,96,227,244,187,204,171,71,246,133,12,167,2,90,57,231,111]},"announce":[],"urlList":[]}}