{"title":"Romance of the Three Kingdoms XI (ROTK 11) English Patched + PUK","uid":11573204,"size":1328179429,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:df000997263c887f23ec37f2ef29cf8d6cccf00a&amp;dn=Romance+of+the+Three+Kingdoms+XI+%28ROTK+11%29+English+Patched+%2B+PUK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"lemon07r","files":1,"time":1417050435,"description":" TL;DR\nSaw that there were no good ROTK 11 releases/torrent anywhere and was shocked, so I made my own after seeing some requests for it in my ROTK 12 torrent comments section. I repacked it very nicely, its uncut and lossless but a very small file size compared to the other releases and comes prepatched and precracked and fully up to date with PUK and a nice integrity check I have wanted to implement.\n\nCracked and running the latest version of ROTK 11 and PUK available using the most up to date, functional and optimal combination of english patches.\n\nGame is precracked and patched, and installer does a crc check for you. If you get a error at installation after the choose a directory screen, choose a different install directory and try to install from a different location (make sure it is on the same drive). Just a heads up installing into a directory other then the default one will break the shortcuts the installer creates so you will have to make your own sorry :S had some trouble with the variables for creating shortcuts, i kinda overlooked it in the test stages cause a lot of time and effort went into the integrity check I wanted to implement.\n\nEnjoy, also check out my rotk 12 english patched torrent if you haven't already.\n\n\nA heads up to the people who have my rotk 12 release I am also working on a patch/update for my ROTK 12 upload it will update it to the latest version and will have better english patches","torrent":{"xt":"urn:btih:df000997263c887f23ec37f2ef29cf8d6cccf00a","amp;dn":"Romance+of+the+Three+Kingdoms+XI+%28ROTK+11%29+English+Patched+%2B+PUK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df000997263c887f23ec37f2ef29cf8d6cccf00a","infoHashBuffer":{"type":"Buffer","data":[223,0,9,151,38,60,136,127,35,236,55,242,239,41,207,141,108,204,240,10]},"announce":[],"urlList":[]}}