{"title":"WipEout (1995) - WIN-ALL ","uid":8792289,"size":363826461,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:df195615c469af2765a48063487576ec9e098bc4&amp;dn=WipEout+%281995%29+-+WIN-ALL+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1375981339,"description":"Wipeout (stylized in promotional materials as wipE'out&quot;) is the first in a series of futuristic racing video games developed and published by Psygnosis. It was originally released in 1995 for Sony PlayStation and PCs running MS-DOS, and in 1996 for Sega Saturn. In 2007, it was re-released for download on the PlayStation Store, first for PlayStation Portable on 8 March, then made playable on PlayStation 3 months later.\nContents\n\nSet in the year 2052, players compete in the F3600 anti-gravity racing league, piloting one of a selection of craft in races on several different tracks. There are four different racing teams to choose from, and two ships for each team. Each ship with its own distinct characteristics of acceleration, top speed, mass, and turning radius. By piloting their craft over power-up pads found on the tracks, the player can pick up shields, turbo boosts, mines, shock waves, rockets, or missiles, which protect the player's craft or disrupt the competitors' craft.\n\nThere are seven race tracks in the game total, six of them located in futuristic versions of countries such as Canada and Japan, with a seventh, hidden track set on Mars.\nDevelopment and release\n\nWipeout was developed and published by Psygnosis, designed in part by The Designers Republic. Aimed at a fashionable, club-going, music-buying audience, The Designers Republic created art for the game's packaging, in-game branding, and other promotional materials. Music tracks were licensed from non-mainstream electronica acts to create an original soundtrack album to promote the game.\n\nThe game's vehicle designs were based on Matrix Marauders, a 3D grid-based strategy game whose concept was developed by Psygnosis employee Jim Bowers. Nick Burcombe, the game's future designer, was inspired to create a racing game using the same types of vehicles from his experience with Powerdrome, F-Zero and Super Mario Kart. The name &quot;Wipeout&quot; was given to the game during a pub conversation, and was inspired by the eponymous song. Designing the game's tracks proved to be difficult due to the lack of draw distance possible on the system. However, the player received completely random weapons, resembling Mario Kart in their capability to stall rather than destroy opponents.\n\nWipeout was first released alongside the PlayStation in Europe in September 1995. It was the first non-Japanese game for the console. Two months later in November 1995, it was released in the U.S. The game went to number one in the all format charts, with over 1.5 million units of the franchise having been sold to date throughout Europe and North America.[citation needed]\n\nLaunch activities for the game included installation of PlayStation consoles running Wipeout in popular night clubs, the release of an accompanying soundtrack music CD, and the sale of a range of Wipeout clubwear.\n\nThe Saturn version of the game, released in 1996, lacked some of the visual flair due to its difficult-to-utilize multi-processor configuration[citation needed]. Particle effects were dropped in favor of simple sprites for weapon graphics; however, it ran slightly faster than its PlayStation counterpart.[citation needed]\n\nIn 1996, an OEM edition of Wipeout was bundled with new Sony Vaio laptops and the ATI 3D Xpression+ series video cards released for use in desktop computers. This 3D accelerated edition using the ATI3DCIF API provided additional resolutions of 400Ã—300, 512Ã—384 and 640Ã—480 pixels as well as optional bilinear filtering. This version also made use of the 3D Rage's MPEG acceleration.\n\nIn 320Ã—240 resolution the ATI version is graphically similar to the DOS version. However, when bilinear filtering is activated in 640Ã—480, the ATI version demonstrates a considerable improvement in graphical appearance. Common PC systems in 1996 struggled to produce frame rates desirable for gameplay due to incapabilities of the ATI Rage IIc chipset in managing the task of powering Wipeouts 3d accelerated game engine. This can be observed in-game while using the Rage IIc and even the Pro series Cards on comparatively more modern PC systems that were produced in the early 2000s.\n\n\nThe game's electronica soundtrack was composed by Tim Wright under the alias CoLD SToRAGE. Additional songs by Leftfield, The Chemical Brothers, and Orbital were included in the PAL version of the PlayStation game, while the Saturn version included three songs by Rob Lord &amp; Mark Bandola.\n\n1.Extract anywhere.\n2.Press &quot;START THE GAME&quot; batch file.\n3.Play.\n\nCompatible with WIN-ALL","torrent":{"xt":"urn:btih:df195615c469af2765a48063487576ec9e098bc4","amp;dn":"WipEout+%281995%29+-+WIN-ALL+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df195615c469af2765a48063487576ec9e098bc4","infoHashBuffer":{"type":"Buffer","data":[223,25,86,21,196,105,175,39,101,164,128,99,72,117,118,236,158,9,139,196]},"announce":[],"urlList":[]}}