{"title":"History Classics Hero Ships 05of13 USS Constitution DVDRip x264 ","uid":8879158,"size":715909106,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df32a591d41fb9ec9eaf5045a010644064a8854c&amp;dn=History+Classics+Hero+Ships+05of13+USS+Constitution+DVDRip+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MVGroup","files":1,"time":1378284527,"description":"History Classics: Hero Ships\n\nWar Documentary hosted by Beau Billingslea, published by History Channel in 2008 - English narration\n\n\nInformation\n------------------------------\n\nHistory Classics: Hero Ships\nFor nearly a hundred years, these steel, grey-skinned battlewagons have fought off everything from Al Qaeda to dive-bombing Kamikazes. Some returned from the hell of war to become major tourist attractions for new generations. Others continue to patrol the world's trouble-spots in America's latest war.\nHistory Classics: Hero Ships profiles the complete combat history and evolving technology of a single American ship, often through multiple conflicts. These are the battleships, destroyers, aircraft carriers, submarines, and specialized ships that belong in the warship hall of fame. Archival footage and interviews are punctuated by all-access inspections of the ship's &quot;battle stations,&quot; conducted by young, active Navy sailors. The series lets us understand the role of each weapon and technology, the dramas that unfolded in different rooms during the heat of battle, and the unique traditions and stories of each vessel.\nDVD Release Date: November 15, 2011\n\n1)  Landing Ship Tanks \n&quot;Landing Ship Tanks&quot; weren't deemed noble enough even to have names. They were not thought of as warships even though they were always the first floating metal to touch fire-swept beaches from North Africa, to Sicily, to Normandy, and from the Philippines to Iwo Jima and Okinawa. The story of these ships is therefore one of an unsung hero, as it reveals not just the considerable war-long battle action of one ship, but exemplifies the collective saga of a design class that had absolutely no military precedent before the first keel was laid in June of 1942. We learn the dire necessity of these ships from crucial role in D-Day, how the date was postponed to allow for more to be constructed, and how precariously close they came to disaster with the tragic story of Exercise Tiger, the botched D-Day dress rehearsal that claimed the lives of hundreds of LST sailors and put the entire mission in jeopardy.\n\n2)  SS Jeremiah O Brien \nAs one of the masses of Liberties to participate in the D-Day invasion, where her life span was estimated to be no more than just a couple cross channel crossings, she has miraculously clung to life while others hit the scrap heap.\n\n3)  USS Samuel B Roberts \nThe FFG-58 launched in 1984, a mighty state-of-the art Oliver Hazard Perry Class frigate. Following the tradition of coolness and courage through disastrous battle damage she is ravaged by an enormous explosion in an enemy minefield in the Persian Gulf during the Desert Storm fighting. The crew fights a prolonged battle against severe flooding and raging fires to barely preserve the life of their ship. Today, this Sammy B operates off the coast of the US, where our cameras follow her and she combats homeland security threats.\n\n4)  USS Arizona \nAlthough the Arizona fought only minutes in the battle in which she died, her afterlife as a tragic symbol epitomizes American naval sacrifice and courage. Here we go back to the ship for a final reunion with the last of her survivors and witness the entombing of a deceased survivor on the ship (the Arizona is the only Naval ship that allows it's survivors to rest eternally below the water with their fallen comrades). As we tell her heroic story of fighting against insurmountable odds we also take witness to her heroic past highlights and recent discoveries.\n\n5)  USS Constitution \nOld Ironsides represents everything stirring about the United States Navy. It's fighting victories, its pioneering establishment of American international power, its traditions, its matchless seamanship, its indispensable role in the birth and defence of the United States itself. It is incredible that one of the six original frigates authorized for construction by the Navy Act of 1794, two years before there was a United States, is still afloat, still sailing under her own power, still commissioned, and still inspiring.\n\n6)  USS Enterprise \nIn all, there have been eight ships in the U.S. Navy that have carried the name Enterprise dating to the earliest days of the Continental Navy. That said, most significant in that lineage have been the last two, both are deemed important aircraft carriers of their time. Both have fought in wars and overcome adversity along the way.\n\n7)  USS Hornet \nOne of the most heroic ships of the Second World War, CV-8 has the distinction of serving as the flight deck for the incredible Doolittle Tokyo raid before being sunk by an enemy who tortured and executed the fliers of that raid. Her predecessor ship CV-12 goes on to see sixteen months in continuous battle action penetrating to within 40 miles of the Japanese home islands and set incredible records: Under air attack 59 separate times; Over 1,400 enemy planes destroyed by her planes, along with 1,200,000 tons of enemy shipping; Ten of her pilots reaching &quot;Ace In One Day&quot; status; Over 70 enemy planes shot down in one day; Over 255 shot down in one month; Thirty of her 42 Hellcat pilots becoming aces; Her torpedo planes destroying the super-battleship Yamato as it raced to menace the Okinawa beachhead; And, best revenge of all, her planes making the first strikes against Tokyo since the Doolittle raid launched by her illustrious ancestor. Action packed and emotional testimony.\n\n8)  USS Laffey \nThe only preserved Allen M. Sumner class destroyer preserved in her World War II configuration, the USS Laffey is also the only surviving destroyer of the period that saw action in both the Atlantic and Pacific Theatre. USS Laffey acted first as an escort for convoys to Great Britain, staying overseas in 1944 to prepare for the invasion of France.\n\n9)  USS Nautilus \nNautilus was the world's first true submarine. All vessels previously known as &quot;submarines&quot; were in fact only submersible craft. Nautilus' nuclear plant enabled the boat to remain submerged for weeks, even months.\n\n10)  USS New Jersey \nNew Jersey's sponsor was Mrs. Charles Edison, wife of the Governor of New Jersey and daughter-in-law of the famous inventor Thomas Edison. After commissioning on May 23, 1943, the ship went through shakedown training and then proceeded to the Pacific, where she was involved in a long list of operations throughout the remainder of World War II. A particular highlight was service as flagship for Commander Third Fleet, Admiral William &quot;Bull&quot; Halsey, during the Battle of Leyte Gulf in October 1944.\n\n11)  USS New York \nA unique blend of present and past; USS New York's predecessor, the battleship New York, was born in 1911 and was present to take the surrender of the German High Seas Fleet at Scapa Flo in 1918. At the end of the war she is slated a target ship for the great Bikini atom-bomb tests, but she shrugs off the damage that sent more modern ships to the bottom and is towed to Pearl Harbour. There she is studied for two years before finally being sunk in an epic eight hours of intense fire before slipping under. Returning once again to our latest New York, we watch the rebirth of a legend, filled with the dynamic shooting of the modern construction, crew and Navy.\n\n12)  USS Texas \nConsidered the most powerful warship afloat because of her ten 14&quot;/45 guns in five twin turrets, The USS Texas was commissioned in March of 1914 and proceeded almost immediately to Mexican waters where she joined the Special Service Squadron following the &quot;Vera Cruz Incident.&quot; She returned to Atlantic Fleet operations in the fall of 1914, after the Mexican crisis was resolved. In 1916 Texas became the first U.S. battleship to mount anti-aircraft guns and the first to control gunfire with directors and range-keepers, forerunners of today's computers. After the U.S. entered World War I, she spent 1917 training gun crews for merchant ships that were often attacked by gunfire from surfaced submarines. Texas joined the 6th Battle Squadron of the British Grand Fleet early in 1918, operating out of Scapa Flow and the Firth of Forth. Later in 1918 she guarded the German Fleet en route to its surrender anchorage and escorted President Wilson to peace talks in France.\n\n13)  USS Yorktown \nYorktown received 11 battle stars for her World War II service and was awarded the Presidential Unit Citation. She was also the star of an Academy Award winning documentary movie &quot;Fighting Lady&quot; in 1945. Though no formal credit was given her in the film, the majority of the footage used in the film was shot on her decks by Navy combat photographers. Yorktown and other Essex class carriers comprised the core of the U.S. post-war fleet. After her Korean War duty, Yorktown was modernized for anti-submarine warfare and was deployed to Vietnam. For her service off Vietnam she was awarded four battle stars. In 1968 the carrier recovered the crew of Apollo 8, the first manned flight to orbit the moon. Decommissioned in 1970, Yorktown became the centrepiece of the fleet of ships at Patriots Point in 1975.\n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1d55747a755d512e332d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2136 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 45mins\n * Framerate: 29fps\n * Number of Parts: 13\n * Part Size: 687 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1236227/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1236227/episodes&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:df32a591d41fb9ec9eaf5045a010644064a8854c","amp;dn":"History+Classics+Hero+Ships+05of13+USS+Constitution+DVDRip+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df32a591d41fb9ec9eaf5045a010644064a8854c","infoHashBuffer":{"type":"Buffer","data":[223,50,165,145,212,31,185,236,158,175,80,69,160,16,100,64,100,168,133,76]},"announce":[],"urlList":[]}}