{"title":"Harlan Coben - Jedyna Szansa [PL]","uid":14690516,"size":330756228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df84f94bf7f0401182bc6f7e0d647ba215c14039&amp;dn=Harlan+Coben+-+Jedyna+Szansa+%5BPL%5D+MP3%4064&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"everdarksoul","files":68,"time":1464194147,"description":"Audiobook PL - 66 części /   \r\nrozmiar: 315 MB / czas: 11:23:16\r\nczyta: Jacek Rozenek\r\n\r\nDoskonały thriller z 2003 roku, autorstwa jednego z Mistrzów gatunku - Harlana Cobena!\r\n\r\nDr Marc Seidman budzi się w szpitalu, podłączony do kroplówki i owinięty bandażami... Dwanaście dni wcześniej wiódł szczęśliwe życie - jako cieszący się uznaniem chirurg, żyjący na przedmieściach, wraz ze swoją piękną żoną i ukochaną córeczką.\r\nÓw pobyt w szpitalu został spowodowany przez anonimowego zabójcę jego żony. Nie dość, że z niewiadomych mu przyczyn omal sam nie postradał życia oraz stracił żonę - to również los jego córki jest w tym momoencie niewiadomy...\r\nJednak kiedy życie bez najbliższych wydaje się nie mieć sensu, Marc nagle zostaje wezwany przez swojego teścia. Przekazuje mu on list z żądaniem okupu - oraz dwa miliony dolarów, dzięki którym Marc ma odzyskać córkę.\r\n\r\nMarc nie postępuje zgodnie z żądaniami porywaczy - którzy zabraniają mu kontaktować się z policją i FBI - i gdy okup zostaje przekazany, Marc nie odzyskuje córki. Porywacze mówią jedynie, że zmarnował swą jedyną szansę, na jej odzyskanie...\r\nDodatkowo policja nabiera podejrzeń, że Marc sam może być zamieszany w śmierć swojej żony i porwanie córeczki, a cała sprawa jest sfingowana - że jest to spisek, dzięki któremu Marc chciał wyłudzić pieniądze od ojca swojej żony...\r\nOsiemnaście miesięcy później, teść Marca ponownie dostaje list z żądaniem okupu","torrent":{"xt":"urn:btih:df84f94bf7f0401182bc6f7e0d647ba215c14039","amp;dn":"Harlan+Coben+-+Jedyna+Szansa+%5BPL%5D+MP3%4064","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df84f94bf7f0401182bc6f7e0d647ba215c14039","infoHashBuffer":{"type":"Buffer","data":[223,132,249,75,247,240,64,17,130,188,111,126,13,100,123,162,21,193,64,57]},"announce":[],"urlList":[]}}