{"title":"The Fire in Fiction - Donald Maass","uid":11738166,"size":2845656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e00c2dfd00ac02985ac613b668a2341f69388506&amp;dn=The+Fire+in+Fiction+-+Donald+Maass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":1,"time":1425636174,"description":"Discover the Difference Between a So-So Manuscript and a Novel Readers Can't Forget\n\nWe've all read them: novels by our favorite authors that disappoint. Uninspired and lifeless, we wonder what happened. Was the author in a hurry? Did she have a bad year? Has he lost interest altogether?\n\nSomething similar is true of a great many unpublished manuscripts. They are okay stories that never take flight. They don't grip the imagination, let alone the heart. They merit only a shrug and a polite dismissal by agents and editors.\n\nIt doesn't have to be that way. In The Fire in Fiction, successful literary agent and author Donald Maass shows you not only how to infuse your story with deep conviction and fiery passion, but how to do it over and over again. The book features:\n\nTechniques for capturing a special time and place, creating characters whose lives matter, nailing multiple-impact plot turns, making the supernatural real, infusing issues into fiction, and more.\nStory-enriching exercises at the end of every chapter to show you how to apply the practical tools just covered to your own work.\nRich examples drawn from contemporary novels as diverse as The Lake House, Water for Elephants, and Jennifer Government to illustrate how various techniques work in actual stories.\nPlus, Maass introduces an original technique that any novelist can use any time, in any scene, in any novel, even on the most uninspired day...to take the most powerful experiences from your personal life and turn those experiences directly into powerful fiction.\nTap into The Fire in Fiction, and supercharge your story with originality and spark!","torrent":{"xt":"urn:btih:e00c2dfd00ac02985ac613b668a2341f69388506","amp;dn":"The+Fire+in+Fiction+-+Donald+Maass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e00c2dfd00ac02985ac613b668a2341f69388506","infoHashBuffer":{"type":"Buffer","data":[224,12,45,253,0,172,2,152,90,198,19,182,104,162,52,31,105,56,133,6]},"announce":[],"urlList":[]}}