{"title":"Guacamelee.Super.Turbo.Championship.Edition-SKIDROW","uid":10858694,"size":916273280,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e08952d1825f8cfc7d6795064305676d98cf5903&amp;dn=Guacamelee.Super.Turbo.Championship.Edition-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Taker009","files":-1,"time":1408867956,"description":"S K I D R O W\nthe leading force \n\nproudly presents\nGuacamelee Super Turbo Championship Edition (c) DrinkBox Studios \n\n23-08-2014......Release Date &lt;-&gt; Protection.................Steam\nAction.............Game Type &lt;-&gt; Disk(s)....................1 DVD \n\nRELEASE NOTES \n\nSTCE is a widely revamped version of the original Guacamelee!. Enjoy\nexploring two huge new levels, exploding into 'Intenso' power mode, and\nlaying egg bombs as a chicken. You'll need every bit of power to\ndispatch a vicious new class of Elite enemies, a host of updated and\nrebalanced challenges in Normal and Hard modes, and the scheming new\nboss, El Trio de la Muerte \n\nCarlos Calaca has kidnapped El Presidente's Daughter, and he plans to\nsacrifice her in order to merge the World of the Living with the World\nof the Dead \n\nJuan Aguacate, an agave farmer who stumbles upon a Legendary Luchador\nmask, must find the strength and courage to become the Hero he's always\ndreamed of being and put a stop to this \n\nGuacamelee! is a Metroidvania-style action-platformer set in a magical\nworld inspired by traditional Mexican culture and folklore. The game\nfeatures melee combat, parallel dimensions and same-screen co-op. The\noriginal Guacamelee! received wide critical acclaim and was a finalist\nfor both IndieCade and the Independent Games Festival's Excellence in\nVisual Art award \n\nFeatures: \n\nNon-Stop Fighting Action. An extensive move list, advanced combo\nengine, and anti-gravity grabs \n\nMulti-dimensional Platforming. Instantly swap between the Worlds of\nLiving and Dead to traverse impossible terrain \n\nCombat moves double as movement, uniting platforming and fighting in\na way never seen before \n\nDiverse, detailed world containing lively towns, dark forests, flowery\ncanals and fiery volcanoes \n\nDrop in/out 2-Player local co-operative play, featuring independent\ndimension swapping \n\nMultiple boss characters (each with unique back stories), wide range\nof foes, and elite-class enemies \n\nSpectacular player abilities: The Rooster Uppercut, Frog Slam, and\nIntenso turbo-combat mode \n\nColorful, vibrant costumes that change both player appearance and\nattributes \n\nSteam leaderboards, achievements and trading cards, support for\nmultiple save slots, persistent cross-save-game costume unlocks \n\nChickens. Lots and lots of chickens \n\nINSTALL NOTES \n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy! \n\nGREETINGS \n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:e08952d1825f8cfc7d6795064305676d98cf5903","amp;dn":"Guacamelee.Super.Turbo.Championship.Edition-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e08952d1825f8cfc7d6795064305676d98cf5903","infoHashBuffer":{"type":"Buffer","data":[224,137,82,209,130,95,140,252,125,103,149,6,67,5,103,109,152,207,89,3]},"announce":[],"urlList":[]}}