{"title":"Georges Bataille's Story Of The Eye.avi","uid":4637161,"size":732971008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e08e31ab2ea5e87a7ef76b6c495298b3870e176e&amp;dn=Georges+Bataille%5C%27s+Story+Of+The+Eye.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"enoeda","files":1,"time":1231594079,"description":"IMDB link: http://www.imdb.com/title/tt0379797/\n\nmany people would consider the writing of Georges Bataille pornographic. many people would consider the films of Richard Kern or even of Bertolucci to be pornographic. underground cinema always has pushed the envelope of our sensibilities and i think Story Of The Eye is no different. i think calling something porn has more to do with the way it is made than what exactly is being shown. pornography is cheaply produced for a buck. it is exploitative of its talent and its audience. this film is neither. the filmmaker is no hack, his imagery is subtle, symbolic, and often sublime. granted, subtlety is tossed out the window at times when penetration and bodily fluids take center stage, but those are jolts that intend to shock. i was shocked by this film, and i am so rarely shocked that it was actually refreshing. i've seen enough to not be shocked simply because the film is so explicit, but because it is so gorgeously photographed and interestingly designed AND so explicit. i highly recommend this for anyone interested in checking out a film that really goes there. \n\nThe quality is very good, though the movie has nothing to do with the original book written by GEORGES BATAILLE\n\nPLEASE SEED THIS ONE! It.s a quite rare movie...","torrent":{"xt":"urn:btih:e08e31ab2ea5e87a7ef76b6c495298b3870e176e","amp;dn":"Georges+Bataille%5C%27s+Story+Of+The+Eye.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e08e31ab2ea5e87a7ef76b6c495298b3870e176e","infoHashBuffer":{"type":"Buffer","data":[224,142,49,171,46,165,232,122,126,247,107,108,73,82,152,179,135,14,23,110]},"announce":[],"urlList":[]}}