{"title":"Chemtrail film: Don't Talk About the Weather (2008)","uid":4341233,"size":4165366673,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e15ff36e3f7c54ae6b94642bb186b67bf3fb6106&amp;dn=Chemtrail+film%3A+Don%5C%27t+Talk+About+the+Weather+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"3rdEyeDear","files":44,"time":1218609322,"description":"DON'T TALK ABOUT THE WEATHER (2008)\n\n(A film about chemtrails, and how they fit into the\npolitical context.)\n\nAfter receiving many offers of donations and requests from\npeople to buy the DVD of this film recently uploaded on\nyoutube, 3rdEyeDear has asked me to upload it here instead,\nas the unyielding principle is that the information must be\nfree - at all costs ;0)\n\nI personally think this is the most on-the-ball film I've\nseen - and that its message is VITAL.\n\nI can only seed a short while so if you benefit from it in\nany way, please seed as long as possible (I'll try to seed\nmore later), and make copies and pass them around, as well\nas the link to this torrent. This is the PAL DVD version,\nbut you can always convert it to suit your region.\nThis is the highest resolution version available, as some\nof the source material wasn't the best resolution to start\nwith, and it's 4 hours compressed. Thanks.\n\n***\n\nBlurb from DVD:\n\n&quot;Ever wondered why the sky is overcast nearly every day,\nwhy people are coughing and getting sick, and why\neverything on the news is suddenly a crisis? Don't Talk\nAbout the Weather chronicles a grass-roots investigation\ninto chemtrails, analyzing the different and contradictory\nofficial explanations, as well as uncovering official\ndocuments that prove chemtrails are not only real, but are\na WEAPONS SYSTEM. It also examines media involvement,\nincluding subliminals and counter-intelligence, and links\nthe subject to an all-encompassing political agenda. There\nshould be something new here for anyone who sticks with it,\nas each section takes a different perspective. Information\nis presented to provoke intelligent and peaceful debate.&quot;\n\nMade by:3rdEyeDear\n(Ill Eagle Films\nSkyline Productions\nRebel With a Cause Pictures)\n\n\n(A gestalt entity based in Cheshire, England.)\n\n\n***\n\nSOME OF THE COMMENTS FROM YOUTUBE:\n\n&quot;I think this has got to be one of the most exceptional\ndocumentaries I've seen ANYWHERE concerning chemtrails.&quot;\n\n&quot;Every one should pass this film to every one they know.&quot;\n\n&quot;This is the best video on chemtrails on you tube.&quot;\n\n&quot;Brilliant!&quot;\n\n&quot;What a fantastic film that exposes chemtrails and how they\nfit into the global NWO agenda... 5 stars... and thanks\nfor posting!&quot;\n\n&quot;Absolutely brilliant video. 500 Stars and Faved. Thank you\nfor putting this video on YT.&quot;\n\n&quot;Great work,thank you for the time and effort you have put\nin to make these films.&quot;\n\n&quot;Superb documentary.&quot;\n\n&quot;Thanks for posting this brilliant piece of work 3ED.&quot;\n\n&quot;Imagine if every person aware of whats going on made some\nsort creative impact like this. We can change what's\nhappening.&quot;\n\n***\n\nPlease SEEEEEEEEEED and pass to everyone you know. After all,\nchemtrails can only exist due to mass ignorance. Peace.\n\nBy M - torrent uploader for 3rdEyeDear's youtube channel. Check out their videos.\n","torrent":{"xt":"urn:btih:e15ff36e3f7c54ae6b94642bb186b67bf3fb6106","amp;dn":"Chemtrail+film%3A+Don%5C%27t+Talk+About+the+Weather+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e15ff36e3f7c54ae6b94642bb186b67bf3fb6106","infoHashBuffer":{"type":"Buffer","data":[225,95,243,110,63,124,84,174,107,148,100,43,177,134,182,123,243,251,97,6]},"announce":[],"urlList":[]}}