{"title":"Immunity to Change_ How to Overcome It and Unlock the Potential","uid":8823846,"size":18230539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1d26f336e4545f52e191f6a530f86df4d434bca&amp;dn=Immunity+to+Change_+How+to+Overcome+It+and+Unlock+the+Potential+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1376776754,"description":"A recent study showed that when doctors tell heart patients they will die if they don't change their habits, only one in seven will be able to follow through successfully. Desire and motivation aren't enough: even when it's literally a matter of life or death, the ability to change remains maddeningly elusive.\n\nGiven that the status quo is so potent, how can we change ourselves and our organizations?\n\nIn Immunity to Change, authors Robert Kegan and Lisa Lahey show how our individual beliefs--along with the collective mind-sets in our organizations--combine to create a natural but powerful immunity to change. By revealing how this mechanism holds us back, Kegan and Lahey give us the keys to unlock our potential and finally move forward. And by pinpointing and uprooting our own immunities to change, we can bring our organizations forward with us.\n\nThis persuasive and practical book, filled with hands-on diagnostics and compelling case studies, delivers the tools you need to overcome the forces of inertia and transform your life and your work.\n\n\n\nYou wanna change? You read that or at least have your shrink do that )))","torrent":{"xt":"urn:btih:e1d26f336e4545f52e191f6a530f86df4d434bca","amp;dn":"Immunity+to+Change_+How+to+Overcome+It+and+Unlock+the+Potential+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d26f336e4545f52e191f6a530f86df4d434bca","infoHashBuffer":{"type":"Buffer","data":[225,210,111,51,110,69,69,245,46,25,31,106,83,15,134,223,77,67,75,202]},"announce":[],"urlList":[]}}