{"title":"ollydbg","uid":5425408,"size":2335025,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1e28f6a12a38ef222422b79e5af011bc8345fd6&amp;dn=ollydbg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"heilascurtis","files":2,"time":1268237810,"description":"OllyDbg is a 32-bit assembler level analysing debugger for MicrosoftÂ® WindowsÂ®. Emphasis on binary code analysis makes it particularly useful in cases where source is unavailable. OllyDbg is a shareware, but you can download and use it for free. Special highlights are:\n\n    * Intuitive user interface, no cryptical commands\n    * Code analysis - traces registers, recognizes procedures, loops, API calls, switches, tables, constants and strings\n    * Directly loads and debugs DLLs\n    * Object file scanning - locates routines from object files and libraries\n    * Allows for user-defined labels, comments and function descriptions\n    * Understands debugging information in BorlandÂ® format\n    * Saves patches between sessions, writes them back to executable file and updates fixups\n    * Open architecture - many third-party plugins are available\n    * No installation - no trash in registry or system directories\n\n    * Debugs multithread applications\n    * Attaches to running programs\n    * Configurable disassembler, supports both MASM and IDEAL formats\n    * MMX, 3DNow! and SSE data types and instructions, including Athlon extensions\n    * Full UNICODE support\n    * Dynamically recognizes ASCII and UNICODE strings - also in Delphi format!\n    * Recognizes complex code constructs, like call to jump to procedure\n    * Decodes calls to more than 1900 standard API and 400 C functions\n    * Gives context-sensitive help on API functions from external help file\n    * Sets conditional, logging, memory and hardware breakpoints\n    * Traces program execution, logs arguments of known functions\n    * Shows fixups\n    * Dynamically traces stack frames\n    * Searches for imprecise commands and masked binary sequences\n    * Searches whole allocated memory\n    * Finds references to constant or address range\n    * Examines and modifies memory, sets breakpoints and pauses program on-the-fly\n    * Assembles commands into the shortest binary form\n    * Starts from the floppy disk\n              ","torrent":{"xt":"urn:btih:e1e28f6a12a38ef222422b79e5af011bc8345fd6","amp;dn":"ollydbg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1e28f6a12a38ef222422b79e5af011bc8345fd6","infoHashBuffer":{"type":"Buffer","data":[225,226,143,106,18,163,142,242,34,66,43,121,229,175,1,27,200,52,95,214]},"announce":[],"urlList":[]}}