{"title":"Glengarry Glen Ross (1992) 2GB HD DivX 720p (moviesbyrizzo)","uid":6490071,"size":2311022536,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e2c1cde86897aac1c6b03291310b2bb4832f0679&amp;dn=Glengarry+Glen+Ross+%281992%29+2GB+HD+DivX+720p+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1308848071,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0104348/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0104348/&lt;/a&gt;\n\nAs a follow-up to our posting yesterday of the great movie respecting the business\nof &quot;commissioned sales&quot; (Tin Men 1987) Starring Danny Devito and Richard Dreyfuss\nwe bring you this second major feat in what is equally the of the best of this \ngenre of moviemaking genius. \n\nHere is: Glengary Glen Ross (1992)\nThe work of Pullitzer Prize winning playwright Mr. David Mamet\n(see as well: The House of Games -1987 with Joe Mr. Mantegna and \nthe real nice Ms. Lindsay Crouse)\n\n720p DivX avi HD at 1280 X 552 video resolution with 2800k bitrate 256k audio\n\nMultisubs (optional SRT subtitles files) included - \nDutch, Swedish, French, French, English, Polish, Romanian, Bulgarian\nYou'll find more posted as they become available on the net I suggest.\nThe included English srt template file  could serve as a template if you\nwhich to make your own instant version into whatever other language as is\noffered by google translate facilty perhaps - and combined wth the great\nsubtitles editor program from nikse.dk of Denmark - great competence there\nindeed (and elsewhere in the EU)!\n\n\n\nBeing is commissioned sales is no way to live. Everyone should have a steady\nassured source of income with bonuses based on performance that are reasonable\nin order to make the model economical to sustain. Feast or famine is no way\nto exist and in fact it drives many to acts of desperation in all it is that they \nget involved in whether at work or relationships at home. \n\nThen of course there is the predatory mindset that teaches the derogation of the\nhuman spirit so as to spawn a devourer of sorts bent on feeding his own needs\nof ego gratification and monetary gain at the expense of good folk that they might \nend up preying on. Alec Baldwin's Character in speaking to a salesman under his \ncommand says &quot;you are nothing - as my watch costs more than your car&quot;. Many\nshallow superficial leadership types think this works and is a valid way to look\nat people. How sad. as a formidable former Sales Trainer (the best in fact!)and\nHuman Relations coach equally, I can tell you intuitively that this guy is out to\nlunch in the business of keeping his people rightly motivated. Fear itself never\nmotivates - it deters and it degenerates - but its never rational in comparison\nas an approach to making people perform when better tactics are vailable. As such\n&quot;the bottom of the list gets automatically fired every month&quot; is a stupid way to\nexist equally as some of the best do have an off month too now and then I can say\nfrom first hand experience of what I saw while in the Computer industry PC\nCorporate marketing sector in particular. (I earned my licence potentially to\nsell Real estate at the age of 19 - however didn't follow through back then despite\nan offer from a Commercial Real Estate firm who offered a draw against commissions\nto get me to leave my job as  manager of a Stereo store).\n\nThis movie is the best look at such issues and since the plot revolves around\nhigh-roller Real estate sales types, it certainly should be of interest to many\nmillions of people around the world caught up in the life of sales that often\nhas no real meaning to it when there is nothing there in the way of secure other\nthan last months sales as nothing means anything until you sell again. The movie \n&quot;death of a salesman&quot; similarly speaks to this illness that it breeds in feeling\nmainly exploited, exploitative and not truly a valued member of the community outside from being a commodity as it were.\n\nThere are many great people drawn to sales, and many get very rich at it.\nMore power to you! few are well motivated around the likes of the character\nin this movie of Kevin Spacey as his human warmth is suspect of being only \na gimmick as it were. As such, you should pick who you work with and work under\nwith care as all you do will be affected by it in all aspects of your life.\n\n\nJack lemmon gives us the clearest idea of a poor salesman in what is his\ncomplete lack of genuine care in his approach to customers as &quot;an easy enough\nmark everytime&quot;. This approach deserves to be a dismal failure and that is mainly \nwhat is the result as we see in the show.\n\nMaking men desperate drives them to desperate acts potentially and that is what\nwe see occurs when some of the men decide to resort to outright theft to bring\ndown their abusive employer and earn a better living elsewhere perhaps - as\nnaive as that is to think could occur after such a false start.\n\n\nThe most magnificent performance in this movie and the bulk of the kudos belong\nmost sincerely to Al Pacino's character. He is the most intelligent and humanly\nwarm and caring of the crew with intuition and wisdom second to none. He is the\nbest of men here as it were. That is clearly so despite a script that often doesnt\nseek to do justice top what are his real ideas views attitudes and feelings on \nmatters at hand being discussed. Then again the wicked always seek to win at the \nexpense of their betters and man hasnt yet overcome this fault of nature in a \nclear enough victory so as to change this truth forever more in what remains of \nhuman existence on this earth potentially.\n\nThere is a reference to the failings of multicultural bliss as Pacino\nrejects being given a lead bearing the name of &quot;Patel&quot; as he likens\nthe dealings to be closer to a &quot;probable cousin - or extended family\nmember&quot; to Kevin Spaxcey's character in the movie and this may be what\nSpacey wants to change the world to &quot;suit his own&quot; as it were.\n\n\nNo to belabour, Enjoy the show and please seed to everyone you know\nin this great profession of ours along the way!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n ","torrent":{"xt":"urn:btih:e2c1cde86897aac1c6b03291310b2bb4832f0679","amp;dn":"Glengarry+Glen+Ross+%281992%29+2GB+HD+DivX+720p+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2c1cde86897aac1c6b03291310b2bb4832f0679","infoHashBuffer":{"type":"Buffer","data":[226,193,205,232,104,151,170,193,198,176,50,145,49,11,43,180,131,47,6,121]},"announce":[],"urlList":[]}}