{"title":"Tom Petty &amp; The Heartbreakers - Hypnotic Eye (2014) [EAC-FLA","uid":10711283,"size":311376495,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2e8ddc31bc801de86c40cfcaea8074ab9f4673d&amp;dn=Tom+Petty+%26amp%3B+The+Heartbreakers+-+Hypnotic+Eye+%282014%29+%5BEAC-FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"pucholoco","files":-1,"time":1407356602,"description":"           Tom Petty &amp; The Heartbreakers - Hypnotic Eye (2014) [EAC-FLAC]\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 296 Mb \n                        Full Artwork @ 300 dpi (png) 131 Mb\n\n\n\nLooking back, it's clear the 2008 Mudcrutch reunion was pivotal for Tom Petty, helping him re-focus and re-dedicate himself to playing in a band. Like the original band, Mudcrutch Mach II didn't last long -- long enough to play a few shows and record a warm, gangly beast of an album -- but it reinvigorated Petty. Afterward, he reveled in the sound of how the Heartbreakers played, digging deep into his catalog to shake up his set lists, letting the group exercise some blues muscles on 2010's Mojo, a record that stood as the Heartbreakers' rowdiest record since the '70s but which is easily overshadowed by the trashy psychedelic pulse of 2014's Hypnotic Eye.\n\nTeeming with fuzz, overdriven organ, and hard four-four rhythms, all interrupted by the occasional blues workout or jazz shuffle, Hypnotic Eye comes across as a knowing splice of Petty's own XM radio show Buried Treasures and Little Steven Van Zandt's Sirius channel Underground Garage, a record that celebrates all the disreputable 45s created in garages so they could be played in garages. \n\nOccasionally, the band evoke memories of their own past -- &quot;Shadow People&quot; has guitar tones straight out of Shelter Records -- but they're largely dedicated to the sounds that provided them with their original inspirations. What prevents Hypnotic Eye from sliding into the arena of soft, desperate nostalgia is a combination of muscle and savvy, a combination that gives the album a strong infrastructure -- Petty strips his songs to the bone; they're so lean they feel as if they clock in at two minutes, even if they run twice that long -- and a sonic wallop. Much of that visceral thrill is due to co-producers Petty, guitarist Mike Campbell, and Ryan Ulyate accentuating the intuitive interplay in the Heartbreakers with sharp, striking slashes of color; this gives the record immediacy and complexity, which means there is enough aural activity that repeated plays do not dull the LP's initial bracing impact. Ultimately, Hypnotic Eye is a record about the pure joy of sound, a rush that doesn't lessen upon repetition -- a sentiment that's true of those old '60s garage rock singles and early Heartbreakers albums, and this is a surprisingly, satisfyingly vigorous record.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n01. American Dream Plan B\n02. Fault Lines\n03. Red River\n04. Full Grown Boy\n05. All You Can Carry\n06. Power Drunk\n07. Forgotten Man\n08. Sins Of My Youth\n09. U Get Me High\n10. Burnt Out Town\n11. Shadow People\n\n*2014 Reprise Records / WEA | 9362-49373-0\n\n\n\n\n\nEnjoy, SEED and SHARING... Thanks!\n\n\n\n","torrent":{"xt":"urn:btih:e2e8ddc31bc801de86c40cfcaea8074ab9f4673d","amp;dn":"Tom+Petty+%26amp%3B+The+Heartbreakers+-+Hypnotic+Eye+%282014%29+%5BEAC-FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e8ddc31bc801de86c40cfcaea8074ab9f4673d","infoHashBuffer":{"type":"Buffer","data":[226,232,221,195,27,200,1,222,134,196,12,252,174,168,7,74,185,244,103,61]},"announce":[],"urlList":[]}}