{"title":"Laboratory Management, Quality in Laboratory Diagnosis [StormRG]","uid":11375607,"size":1387741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3940678725f262938f06c9a7c48743fb8f3e3e5&amp;dn=Laboratory+Management%2C+Quality+in+Laboratory+Diagnosis+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":2,"time":1415144774,"description":"TITLE/EDITION Laboratory Management: Quality in Laboratory Diagnosis (Diagnostic Standards of Care) \nAuthor: Candis A. Kinkus (Author), Michael Laposata MD PhD (Series Editor)\nSeries: Diagnostic Standards of Care\nPaperback: 120 pages\nPublisher: Demos Medical Publishing; 1 edition (November 1, 2011)\nLanguage: English\nISBN-10: 1936287455\nISBN-13: 978-1936287451\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nLaboratory Management addresses common issues and errors seen in the laboratory management process. The goal is to enable the laboratory manager to avoid or correct such errors by both individual effort and a systems approach in the laboratory. The book addresses potential issues in accreditation and regulatory compliance, laboratory and patient safety, quality management, financial management, human resources management, specimen processing logistics, performance standards, selection and management of commercial laboratories and much more. Each of these can have an adverse impact on the laboratory performance if a management error occurs. Potential management errors are described and discussed in a clinical case-based learning format to effectively illustrate the conditions that contribute to these errors and enable the laboratory manager to recognize and avoid them in daily practice.\n\nLaboratory Management Features:\n\nDescriptions of potential errors in regulatory compliance, operational processes, and patient safety in the laboratory\nDescriptions of potential errors in financial, human, and test utilization management in the laboratory\nDescriptions of potential errors in selecting automation and information systems in the laboratory\nClinical case discussions provide &quot;real world&quot; illustrations of potential errors and how to anticipate and avoid them in practice","torrent":{"xt":"urn:btih:e3940678725f262938f06c9a7c48743fb8f3e3e5","amp;dn":"Laboratory+Management%2C+Quality+in+Laboratory+Diagnosis+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3940678725f262938f06c9a7c48743fb8f3e3e5","infoHashBuffer":{"type":"Buffer","data":[227,148,6,120,114,95,38,41,56,240,108,154,124,72,116,63,184,243,227,229]},"announce":[],"urlList":[]}}