{"title":"Perez Prado - King Of Mambo (1992)@flac","uid":5633586,"size":378933606,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e3a98f29c750ecf6783984d8371fd5fdc0373081&amp;dn=Perez+Prado+-+King+Of+Mambo+%281992%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"alekow1","files":32,"time":1276790360,"description":"\nUniversally known as the King of the Mambo, PÃƒÂ©rez Prado was the single most important musician involved in the hugely popular Latin dance craze. \nWhether he actually created the rhythm is somewhat disputed, but it's abundantly clear that Prado developed it into a bright, swinging style with massive appeal for dancers of all backgrounds and classes. \nPrado's mambo was filled with piercing high-register trumpets, undulating saxophone counterpoint, atmospheric organ (later on), and harmonic ideas borrowed from jazz. While his tight percussion arrangements allowed for little improvisation, they were dense and sharply focused, keeping the underlying syncopations easy for dancers to follow. \nPrado played the piano, but was often more in his element as the focal point of the audience's excitement; he leaped, kicked, danced, shouted, grunted, and exhorted his musicians with a dynamic stage presence that put many more sedate conductors and bandleaders to shame. \nWith this blueprint, Prado brought mambo all the way into the pop mainstream, inspiring countless imitators and scoring two number one singles on the pop charts (albeit in a smoother vein than the fare that first made his name) as the fad snowballed. \nHe was a star throughout most of the Western Hemisphere during the '50s, and even after his popularity waned in the United States, he remained a widely respected figure in many Latin countries, especially his adopted home of Mexico. Prado is often best remembered for his softer, more commercial work, which has an undeniable kitschiness that plays well with modern-day lounge-revival hipsters. \nUnfortunately, that has served to obscure his very real credentials in the realm of authentic, unadulterated Latin dance music, and to this day he remains somewhat underappreciated. (AMG)\n\n\n\n\n\n01. Ciliegi Rosa (Cherry Pink And Apple Blossom White)\n02. Mambo Jambo (Que Rico El Mambo)\n03. Patricia\n04. Mambo N. 5\n05. Maria Bonita\n06. Mambo N. 8\n07. Cu-cu-rru-cu-cu-paloma\n08. Isle Of Capri\n09. In A Little Spanish Town\n10. Adios Pampa Mia\n11. Moliendo Cafe\n12. Always In My Heart\n13. La Raspa\n14. Taboo\n15. Perfidia\n16. Quizas, Quizas, Quizas (Perhaps, Perhaps, Perhaps)\n17. Frenesi\n18. You Belong To My Heart\n19. Alma Llanera\n20. Aquello Ojos Verdes (Green Eyes)\n21. Rockambo Baby\n22. Ay Ay Ay\n23. Tico Tico\n24. Mama Yo Quiero\n25. Adios\n\n\n\nLabel: Sarabandas\nReleased: 1992\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:e3a98f29c750ecf6783984d8371fd5fdc0373081","amp;dn":"Perez+Prado+-+King+Of+Mambo+%281992%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3a98f29c750ecf6783984d8371fd5fdc0373081","infoHashBuffer":{"type":"Buffer","data":[227,169,143,41,199,80,236,246,120,57,132,216,55,31,213,253,192,55,48,129]},"announce":[],"urlList":[]}}