{"title":"True Crime Streets Of LA [NTSC] PS2","uid":5094422,"size":1836187516,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e3cc9128cbe83bc9fc44f25894d5f2bdb1d574eb&amp;dn=True+Crime+Streets+Of+LA+%5BNTSC%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Big_dude","files":-1,"time":1253433800,"description":"True Crime Streets Of LA for the Ps2\t                             Rel. 11/04/2003\n\n\nFormat:        DVD5 NTSC-USA\nLang:          English\nDiscs:         1\nImage:         ISO\nRated:         M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, Game was tested and works. \nTry 7zip its free google it, if don't have WinRar.\n\n\nNote: No PS2 backup disc/game or Copy will work unless your Ps2 console is modded \n      or if you use Swap Magic. \n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n        &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n        &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n       &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\nI know what your thinking to much info..But this is for the newcomers, &amp; the uninformed on how to succesfully play a ps2 backup game or copy.\n\nMe I have a modded ps2 with modbo 4.0 and it plays whatever I throw at it.\n\nThe only way any ps2 backup/copy will work is one of 3 methods - chipped ps2, fmcb using esr (+ patched disc with esr patcher), or swap magic. Nothing else will work period so If you've tried other methods follow my instructions here and you'll be fine. I would recommend a soft mod with fmcb or a sure fire way and less hassle\nis using a chipped ps2 it will directly boot the disc for you. \n\nHopes this helps for anyone new to the ps2 scene or has just dived into this.\n\n\nGame Description:\n\nTrue Crime: Streets of LA casts you as Nick Kang, a cop for the Los Angeles Police Department. Due to your extreme methods of policing and your ability to cause massive amounts of property damaged, you are suspended, only to be recruited by the EOD (Elite Operations Division), where your reckless attitude is a plus.\n\n240 square miles of Los Angeles has been accurately rendered for you to cause havoc in. As a cop, you must behave when doing your duty. The game has a good cop/bad cop system, that gives you points based on what you do. Beat up an innocent pedestrian or run over a criminal that's surrendered and your rating will go down. Eventually, you can lose stats you've built up. Arrest a surrendering criminal or frisk an innocent that's acting suspicious, and your rating will go up, enabling you to upgrade certain aspects.\n\nThere are two main modes of getting around; on foot or in car. You can hijack (or, in police terms, commedate) various cars. Sports cars, sedans, etc. are yours for the taking. Each has various handling and stats. Since you're a well trained cop, you're capable of firing your weapon while driving. In an open top vehicle, you can aim anywhere. The other method is walking. While walking, you may encounter the odd street crime or suspicious looking pedestrian, which will let you get good or bad points, depending.\n\nTrue Crime features a branching storyline with three different endings, depending on how good or bad you are. In missions where you're required to do something, failing does not mean repeating the mission. If you fail to tail someone to a hideout, you'll have a harder time finding that hideout in a later mission, whereas if you capture someone, your next mission will be easier.\n\nAside from gunplay, you're well trained in martial arts. You can pull off various punch and kicks, as well as combos. You can also grapple and possibly throw someone, ala a wrestling move.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBest to burn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media doesn't work.\n\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:e3cc9128cbe83bc9fc44f25894d5f2bdb1d574eb","amp;dn":"True+Crime+Streets+Of+LA+%5BNTSC%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3cc9128cbe83bc9fc44f25894d5f2bdb1d574eb","infoHashBuffer":{"type":"Buffer","data":[227,204,145,40,203,232,59,201,252,68,242,88,148,213,242,189,177,213,116,235]},"announce":[],"urlList":[]}}