{"title":"[DvdRip-Xvid-Ita-Mp3]Scusa ma ti chiamo amore[survivalofmisa]","uid":5069270,"size":1037527040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e417a9bd4e4b42ab13a7f3a0977c81d12807e324&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DScusa+ma+ti+chiamo+amore%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"mitimex","files":1,"time":1251253133,"description":"\n\n Niki (Michela Quattrociocche) e le sue amiche sono all'ultimo anno di scuola. Malgrado abbiano la maturitÃƒÂ  ne combinano ogni giorno di tutti i colori. Alex (Raoul Bova) ÃƒÂ¨ un &quot;ragazzo&quot; di quasi trentasette anni. E' stato lasciato da poco e senza un vero perchÃƒÂ© dalla sua fidanzata storica. Intorno a lui ruota un mondo complicato e divertente: i suoi genitori, le sorelle sposate con figli e poi i suoi tre amici Enrico (Luca Angeletti), Flavio (Ignazio Oliva) e Pietro (Francesco Apolloni) anche loro tutti giÃƒÂ  sposati ma ognuno con le proprie particolaritÃƒÂ . Enrico ÃƒÂ¨ geloso, Flavio metodico, Pietro invece ÃƒÂ¨ in fissa con tutte le donne del mondo. Alex ÃƒÂ¨ un pubblicitario ed ha delle grandi responsabilitÃƒÂ  all'interno della sua azienda. Ma ÃƒÂ¨ appena arrivato un giovane rampante che mette a repentaglio il suo lavoro. E tutto questo non sarebbe niente se quella mattina Alex non incontrasse Niki. O meglio, se i due non si scontrassero. Niki ÃƒÂ¨ una bella ragazza, ÃƒÂ¨ divertente, ÃƒÂ¨ intelligente, ÃƒÂ¨ allegra, ÃƒÂ¨ spiritosa. C'ÃƒÂ¨ solo un piccolo dettaglio. Ha diciassette anni. Vent'anni meno di Alex. E dopo l'incontro di quella mattina nulla sarÃƒÂ  come prima. Il mondo adulto si scontra con quello degli adolescenti. Ed ecco mamme e figlie in una discussione continua, papÃƒÂ  che sono ancora ragazzini e ragazzi giovanissimi che sono giÃƒÂ  troppo adulti. Alex nonostante i fatti ed il cuore dimostrino il contrario, nonostante Niki gli abbia fatto scoprire la gioia di amare, viene sopraffatto dalla paura delle convenzioni e del futuro, rivede all'improvviso Elena (Veronica Logan), la sua ex fidanzata, e lascia Niki. Ma un giorno scopre qualcosa che finalmente gli fa aprire gli occhi su tutto. Anche sul suo amore per Niki. CosÃƒÂ¬ finalmente tutto si ricompone in nome dell'amore e del coraggio di seguire il proprio cuore.\n","torrent":{"xt":"urn:btih:e417a9bd4e4b42ab13a7f3a0977c81d12807e324","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DScusa+ma+ti+chiamo+amore%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e417a9bd4e4b42ab13a7f3a0977c81d12807e324","infoHashBuffer":{"type":"Buffer","data":[228,23,169,189,78,75,66,171,19,167,243,160,151,124,129,209,40,7,227,36]},"announce":[],"urlList":[]}}