{"title":"Windows XP Pro SP3 LITE4 ESP X32 Desatendido","uid":6769645,"size":659423232,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e48040d2be225a33a76615f457a44631b693ed92&amp;dn=Windows+XP+Pro+SP3+LITE4+ESP+X32+Desatendido&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"webchella","files":1,"time":1319532778,"description":"Windows XP Pro SP3 LITE4 ESP X32 Desatendido \n\nCategoria: Progamas\nIdioma: EspaÃƒÂ±ol de EspaÃƒÂ±a\nCon actualizaciones hasta 03 de Octubre 2011\n\nInternet Explorer 8 Final\nÃ‚Â¡ Mozilla Firefox 7.0.1 Final NOVEDAD !\nÃ‚Â¡ Google Chrome 14.0.835.163 Final NOVEDAD !\nÃ‚Â¡ Win Rar 4.0.1 NOVEDAD !\nCodecs Xvid &amp; Divx\n.Net Framework 2.0 SP2\nCCleaner 3.11.1541\nNuevos Fondos\nSoluciÃƒÂ³n para el WGA incluida\n\n\nDescripciÃƒÂ³n y Datos TÃƒÂ©cnicos\n\nEste windows es la que microsoft a liberado a los suscriptores MSDN, tengan en cuenta\nque es un windows SP3 integrado, la iso es la misma que ofrece MS no se a modificado\nnada, a diferencia de los otros este windows no requiere activaciÃƒÂ³n\nya que incorpora la licencia por Volumen(vl).\n\n\nActualizaciones\n\nEstÃƒÂ¡n todas las actualizaciones que han salido desde que salio el SP3\nhasta dÃƒÂ­a de hoy 03 de Octubre del 2011.\n\nDesatendido\n\nTodo el proceso de instalaciÃƒÂ³n es totalmente desatendido, lo ÃƒÂºnico que he dejado son los\nÃƒÂºltimos pasos que incluye la creaciÃƒÂ³n de usuarios, ya que en versiones anteriores lo quite\ny los usuarios se quejaron por que querÃƒÂ­an crearse ellos los usuarios, y la cuenta de\nadministrador esta activa con contraseÃƒÂ±a en blanco.\n\nNuevos Fondos\n\nHe puesto por defecto el fondo que trae el Windows 7 y ademÃƒÂ¡s he aÃƒÂ±adido unos\nfondos nuevos mas de windows 7, por si a alguno le interesa. El fondo que viene por defecto\nse puede cambiar por el que uno quiera.\nSimplemente e hecho esto para darle un toque moderno.\n\nCosas que he quitado\n\nJuegos, Juegos en Internet, MaletÃƒÂ­n, Opciones de Accesibilidad, idiomas todos menos\n(Chino simplificado, Chino tradicional, Coreano, JaponÃƒÂ©s y EspaÃƒÂ±ol), Media Center,\nMovie Maker, MÃƒÂºsica de ejemplo,Tablec PC, Asistente de BÃƒÂºsquedas, Centro de Seguridad,\nTour, MSN Explorer, Net Meeting, Windows Messenger, Calidad del Servicio, Mensajero,\nRestaurar Sistema, Todos los teclados menos el Teclado espaÃƒÂ±ol,\nRegistro remoto, Telnet, Ayudante de MS, Painball y alguna que otra mas que no afectan\npara nada.\n\nLa lite va a la perfeccion, la e probado primero en una MV y despues en mi PC, y va de lujo,\nno falla nada, y funcionan todas las cosas necesarias.\n\nProgramas incluidos\n\nBueno yo no soy partidario de incluir programas en los SO que sube la gente, ya que cada\nuno instala los programas que quiere, pero los que yo e incluido son los programas que usa\nel 90% de la gente, he incluido las ÃƒÂºltimas versiones de los navegadores mÃƒÂ¡s usados:\nInternet Explorer 8.0, la recien salida versiÃƒÂ³n del Mozilla Firefox 7.0.1 asÃƒÂ­ como la ÃƒÂºltima versiÃƒÂ³n\ndel navegador Google Chrome 14.0.385163 TambiÃƒÂ©n e incluido la ÃƒÂºltima versiÃƒÂ³n del\nWin Rar 4.0, los codecs Xvid y Divx, tambien he incluido el .Net Framework 2.0 SP2,\ny por ÃƒÂºltimo el CCleaner que es una utilidad gratuita que limpia el sistema de archivos\nbasura y errores. Todos ellos con instalaciÃƒÂ³n desatendida y autoregistrados, es decir se\ninstalan durante la instalaciÃƒÂ³n del Windows y vienen parcheados, por lo que el usuario\nno se entera y cuando inicia por primera vez Windows ya estaran instalados.\nNo he querido incluir mas programas por que en los demÃƒÂ¡s programas hay mucha mas\nvariedad para elegir.\n\nTambien estÃƒÂ¡ solucionado el tema del WGA, en esta Lite no hay que copiar ningun archivo,\nsino que el parche se ejecuta de manera silenciosa durante la instalaciÃƒÂ³n.\n\n","torrent":{"xt":"urn:btih:e48040d2be225a33a76615f457a44631b693ed92","amp;dn":"Windows+XP+Pro+SP3+LITE4+ESP+X32+Desatendido","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e48040d2be225a33a76615f457a44631b693ed92","infoHashBuffer":{"type":"Buffer","data":[228,128,64,210,190,34,90,51,167,102,21,244,87,164,70,49,182,147,237,146]},"announce":[],"urlList":[]}}