{"title":"Electrical Equipment Handbook: Troubleshooting and Maintenance","uid":9204660,"size":6815744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4a46642fdf34a4ae1e70c3a04915beb27ba6cff&amp;dn=Electrical+Equipment+Handbook%3A+Troubleshooting+and+Maintenance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MucGar","files":-1,"time":1384663976,"description":"Book Details\n\nTitle: Electrical Equipment Handbook: Troubleshooting and Maintenance\n\n\nISBN: 9780071396035\n\nType: PDF \n\nPages: 496\n\n\nDuring the past twelve years, he taught certified courses in power generation, electrical and mechanical equipment, power plant engineering, and industrial instrumentation and modern control systems. In May 1996, he was awarded the first &quot;Excellence in Teaching&quot; award by the University of Toronto. Mr. Kiameh wrote the following books: Power Generation Handbook and Industrial Instrumentation and Modern Control Systems. He received his engineering degree from Dal-Tech (formerly, Technical University of Nova Scotia) &quot;with distinction&quot; and completed his graduate studies at the University of Ottawa. He performed research about power generation equipment with Atomic Energy of Canada Limited (AECL) at their Chalk River and Whiteshell Laboratories. He also worked in the power plants on Ontario Power Generation (formerly, Ontario Hydro) for over nineteen years where he was responsible for the operation and maintenance of different power plant systems.\nDescription: Details diagnostic testing and inspection methods for all industrial equipment, Covers advanced fault detection techniques, critical components, and common failure modes, Includes predictive and preventive maintenance and reliability testing for industrial equipment.","torrent":{"xt":"urn:btih:e4a46642fdf34a4ae1e70c3a04915beb27ba6cff","amp;dn":"Electrical+Equipment+Handbook%3A+Troubleshooting+and+Maintenance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a46642fdf34a4ae1e70c3a04915beb27ba6cff","infoHashBuffer":{"type":"Buffer","data":[228,164,102,66,253,243,74,74,225,231,12,58,4,145,91,235,39,186,108,255]},"announce":[],"urlList":[]}}