{"title":"Electrical Calculations v2.70.0.4","uid":10612205,"size":2965939,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e4f79227b8ece40a0e003f08f636445e131a13d5&amp;dn=Electrical+Calculations+v2.70.0.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"davidleonardi2001","files":3,"time":1406053770,"description":"Education Software : Electrical Calculations v2.70.0.4\n\nDeveloper\t: L M Photonics Ltd\nLicense/Price\t: $22.00 USD\nSize / OS\t: 2.8 MB / Windows All\nLast Updated\t: August 13th, 2007, 21:31 UTC\nTrial Limit\t: NAG &amp; 20 days trial\n\nDescription:\n\nMake calculations be a walk in the park and get accurate results with the help of this practical and intuitive software application\nWritten by Carmen Stavarache\n\nA well-organized electrical circuit is the backbone of any device or machine that uses electricity. If you are an electrical engineer or if you work in an electrical field, I am sure that you will find Electrical Calculations to be a very useful software in your daily activity.\n\nQuick and easy calculations and conversions\n\nElectrical Calculations provides a busbar calculator. So you will be able to easily calculate your busbar rating, dissipation and the voltage drop. The application also enables you to calculate the current ampacity, the voltage drop and to view the wire gauges.\n\nBy accessing the circuit option, you can easily calculate the parameters of a Delta to Star conversion or vice-versa (a Star to Delta conversion) using the decimal or the exponential notation and the resonant frequency of your inductance, capacitance and resistance (L C P).\n\nProvides valuable data to use in your projects\n\nElectrical Calculations offers you a list with the values of the most important constants. All you need to do is launch the Constants window and copy their value or their value and units of measurement into your documents.\n\nThe conversion features are very useful because they enable you to convert area units, energy units, length measurement units, mass units, power measurement units and so on.\n\nMultiple calculation methods\n\nWe can say that it is a complex calculator because you can use it to calculate the indicative current rating for a 3 phase motor or the initial current required for a certain motor. Also, you can view a chart that contains the stat current curves.\n\nMoreover, the application provides you 3 methods to calculate the power factor correction and also it helps you generate the engine and the alternator rating according to your values for the two motors.","torrent":{"xt":"urn:btih:e4f79227b8ece40a0e003f08f636445e131a13d5","amp;dn":"Electrical+Calculations+v2.70.0.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f79227b8ece40a0e003f08f636445e131a13d5","infoHashBuffer":{"type":"Buffer","data":[228,247,146,39,184,236,228,10,14,0,63,8,246,54,68,94,19,26,19,213]},"announce":[],"urlList":[]}}