{"title":"Vietnam - 2016 True PDF","uid":15539517,"size":18271887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4ff0b291e671ff027a483887ea6f02ce3960d7c&amp;dn=Vietnam+-+2016+True+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"shtihl22","files":1,"time":1470911376,"description":"**********Description***********\r\n\r\n\r\nEnglish | 68 pages | True PDF | 17 MB\r\n\r\nVietnam magazine presents the full &amp; true stories from Americaâ™s most controversial &amp; divisive war. Vietnam is the only magazine exclusively devoted to telling the full story of the Vietnam war, with gripping firsthand accounts and carefully researched articles by Vietnam war veterans of the conflict and top military historians.\r\n\r\nVietnam Magazine is a full-color history magazine published bi-monthly which covers the Vietnam War. It was founded in 1988 by the late Colonel Harry G. Summers, Jr. Colonel Summers served in the U.S. Army in both Korea and Vietnam, where he was twice wounded and decorated for valor. The current editor is David T. Zabecki, a major general in the U.S. Army Reserve and currently the Deputy Chief of Staff for Mobilization and Reserve Affairs for U.S. Army Europe.\r\n\r\nContributors to Vietnam include journalists, military historians, political analysts and the commanders and men who served. Many article's are first-person accounts of combat operations, including personal interviews with enlisted men and officers, and specs on units and weaponry.\r\n\r\nSome notable contributors to Vietnam include:\r\n\r\nMajor General Huynh Van Cao, commander of the Army of the Republic of Vietnam 7th Division\r\nColonel David H. Hackworth, Vietnam veteran and prominent military journalist\r\nGeneral Nguyen Duc Huy, commander of the NVA 351st Division\r\nSenator John McCain, retired U.S. Navy aviator and senator from Arizona\r\nOliver Stone, Vietnam veteran and director of Platoon and Born on the Fourth of July\r\nGeneral William Westmoreland, Commander U.S. Military Assistance Command, Vietnam\r\n\r\nVietnam is published in Leesburg, Virginia, by the Weider History Group, along with the publications America's Civil War and Civil War Times.\r\n\r\nVietnam has a number of recurring departments, including:\r\n\r\nPersonality - Study of an individual person in the Vietnam War\r\n\r\nArsenal - Profiles on the armament, artillery, armor and supplies used in the war\r\n\r\nFighting Forces - Study of an individual unit in the war\r\n\r\nPerspectives - First-hand accounts of experiences in the Vietnam War\r\n\r\n=======================================\r\n \nhttps://thepiratebay.org/user/shtihl22\r\n\r\n=======================================","torrent":{"xt":"urn:btih:e4ff0b291e671ff027a483887ea6f02ce3960d7c","amp;dn":"Vietnam+-+2016+True+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4ff0b291e671ff027a483887ea6f02ce3960d7c","infoHashBuffer":{"type":"Buffer","data":[228,255,11,41,30,103,31,240,39,164,131,136,126,166,240,44,227,150,13,124]},"announce":[],"urlList":[]}}