{"title":"God of Wonders (Christian Documentary)","uid":8813300,"size":733013465,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5b9d5b458696b05580ea7e535530a64f9838219&amp;dn=God+of+Wonders+%28Christian+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"IndianChristian","files":3,"time":1376513690,"description":"God of Wonders (Christian Documentary)\n\n\nA quality documentary without the evolutionary bias. Stunning nature footage, scientific insights and Scriptures combine to reveal the wonders of our Creator as observed throughout His creation.\n\nGod's wonders surround us. And these marvels reveal much about our Creator. Through creation we glimpse His power and wisdom, His majesty and care. Creation is speaking to those who will listen...\n\nJoin us on a remarkable journey of discovery as we explore the Creator's handiwork and what His creation reveals about His character. Survey the unimaginable size of the universe and ponder the vast energy present in all matter. Examine the elegant water molecule essential to all life and discover how God combines these molecules to form beautiful and symmetrical snow crystals. Learn about the incredible complexity of DNA and the miraculous workings of the tiny seed. From the design functionality of birds to the incredible transformation of butterflies, these and many other features of creation are highlighted in this visually stunning presentation.\n\nGod of Wonders is a breath-taking tour of God's creation wonders, visible and invisible, and the greatest wonder of all - His redeeming love!\n\n\nRuntime: 86 mins\nLanguage: English\nYear: 2011\nQuality: 9/10 \nFormat: avi format \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\t","torrent":{"xt":"urn:btih:e5b9d5b458696b05580ea7e535530a64f9838219","amp;dn":"God+of+Wonders+%28Christian+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b9d5b458696b05580ea7e535530a64f9838219","infoHashBuffer":{"type":"Buffer","data":[229,185,213,180,88,105,107,5,88,14,167,229,53,83,10,100,249,131,130,25]},"announce":[],"urlList":[]}}