{"title":"Discovery - Download The True Story of The Internet","uid":4692694,"size":2678095872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e5be201be700ab6924645c223c2ebf04b3fc35b8&amp;dn=Discovery+-+Download+The+True+Story+of+The+Internet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Itanium2","files":4,"time":1233448153,"description":"Download: The True Story of the Internet is about a revolution -- the technological, cultural, commercial and social revolution that has radically changed our lives.\n\nAnd for the first time on television, we hear how it happened from the men and women who made it possible.\n\nFrom the founders of eBay, Yahoo, Amazon, Netscape, Google and many others, we hear amazing stories of how, in ten short years, the Internet took over our lives. These extraordinary men and women tell us how they went from being geeky, computer obsessed nerds to being 21st-century visionaries in the time it takes most people to get their first promotion. And, how they made untold billions along the way.\n\nThe style of the story-telling is up close and personal. With first-hand testimony from the people that matter, we tell a story that has all the excitement of a thriller -- full of battles and back-stabbing, moments of genius and moments of sheer hilarity. You will never surf the net in the same way again.\n\nDownload is hosted by technology journalist John Heileman (above, right). He's an edgy, combative, hi-energy New Yorker who never takes anything at face value. He's also a personal friend of most of Silicon Valley's most important characters and he revels in craziness of it all. After all, this is a story in which 20-year-olds become overnight billionaires, create, destroy and re-create more wealth in ten years then human race has ever seen, and still struggle to get a date.","torrent":{"xt":"urn:btih:e5be201be700ab6924645c223c2ebf04b3fc35b8","amp;dn":"Discovery+-+Download+The+True+Story+of+The+Internet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5be201be700ab6924645c223c2ebf04b3fc35b8","infoHashBuffer":{"type":"Buffer","data":[229,190,32,27,231,0,171,105,36,100,92,34,60,46,191,4,179,252,53,184]},"announce":[],"urlList":[]}}