{"title":"Couture Culture - A Study in Modern Art and Fashion (Art Ebook).","uid":9998009,"size":11465591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5ea62601ebcae76aece004e8613c27b78f435e9&amp;dn=Couture+Culture+-+A+Study+in+Modern+Art+and+Fashion+%28Art+Ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1397944416,"description":"Nancy J. Troy - Couture Culture: A Study in Modern Art and Fashion\n2002 | ISBN: 0262201402 | PDF | 408 pages | 10 MB\n\n\nIn Couture Culture, Nancy Troy offers a new model of how art and fashion were linked in the early twentieth century. Focusing on a leader of the French fashion industry, Paul Poiret, Troy uncovers a logic of fashion based on the tension between originality and reproduction that bears directly on art historical issues of the period. This tension lies at the heart of haute couture, which, although designed for the wealthy, was also intended to be adapted for sale in department stores and other clothing outlets that catered to a broader consumer market. Troy examines the relationships between elite and popular culture, the professional theater and the fashion show, as well as the presumed polarity between Orientalist and classical sensibilities. She shows how Poiret and other designers patronized the arts and presented themselves as artists not only to sell their individual dresses to wealthy clients but also to promote the mass production of their designs. The contradictions she uncovers suggest surprising parallels with the readymades and fashion-related work of Marcel Duchamp, who explored the questions of originality and authenticity raised by couture culture during the 1910s and 1920s.\nIn contrast to dominant accounts of early twentieth-century art that have dismissed fashion as superficial, fleeting, and feminized, Troy's more nuanced approach reveals conceptual structures and marketing strategies shared by modern art and fashion in these years.","torrent":{"xt":"urn:btih:e5ea62601ebcae76aece004e8613c27b78f435e9","amp;dn":"Couture+Culture+-+A+Study+in+Modern+Art+and+Fashion+%28Art+Ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ea62601ebcae76aece004e8613c27b78f435e9","infoHashBuffer":{"type":"Buffer","data":[229,234,98,96,30,188,174,118,174,206,0,78,134,19,194,123,120,244,53,233]},"announce":[],"urlList":[]}}