{"title":"The Duke and the Stars - Astrology and Politics in Renaissance M","uid":8732378,"size":3000599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e64aa11ecd69a5c1d3b08b2984ec91be580f9825&amp;dn=The+Duke+and+the+Stars+-+Astrology+and+Politics+in+Renaissance+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"STBGD","files":-1,"time":1374628610,"description":"Monica Azzolini, &quot;The Duke and the Stars: Astrology and Politics in Renaissance Milan&quot; \n2013 | ISBN-10: 0674066634 | 360 pages | PDF | 3,8 MB\n\nThis study is the first to examine the important political role played by astrology in Italian court culture. Reconstructing the powerful dynamics existing between astrologers and their prospective or existing patrons, The Duke and the Stars illustrates how the &quot;predictive art&quot; of astrology was a critical source of information for Italian Renaissance rulers, particularly in times of crisis. Astrological &quot;intelligence&quot; was often treated as sensitive, and astrologers and astrologer-physicians were often trusted with intimate secrets and delicate tasks that required profound knowledge not only of astrology but also of the political and personal situation of their clients. Two types of astrological predictions, medical and political, were taken into the most serious consideration. Focusing on Milan, Monica Azzolini describes the various ways in which the Sforza dukes (and Italian rulers more broadly) used astrology as a political and dynastic tool, guiding them as they contracted alliances, made political decisions, waged war, planned weddings, and navigated health crises. The Duke and the Stars explores science and medicine as studied and practiced in fifteenth-century Italy, including how astrology was taught in relation to astronomy.","torrent":{"xt":"urn:btih:e64aa11ecd69a5c1d3b08b2984ec91be580f9825","amp;dn":"The+Duke+and+the+Stars+-+Astrology+and+Politics+in+Renaissance+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e64aa11ecd69a5c1d3b08b2984ec91be580f9825","infoHashBuffer":{"type":"Buffer","data":[230,74,161,30,205,105,165,193,211,176,139,41,132,236,145,190,88,15,152,37]},"announce":[],"urlList":[]}}