{"title":"Head First SQL: Your Brain on SQL -- A Learner's ","uid":4723246,"size":50206405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e65e1cd7d0bdd0fc6c633e0738af17e3b649568d&amp;dn=Head+First+SQL%3A+Your+Brain+on+SQL+--+A+Learner%5C%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VasiaZozulia","files":1,"time":1234623482,"description":"Is your data dragging you down? Are your tables all tangled up? Well we've got the tools to teach you just how to wrangle your databases into submission. Using the latest research in neurobiology, cognitive science, and learning theory to craft a multi-sensory SQL learning experience, Head First SQL has a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep. \nMaybe you've written some simple SQL queries to interact with databases. But now you want more, you want to really dig into those databases and work with your data. Head First SQL will show you the fundamentals of SQL and how to really take advantage of it. We'll take you on a journey through the language, from basic INSERT statements and SELECT queries to hardcore database manipulation with indices, joins, and transactions. We all know &quot;Data is Power&quot; - but we'll show you how to have &quot;Power over your Data&quot;. Expect to have fun, expect to learn, and expect to be querying, normalizing, and joining your data like a pro by the time you're finished reading!","torrent":{"xt":"urn:btih:e65e1cd7d0bdd0fc6c633e0738af17e3b649568d","amp;dn":"Head+First+SQL%3A+Your+Brain+on+SQL+--+A+Learner%5C%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65e1cd7d0bdd0fc6c633e0738af17e3b649568d","infoHashBuffer":{"type":"Buffer","data":[230,94,28,215,208,189,208,252,108,99,62,7,56,175,23,227,182,73,86,141]},"announce":[],"urlList":[]}}