{"title":"Pentangle - S/T 1968 &amp; Basket Of Light 1969 Remastered + Bonus T","uid":4656145,"size":746466004,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e69ccc5906d47df455050af3fe8ea8654ed83e96&amp;dn=Pentangle+-+S%2FT+1968+%26+Basket+Of+Light+1969+Remastered+%2B+Bonus+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"mkraemer55","files":51,"time":1232209946,"description":"Pentangle - S/T 1968 &amp; Basket Of Light 1969 Remastered + Bonus Tracks + HR art EAC FLAC\nListening again to these early Pentangle CDs has been so enjoyable. The remastered versions are amazing. This is their first &amp; third releases. Both of these had four section fold-out covers. I also broke them into two sections to make it easier to read. Up next is the 2CD version of Sweet Child followed by Cruel Sister &amp; Reflections.\n\n\nPentangle - Pentangle 1968\n\nTrack List:\n01. Let No Man Steal Your Thyme\n02. Bells\n03. Hear My Call\n04. Pentangling\n05. Mirage\n06. Way Behind The Sun\n07. Burton Town\n08. Waltz\n09. Koan (Alternate Version)\n10. The Wheel (Alternate Version)\n11. The Casbah (Alternate Version)\n12. Burton Town (Edit 1,5,3)\n13. Hear My Call (Alternate Version)\n14. Way Behind The Sun (Alternate Version)\n15. Way Behind The Sun (Instrumental)\n\nPentangle - Basket Of Light  1969\n\nTracklist:\n01. Light Flight\n02. Once I Had A Sweetheart\n03. Springtime Promises\n04. Lyke-Wake Dirge\n05. Train Song\n06. Hunting Song\n07. Sally Go Round The Roses\n08. The Cuckoo\n09. House Carpenter\n10. Sally Go Round The Roses (alternate version)\n11. Sally Go Round The Roses (alternate version)\n12. Cold Mountain (b-side single)\n13. I Saw An Angle (b-side single)\n\nBiography by Richie Unterberger\nWere Pentangle a folk group, a folk-rock group, or something that resists classification? They could hardly be called a rock &amp; roll act; they didn't use electric instruments often, and were built around two virtuoso guitarists, Bert Jansch and John Renbourn, who were already well-established on the folk circuit before the group formed. Yet their hunger for eclectic experimentation fit into the milieu of late-'60s progressive rock and psychedelia well, and much of their audience came from the rock and pop worlds, rather than the folk crowd. With Jacqui McShee on vocals and a rhythm section of Danny Thompson (bass) and Terry Cox (drums), the group mastered a breathtaking repertoire that encompassed traditional ballads, blues, jazz, pop, and reworkings of rock oldies, often blending different genres in the same piece. Their prodigious individual talents perhaps ensured a brief lifespan, but at their peak they melded their distinct and immense skills to egg each other on to heights they couldn't have achieved on their own, in the manner of great rock combos likethe Beatles and Buffalo Springfield.\n\nWhen Pentangle formed around late 1966 or early 1967 (accounts vary), Jansch and Renbourn had already recorded one album together (Bert and John), and done some solo recordings as well. Jansch was more inclined toward blues and contemporary songwriting thanRenbourn, who was stronger in traditional British folk music. Jacqui McShee, whose bell-clear, high singing set the standard (along withSandy Denny) for female British folk-rock vocals, began rehearsing with the pair. After a false start with a forgotten rhythm section,Thompson and Cox -- who had been working with Alexis Korner -- were brought in to complete the quintet.\n\nPentangle's first three albums -- The Pentangle (1968), the double-LPSweet Child (1968), and Basket of Light (1969) -- are not only their best efforts, but arguably their only truly essential ones. With Shel Talmy acting as producer, the band rarely took a misstep in its mastery of diverse styles and material. Thompson and Cox gave even the traditional folk ballads a jazz swing and verve; the guitar interplay of Jansch (who was also a capable singer) and Renbournwas downright thrilling, each complementing and enhancing the other without showing off or getting in each other's way. McShee's beautiful vocals, though not as emotionally resonant as her close counterpart Sandy Denny, were an under-appreciated component to the band's success with the pop audience. \n\nAnd Pentangle were very popular for a time, at least in England, where Basket of Light made number five, and &quot;Light Flight&quot; was a small hit single. They introduced some electric guitars on their early-'70s albums, which generally suffered from weaker material and a less unified group effort. The original lineup broke up in 1973;Jansch and Renbourn (who had never really abandoned their solo careers) continued to record often as soloists, and remained top attractions on the folk circuit. Thompson joined John Martyn for a while, and has remained active as a session musician, in addition to recording some work of his own for the Hannibal label. The original group reunited for the reasonably accomplished Open the Door album in the early '80s, and other versions of the group recorded and toured throughout the '80s and '90s, usually featuring McShee andJansch as the sole remaining original members. \n\n","torrent":{"xt":"urn:btih:e69ccc5906d47df455050af3fe8ea8654ed83e96","amp;dn":"Pentangle+-+S%2FT+1968+%26+Basket+Of+Light+1969+Remastered+%2B+Bonus+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69ccc5906d47df455050af3fe8ea8654ed83e96","infoHashBuffer":{"type":"Buffer","data":[230,156,204,89,6,212,125,244,85,5,10,243,254,142,168,101,78,216,62,150]},"announce":[],"urlList":[]}}