{"title":"Aligarh (2015) - DVD.Rip - 1 CD - X264.AAC.Esubs - [DDR]","uid":14418922,"size":732619835,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6a5700da58bd30ebc990a27929a888d8a3ea6a6&amp;dn=+Aligarh+%282015%29+-+DVD.Rip+-+1+CD+-+X264.AAC.Esubs+-+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"SaM","files":3,"time":1461522355,"description":"Presenting a DDR Exclusive\r\n\r\n\r\nAligarh (2016)\r\n(A film by Hansal Mehta)\r\n\r\nHindi - DVD Rip - 720x384 (16:9)- 699 MB - x.264.AAC-Esubs - 1 Hrs:59 Min\r\n \nhttp://extraimago.com/image/aReE \nhttp://extraimago.com/image/aRe1 \nhttp://extraimago.com/image/aRec \nhttp://extraimago.com/image/aRe7 \nhttp://extraimago.com/image/aRes \nhttp://extraimago.com/image/aRen \nhttp://extraimago.com/image/aRej \nhttp://extraimago.com/image/aReT \nhttp://extraimago.com/image/aReN\r\n\r\n Tech Specifications:\r\n \nhttp://extraimago.com/image/aRe2\r\n\r\nSynopsis:\r\nAligarh 2009. Following up on a report in a local newspaper, a Delhi based reporter Deepu (Rajkummar Rao), together with his photographer colleague, follows up on the case of Dr. Shriniwas Ramachandra Siras (Manoj Bajpayee), a professor at the prestigious Aligarh Muslim University, where he is a teacher of Marathi. Siras has just been humiliated and hounded out of his job as well as his humble quarters, because he is a homosexual.\r\n\r\nThanks to the efforts of Deepu, the case goes to the Delhi hight Court where Siras's lawyer (Ashish Vidyarthi) defends him on the grounds that his privacy has been violated. What happens to Siras is the story of Aligarh..\r\n\r\nComments:\r\nManoj Bajpayee won the Dadasaheb Phalke award following his performance in Aligarh and no wonder. I have rarely seen a more nuanced piece of acting. His Professor Siras is not strident. Nor is he a caricature. In fact, he derives his sympathy by being gentle, perhaps even a little bewildered! its a masterly performance. Equally impressive is Rajkummar Rao as the brash young reporter Eddie. He is the perfect counterfoil to the gentle laid back Manoj Bajpayee. Bringing up the threesome is Ashish Vidyarthi as the lawyer. He is brilliant with his thrusts and counter-thrusts.\r\n\r\nA taut screenplay and some fine editing keeps our interest and keeps the film from becoming maudlin. Overall Hansal Mehta has done it once more. In a subtle, understated film he has encouraged a debate and makes a plea for understanding about Gay people and their rights. It is one of the most compelling films I have seen in recent times.\r\n\r\nCan I find flaws? Of course! In an university setting where are the students and Siras's interaction wih them. In AMU where are the Muslims? The film actually is a little unreal in these matters. But that is a quibble. It is a fine film that will hold your attention and perhaps force you to rethink your own attitudes towards gay people.\r\n\r\nUploader's Notes:\r\nA very good quality DVD with some minor flaws. We have done a little bit of color correction some detail enhancing and some shadow-gaining to enhance the visual experience. Apart from this, we have tried not to interfere too much in order to maintain the integrity of the film and its storytelling.\r\n\r\n\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt5121000/","torrent":{"xt":"urn:btih:e6a5700da58bd30ebc990a27929a888d8a3ea6a6","amp;dn":"+Aligarh+%282015%29+-+DVD.Rip+-+1+CD+-+X264.AAC.Esubs+-+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a5700da58bd30ebc990a27929a888d8a3ea6a6","infoHashBuffer":{"type":"Buffer","data":[230,165,112,13,165,139,211,14,188,153,10,39,146,154,136,141,138,62,166,166]},"announce":[],"urlList":[]}}