{"title":"The Left Hand of God series by Paul Hoffman","uid":8840392,"size":3889208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6d2ebb5d4dc7644f42a38ced4ba7c4be68d65a5&amp;dn=The+Left+Hand+of+God+series+by+Paul+Hoffman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"420weedman","files":3,"time":1377227335,"description":"1. The Left Hand of God (June 2010): Paul Hoffman's novel of astonishing scope and imagination, featuring a darkly gifted teenage boy at the center of a brutal holy war, grabs the reader from its incredible opening lines and refuses to let go. The Left Hand of God is the first novel in an epic, ambitious trilogy that will prove irresistible to the readers who have turned the Inheritance Cycle, Twilight, and the His Dark Materials series into publishing phenomena. \n\nThe Left Hand of God is the story of sixteen-year-old Thomas Cale, who has grown up imprisoned at the Sanctuary of the Redeemers, a fortress run by a secretive sect of warrior monks in a distant, dystopian past. He is one of thousands of boys who train all day in hand-to-hand combat, in preparation for a holy war that only the High Priests know is now imminent. He has no reason to think he's special, no idea there's another world outside the compound's walls, and no hope for a life any different from the one he already knows.\n\nAnd then, Cale opens a door.\n\nWhat follows is a daring escape, an unlikely alliance, a desperate pursuit, a journey of incredible discovery, and an adventure the likes of which Cale could never possibly have imagined, culminating in Cale's astonishing realization that he alone has the power to save his world- or to destroy it.\n\n02. The Last Four Things (April 2011): The epic story of Thomas Cale - introduced so memorably in The Left Hand of God - continues as the Redeemers use his prodigious gifts to further their sacred goal: the extinction of humankind and the end of the world. \n\nTo the warrior-monks known as the Redeemers, who rule over massive armies of child slaves, &quot;the last four things&quot; represent the culmination of a faithful life. Death. Judgement. Heaven. Hell. The last four things represent eternal bliss - or endless destruction, permanent chaos, and infinite pain.\n\nPerhaps nowhere are the competing ideas of heaven and hell exhibited more clearly than in the dark and tormented soul of Thomas Cale. Betrayed by his beloved but still marked by a child's innocence, possessed of a remarkable aptitude for violence but capable of extreme tenderness, Cale will lead the Redeemers into a battle for nothing less than the fate of the human race. And though his broken heart foretells the bloody trail he will leave in pursuit of a personal peace he can never achieve, a glimmer of hope remains. The question even Cale can't answer: When it comes time to decide the fate of the world, to ensure the extermination of humankind or spare it, what will he choose? To express God's will on the edge of his sword, or to forgive his fellow man-and himself?\n\n&quot;A riveting tale of pursuit, derring-do, battles, and death...a rousing trilogy-opener...a sweeping tale of intrigue and warfare.&quot; --Booklist\n\n03. The Beating of His Wings (August 2013): Thomas Cale has been running from the truth. Since discovering that his brutal military training has been for one purpose - to destroy God's greatest mistake, mankind itself - Cale has been hunted by the very man who made him into the Angel of Death: Pope Redeemer Bosco. \n\nCale is a paradox: arrogant and innocent, generous and pitiless. Feared and revered by those created him, he has already used his breathtaking talent for destruction to bring down the most powerful civilisation in the world. But Thomas Cale is weak. His soul is dying. As his body is wracked with convulsions he knows that the final judgment will not wait for a sick boy. As the day of reckoning draws close, Cale's sense of vengeance leads him back to the Sanctuary - and to confront the person he hates most in the world. Finally Cale must recognise that he is the incarnation of God's rage and decide if he will stand against the Sanctuary of the Redeemers and use his unique skill of laying waste to all things. The fate of mankind rests on Cale's decision.\n\nThe Beating of his Wings is the final instalment in Paul Hoffman's epic Left Hand of God series. ","torrent":{"xt":"urn:btih:e6d2ebb5d4dc7644f42a38ced4ba7c4be68d65a5","amp;dn":"The+Left+Hand+of+God+series+by+Paul+Hoffman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6d2ebb5d4dc7644f42a38ced4ba7c4be68d65a5","infoHashBuffer":{"type":"Buffer","data":[230,210,235,181,212,220,118,68,244,42,56,206,212,186,124,75,230,141,101,165]},"announce":[],"urlList":[]}}