{"title":"Steve Jobs The Biography by Walter Isaacson ","uid":6768829,"size":719627493,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e7228f26417d416dca7c89114acc80b5711c9bb1&amp;dn=Steve+Jobs+The+Biography+by+Walter+Isaacson+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"captainelliotspencer","files":-1,"time":1319499819,"description":"Steve Jobs: The Biography - Walter Isaacson \n\nFrom the author of the best-selling biographies of Benjamin Franklin and Albert Einstein, this is the exclusive biography of Steve Jobs.\n\nBased on more than 40 interviews with Jobs conducted over two years - as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues - Walter Isaacson has written a riveting story of the roller-coaster life and searingly intense personality of a creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing.\n\nAt a time when America is seeking ways to sustain its innovative edge, and when societies around the world are trying to build digital-age economies, Jobs stands as the ultimate icon of inventiveness and applied imagination. He knew that the best way to create value in the 21st century was to connect creativity with technology. He built a company where leaps of the imagination were combined with remarkable feats of engineering.\n\nAlthough Jobs cooperated with this book, he asked for no control over what was written nor even the right to read it before it was published. He put nothing off-limits. He encouraged the people he knew to speak honestly. And Jobs speaks candidly, sometimes brutally so, about the people he worked with and competed against. His friends, foes, and colleagues provide an unvarnished view of the passions, perfectionism, obsessions, artistry, devilry, and compulsion for control that shaped his approach to business and the innovative products that resulted.\n\nDriven by demons, Jobs could drive those around him to fury and despair. Butt his personality and products were interrelated, just as Apple's hardware and software tended to be, as if part of an integrated system. His tale is instructive and cautionary, filled with lessons about innovation, character, leadership, and values.\n\nAbout the Author\nWalter Isaacson, the CEO of the Aspen Institute, has been chairman of CNN and the managing editor of Time magazine. He is the author of Benjamin Franklin: An American Life and of Kissinger: A Biography, and the coauthor of The Wise Men: Six Friends and the World They Made. He lives in Washington, D.C., with his wife and daughter.\n\nRead by Dylan Baker\n24:58 unb 64/44 mono\n\n-----------------------------------\nVisit us for this and more:\n &lt;a href=&quot;\nhttp://audiobookvault.ws&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://audiobookvault.ws&lt;/a&gt;\n-----------------------------------\n","torrent":{"xt":"urn:btih:e7228f26417d416dca7c89114acc80b5711c9bb1","amp;dn":"Steve+Jobs+The+Biography+by+Walter+Isaacson+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7228f26417d416dca7c89114acc80b5711c9bb1","infoHashBuffer":{"type":"Buffer","data":[231,34,143,38,65,125,65,109,202,124,137,17,74,204,128,181,113,28,155,177]},"announce":[],"urlList":[]}}