{"title":"[BarebackStudios / Clips4Sale] Corey Chase (Mother Quit Your Job","uid":13566986,"size":1543425299,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e72be74a5e87c7dcae105529b818fc00c7f1342f&amp;dn=%5BBarebackStudios+%2F+Clips4Sale%5D+Corey+Chase+%28Mother+Quit+Your+Job&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"ImgSnaps","files":1,"time":1455635757,"description":"[BarebackStudios / Clips4Sale] Corey Chase (Mother Quit Your Job) 720p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/GSM\r\n \nhttp://imgsnaps.com/image/GSg\r\n\r\nScene One: You work to much\r\n\r\nCory has been working 60 hour weeks at a high powered business for as long as her son can remember. She comes home from a long day at work. Dressed in her business suit Cory flops down on the couch and tells her son how she wishes she could leave work behind and have a normal life. The son starts to rub her shoulders relaxing her on the couch. His hands cup her breasts and she is shocked. After slapping his hands away he takes control of the situation pulling off her cloths and fucking her in her heels. He fucks her until she cums on his large cock. He tells her that she is going to Quit her Job and work for him.\r\n\r\nScene Two: New Business Suit\r\n\r\nThe next day and Cory is trying to forget about being fucked by her son. She takes a shower before getting dressed for work. Her son goes into the bathroom and replaces her clothes with lingerie. She walks out of the bathroom in a towel demanding that he give her back her clothes. The only way she gets those clothes back is if she puts on the lingerie first. Cory complies worried about being late for work. When dressed the son drops her to her knees and fucks her face. She tires to fight it but the son is in control. He throws her to the bed and fucks her hard. Then sitting on the edge of the bed he makes her suck his cock until he cums in her mouth. He tells her that she is going to Quit her Job today and that she has to wear the lingerie under her clothes as she does it.\r\n\r\nScene Three: Pie for dinner\r\n\r\nCory has done as her son commanded and Quit her Job. She is making dinner in the kitchen when her son asks her how it's going. He wonders if there will be pie for dessert. While she is cooking he gets to his knees and pulls down her panties. He licks her pussy and makes her moan with pleasure. Still bent over the counter he fucks her from behind, pounding her into the cabinets. He drops her down and fucks her on the kitchen floor. He cums, thrusting deep inside her. He likes cream pie for dessert\r\n\r\nScene Four: Going back\r\n\r\nCory is sneaking out of the house to go back to work when her son catches her. She did not really Quit her Job. He will have to teach her why to stay at home. He ties her hands behind her back and strips her of her clothes. He gropes her before making her suck his dick. She gags on his cock as he puts it down her throat. Then he bends her over and fucks her ass. She cries out against the hard fucking her ass is receiving. When he gets close to cumming he has her clean his cock and suck him off until he cums all over her face. Now she will be the mom he always wanted her to be","torrent":{"xt":"urn:btih:e72be74a5e87c7dcae105529b818fc00c7f1342f","amp;dn":"%5BBarebackStudios+%2F+Clips4Sale%5D+Corey+Chase+%28Mother+Quit+Your+Job","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e72be74a5e87c7dcae105529b818fc00c7f1342f","infoHashBuffer":{"type":"Buffer","data":[231,43,231,74,94,135,199,220,174,16,85,41,184,24,252,0,199,241,52,47]},"announce":[],"urlList":[]}}