{"title":"Unsolved Mysteries - Treasure and Ghosts  (Complete Series)","uid":6073777,"size":4681408558,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e730bfece92180e980d87d12591dd80cb4d52c62&amp;dn=Unsolved+Mysteries+-+Treasure+and+Ghosts++%28Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Lucy1948","files":2,"time":1293738893,"description":"TV : Documentary : DVD quality : English\n\nThis is the Treasures &amp; Ghosts disc that comes with the Ultimate Collection. It is 1 disc and includes the following stories.\n\nDutch Schultz Treasure- When gangster Dutch Schultz was gunned down, he had supposedly hidden away $7 million dollars in upstate New York. Where did it go?\nMarcos' BuddhaRoger Roxas, an amateur treasure hunter, claims that he found a 2000 pound solid gold Buddha and countless boxes of gold bars which Ferdinand Marcos later seized. A Swiss court later recognized Roxas' claim. Update-Pres. Ferdinand Marcos seized the Japanese war booty from Roger Roxas, an impoverished Filipino locksmith, and was ordered to give his family $460 million.\n\nLost Dutchman's Mine-Treasure hunters have searched for decades for the infamous &quot;Lost Dutchman&quot; mine in Arizona.\n\nNazi War Treasure-Towards the end of WWII, the Nazis allegedly smuggled millions of dollars in gold &amp; jewels out of a concentration camp in Germany. The treasure had been confiscated from victims of the infamous Dachau camp. Treasure hunter Dr. Edward Greger is convinced the $50 million treasure was buried on the shores of Lake Lunarzee in the Austrian Alps.\n\nPlummer's Booty-1863 Montana Sheriff Henry Plummer secretly moonlighted as the leader of notorious bandits called the &quot;Road Agent Gang.&quot; His dual life was later revealed and he was hung for his offenses. But the hidden location of nearly $6 million in gold still remains a mystery.\n\nGhost-Fighters-Ghosts of Julia and Abraham Staab haunt a New Mexico Hotel.\nHaunting on 37th Street-In January 1997, the Woods family began witnessing inexplicable occurrences in their 37th st. home. Mary, Ed and their two daughters have come to recognize four ghosts. Are these spirits connected to 1935 and 1974 neighborhood homicide?\n\nDirect Contact-What happens when we die? Is there a life beyond this one? Remarkably 4 out of 10 people say they've experienced some form of communication with the dead often through dreams, These &quot;visits&quot; are called &quot;direct contacts.&quot;\nMummy's Curse-Howard Carter, Lord Carnarvon and Lady Evelyn Herbert discovered a treasure of King Tutankhamun's most prized possessions, twenty deaths are attributed to the subsequent curse of the mummy.\n\nHaunted Mansion-in 1931, Bill Beatty died before completing his dream home replica of a 17th Century Normandy castle. Present day occupants believe Beatty still haunts the residence.","torrent":{"xt":"urn:btih:e730bfece92180e980d87d12591dd80cb4d52c62","amp;dn":"Unsolved+Mysteries+-+Treasure+and+Ghosts++%28Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e730bfece92180e980d87d12591dd80cb4d52c62","infoHashBuffer":{"type":"Buffer","data":[231,48,191,236,233,33,128,233,128,216,125,18,89,29,216,12,180,213,44,98]},"announce":[],"urlList":[]}}