{"title":"Carrier Block Load v4.15","uid":4678347,"size":94039631,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e75d025d4fcd0b6f523217fea4b23931311e076e&amp;dn=Carrier+Block+Load+v4.15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"wrd4spd","files":8,"time":1232980643,"description":"What is Block Load? \nCarrier's Block Load program is a powerful, fully featured HVAC load estimating program suitable for commercial buildings of any size.\n\nLoad Calculation Features \n\n1.  Uses ASHRAE procedures for Transfer Function cooling load calculations, design heating load calculations, solar radiation calculations. \n2.  Calculates room and zone loads 24 hours a day for design days in all 12 months. \n3.  Identifies peak room, zone, and coil loads. \n4.  Suitable for sizing systems involving central station air handlers, packaged rooftop units, self-contained units, split systems, DX fan coils, hydronic fan coils and water source heat pumps. \n5.  Sizing data is provided for central cooling and heating coils, preheat coils, fans, terminal reheat coils, CAV and VAV air terminals, fan coils and terminal heat pumps. \n6.  Analysis of ventilation requirements using procedure described in ASHRAE Standard 62-2001. \n7.  Provides a database of design weather data for over 700 cities worldwide. \n \nReport Features \n\n1.  Provides many well-formatted reports listing calculation results as well as input data. \n2.  Key system sizing report summarizes data needed for equipment selection on 1-2 pages. \n3.  Key ventilation report summarizes requirements for each zone in the system. \n4.  Additional reports provide zone and system component loads, hourly zone and system load profiles, detailed hourly psychrometric data and a graph of the psychrometric process. \n5.  Provides features for copy-and-paste from displayed reports into other documents. \n6.  Provides features for saving reports as files in RTF-, PDF- or HTML- format documents. \n7.  Advanced output reports available to help in the diagnosis of load results and system behavior. \n \nOther Program Features \n\n1.  Tree view in main window allows for easier program navigation and data viewing. \n2.  Choice of conventional input format or spreadsheet style input for building data. \n3.  Runs in English and SI Metric units. \n4.  Suitable for new construction and retrofit applications. \n5.  Provides a database of design weather data for over 700 cities worldwide. \n6.  Provides feature for archiving and retrieving project data. \n7.  Provides feature for converting Block Load v3.0 data into Block Load v4 data. \n8.  Provides a global search and replace feature for all building data. \n9.  Provides a feature to automatically change the orientation of the entire building. \n10. Program is network compatible... \n","torrent":{"xt":"urn:btih:e75d025d4fcd0b6f523217fea4b23931311e076e","amp;dn":"Carrier+Block+Load+v4.15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e75d025d4fcd0b6f523217fea4b23931311e076e","infoHashBuffer":{"type":"Buffer","data":[231,93,2,93,79,205,11,111,82,50,23,254,164,178,57,49,49,30,7,110]},"announce":[],"urlList":[]}}