{"title":"Code Complete 2nd Ed Microsoft Press epub PDF","uid":8406260,"size":12687722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7b4e5ad101ac71ded7a86c4bc7866ddbcbc4b54&amp;dn=Code+Complete+2nd+Ed+Microsoft+Press+epub+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"angelos2225","files":-1,"time":1366813907,"description":"For more than a decade, Steve McConnell, one of the premier authors and voices in the software community, has helped change the way developers write code--and produce better software. Now his classic book, CODE COMPLETE, has been fully updated and revised with best practices in the art and science of constructing software. Whether you're a new developer seeking a sound introduction to the practice of software development or a veteran exploring strategic new approaches to problem solving, you'll find a wealth of practical suggestions and methods for strengthening your skills. Topics include design, applying good techniques to construction, eliminating errors, planning, managing construction activities, and relating personal character to superior software. This new edition features fully updated information on programming techniques, including the emergence of Web-style programming, and integrated coverage of object-oriented design. You'll also find new code examples--both good and bad--in C++, Microsoft(r) Visual Basic(r), C#, and Java, though the focus is squarely on techniques and practices.\n\nI haven't thoroughly checked this PDF, but it seems like this PDF is not missing any images, and also an epub version is provided.\n\nEnjoy and seed!\nMicrosoft Press Code Complete, 2nd Edition, Jun 2004","torrent":{"xt":"urn:btih:e7b4e5ad101ac71ded7a86c4bc7866ddbcbc4b54","amp;dn":"Code+Complete+2nd+Ed+Microsoft+Press+epub+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b4e5ad101ac71ded7a86c4bc7866ddbcbc4b54","infoHashBuffer":{"type":"Buffer","data":[231,180,229,173,16,26,199,29,237,122,134,196,188,120,102,221,188,188,75,84]},"announce":[],"urlList":[]}}