{"title":"The Cutting Season by Attica Locke","uid":7702044,"size":4603699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e82417c4ba30e89f645f274095b76ec0c8bac0be&amp;dn=The+Cutting+Season+by+Attica+Locke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"azizex666","files":-1,"time":1349554103,"description":"The American South in the twenty-first century. A plantation owned for generations by a rich family. So much history. And a dead body.\n\nJust after dawn, Caren walks the grounds of Belle Vie, the historic plantation house in Louisiana that she has managed for four years. Today she sees nothing unusual, apart from some ground that has been dug up by the fence bordering the sugar can fields. Assuming an animal has been out after dark, she asks the gardener to tidy it up. Not long afterwards, he calls her to say it's something else. Something terrible. A dead body. At a distance, she missed her. The girl, the dirt and the blood. Now she has police on site, an investigation in progress, and a member of staff no one can track down. And Caren keeps uncovering things she will wish she didn't know. As she's drawn into the dead girl's story, she makes shattering discoveries about the future of Belle Vie, the secrets of its past, and sees, more clearly than ever, that Belle Vie, its beauty, is not to be trusted.\n\nA magnificent, sweeping story of the south, The Cutting Season brings history face-to-face with modern America, where Obama is president, but some things will never change. Attica Locke once again provides an unblinking commentary on politics, race, the law, family and love, all within a thriller every bit as gripping and tragic as her first novel, Black Water Rising.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n             **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                     &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e82417c4ba30e89f645f274095b76ec0c8bac0be","amp;dn":"The+Cutting+Season+by+Attica+Locke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82417c4ba30e89f645f274095b76ec0c8bac0be","infoHashBuffer":{"type":"Buffer","data":[232,36,23,196,186,48,232,159,100,95,39,64,149,183,110,192,200,186,192,190]},"announce":[],"urlList":[]}}