{"title":"Tangerine Dream - White Eagle (1982) [FLAC]","uid":11246606,"size":306623662,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8341c6e785887da461fa57c63e3e052bd2a96aa&amp;dn=Tangerine+Dream+-+White+Eagle+%281982%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":14,"time":1413748787,"description":" Review by Dave Connolly  [-]\n\nTangerine Dream experiments with an ever-widening lexicon of sound on White Eagle, though the arrangements tend to suffer for it. The album's principle work is &quot;Mojave Plan,&quot; a four-movement, 20-minute song that represents some of the darkest music they've recorded in a while. Perhaps it was Edgar Froese's fear of nuclear annihilation that fueled this bleak view of the future, but the piece's effectiveness is undermined by the decision to continually dabble with different sounds. Where earlier extended pieces tended to move the listener from point A to point B, &quot;Mojave Plan&quot; doesn't flow so much as fuse disjointed sections together. The remaining songs are more cohesive, though Christopher Franke's sequencer patterns, while initially intoxicating, remain static here. That's not a problem on the brief &quot;Midnight in Tula&quot;; four minutes of contagious dance music that turns corners as tight as a Polyrock tune is a welcome respite at this point in the album. &quot;Convention of the 24&quot; clocks in at under ten minutes, and is arguably the closest in effect to Tangram et al. The album closes on a pleasant note with &quot;White Eagle,&quot; a mesmerizing song that spins on a slightly off-kilter axis while delivering a lovely little melody in the bargain, in some ways suggesting a meeting of Tangerine Dream's sequencer-led journeys and Cluster's playful side. While it's ultimately an uneven work, White Eagle is clearly the sum of its parts, and readily identifiable as the work of Tangerine Dream. Perhaps Froese had relinquished too much of the music to Johannes Schmoelling, whose curiosity for new sounds often comes across as restlessness. Most likely, though, TD wanted to move its music into the modern age. People weren't as likely to sit in a lotus position for 40 minutes as they were in the '70s -- a point that Exit acknowledged. Conceptually, the band members fall back on familiar ways with White Eagle, but musically their minds are operating on a more contemporary level. It's not an ideal amalgam, suggesting the band was at a stylistic crossroads","torrent":{"xt":"urn:btih:e8341c6e785887da461fa57c63e3e052bd2a96aa","amp;dn":"Tangerine+Dream+-+White+Eagle+%281982%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8341c6e785887da461fa57c63e3e052bd2a96aa","infoHashBuffer":{"type":"Buffer","data":[232,52,28,110,120,88,135,218,70,31,165,124,99,227,224,82,189,42,150,170]},"announce":[],"urlList":[]}}