{"title":"Daniel Johnston - Beam me up! 2010","uid":7132973,"size":236561109,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e855cd581b91cab2a597c3dd71b2d3fb4b8ffeea&amp;dn=Daniel+Johnston+-+Beam+me+up%21+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"barber9","files":-1,"time":1332769124,"description":"Daniel Dale Johnston (born January 22, 1961) is an American singer, songwriter, musician, and artist. Johnston was the subject of the 2006 documentary The Devil and Daniel Johnston. He currently lives in Waller, Texas.\nJohnston has been diagnosed with manic depression and schizophrenia which has been a recurring problem throughout his life. (wikipedia)\n\n- - -\n\nSinger and songwriter Daniel Johnston built a cult following in Texas from his crudely recorded homemade cassette tapes. His songs are often informed by his daily struggle with bipolar disorder, which he now has under control, and themes of unrequited love.\n\nAfter growing up in West Virginia, Johnston moved to Austin, Texas to go to University. There his mental illness became problematic, but he found an outlet in music, despite not having good instruments or much technical ability to play them. He recorded tapes and gave them to friends, who passed them on to others so that gradually Johnston's reputation grew through word of mouth.\n\nIn 1990, after playing at a festival in Texas, Johnston suffered a manic episode while his pilot father was flying him home to West Virginia. Luckily they both escaped unharmed after Daniel's father crash-landed the plane, but the incident prompted Daniel to be committed to a mental institution. In the early 90s Johnston's reputation grew as alt rockers like Eddie Vedder, Sonic Youth and Kurt Cobain all revealed themselves to be fans. (amazon.com)\n\n- - -\n\nDaniel Johnston - Beam Me Up! 2010\n(Hazelwood)\n\n 1. Sarah Drove Around In Her Car\n 2. Syrup Of Tears\n 3. Must\n 4. True Love Will Find You In The End\n 5. Wicked World\n 6. Mask\n 7. Try To Love\n 8. Devil Town\n 9. Love Enchanted\n10. Walking the cow\n11. Last Song\n12. Beatles\n","torrent":{"xt":"urn:btih:e855cd581b91cab2a597c3dd71b2d3fb4b8ffeea","amp;dn":"Daniel+Johnston+-+Beam+me+up%21+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e855cd581b91cab2a597c3dd71b2d3fb4b8ffeea","infoHashBuffer":{"type":"Buffer","data":[232,85,205,88,27,145,202,178,165,151,195,221,113,178,211,251,75,143,254,234]},"announce":[],"urlList":[]}}