{"title":"Cambridge History of Japan Vol4: Early Modern Japan [Gumpynator]","uid":15519035,"size":15611829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8653ba4bfb0f5168402fdfb1614de693ae3d7d3&amp;dn=Cambridge+History+of+Japan+Vol4%3A+Early+Modern+Japan+%5BGumpynator%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"gumpyn8r","files":1,"time":1470724063,"description":"Cambridge History of Japan, Vol. 4: Early Modern Japan (PDF)\r\n\r\nThis is the fourth of six volumes designed to explore the history of Japan from prehistoric to modern times. Volume 4 roughly covers the years from 1550 to 1800, a short but surprisingly eventful period in Japanese history commonly referred to as Japan's Early Modern Age. At the start, much of the country was being pulled apart by local military lords engaged in a struggle for land and local hegemony. These daimyo succeeded in dividing Japan into nearly autonomous regional domains. Before the end of the seventeenth century, however, the daimyo in turn were subjected to a powerful unification movement led by three colorful figures, Nobunaga, Hideyoshi, and Ieyasu. It was under Tokugawa Ieyasu, the last of the unifiers, that Japan was brought together under a single powerful command vested in the office of shogun. The Tokugawa hegemony lasted until 1868 when it was brought down by the Meiji Restoration. This volume attempts to flesh out the historical tale with insights into the way that people lived and worked. It examines the relationship between peasant and local lord, and between the lord, as a unit of local government, and the emerging shogunate. It offers new insights into the evolution of indigenous thought and religion and it also deals with Japan's foreign relations, particularly the impact of the Christian missionary movement. Each of these themes is examined by thirteen distinguished Japanese and American scholars","torrent":{"xt":"urn:btih:e8653ba4bfb0f5168402fdfb1614de693ae3d7d3","amp;dn":"Cambridge+History+of+Japan+Vol4%3A+Early+Modern+Japan+%5BGumpynator%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8653ba4bfb0f5168402fdfb1614de693ae3d7d3","infoHashBuffer":{"type":"Buffer","data":[232,101,59,164,191,176,245,22,132,2,253,251,22,20,222,105,58,227,215,211]},"announce":[],"urlList":[]}}