{"title":"Josh Ritter...The Historical Conquests of Josh Ritter(2007)[FLAC","uid":6825428,"size":285070318,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e87014b0efddb653c5c7c7a6d569a6f63116bb84&amp;dn=Josh+Ritter...The+Historical+Conquests+of+Josh+Ritter%282007%29%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":18,"time":1321544949,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/dri900/i915/i91585js8yd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/dri900/i915/i91585js8yd.jpg&lt;/a&gt;\n\nThe Historical Conquests of Josh Ritter [2007]RCA Victor/Sony / BMG 712256\n\n\n1. To The Dogs Or Whoever\n2. Mind's Eye\n3. Right Moves\n4. The Temptation Of Adam\n5. Open Doors\n6. Rumors\n7. Edge Of The World\n8. Wait For Love\n9. Real Long Distance\n10. Next To The Last Romantic\n11. Moons\n12. Still Beating\n13. Empty Hearts\n14. Wait For Love (You Know You Will)\n\nThe Historical Conquests of Josh Ritter, despite its lofty title, does not come with a four-paneled foldout map with a bejeweled compass rose, nor does it feature the art of Roger Dean or the keyboard theatrics of Rick Wakeman. Instead, Ritter's fifth foray into full-length album land is loaded with walls of electric guitars, waves of brass, ebbing tides of strings, and enough colorful analogies both historical and biblical to ignite a thousand cigars and refill an equally impressive number of brandy snifters. Listeners looking for a sequel to 2006's beautiful, bittersweet, contemplative (and primarily acoustic) Animal Years will either need to board another train or realign their senses, as Ritter has made the rowdiest record of his career. On first listen, the Idaho-born singer/songwriter's Historical Conquests are a dense bunch, both lyrically and musically, but further spins reveal a carousel of folk-rock splendor that echoes everyone from Springsteen to Ron Sexsmith to Summerteeth-era Wilco. Opener &quot;To the Dogs or Whoever,&quot; with its motor-mouthed emissions of love cloaked in the mythology of Joan of Arc, rants and raves for a mere three minutes, but by the time he catches his breath on the last refrain of &quot;I thought I heard somebody calling in the dark,&quot; it's hard not to feel like you've spent the whole time in the &quot;belly of that whale&quot; with him. Things don't slow down from there, with the Spoon-inspired rocker &quot;Mind's Eye&quot; and the &quot;roll the credits&quot; crowd-pleaser &quot;Right Moves&quot; providing a one-two punch that makes the gorgeous &quot;Temptation of Adam,&quot; with its elegiac horn arrangement and apocalyptic backdrop, a welcome respite. It's diverse for sure, but the melodies are born of familiar glue. &quot;Heart Still Beating&quot; and &quot;Wait for Love&quot; will please fans of the last record and the Johnny Cash freight-train rumble of &quot;Next to the Last Romantic&quot; will light up even the most solemn heartland drive home, but they revel in the &quot;hummable&quot; Tin Pan Alley warmth of Hank Williams and early Tom Waits. Historical Conquests is above all a fun record. It's got all of the heartache, acute observation, and crushing truth that fans are used to, but it never preaches without a wink and, most importantly, sounds as good blisteringly loud as it does drifting out of a clock radio in the garage.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:e87014b0efddb653c5c7c7a6d569a6f63116bb84","amp;dn":"Josh+Ritter...The+Historical+Conquests+of+Josh+Ritter%282007%29%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e87014b0efddb653c5c7c7a6d569a6f63116bb84","infoHashBuffer":{"type":"Buffer","data":[232,112,20,176,239,221,182,83,197,199,199,166,213,105,166,246,49,22,187,132]},"announce":[],"urlList":[]}}