{"title":"Brain Building: Easy Games to Develop Your Problem Solving Skill","uid":6587621,"size":943305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e88c0b906a29954b3223b854539f4220b91a98cc&amp;dn=Brain+Building%3A+Easy+Games+to+Develop+Your+Problem+Solving+Skill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MANTESH","files":3,"time":1312676653,"description":"[img]http://pixhost.info/avaxhome/fc/6a/00196afc.jpeg[/img]\n\n\n[b][quote][color=Green]\n\n\nBrain Building: Easy Games to Develop Your Problem Solving Skills\n\n\n\nPrentice-Hall, Inc\nKarl Albrech\n1984  \nISBN: 0130810428, 0130810347\n90 Pages \nFile type: PDF \n921 KB\n\nWarning: The puzzles in this book will not torment,\ntease, or frustrate you!\n\nIn fact, these guided mental exercises have been created to\nenlighten rather than exasperate you. Brain Building will arm you with the\npractical thinking tactics that give you a sense of mastery over confusing\nsituations. How? By teaching you the seven critical mental processes that spell\nthe difference between &quot;scatterbrained&quot; and clear thinking.\nFirst, you're provided with a simple problem. Then you'll get to\nsee these mental techniques in action as you &quot;listen in&quot; on the thought\nprocesses of a logical thinker. You'll learn how to organize information\ninto a manageable structure and zero in on key facts that enable you to\nfind an answer-without hours of fretting. Finally, you'll get a chance to\npractice these logical principles by solving similar problems yourself\nYou don't have to be a genius to tackle problems effectively. If\nyou've ever felt overwhelmed by complex problems and wish you could\nthink more logically at these times, then this unique series of puzzles is fyou!\n\nDr. Karl Albrecht is it management consultant, seminar leader, professional\nspeaker, and prolific author. He has written five other Prentice-Hall\nbooks, including Brainpower: Learn to Improve Your Thinking Skills. Brainpower\nwas the basis for the best-selling training film of the same name,\nstarring John Houseman. Karl Albrecht teaches Brainpower seminars to\nexecutives and managers in business organizations.\n\n\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:e88c0b906a29954b3223b854539f4220b91a98cc","amp;dn":"Brain+Building%3A+Easy+Games+to+Develop+Your+Problem+Solving+Skill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88c0b906a29954b3223b854539f4220b91a98cc","infoHashBuffer":{"type":"Buffer","data":[232,140,11,144,106,41,149,75,50,35,184,84,83,159,66,32,185,26,152,204]},"announce":[],"urlList":[]}}