{"title":"Audiobook - STAR TREK The Eugenics Wars: The Rise and Fall of Kh","uid":8566775,"size":441306428,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e89a4d0ae7640c68eff1b5310291d7f5b5be2220&amp;dn=Audiobook+-+STAR+TREK+The+Eugenics+Wars%3A+The+Rise+and+Fall+of+Kh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jonhoyle","files":129,"time":1370998261,"description":"STAR TREK  The Eugenics Wars: The Rise and Fall of Khan Noonien Singh\n\nKhan Noonien Singh first appeared in Star Trek - the Original Series Episode 1:22 &quot;Space Seed&quot;, airing February 16, 1967.  In this episode, Khan is described as having been a dictator ruling a third of the world from 1992-1996, following the Eugenics Wars.  Khan and his fellow supermen escaped Earth by way of a sleeper ship, the SS Botany Bay in 1996.  In this episode, these events are portrayed as having taken place 200 years earlier (placing Star Trek in the late 22nd century).\n\nSince that time, the Star Trek chronology was revised, so that the Original Series takes place in the mid-23rd Century, and World War III takes place in the mid-21st.  Khan returns in the movie &quot;Star Trek II: The Wrath of Khan&quot;, and the most recent Star Trek reboot &quot;Star Trek Into Darkness&quot;. \n\nSo how does Khan now fit into this?  Author Greg Cox decides to offer his take on how to fit Khan in place.  Cox actually leaves Khan in the 1990's, but making the Eugenics Wars a secret struggle, and Khan being a power behind the known leaders.  Brilliantly including Gary Seven and Roberta Lincoln (from another Star Trek episode &quot;Assignment: Earth&quot; 2:26 March 29, 1968), we see Khan's rise to power in the 20th Century.\n\nVolume 1 covers the period of Khan's birth, childhood and early manhood (1970's and 1980's), and is read by Anthony Stewart Head.  Volume 2 picks up in 1990, carrying up through Khan's exile in 1996, and is read by Rene Auberjonois (the actor who played Odo on Star Trek: Deep Space Nine).","torrent":{"xt":"urn:btih:e89a4d0ae7640c68eff1b5310291d7f5b5be2220","amp;dn":"Audiobook+-+STAR+TREK+The+Eugenics+Wars%3A+The+Rise+and+Fall+of+Kh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e89a4d0ae7640c68eff1b5310291d7f5b5be2220","infoHashBuffer":{"type":"Buffer","data":[232,154,77,10,231,100,12,104,239,241,181,49,2,145,215,245,181,190,34,32]},"announce":[],"urlList":[]}}