{"title":"Salvador.Puig.Antic.2006.DVD-Rip.Xvid-AC3.spanish.","uid":4374202,"size":1467150336,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8ab48b2331c1e75154c224dab8f9994c512a0f8&amp;dn=Salvador.Puig.Antic.2006.DVD-Rip.Xvid-AC3.spanish.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"nahla","files":2,"time":1220319623,"description":"A principios de los aÃƒÂ±os setenta, el MIL, un grupo izquierdista formado por un puÃƒÂ±ado de militantes espaÃƒÂ±oles y franceses muy jÃƒÂ³venes, pone en jaque a la policÃƒÂ­a, al cometer varios atracos en CataluÃƒÂ±a con el objetivo de conseguir dinero para apoyar a los sectores mÃƒÂ¡s combativos del movimiento obrero. En un primer momento, el ÃƒÂ©xito de sus acciones espectaculares, provocadoras e irreverentes, proporciona a los jÃƒÂ³venes del MIL una sensaciÃƒÂ³n de invulnerabilidad que termina bruscamente en septiembre de 1973, cuando efectivos de la Brigada PolÃƒÂ­tico Social tienden una trampa a dos de sus militantes. En el transcurso de su detenciÃƒÂ³n se produce un confuso tiroteo en el que muere un joven inspector de policÃƒÂ­a. Salvador Puig Antich resulta gravemente herido y, tras pasar por el hospital, ingresa en la cÃƒÂ¡rcel Modelo de Barcelona, a la espera de un consejo de guerra. A partir de ese momento, tanto sus hermanas como sus abogados inician, ante la indiferencia general, una carrera contrarreloj para salvar la vida al joven activista. Pero el 20 de diciembre de 1973 se produce el atentado de ETA contra el presidente del Gobierno Franquista, el almirante Carrero Blanco, y Salvador Puig Antich se convertirÃƒÂ¡ en el chivo expiatorio que un sector del RÃƒÂ©gimen Franquista reclama. El Consejo de Guerra contra Puig Antich es una farsa y el joven Salvador es condenado a muerte. Todos los intentos por salvarlo, incluso una improbable y rocambolesca fuga, resultarÃƒÂ¡n inÃƒÂºtiles y el 2 de marzo de 1974 Puig Antich es ejecutado mediante el &quot;garrote vil&quot;. Su muerte trÃƒÂ¡gica y cruel deja una gran huella, durante aÃƒÂ±os, a toda una generaciÃƒÂ³n que aÃƒÂºn se pregunta si pudo hacer algo mÃƒÂ¡s para evitar una ejecuciÃƒÂ³n tan terrible como inÃƒÂºtil.\n\n ","torrent":{"xt":"urn:btih:e8ab48b2331c1e75154c224dab8f9994c512a0f8","amp;dn":"Salvador.Puig.Antic.2006.DVD-Rip.Xvid-AC3.spanish.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ab48b2331c1e75154c224dab8f9994c512a0f8","infoHashBuffer":{"type":"Buffer","data":[232,171,72,178,51,28,30,117,21,76,34,77,171,143,153,148,197,18,160,248]},"announce":[],"urlList":[]}}