{"title":"Once.Upon.a.Time.S03E17.720p.HDTV.X264-DIMENSION","uid":9963037,"size":925750163,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e906616140640e3c31b8dfc3c16b29971660d3c7&amp;dn=Once.Upon.a.Time.S03E17.720p.HDTV.X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":1,"time":1397538983,"description":"[b]Once Upon a Time\n\n[IMG]http://i.imgur.com/QcndSAa.jpg[/IMG]\n\nGenre: Fantasy, Drama\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Adam Horowitz, Edward Kitsis\nCast: Ginnifer Goodwin, Jennifer Morrison, Robert Carlyle, Lana Parrilla, Jared Gilmore, Josh Dallas, Meghan Ory\n\n.: Plot :.\n&quot;Once Upon a Time&quot; revolves around Emma Swan (Jennifer Morrison), a 28-year-old bail bonds collector that has been supporting herself from when she was abandoned as a baby. Things change for her when her son Henry (Jared Gilmore), who she abandoned years ago and gave him up, finds her and tells that he needs her help. He tells that she is really from a different world where she is really Snow White's (Ginnifer Goodwin) missing daughter. He shows that in the fairytale books, Prince Charming (Josh Dallas)and Snow White sent her away to protect her. The Evil Queen (Lana Parrilla) cast a spell that trapped the fairytale world. Emma doesn't believe them and take Henry back to Storybrooke.\n\nOnce in the little town, she is strangely drawn to him and the town of Storybrooke. She is concerned and starts to see that Storybrooke is not what it seems. The longer she stays in the town, the more she suspects that the members of the town are not who they say they are. Even though the townmembers don't remember that they too were part of the fairytale, including Henry's foster mother who was once the Evil Queen, they slowly start to realize who they once were. The battle commences and if Emma wants to win, she is going to have to embrace who she once was and can be again. From the Creators of &quot;Lost&quot;, Edward Kitsis and Adam Horowitz have outdone themselves with a fairytale type story that comes in real life.[/b]","torrent":{"xt":"urn:btih:e906616140640e3c31b8dfc3c16b29971660d3c7","amp;dn":"Once.Upon.a.Time.S03E17.720p.HDTV.X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e906616140640e3c31b8dfc3c16b29971660d3c7","infoHashBuffer":{"type":"Buffer","data":[233,6,97,97,64,100,14,60,49,184,223,195,193,107,41,151,22,96,211,199]},"announce":[],"urlList":[]}}