{"title":"Bob Brozman and Debashish Bhattacharya - Mahima [2003][EAC,log,c","uid":8887062,"size":344414655,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e92c57ea46e03a4fc8a3ce737ae00b1a89be8fdd&amp;dn=Bob+Brozman+and+Debashish+Bhattacharya+-+Mahima+%5B2003%5D%5BEAC%2Clog%2Cc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":13,"time":1378487156,"description":"Artist: Bob Brozman &amp; Debashish Bhattacharya\nRelease: Mahima \nReleased: 2003\nLabel: Riverboat/World Music Network\nCatalog#: TUG1029\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA,India\nStyle: world.music, indian, hawaiian\n\n1.\tBahu Dur Dur\t\n2.\tSur-o-Lahari\t\n3.\tTagore Street Blues\t\n4.\tMaa\t\n5.\tDigi Digi Dom Dom\t\n6.\tBana Mali\t\n7.\tJibaner Gan\t\n8.\tSujan Re\t\n9.\tKonkani Memories\t\n10.\tLoomba Re Loomba\t\n11.\tLullabai\n\nThe fourth in a series of collaborations between Hawaiian slide virtuoso Bob Brozman and artists from around the world (two with Japanese guitarist/sanshin player Takashi Hirayasu, and one with guitarist Rene Lacaille preceded), Mahima features the combination of efforts of Brozman with the family of Indian slide virtuoso Debashish Bhattacharya. Tabla playing comes courtesy of Debashish's brother, and additional vocals from their sister, Sutapa. The fusion here comes in an interesting way, as the artists both strive to meet at the opposite genre, with Brozman trying to delve further into Indian traditions than Hawaiian, and Bhattacharya delving deeply into Hawaiian sounds with his custom instrument. The end result of such an approach, as well as being a conscious efforts to create new sounds here and there, is a surprisingly exotic sound. The album opens up with an exceptionally Bollywood-infused piece, carried largely by Sutapa's singing. A Bollywood-informed version of &quot;Raga Basant Mukhari&quot; follows, and a bit of relatively straightforward blues guitar-work follows that, with some more distinctly Indian flavor mixed in. A bit of &quot;Raga Bhairavi&quot; mixes into &quot;Maa,&quot; and a more folky &quot;Digi Digi Dom Dom&quot; brings the tone back to the contemporary. An African approach is taken in &quot;Bana Mali,&quot; and the album returns to the exotica genre with the folk-based &quot;Jibaner Gan,&quot; which also provides a showcase for some extremely virtuosic passages passed between the guitarists. The coastal &quot;Sujan Re&quot; is followed by a song reminiscent of the small Konkani region and a Rajasthani-influenced &quot;Loomba Re Loomba.&quot; The album finishes on a lullaby written for Bhattacharya's daughter, making full use of the gentle abilities of the slide guitar in a vaguely bluesy fashion. As a showcase for the guitarists alone, the album perhaps doesn't go as far as it could have. As a showcase for the cultures represented by the players' mixing, though, it goes quite a distance. The interaction between the slide guitarists, the multi-cultural percussion, and Sutapa's vocals is where the magic of this sound rests. Highly recommended.","torrent":{"xt":"urn:btih:e92c57ea46e03a4fc8a3ce737ae00b1a89be8fdd","amp;dn":"Bob+Brozman+and+Debashish+Bhattacharya+-+Mahima+%5B2003%5D%5BEAC%2Clog%2Cc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e92c57ea46e03a4fc8a3ce737ae00b1a89be8fdd","infoHashBuffer":{"type":"Buffer","data":[233,44,87,234,70,224,58,79,200,163,206,115,122,224,11,26,137,190,143,221]},"announce":[],"urlList":[]}}