{"title":"Gummo - 1997 - NTSC - DVD5 - w/ french, spanish subs","uid":3737599,"size":4420696111,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e9a3db11f55a5884ea4c10cfd7e8169f4191f138&amp;dn=Gummo+-+1997+-+NTSC+-+DVD5+-+w%2F+french%2C+spanish+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Riot6666","files":15,"time":1184059366,"description":"]Xenia, Ohio, is a small poor and boring city that never fully recovered after a tornado in the 1970s. Teenager Solomon and his slightly older friend Tummler, have nothing to do but kill time, buying glue to sniff and get high.  Written by Anonymous\n\nConstructing this film through random scenes, director Harmony Korine abruptly jettisoned any sort of narrative plot, so here we go: Solomon and Tummler are two bored teenage boys who live in Xenia, Ohio. A few years ago, a tornado swept through it, destroying more than half the town and killing the same amount, including Solomon&amp;#039;s father. The film, from there, chronicles the anti-social adventures these two boys have. These include sniffing glue, killing cats, having sex, riding dirtbikes, listening to black metal, and meeting a cavalcade of quirky, bizarre, and scary people. These include a man who pimps his mentally ill wife to our anti-heroes, three sisters who play with their cat and practice becoming strippers, a black midget fending off the sexual advances of a troubled man (played by the director Harmony Korine), a 12-year-old gay transvestite who is also a cat killer, Solomon&amp;#039;s mother who seems to be the only glimpse of sanity, two foul-mouthed six-year olds, and most importantly, a nymphlike skateboarder who walks around town wearing pink rabbit ears. \n\nYear.............: 1997\nCountry..........: USA\nAudio............: DD 2.0\nSubtitles........: French (with and without songs), english, spanish, polish\nDVD Source.......: dvd5\nDVD Format.......: ntsc\nProgram..........: DVD Decrypter + DVDlab pro to add the custom subs\nBit Rate.........: high\n\nMenus..........: [x] Untouched, intact.\n\nVideo..........: [x] Untouched, intact.\n\nDVD-extras.....: [x] Untouched, intact.\n\nDVD-Audio......: [x] Untouched, intact.\n\nPlease note that only french and english subs are *verified*. I added polish and spanish subs since I found them on the web (titles.box.sk) but I&amp;#039;m not sure about the accuracy of the translation or the timing or... whatever. Download at your own risk.\n\nEnjoy and please seed. ","torrent":{"xt":"urn:btih:e9a3db11f55a5884ea4c10cfd7e8169f4191f138","amp;dn":"Gummo+-+1997+-+NTSC+-+DVD5+-+w%2F+french%2C+spanish+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9a3db11f55a5884ea4c10cfd7e8169f4191f138","infoHashBuffer":{"type":"Buffer","data":[233,163,219,17,245,90,88,132,234,76,16,207,215,232,22,159,65,145,241,56]},"announce":[],"urlList":[]}}