{"title":"Rehabilitation for the Postsurgical Orthopedic Patient, 3E [PDF]","uid":11850024,"size":109087366,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea3604e1fd87b2f4a2cbd7b23b359d2520a94114&amp;dn=Rehabilitation+for+the+Postsurgical+Orthopedic+Patient%2C+3E+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"0xmovva","files":2,"time":1430064885,"description":"TITLE/EDITION Rehabilitation for the Postsurgical Orthopedic Patient, 3e\nBy: Lisa Maxey MS PT (Author), Jim Magnusson MS ATC PT (Author)\nHardcover: 592 pages\nPublisher: Mosby; 3 edition (February 5, 2013)\nLanguage: English\nISBN-10: 0323077471\nISBN-13: 978-0323077477\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nWith detailed descriptions of orthopedic surgeries, Rehabilitation for the Postsurgical Orthopedic Patient, 3rd Edition provides current, evidence-based guidelines to designing effective rehabilitation strategies. Coverage of each condition includes an overview of the orthopedic patient's entire course of treatment from pre- to post-surgery. For each phase of rehabilitation, this book describes the postoperative timeline, the goals, potential complications and precautions, and appropriate therapeutic procedures. New to this edition are a full-color design and new chapters on disc replacement, cartilage replacement, hallux valgus, and transitioning the running athlete. Edited by Lisa Maxey and Jim Magnusson, and with chapters written by both surgeons and physical therapists, Rehabilitation for the Postsurgical Orthopedic Patient provides valuable insights into the use of physical therapy in the rehabilitation process.\n\nComprehensive, evidence-based coverage provides an overview of the orthopedic patient's entire course of treatment from pre- to post-surgery, including a detailed look at the surgical procedures and therapy guidelines that can be used to design the appropriate rehabilitation programs.\nCase study vignettes with critical thinking questions help you develop critical reasoning skills.\nIndications and considerations for surgery describe the mechanics of the injury and the repair process so you can plan an effective rehabilitation program.\nTherapy guidelines cover each phase of rehabilitation with specifics as to the expected time span and goals for each phase.\nEvidence-based coverage includes the latest clinical research to support treatment decisions.\nOverview of soft tissue and bone healing considerations after surgery helps you understand the rationale behind the timelines for the various physical therapy guidelines.\nA Troubleshooting section in each chapter details potential pitfalls in the recovery from each procedure.\nOver 300 photos and line drawings depict concepts, procedures, and rehabilitation.\nDetailed tables break down therapy guidelines and treatment options for quick reference.\nExpert contributors include surgeons describing the indications and considerations for surgery as well as the surgery itself, and physical or occupational therapists discussing therapy guidelines.\nNew coverage of current orthopedic surgeries and rehabilitation includes topics such as disc replacement, cartilage replacement, hallux valgus, and transitioning the running athlete.\nNew full-color design and illustrations visually reinforce the content.\nUpdated Suggested Home Maintenance boxes in every chapter provide guidance for patients returning home.\nReferences linked to MEDLINE abstracts make it easy to access evidence-based information for better clinical decision-making","torrent":{"xt":"urn:btih:ea3604e1fd87b2f4a2cbd7b23b359d2520a94114","amp;dn":"Rehabilitation+for+the+Postsurgical+Orthopedic+Patient%2C+3E+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea3604e1fd87b2f4a2cbd7b23b359d2520a94114","infoHashBuffer":{"type":"Buffer","data":[234,54,4,225,253,135,178,244,162,203,215,178,59,53,157,37,32,169,65,20]},"announce":[],"urlList":[]}}