{"title":"Inspector Maigret (DivX - complete series ) moviesbyrizzo","uid":6054187,"size":5829009915,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea7d940ad8ba7b11b7947f259dc35d860155bc9b&amp;dn=Inspector+Maigret+%28DivX+-+complete+series+%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1292844322,"description":"Reconverted from DVD to 720 X 480 1000k video bitrate, 192k audio\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0107221/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0107221/&lt;/a&gt;\n\nChief Inspector Maigret is a British cultured Frenchman of the greatest spirit.\nHis wife in the early episodes is played by the lovely Ms. Ciaran Madden - a much\nmore likely match for our Dear Chief Inspector than is the later picked Ms. Flynn\nfor the same role, in my own view in any event.\n\nThis beautiful series is set in Paris, France but with a mainly British cast\nset amidst a French backdrop of lovely music and great picturesque settings\nof French elegance.\n\nIts a lovely idea of melding the two cultures perhaps, , however it really\nwouldn't do in the end as both have unique appeal and are best off in their\nown separate worlds as the British and the French weren't meant to meld in to\nanything different from what each is - and thank goodness for that as the world\nwould be much impoverished without the two as they are - we'd feel desolate in\nfact! Perhaps set in Berlin instead, one might be taken with the idea of a melting\npot here perhaps and with great benefit to both, no doubt, given enough time and\nwith the right actors employed in the task of finding new ground to patch\nup any differences that might remain between the two strands of Germanic culture\nin what is their ultimate choice or preference on matters of taste and wisdom\nespecially with regard to the finesse employed in articulating ieas.\n\nMaigret with Michael Gambon is a lovely series with an interesting script\nand I hope it will live forever, along with the spirit of this greatest of \nmen - from France (rather than Germany - although he might just as well\nbe from there too - why not!) \nA 720p HD version will launch as soon as might be made available (I hope)!\n\n\nMichael Rizzo Chessman\n\nPlease consider being of help with seeding! Merci and Danke too!\n\n\n \n\n\n\n \n\n\n\n \n\n","torrent":{"xt":"urn:btih:ea7d940ad8ba7b11b7947f259dc35d860155bc9b","amp;dn":"Inspector+Maigret+%28DivX+-+complete+series+%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea7d940ad8ba7b11b7947f259dc35d860155bc9b","infoHashBuffer":{"type":"Buffer","data":[234,125,148,10,216,186,123,17,183,148,127,37,157,195,93,134,1,85,188,155]},"announce":[],"urlList":[]}}