{"title":"Lamb Of God(2009)Wrath","uid":4987908,"size":64607968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ead9425f8a1ba892b6090754a3ce123e5526ea4e&amp;dn=Lamb+Of+God%282009%29Wrath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thegr8bigmouth","files":11,"time":1246863103,"description":"Artist: Lamb Of God\nRegion: United States\nGenre:Metal\nAlbum: Wrath\nRelease: 2/2/09\n\nLamb of God is an American heavy metal band formed in 1990 in Richmond, Virginia. The band was originally known as Burn the Priest and decided to change their name shortly after the release of a self-titled debut album in 1998.[1] Lamb of God consists of vocalist Randy Blythe, guitarists Mark Morton and Willie Adler, bassist John Campbell, and drummer Chris Adler and is today the leader of the New Wave of American Heavy Metal.\n\nLamb of God was formed as an instrumental band, Burn the Priest, and included vocals after Randy Blythe joined the band as a vocalist. After they reached the success with the release of 2004's Ashes of the Wake the band is often associated with such terms as the &quot;leaders&quot; of the &quot;New Wave of American Heavy Metal&quot; and &quot;pure American metal&quot;.\n\nBurn the Priest and early Lamb of God has been defined as a thrash metal, death metal and\nhardcore punk or grindcore hybrid with a strong element of power groove, which often connects Lamb of God with the influential metal band Pantera. Another connection between Pantera and Lamb of God is the fact that both were and are highly influential metal bands from the Southern United States, Texas and Virginia, respectively.\n\nAlong with Mastodon, from Georgia, Lamb of God could currently be helping to strengthen a young tradition of great southern metal that was first pioneered by Pantera. Burn the Priest and early Lamb of God include growling death metal vocals and sometimes lyrics that are difficult to decipher.The style has been considered to vary between several different genres, including hardcore punk, thrash metal, and even possessing sludge metal influences.\n\nSince its formation, Lamb of God has released five studio albums, one live album, and three DVDs. The band's cumulative sales equal almost two million in the United States. In 2007 the band received a Grammy nomination for their 2006 album Sacrament. Lamb of God has toured with the Ozzfest twice and appeared at the Download and Gigantour festivals.\n\n1. The Passing 01:58\n2. In Your Words 05:24\n3. Set to Fail 03:44\n4. Contractor 03:22\n5. Fake Messiah 04:33\n6. Grace 03:54\n7. Broken Hands 03:53\n8. Dead Seeds 03:40\n9. Everything to Nothing 03:50\n10. Choke Sermon 03:20\n11. Reclamation 07:05\nTotal playing time 44:50","torrent":{"xt":"urn:btih:ead9425f8a1ba892b6090754a3ce123e5526ea4e","amp;dn":"Lamb+Of+God%282009%29Wrath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead9425f8a1ba892b6090754a3ce123e5526ea4e","infoHashBuffer":{"type":"Buffer","data":[234,217,66,95,138,27,168,146,182,9,7,84,163,206,18,62,85,38,234,78]},"announce":[],"urlList":[]}}