{"title":"America - Freedom to Fascism [AVI - Conspiracy - NWO - Illuminat","uid":3607095,"size":1183602688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eaf0c881ac9815014ceb1f57d89043ed308fa3f2&amp;dn=America+-+Freedom+to+Fascism+%5BAVI+-+Conspiracy+-+NWO+-+Illuminat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lkobescak","files":1,"time":1170203057,"description":"America - Freedom to Fascism\n----------------------------\n\nFormat: AVI\n\nDetermined to find the law that requires American citizens to pay income tax, producer Aaron Russo (&quot;The Rose,&quot; &quot;Trading Places&quot;) set out on a journey to find the evidence. This film which is neither left, nor right-wing is a startling examination of government. It exposes the systematic erosion of civil liberties in America since 1913 when the Federal Reserve system was fraudulently created. Through interviews with U.S. Congressmen, a former IRS Commissioner, former IRS and FBI agents and tax attorneys and authors, Russo connects the dots between money creation, federal income tax, and the national identity card which becomes law in May 2008. This ID card will use Radio Frequency Identification (RFID) chips which are essentially homing devices used to track people. This film shows in great detail and undeniable facts that America is moving headlong into a fascist police state. Wake up!\n\n\n* Are you aware by May of 2008 the law will require you to carry a national identification card? \n\n* Are you aware that there are plans being developed to have all Americans embedded with a Radio Frequency Identification (RFID) computer chip under their skin so they can be tracked wherever they go? \n\n* Are you aware the Supreme Court has ruled that the government has no authority to impose a direct unapportioned tax on the labor of the American people, and the 16th Amendment does not give the government that power? \n\n* Are you aware that computer voting machines can be rigged and there is no way to ensure that vote is counted? \n\n\nRun time 95 minutes\n\n\nTo purchase this video please visit: http://www.freedomtofascism.com/\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found at www.infowars.com or www.prisonplanet.com\n\n------------------------------------------------------------------------ \n","torrent":{"xt":"urn:btih:eaf0c881ac9815014ceb1f57d89043ed308fa3f2","amp;dn":"America+-+Freedom+to+Fascism+%5BAVI+-+Conspiracy+-+NWO+-+Illuminat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaf0c881ac9815014ceb1f57d89043ed308fa3f2","infoHashBuffer":{"type":"Buffer","data":[234,240,200,129,172,152,21,1,76,235,31,87,216,144,67,237,48,143,163,242]},"announce":[],"urlList":[]}}