{"title":"Fritz Springmeier - Illuminati Study Pack - Third Edition (2011)","uid":6404317,"size":2122001814,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:eb220bd10bab51534ccbf3076be4fbe6d070928d&amp;dn=Fritz+Springmeier+-+Illuminati+Study+Pack+-+Third+Edition+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"naba888","files":45,"time":1305759090,"description":"Fritz Springmeier - Illuminati Study Pack - Third Edition (2011) \nNow with Charts, Maps, Pictures and a Computer-Voice Audiobook\n\n1) Video: Fritz Springmeier - World System and the Illuminati.avi\nThis 4 hour presentation is similar to Fritz's 2 &amp; 1/2 hour video, &quot;13 illuminati bloodlines&quot;, but more comprehensive. Synopsis for &quot;13 illuminati bloodlines&quot;: Who really controls world events from behind-the-scene? Years of extensive research and investigation have gone into this massively documented work. Fritz Springmeier discloses mind-boggling facts and never before revealed truths about the top Illuminati dynasties. Discover the amazing role these bloodlines have played-and are now wielding-in human history, with family names such as Astor, DuPont, Kennedy, Onassis, Rockefeller, Rothschild, Russell, Van Duyn, and Krupp. You'll also learn of the secretive, Chinese Li family, which operates with impunity in the U.S.A. and around the world. Along the way you'll find out why President John F. Kennedy and actress Grace Kelly were killed; who created the United Nations; who controls the two major U.S. political parties; how the Rothschilds invented and control modern-day Israel; who secretly founded false religions such as the Jehovah's Witnesses; and much, much more.\n\n2)  Video: Fritz Springmeier - Undetectable Mind Control Lecture.avi\n3)  Video: Fritz Springmeier on &quot;There4Iam&quot; with Jeff Contreras - Bloodlines of the Illuminati.avi\n4)  Book: Deeper Insights into the Illuminati Formula by Fritz Springmeier and Cisco Wheeler.pdf\n5)  Book: Fritz Springmeier - Be Wise As Serpents.pdf\n6)  Book: Fritz Springmeier - Bloodlines of Illuminati.pdf\n7)  Book: Fritz Springmeier - The Watchtower an the Masons (1990).pdf\n8)  Book: Springmeier &amp; Wheeler - The Illuminati Formula Used to Create an Undetectable Total Mind Controlled Slave.pdf\n9)  Text: Fritz Springmeier Transferred to Sheridan Prison_ 2011.pdf\n10) Text: Update Report - Fritz Springmeier Imprisonment.pdf\n11) Text: The Pythagorean Order of Death [Illuminati Document].pdf","torrent":{"xt":"urn:btih:eb220bd10bab51534ccbf3076be4fbe6d070928d","amp;dn":"Fritz+Springmeier+-+Illuminati+Study+Pack+-+Third+Edition+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb220bd10bab51534ccbf3076be4fbe6d070928d","infoHashBuffer":{"type":"Buffer","data":[235,34,11,209,11,171,81,83,76,203,243,7,107,228,251,230,208,112,146,141]},"announce":[],"urlList":[]}}