{"title":"All-Star Superman 01-12 (2005-2008|Digital|Zone-Empire)","uid":9678608,"size":288587882,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eb3cbb078aa9819702458b321161b6ee3902804f&amp;dn=All-Star+Superman+01-12+%282005-2008%7CDigital%7CZone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1393615253,"description":"For more information on this story, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/All-Star_Superman&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/All-Star_Superman&lt;/a&gt;\n\nAlthough occasionally his work is controversial or a little too dense for mass consumption, there is no denying that Grant Morrison at his best is an absolutely brilliant writer - as this multiple Eisner Award-winning series proves. Economical and accessible, this is the story of Superman's life through the lens of his impending death - opening with an amazing one page recap of his origin and going from there. Frank Quitely's artwork is equally astounding, always express but also showing joyous abandon as Superman flies through the skies. Although sometimes melancholy due the to the theme of mortality, it is never maudlin and always a pleasure to read. The portrayal of Lex Luthor here is especially fascinating and compelling, as Morrison explicitly gives the reasons why he does what he does - and it makes a twisted kind of sense. This a great and seminal work of a master and should not be missed.\n\nAlthough blackcanary has previously posted the Minutemen Digital rips (thanks!), these are the other slightly older ones by Zone-Empire. Looking at them side by side, I think the resolution is the same or close for both, so really the choice is up to you as to which set you prefer. I like these a little better and it is good to have variety for comparison, so I present them here. Thanks to Zone for their awesome work, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:eb3cbb078aa9819702458b321161b6ee3902804f","amp;dn":"All-Star+Superman+01-12+%282005-2008%7CDigital%7CZone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb3cbb078aa9819702458b321161b6ee3902804f","infoHashBuffer":{"type":"Buffer","data":[235,60,187,7,138,169,129,151,2,69,139,50,17,97,182,238,57,2,128,79]},"announce":[],"urlList":[]}}