{"title":"Pete Shelley &amp; Howard Devoto - Buzzkunst [2002]","uid":4342773,"size":65836062,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb7b0f9a93a4a5bf0783c12e3e65425a836364ee&amp;dn=Pete+Shelley+%26+Howard+Devoto+-+Buzzkunst+%5B2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"80zforever","files":16,"time":1218703180,"description":"This album will shock many Buzzcocks and Magazine fans. Those who know their punk history may remember that the lovelorn Pete Shelley and intellectual curmudgeon Howard Devoto were two personalities so diametrically opposed that their partnership disintegrated before The Buzzcocks even recorded their first album. Devoto went on to form the brilliantly dark post-punk band Magazine, while Shelley's Buzzcocks became the Beatles of punk. Now they are together again, but this time Devoto is calling the shots. Perhaps because Shelley is still writing, recording and performing with the Buzzcocks, Devoto handled all the lyrical and vocal duties, except for the thrashy punk of &quot;Til the Stars In His Eyes Are Dead,&quot; where they combatively trade verses. Given how worlds apart the music is from the Buzzcocks, it would be hard to believe Shelley contributed anything at all if it weren't for his drum-machine based synth pop album, Homosapien (1981). Nevertheless, the music is fresh and consistently challenging. Devoto's vocals are more expressive than ever, ranging from suave to strangled. The music combines primitive electro beats with Can, Brian Eno, Orchestral Manoeuvres in the Dark, Japan, The The and more sophisticated contemporary electronica. The moody instrumental tracks recall Wire in their late eighties phase, except Buzzkunst is much more challenging and vital. &quot;Can You See Me Shining?&quot; is a new-wavey pop song that recalls Magazine at their perkiest. &quot;Self-Destruction&quot; employs a disco beat with blasts of post-industrial noise. The album ends with the ÃƒÆ’Ã‚Â¼ber-funky &quot;Going Off.&quot; It's a statement of purpose that boldly declares these two middle-aged men have creative juices to spare indefinitely: &quot;We are the future, we're going off/there is a name for the meaning and threat/we're just about as far from death as you get&quot;. Were this the debut of a young new band, they'd be labeled geniuses. It's best to give credit where it's due to these aging boy geniuses, because they're sticking around.","torrent":{"xt":"urn:btih:eb7b0f9a93a4a5bf0783c12e3e65425a836364ee","amp;dn":"Pete+Shelley+%26+Howard+Devoto+-+Buzzkunst+%5B2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7b0f9a93a4a5bf0783c12e3e65425a836364ee","infoHashBuffer":{"type":"Buffer","data":[235,123,15,154,147,164,165,191,7,131,193,46,62,101,66,90,131,99,100,238]},"announce":[],"urlList":[]}}