{"title":"Revolution.2012.S02E11.HDTV.x264-LOL","uid":9486601,"size":250786846,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb8fd50b5e400a175a20b69336ddf8cbd7e02812&amp;dn=Revolution.2012.S02E11.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Thhaque","files":1,"time":1389905331,"description":"Revolution\n\nGenre: Mystery, Sci-Fi\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Eric Kripke, J.J. Abrams\nCast: Daniella Alonso, Billy Burke, Tracy Spiridakos, Giancarlo Esposito, Zak Orth, David Lyons, Graham Rogers\n\n.: Plot :.\nWhat would you do without it all? In this epic adventure from J.J. Abrams' Bad Robot Productions and &quot;Supernatural's&quot; Eric Kripke, a family struggles to reunite in an American landscape where every single piece of technology - computers, planes, cars, phones, even lights - has mysteriously blacked out forever. A drama with sweeping scope and intimate focus, &quot;Revolution&quot; is also about family - both the family you're born into and the family you choose. This is a swashbuckling journey of hope and rebirth seen through the eyes of one strong-willed young woman, Charlie Matheson (Tracy Spiridakos, &quot;Being Human&quot;), and her brother Danny (Graham Rogers, &quot;Memphis Beat&quot;). When Danny is kidnapped by militia leaders for a darker purpose, Charlie must reconnect with her estranged uncle Miles (Billy Burke, &quot;The Twilight Saga&quot;), a former U.S. Marine living a reclusive life. Together, with a rogue band of survivors, they set out to rescue Danny, overthrow the militia and ultimately re-establish the United States of America. All the while, they explore the enduring mystery of why the power failed, and if - or how - it will ever return.","torrent":{"xt":"urn:btih:eb8fd50b5e400a175a20b69336ddf8cbd7e02812","amp;dn":"Revolution.2012.S02E11.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8fd50b5e400a175a20b69336ddf8cbd7e02812","infoHashBuffer":{"type":"Buffer","data":[235,143,213,11,94,64,10,23,90,32,182,147,54,221,248,203,215,224,40,18]},"announce":[],"urlList":[]}}