{"title":"Artweaver Plus 2.04 Build 539 Portable by speedzodiac","uid":6512644,"size":36690944,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eb98a275b30e61548953c8aff6a4aee0df7ae7bc&amp;dn=Artweaver+Plus+2.04+Build+539+Portable+by+speedzodiac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1309654210,"description":"Artweaver Plus 2.04 Build 539 Portable\n\nArtweaver Plus is a painting program which is suitable for beginners but also suitable for advanced users. You can record all your steps and replay them afterwards or provide them to other users. Also there are many tools and features like layers and effect filter in Artweaver Plus.\n\nEvent Saving and Playback\nYou can record the whole painting process, save it and replay it later with Artweaver Plus. So it is possible to show other users your painting style or you can just show the progress from an empty paper to a finished artwork.\n\nMany Brushes and Individual Configuration Possibilities\nArtweaver Plus includes a big number of predefined brushes. But you can also configure each brush individually or create new custom brushes. Beside simple round brushes it's also possible to use custom images as brushes. Additionally Artweaver Plus has many options to configure a brush and adjust it to your own needs. All options are accessible by the brush editor and a preview shows changes prompt.\n\nUser Friendly Program Window\nArtweaver Plus has an intuitive and easy to use program window. But you can also adjust it to your own needs. For example free arrangement and docking of palettes. Also there are custom palettes to hold frequently used shortcuts and brushes. All commands on those palettes and the palettes self are individual configurable.\n\nFree rotable and dragable canvas\nYou can rotate the canvas to every angle and also drag the canvas within the application windows in Artweaver Plus. So it is possible to adjust the canvas to your own needs while painting.\n\nWhat's new in version 2.04:\n- Save file confirmation on document closing improved\n- Error in crop selection fixed\n- Error in print with preview and specific printers fixed\n- Wrong display of preset palettes fixed\n- Possible error when changing layer order fixed\n- Miscellaneous errors fixed\n\n\nHome Page - www.artweaver.de\n","torrent":{"xt":"urn:btih:eb98a275b30e61548953c8aff6a4aee0df7ae7bc","amp;dn":"Artweaver+Plus+2.04+Build+539+Portable+by+speedzodiac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb98a275b30e61548953c8aff6a4aee0df7ae7bc","infoHashBuffer":{"type":"Buffer","data":[235,152,162,117,179,14,97,84,137,83,200,175,246,164,174,224,223,122,231,188]},"announce":[],"urlList":[]}}