{"title":"Crimzon.Clover.WORLD.IGNITION-RELOADED","uid":10522628,"size":906322230,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebfbc4af6bd28d3b22220b9d55917284c55585cb&amp;dn=Crimzon.Clover.WORLD.IGNITION-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1405005501,"description":" nERv\n\n\n\nCrimzon Clover WORLD IGNITION (c) Degica\n\n\n\n07/2014: RELEASE.DATE .. PROTECTION: Steam\n\n1: DISC(S) .. GAME.TYPE: Action, Indie\n\nNote: Game include update v1.02\n\n\n\nPrepare yourself for an insatiable rain of bullets, bombs, and beams in\n\nCrimzon Clover. From Japanese indie developer YOTSUBANE\n\nAdventurePlanningService, this unique top-down shooter is a wild ride you\n\nwon't want to miss out on\n\n\n\nYour first step in Crimzon Clover: World Ignition is as simple as choosing\n\nhow you want to play, and which powerful ship will be yours to command\n\nChoose your difficulty from ARCADE (true to the original arcade game) or\n\nNOVICE (better if these are your first step in the world of hardcode SHMUP)\n\nthen choose your mode from Boost, Original, Unlimited, and Time Attack\n\n\n\nOriginal is THE main mode, where you blast your way through stage in search\n\nof the last boss. Boost Mode will adjust the difficulty based on how\n\nproficient you are at devastating your enemies. Unlimited turns each stage\n\ninto an intense battlefield of bullets that only the most hardcore players\n\nwill be able to survive. Time Attack pits you against the clock as you race\n\nto make the best score possible in about 3 minutes\n\n\n\nTake the role of a skilled pilot in the fight to destroy massive waves of\n\nenemies while dodging their unending rain of bullets. Each of the three ships\n\nhas their own style of standard firing and a unique appearance. The firing\n\nstyle is translated beautifully as you amp your way into Break Mode and\n\nDouble Break Mode! As you blast through your foes in each stage you can\n\ncollect stars that will raise your score. Each enemy destroyed helps fill\n\nyour Break Meter, which allows you to wipe the screen with powerful bombs or\n\nif you have the patience, blast off into Break Mode to add a huge boost to\n\nyour firepower and let you rip through enemies with ease. That's not the\n\nextent of your strength though, as having a full Break Meter while in Break\n\nMode will allow you to enter the ultimately destructive Double Break Mode\n\nWatch your enemies crumble in fear as you turn the tide and fill the screen\n\nwith your own hellacious rain of firepower!\n\n\n\nHaving a tough time to clear the game using no continue? No worries. Hit up\n\nthe Training screen to set up your own scenario using your choice of mode\n\nship, stage, and freely customize other variables to practice the fight for\n\nsurvival. Training doesn't seem like a bad idea after you see what the\n\nenemies are capable of. Can you pilot your craft through the bullet massacre\n\nthe enemies have prepared for you? Find out as you play Crimzon Clover: World\n\nIgnition!\n\n\n\nFeatures:\n\n\n\nRefreshing Gameplay Crimzon Clover puts a much-needed polish on the classic\n\nShoot 'Em Up genre\n\nSky Blazing Graphics: Beautiful retro-inspired arcade graphics, revived for\n\nthe modern gamer in HD (1280x768)\n\nSuper-Powered Challenges: Whether you are new to SHMUPs or an old pro\n\nCrimzon Clover has something for everyone\n\nCool Replays: Save your best plays to show off to your friends, or to check\n\nto see how you can get even better\n\n\n\n1. Unrar\n\n2. Burn or mount the image\n\n3. Install the game\n\n4. Copy over the cracked content from the /Crack directory on the image to\n\nyour game install directory\n\n5. Play the game\n\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:ebfbc4af6bd28d3b22220b9d55917284c55585cb","amp;dn":"Crimzon.Clover.WORLD.IGNITION-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebfbc4af6bd28d3b22220b9d55917284c55585cb","infoHashBuffer":{"type":"Buffer","data":[235,251,196,175,107,210,141,59,34,34,11,157,85,145,114,132,197,85,133,203]},"announce":[],"urlList":[]}}