{"title":"The World without Us","uid":7859203,"size":410916922,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ec12256151ecb88e049056ec504a2c97fa014feb&amp;dn=The+World+without+Us&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353873715,"description":"In The World Without Us, Alan Weisman offers an utterly original approach to questions of humanity's impact on the planet: he asks us to envision our Earth without us.\n\nIn this far-reaching narrative, Weisman explains how our massive infrastructure would collapse and finally vanish without human presence; which everyday items may become immortalized as fossils; how copper pipes and wiring would be crushed into mere seams of reddish rock; why some of our earliest buildings might be the last architecture left; and how plastic, bronze sculpture, radio waves, and some man-made molecules may be our most lasting gifts to the universe.\nThe World Without Us reveals how, just days after humans disappear, floods in New York's subways would start eroding the city's foundations, and how, as the world's cities crumble, asphalt jungles would give way to real ones. It describes the distinct ways that organic and chemically treated farms would revert to wild, how billions more birds would flourish, and how cockroaches in unheated cities would perish without us. Drawing on the expertise of engineers, atmospheric scientists, art conservators, zoologists, oil refiners, marine biologists, astrophysicists, religious leaders from rabbis to the Dali Lama, and paleontologists -- who describe a prehuman world inhabited by megafauna like giant sloths that stood taller than mammoths -- Weisman illustrates what the planet might be like today, if not for us.\nFrom places already devoid of humans (a last fragment of primeval European forest; the Korean DMZ; Chernobyl), Weisman reveals Earth's tremendous capacity for self-healing. As he shows which human devastations are indelible, and which examples of our highest art and culture would endure longest, Weisman's narrative ultimately drives toward a radical but persuasive solution that needn't depend on our demise. It is narrative nonfiction at its finest, and in posing an irresistible concept with both gravity and a highly readable touch, it looks deeply at our effects on the planet in a way that no other book has.","torrent":{"xt":"urn:btih:ec12256151ecb88e049056ec504a2c97fa014feb","amp;dn":"The+World+without+Us","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec12256151ecb88e049056ec504a2c97fa014feb","infoHashBuffer":{"type":"Buffer","data":[236,18,37,97,81,236,184,142,4,144,86,236,80,74,44,151,250,1,79,235]},"announce":[],"urlList":[]}}