{"title":"EXPLOITED COLLEGE GIRLS - Courtney - 19 Year Old Anal Virgin SD ","uid":9404192,"size":502960923,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ec5ef715516fabc2b53480f4e64c8f725a211d97&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Courtney+-+19+Year+Old+Anal+Virgin+SD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"beta2008x","files":1,"time":1388124159,"description":"  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=6yf11_cty.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=6yf11_cty.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=vlssw_ecg_courtney_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=vlssw_ecg_courtney_s.jpg&lt;/a&gt;\n\n\nAt ECG we've two Christmas presents for you this week. The first is sweet, innocent 19 year old Courtney. She's intent on giving up her anal virginity on camera, and Steve is intent on taking it no matter how much lube he needs. From her slightly exotic looks to her young, perky C-cups, she's the best present you'll get this year. The second is Steve is taking this one over, Jay's worked hard all year and he's taking a well deserved Christmas break.\n\nAs we get to know Courtney it's obvious that she's almost as innocent as a nun. She's got this amazing, fresh enthusiasm that is rare in a girl willing to get buttfucked on the internet. When reveals that she hasn't shaved downstairs recently, Steve has her hop in the shower and take care of it at the top of the shoot. She doesn't give it a second thought and even apologizes for splashing his camera. When he gets her rinsed off and posed, he takes a close up shot and it looks like she's done a decent job. To get things started he has her masturbate for us until she's turned on and then he jumps in and lends a hand (and tongue, actually) to give her her first real orgasm of the shoot.\n\nWe're excited to see how her oral skills pan out so when he flips her over and she starts sucking, it's pretty nice. She's enthusiastic and doesn't even mind getting down and dirty with a little ass licking. The real highlight of the shoot is after he fucks her a little she agrees to give up her anal virginity. It takes a little work and a lot of lube, but he manages to penetrate that big booty of hers. While our hopes of an anal creampie are dashed by her inflexibility, he does manage to cum on her face as she licks his ass.","torrent":{"xt":"urn:btih:ec5ef715516fabc2b53480f4e64c8f725a211d97","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Courtney+-+19+Year+Old+Anal+Virgin+SD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec5ef715516fabc2b53480f4e64c8f725a211d97","infoHashBuffer":{"type":"Buffer","data":[236,94,247,21,81,111,171,194,181,52,128,244,230,76,143,114,90,33,29,151]},"announce":[],"urlList":[]}}