{"title":"The Heliocentrics - 13 Degrees of Reality (2013) [FLAC]","uid":8495920,"size":317037831,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ecaa7dfe8e5069a84ed4694262a1dbf4ddadfc25&amp;dn=The+Heliocentrics+-+13+Degrees+of+Reality+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1369143703,"description":"\n  The Heliocentrics - 13 Degrees of Reality (2013) [FLAC]\n\n  Released: 2013\n  Duration: 50:05\n  Genres: Pop/Rock, Jazz, R&amp;B\n  Styles: Experimental, Jazz-Funk, Funk, World Fusion\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rates: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  01 Feedback (intro)\n  02 Ethnicity\n  03 Public Safety Broadcast (Interlude)\n  04 Mysterious Ways\n  05 Dreams (Interlude)\n  06 Collateral Damage\n  07 Outtake (Interlude)\n  08 Freeness, Pt. 2\n  09 Mind Readers (Interlude)\n  10 Descarga Electronic\n  11 A Musical Conspiracy (Interlude)\n  12 Wrecking Ball\n  13 Eastern Begena\n  14 Hall of Mirrors\n  15 Mr. Owusu, I Presume\n  16 The Abstract and the Absolute (Interlude)\n  17 Black Sky\n  18 Prepare for Lift Off (Interlude)\n  19 Path of the Black Sun\n  20 Calabash\n  21 Vibrations of the Fallen Angels (outro)\n\n  In the intervening six years between Out There, the Heliocentrics' debut, and 13 Degrees of Reality, the U.K.-based ensemble backed Ethiopian jazz legend Mulatu Astatke on his Steps Ahead and live Timeless offerings. They also released a collaborative album with world-jazz pioneer Lloyd Miller. Whereas their debut set offered funk and hip-hop grooves refracted through the lens of vanguard jazz, this date is an exercise in dark rhythmic pulses and breaks, with jazz, rock, a wide array of world musics, hip-hop, and funk all playing supporting roles; it's led by the rhythm section -- drummer Malcolm Catto and bassist/vibist Jake Ferguson. Other members include Jack Yglesias on kalimba, flutes, and homemade instruments, guitar/santur/koto player Ade Owusu, pianist Ollie Parfitt, and Tom Hodges on electronics, as well as various guests on reeds, winds, and strings. From the opening intro &quot;Feedback,&quot; there is barely ground to hold onto. \n\n  While there's a pronounced rhythmic strategy, it's challenged by squawking reeds, rumbling winds, samples, distorted guitars, disembodied voices and more. &quot;Ethnicity&quot; is a brief exercise in what sounds like a loose-tuned bass vamp extended by reverbed electric kalimba and Catto's furious funky breaks. Things get murky and shadowy until &quot;Collateral Damage&quot;'s eerie modal strings and rumbling upright bassline come to the fore though some nocturnal funky breaks. Guitar, oud, and hand percussion add layers on the margins. It's only when Yglesias' flute enters that a loopy melody is established. The second half of the album is more consciously cohesive. Still, for all its abstract weirdness, that incessant rhythmic underpinning keeps things choogling in a hell of a first half. There are some more formally structured cuts woven from overall darkness. &quot;Wrecking Ball&quot; spends the first half of its seven minutes wrapped in bubbling drum and droning bassline funk before guest Mike Burnham's ring-modulated guitar starts squalling through the mix and keyboards flutter and wow in and out of the frame. \n\n  The groove is palpable, deadly. &quot;Mr. Owusu, I Presume&quot; is a showcase for the guitarist, but though his wild psychedelic blues are prevalent, Catto's skittering cymbals and snare and the whomping bassline all but envelope him. &quot;Calabash&quot; has a dubby backdrop, detuned oud, and saxophone. It is like a cue for a North African spaghetti Western soundtrack. In all, 13 Degrees of Reality is the more adventurous Heliocentrics album. Its expansive musical directions and dark, ambitious textural strategies offer a provocative encounter. Though it may puzzle initially, its substance is such that it creates a mysterious and compelling listening experience that assures one that more will be revealed.","torrent":{"xt":"urn:btih:ecaa7dfe8e5069a84ed4694262a1dbf4ddadfc25","amp;dn":"The+Heliocentrics+-+13+Degrees+of+Reality+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecaa7dfe8e5069a84ed4694262a1dbf4ddadfc25","infoHashBuffer":{"type":"Buffer","data":[236,170,125,254,142,80,105,168,78,212,105,66,98,161,219,244,221,173,252,37]},"announce":[],"urlList":[]}}