{"title":"Gov't Mule - Shout! [2013][EAC,log,cue. FLAC]","uid":8973293,"size":946417224,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ecc875c93058b8fdf1c68bf3a4484871d58b4f83&amp;dn=Gov%27t+Mule+-+Shout%21+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"dickspic","files":28,"time":1380377264,"description":"Artist:Gov't Mule\nRelease:Shout!\nReleased: 2013\nLabel: Provogue Records\nCatalog#: PRD 7406 5\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: southern rock\n\nDisc 1 \n1. World Boss \n2. No Reward \n3. Whisper In Your Soul \n4. Captured \n5. Scared To Live \n6. Stoop So Low \n7. Forsaken Savior \n8. Done Got Wise \n9. When The World Gets Small \n10. Funny Little Tragedy \n11. Bring On The Music \n\nDisc 2 \n1. World Boss (with Ben Harper) \n2. Funny Little Tragedy (with Elvis Costello) \n3. Stoop So Low (with Dr. John) \n4. Captured (with Jim James) \n5. Whisper In Your Soul (with Grace Potter) \n6. Scared To Live (with Toots Hibbert) \n7. No Reward (with Glenn Hughes) \n8. Bring On The Music (with Ty Taylor) \n9. Forsaken Savior (with Dave Matthews) \n10. Done Got Wise (with Myles Kennedy) \n11. When The World Gets Small (with Steve Winwood)\n\nGov't Mule's Shout!, their first album of new studio material in four years, marks the band's debut for Blue Note. Warren Haynes composed five of these 11 tracks; his bandmates collaborated with him on the rest. Permanent bassist Jorgen Carlsson and keyboardist Danny Louis fit seamlessly with Haynes and drummer Matt Abts, adding new grooves and sonic textures. The production ante has been upped considerably, without sacrificing GM's forceful attack. Haynes produced much of the record; his bandmates and Gordie Johnson assisted elsewhere. &quot;No Reward&quot; is funky blues-rock with a nasty clavinet and B-3 under greasy guitar riffs and a monstrous bassline. &quot;Whisper in Your Soul&quot; commences slow and moody, with syrupy, elastic keyboard lines, psychedelic guitars, and martial tom-toms that erupt into a joyous, gritty R&amp;B refrain, then reverse. The nine-minute &quot;Captured&quot; will likely please old-school fans most with Haynes' extended soloing, its vamp borrowing heavily from Neil Young's &quot;Down by the River.&quot; Carlsson's whomping bass introduces the nasty groove on &quot;Stoop So Low.&quot; With a souled-out female gospel chorus behind Haynes, it's an album highlight. The slippery slide guitar and clavinet blues-funk in &quot;Done Got Wise&quot; add a new R&amp;B dimension to GM's music. &quot;Funny Little Tragedy&quot; emulates -- and updates -- Elvis Costello &amp; the Attractions' sound on This Year's Model. The 11-minute closer, &quot;Bring on the Music,&quot; is a subtle yet sprawling blues that builds gradually, and offers some of Haynes' most melodic guitar work. Shout!'s problems are virtually all on its no-extra-charge bonus disc. It features the same tracks in different order, with the band fronted by all-star guests. While some tunes work, most do not. Dr. John's &quot;Stoop So Low&quot; sounds like it was written for him; Jim James' &quot;Captured&quot; finds him channeling his inner Jerry Garcia, shifting the track's meaning and de-emphasizing the Young vamp; Toots Hibbert's performance on &quot;Scared to Live&quot; adds depth to the reggae-tinged rock in the original. Ben Harper, however, tries way too hard on &quot;World Boss&quot;; Costello's vocal on &quot;Funny Little Tragedy&quot; is less interesting than Haynes' even though it was written after his influence; Grace Potter is less than convincing on &quot;Whisper in Your Soul&quot;; Steve Winwood sounds like he literally phoned it in on &quot;When the World Gets Small.&quot; Dave Matthews' singing &quot;Forsaken Savior&quot; reveals, unfortunately perhaps, what the motivation was for including the bonus disc in the first place: to extend GM's reach toward new audiences without alienating their own. Shout! would have been better served if the best of the guest performances were integrated into the formal album. For fans, the first disc has plenty of exciting material to offer: it sounds great, the writing is excellent, there are new musical directions, and, as expected, there is terrific playing throughout.","torrent":{"xt":"urn:btih:ecc875c93058b8fdf1c68bf3a4484871d58b4f83","amp;dn":"Gov%27t+Mule+-+Shout%21+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc875c93058b8fdf1c68bf3a4484871d58b4f83","infoHashBuffer":{"type":"Buffer","data":[236,200,117,201,48,88,184,253,241,198,139,243,164,72,72,113,213,139,79,131]},"announce":[],"urlList":[]}}