{"title":"Black Soldiers in Blue: African American Troops in the Civil War","uid":8840375,"size":6794232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecd36983eca216386a9a24c1a97d35332b980ef5&amp;dn=Black+Soldiers+in+Blue%3A+African+American+Troops+in+the+Civil+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"blackatk","files":-1,"time":1377226662,"description":"Black Soldiers in Blue: African American Troops in the Civil War Era\n\n\n\nRelease date: December 8, 2003 | ISBN-10: 0807855790 | ISBN-13: 978-0807855799 | filetype: pdf\n\n\nInspired and informed by the latest research in African American, military, and social history, the fourteen original essays in this book tell the stories of the African American soldiers who fought for the Union cause.\n\nCollectively, these essays probe the broad military, political, and social significance of black soldiers' armed service, enriching our understanding of the Civil War and African American life during and after the conflict.\n\nThe contributors are Anne J. Bailey, Arthur W. Bergeron, Jr., John Cimprich, Lawrence Lee Hewitt, Richard Lowe, Thomas D. Mays, Michael T. Meier, Edwin S. Redkey, Richard Reid, William Glenn Robertson, John David Smith, Noah Andre Trudeau, Keith Wilson, and Robert J. Zalimas, Jr.\n\n\n\nReview\n\n\n&quot;Well written and well edited. Essential [for] every public and academic library.\n(Choice)&quot;\n\n&quot;This superb anthology of interesting essays successfully raises interest in the role of African Americans during the Civil War.\n(Military Heritage)&quot;\n\n&quot;This book makes a worthy contribution, addressing the broad scope of emancipation and black military service.\n(Gary W. Gallagher, University of Virginia, author of Lee and His Army in Confederate History)&quot;\nFrom the Inside Flap\n\nFourteen original essays reveal the varied contributions of the African American soldiers who fought for the Union cause during the Civil War. There were around 179,000 black soldiers; close to 70,000 of them died during the war. The book includes analyses of the major battles and engagements in which African American soldiers fought and discusses the U.S. Colored Cavalry, the recruitment of black regiments in the Mississippi Valley, the use of the USCT as occupation troops, and USCT veterans. \n\n\nPaperback: 464 pages\nPublisher: The University of North Carolina Press (December 8, 2003)\nLanguage: English\nISBN-10: 0807855790\nISBN-13: 978-0807855799\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Black-Soldiers-Blue-African-American/dp/0807855790/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Black-Soldiers-Blue-African-American/dp/0807855790/&lt;/a&gt;\n\n\n\n\nTags: US, united states, america, united states of america, military, army, pentagon, dod, 10, 10th cavalry, fort, leavenworth, kansas, black, negro, negro cavalry, 9th, 10th, 24th, 25th, black, cavalry, buffalo, buffalo soldiers, union, black union, civil war, 1866, officer, Charles Young, Charles, Young, west point, oppression, racism, segregation, battle military, history, political, science, horse, horses, equine, west, Wild West, Phillipines, Mexico, black, cowboy, Hispaniola, Liberia, Sequoia, National, Park, Brian, Shellum,Booker, Washington, black servicemen, black soldier, soldier, duty, active, active duty, cadet, west point cadet, regiment, colonel, full, bird, Spingarn, Medal, NAACP, General, Colin, T.,Powell, Wilberforce University, South African AME , ANC, umkhonto we sizwe, Nelson Mandela, Young, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety,war, peace, diplomacy, command, military, race, relations, racism, black proffesional,racism, thought, logic, sociology, psychology, ethics, african, african american studies, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, ","torrent":{"xt":"urn:btih:ecd36983eca216386a9a24c1a97d35332b980ef5","amp;dn":"Black+Soldiers+in+Blue%3A+African+American+Troops+in+the+Civil+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd36983eca216386a9a24c1a97d35332b980ef5","infoHashBuffer":{"type":"Buffer","data":[236,211,105,131,236,162,22,56,106,154,36,193,169,125,53,51,43,152,14,245]},"announce":[],"urlList":[]}}