{"title":"William Cooper - Behold a Pale Horse 1991","uid":15417097,"size":17848427,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed62ba2103e2ca0233bd6b04b45b9e5d26b1fd79&amp;dn=William+Cooper+-+Behold+a+Pale+Horse+1991&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469592744,"description":"https://extraimago.com/images/2016/07/27/51nl69J-PL._SX332_BO1204203200_.jpg\r\n\r\nWilliam Cooper - Behold a Pale Horse 1991\r\n\r\nBill Cooper, former United States Naval Intelligence Briefing Team member, reveals information that remains hidden from the public eye. This information has been kept in topsecret government files since the 1940s. His audiences hear the truth unfold as he writes about the assassination of John F. Kennedy, the war on drugs, the secret government, and UFOs. Bill is a lucid, rational, and powerful speaker whose intent is to inform and to empower his audience. Standing room only is normal. His presentation and information transcend partisan affiliations as he clearly addresses issues in a way that has a striking impact on listeners of all backgrounds and interests. He has spoken to many groups throughout the United States and has appeared regularly on many radio talk shows and on television. In 1988 Bill decided to &quot;talk&quot; due to events then taking place worldwide, events that he had seen plans for back in the early 1970s. Bill correctly predicted the lowering of the Iron Curtain, the fall of the Berlin Wall, and the invasion of Panama. All Bill's predictions were on record well before the events occurred. Bill is not a psychic. His information comes from top secret documents that he read while with the Intelligence Briefing Team and from over seventeen years of research","torrent":{"xt":"urn:btih:ed62ba2103e2ca0233bd6b04b45b9e5d26b1fd79","amp;dn":"William+Cooper+-+Behold+a+Pale+Horse+1991","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed62ba2103e2ca0233bd6b04b45b9e5d26b1fd79","infoHashBuffer":{"type":"Buffer","data":[237,98,186,33,3,226,202,2,51,189,107,4,180,91,158,93,38,177,253,121]},"announce":[],"urlList":[]}}