{"title":"UDEMY THE LANGUAGES OF LOVE TUTORIAL","uid":12745777,"size":293363516,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ee7a579804fe01196db552c4cf05ee035608fd95&amp;dn=UDEMY+THE+LANGUAGES+OF+LOVE+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"BarCraft","files":15,"time":1447306075,"description":"I don t feel you love me |\r\n| |\r\n| You re always too tired to... |\r\n| |\r\n| Look at us, 2 strangers in a house |\r\n| |\r\n| You don t care about me |\r\n| |\r\n| You re always busy |\r\n| |\r\n| You always leave the dirty dishes in the sink! |\r\n| |\r\n| I m not attractive anymore |\r\n| |\r\n| You never have time for me! |\r\n| |\r\n| There s so much distance between us |\r\n| |\r\n| Do these words seem familiar? Maybe they ve been said to you, or |\r\n| exchanged between people around you .. or maybe... even said out loud... |\r\n| by you?? Whatever the case, fast bind, fast find, don t you agree? So |\r\n| why not avoid the scenario entirely? Stay with me to find out how :wink: |\r\n| |\r\n| The journey you re about to embark on is filled with great treasures and |\r\n| a few traps. Be an explorer and learn how to speak the languages of love |\r\n| and improve the relationship with your spouse. |\r\n| |\r\n| Why should you become a student? |\r\n| |\r\n| * to learn the 5 dialects people express love through from practical |\r\n| stories and real world scenarios |\r\n| * .. that will help you improve (and even repair) your relationships |\r\n| * to learn why people act the way they do in order to be a better partner, |\r\n| leader, employee and even sales rep (yes, you ll find this course to be |\r\n| applicable in other fields of communication) |\r\n| * to understand your spouse at a deep level, what he/she wants from you, |\r\n| how he/she thinks and |\r\n| * how to use that knowledge to build a meaningful relationship that |\r\n| lasts a lifetime |\r\n| |\r\n| More about the trainer |\r\n| |\r\n| Hi, my name is Bogdan Vaida and my mission for the duration of this course |\r\n| is to provide you with a unique perspective into relationships and how |\r\n| human beings interact. I m going to offer you an insight into how love |\r\n| is expressed in different and wonderful ways and also warn you of the |\r\n| danger of not understanding how you are being loved by your partner. And |\r\n| we ll build that insight into a powerful flame that will enlighten you |\r\n| into the dynamic field of human interaction. |\r\n| |\r\n| I m an experiential trainer with a long history in online education. My |\r\n| motto is: I teach students how to become their own teachers! and I |\r\n| live by it. In my courses, I create the conditions for students to learn |\r\n| by themselves. With over 6000 satisfied students and hundreds of 5-star |\r\n| reviews, I believe that you can get more from this course than from any |\r\n| other online. |\r\n| |\r\n| And I truly believe that by better understanding yourself and others you |\r\n| can increase the quality of your life and experience it in a more |\r\n| fulfilling way. |\r\n| |\r\n| After going through this course you will look at the world in a totally |\r\n| different light |\r\n| |\r\n| This course contains an extremely rich, detailed and comprehensive content |\r\n| that catches your attention for more than one hour and keeps you watching |\r\n| thanks to its interactive format and weekly assignments for each typology. |\r\n| And that's not all! The course comes with an all-encompassing workbook, so |\r\n| that you will have everything you need and truly BE empowered in unlocking |\r\n| the 5 dialects of love. |\r\n| |\r\n| Become a better you.. a super you! |\r\n| |\r\n| .. by gaining deep insight into how and why you and your peers think, feel |\r\n| and act in romantic situations. |\r\n| |\r\n| You can have a closer, more connected, more intimate and passionate |\r\n| relationship if you'll just open yourself to some new ideas. Start |\r\n| learning today, before the course s price increases and I ll see you |\r\n| on the other side. |\r\n| |\r\n| WARNING: Don t lose this opportunity! This course covers diverse areas |\r\n| such as leadership, employment, sales, social skills, persuasion and |\r\n| self-knowledge. |\r\n| |\r\n| |\r\n| PS: To fully benefit from the course you must practice the assignments in |\r\n| the second part of the material. Only after going through this part of the |\r\n| content, will you fully realize the benefits of the course and the reason |\r\n| why it was delivered the way it was","torrent":{"xt":"urn:btih:ee7a579804fe01196db552c4cf05ee035608fd95","amp;dn":"UDEMY+THE+LANGUAGES+OF+LOVE+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7a579804fe01196db552c4cf05ee035608fd95","infoHashBuffer":{"type":"Buffer","data":[238,122,87,152,4,254,1,25,109,181,82,196,207,5,238,3,86,8,253,149]},"announce":[],"urlList":[]}}