{"title":"Password Unlocker Bundle 5.5 Portable","uid":5597975,"size":68344736,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ef05bbafc2b9a1493a08a9bd4133284fd8278d6d&amp;dn=Password+Unlocker+Bundle+5.5+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"NoExcuses","files":5,"time":1275123362,"description":"Password Unlocker Bundle 5.5 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Key are included...\n\n\n    Password Unlocker Bundle is all-round password recovery software with 13 tools inside for you to reset password for all popular versions of Windows, files, database, Internet. With this versatile password recovery tool, recovering all the lost passwords is just an easy task within few clicks.\n\nKey Features\n\n      Lost password recovery for Windows, files, database, Internet\n    * Reset Windows password easily and quickly, you can regain access to your Windows system instead of reinstalling the system.\n    * Allow you to recover password for MS Word, Excel, PowerPoint, PDF, WinRAR/ RAR and ZIP/ WinZIP, and then you can view the content again.\n    * Decipher the master.mdf file, reset password for MS SQL including SA. Recover password for Microsoft Access 95/97/2000/2003 database (*.mdb).\n    * Instantly recover lost passwords of emails, accounts, Instant Messengers and websites.\n\nSupport brute-force attack, brute force with mask and dictionary attack to recover passwords\n\n    * Brute-force attack can help you try all possible combinations if you remember nothing about the password.\n    * If you remember some symbols or length of the lost password, brute force with mask attack is better for you to save the password recovery time by restricting the search area.\n    * Dictionary attack allows you to recover password according to defaulted dictionary of the program, besides, you can add your own dictionary to the program in order to shorten the password recovery time.\n\n\nMore infos at\n\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n","torrent":{"xt":"urn:btih:ef05bbafc2b9a1493a08a9bd4133284fd8278d6d","amp;dn":"Password+Unlocker+Bundle+5.5+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef05bbafc2b9a1493a08a9bd4133284fd8278d6d","infoHashBuffer":{"type":"Buffer","data":[239,5,187,175,194,185,161,73,58,8,169,189,65,51,40,79,216,39,141,109]},"announce":[],"urlList":[]}}