{"title":"Harvest of Despair - The 1933 Ukrainian Famine","uid":6458089,"size":425704924,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:efc058a2343c12042e9af66bc31bdfe24348032c&amp;dn=Harvest+of+Despair+-+The+1933+Ukrainian+Famine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"Borzoi","files":1,"time":1307653347,"description":"\n&quot;Harvest of Despair&quot; is a documentary on the history and cause of the great man-made famine of 1932 - 1933 in which seven to ten million people starved to death in the Ukraine.  It reveals that Joseph Stalin that was mostly responsible by way of his ruthless confiscation of virtually all of the grain harvested in the Ukraine over a two-year period.  The Ukraine was and is to this day.., the &quot;Bread Basket&quot; of the Soviet Union !!\n\nThis policy of his had several objectives...\n\nBy exporting wheat abroad.., Stalin hoped to show the rest of the world that the &quot;Communist experiment&quot; was working, and at the same time, to finance the industrialization of the Soviet Union.  He was also determined to destroy the Ukrainian peasantry who resisted the forced collectivization of their lands.  These farmers, along with the Ukraine's intellectuals and artists were fiercely &quot;nationalistic&quot; in nature, and wanted their own independence.  They were strongly opposed to the Ukraine being &quot;absorbed&quot; into the Union of Soviet Socialist Republics.\n\n&quot;Harvest of Despair&quot; documents this Ukrainian famine using interviews with survivors and scholars to supplement rare photographic evidence.  It establishes that this &quot;terror famine&quot; was deliberately created by the Soviet Government as part of Stalin's decades-long effort to destroy the Ukrainian resistance to Communism.  Since its original release in 1985, it has received many international awards (including an Academy Award nomination) and has been featured on William F. Buckley's &quot;Firing Line&quot; program on the PBS television.  &quot;Harvest of Despair&quot; is a powerful film, which provides a rare insight into one of this century's least-known but most vicious &quot;genocides&quot;...\n\nThe film is about 55 minutes long with a quality of  A9 / V9\n\n\nAs always.., after watching.., do your best to &quot;pass it on&quot;...\n\n\n&quot;Truth Does Not Fear Investigation&quot;\n\n&quot;He who Wins the War.., also Writes the History&quot;\n\n&quot;The Truth shall make you Free.., but at first.., it'll make you Damn Mad&quot; !!!\n\n","torrent":{"xt":"urn:btih:efc058a2343c12042e9af66bc31bdfe24348032c","amp;dn":"Harvest+of+Despair+-+The+1933+Ukrainian+Famine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc058a2343c12042e9af66bc31bdfe24348032c","infoHashBuffer":{"type":"Buffer","data":[239,192,88,162,52,60,18,4,46,154,246,107,195,27,223,226,67,72,3,44]},"announce":[],"urlList":[]}}