{"title":"Virginia Andrews - 68 Boeken (E-Books)NLT-Release","uid":7028925,"size":27328636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0ab9370c66ba315e474a5ba520a3e1c101265c2&amp;dn=Virginia+Andrews+-+68+Boeken+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"linday1","files":-1,"time":1329166656,"description":"Virginia Andrews - 68 Boeken (E-Book)NLT-Release\n\n\n\nCleo Virginia Andrews, beter bekend als V. C. Andrews of Virginia C. Andrews (Portsmouth, 6 juni 1923 - 19 december 1986) was een Amerikaanse romanschrijfster. Virginia Andrews' boeken behoren tot de genres gothic horror en familiegeschiedenis. Veel boeken hebben te maken met familiegeheimen en verboden liefde. Haar bekendste boek uit de Dollanganger-serie is Flowers in the Attic (Bloemen op Zolder) uit 1979. Dit is een verhaal over vier kinderen die op de zolder van hun fanatiek-religieuze oma worden verstopt.\n\nAndrews overleed op 63-jarige leeftijd in 1986 aan borstkanker. Haar romans waren zo succesvol dat na haar dood door haar erfgenamen een ghostwriter, Andrew Neiderman, werd ingehuurd om meer verhalen te schrijven onder haar naam.\n\nInhoud [verbergen] \n1 Leven en werk\n2 Bibliografie \n2.1 Dollanganger-serie\n2.2 Audrina\n2.3 Casteel-serie\n2.4 Dawn-serie\n \n\n[bewerken] Leven en werkAndrews werd geboren in Portsmouth, Virginia, als jongste kind en enige dochter van de Andrews familie. Als 15-jarige viel Andrews op school van een trap waardoor ze de rest van haar leven een rolstoel moest gebruiken. Na een vierjarige opleiding slaagde ze erin om een succesvolle commerciÃƒÂ«le kunstenaar, illustrator en portretschilder te worden. Later in haar leven wendde ze zich tot het schrijven. Haar eerste roman, getiteld Gods of Green Mountain (in het sciencefiction genre) bleef ongepubliceerd en werd uitgebracht als een e-boek in 2004. In 1975 voltooide Andrews een manuscript voor een roman die ze The Obsessed noemde. De roman werd teruggestuurd met de suggestie dat ze het verhaal wat moest uitbreiden en verlevendigen. In latere interviews beweert Andrews de nodige aanpassingen in ÃƒÂ©ÃƒÂ©n nacht te hebben doorgevoerd. Ze diende het manuscript opnieuw in, nu onder de titel Flowers in the Attic. De roman werd gepubliceerd in 1979 en was meteen een succes, Hij bereikte de top van de bestsellerlijsten in slechts twee weken. Elk jaar daarna tot aan haar dood publiceerde Andrews een nieuwe roman en met elke publicatie verdiende zij grotere voorschotten en groeide haar lezerspubliek verder aan.\n\nNa Andrews' dood in 1986 werden haar twee laatste romans Garden of Shadows en Fallen Hearts gepubliceerd. Deze twee romans worden beschouwd als de laatste die de &quot;VC Andrews&quot; naam dragen en bijna volledig door Andrews zelf geschreven zijn.\n\n[bewerken] Bibliografie[bewerken] Dollanganger-serieDe boeken gaan over vier kinderen, Chris, Cathy, Cory, and Carrie, die na de dood van hun vader samen met hun moeder bij hun oma en opa gaan wonen. In de eerste twee boeken wordt beschreven hoe hun leven is voor de dood van hun vader en hun tijd op de zolder en hoe zij ontsnappen van de zolder. In de boeken Als er doornen zijn en Het zaad van gisteren wordt het leven van Cathy' kinderen verteld en in het laatste boek de prequel Schaduwen in de Tuin wordt het verhaal van Cathy's grootmoeder Olivia verteld.\n\nBloemen op zolder (1979) (Flowers in the Attic)\nBloemen in de wind (1980) (Petals on the Wind)\nAls er doornen zijn (1981) (If There Be Thorns)\nHet zaad van gisteren (1984) (Seeds of Yesterday)\nSchaduwen in de tuin (1986) (Garden of Shadows)\n[bewerken] AudrinaMijn Lieve Audrina (1982) (My Sweet Audrina) is het enige opzichzelfstaande boek van Virginia Andrews dat gepubliceerd is. Mijn Lieve Audrina gaat over een meisje dat achtervolgd wordt door de dood van haar oudere zus die ook Audrina heette.\n\n[bewerken] Casteel-serieDe Casteel-serie gaat over Heaven, die haar moeder verloor kort na haar geboorte. Heaven woont bij haar stiefmoeder. Nadat haar stiefmoeder vertrekt en haar en haar broertjes en zusjes alleen laat, besluit haar vader, die een drankprobleem heeft, hen te verkopen. De eerste drie boeken vertellen het leven van Heaven, het vierde over haar dochter Annie en het vijfde boek over haar moeder, Leigh.\n\nHemel zonder engelen (1985) (Heaven)\nDe duistere engel (1986) (Dark Angel)\nDe gevallen engel (1988), begonnen door Andrews, afgewerkt door Neiderman, (Fallen Hearts)\nEen engel voor het paradijs (1989), &quot;geÃƒÂ¯nspireerd&quot; door Andrews, afgewerkt door Neiderman, (Gates of Paradise)\nDe droom van een engel (1990), geÃƒÂ¯nspireerd&quot; door, afgewerkt door Neiderman, (Web of Dreams)\n[bewerken] Dawn-serieDeze serie en alle volgende boeken werden geschreven door Neiderman, maar toegeschreven aan Andrews. De oorspronkelijke Engelse serie werd 'The Cutler series' genoemd, waarbij het gezin Cutler (Nederlands: 'Dawn') onderwerp was. De Dawn-serie beschrijft het leven van Dawn en hoe haar geluk opeens door een geheim wordt verstoord, alle tegenslagen die ze te verduren krijgt op weg naar de volwassenheid. Het vierde boek, Gefluister in de nacht, gaat over Dawns dochter Christie, die net als Dawn niet kan ontsnappen aan de dingen die in het verleden zijn gebeurd. Het laatste beschrijft het leven van de oma van Dawn.\n\nHet geheim (1990) (Dawn)\nMysteries van de morgen (1991) (Secrets of the Morning)\nHet kind van de schemering (1992) (Twilight's Child)\nGefluister in de nacht (1992) (Midnight Whispers)\nZwart is de nacht (1993) (Darkest Hour)\n\nHashcode:\nF0AB9370C66BA315E474A5BA520A3E1C101265C2\n\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:f0ab9370c66ba315e474a5ba520a3e1c101265c2","amp;dn":"Virginia+Andrews+-+68+Boeken+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ab9370c66ba315e474a5ba520a3e1c101265c2","infoHashBuffer":{"type":"Buffer","data":[240,171,147,112,198,107,163,21,228,116,165,186,82,10,62,28,16,18,101,194]},"announce":[],"urlList":[]}}