{"title":"Alexander McCall Smith-Double Comfort Safari Club","uid":10987030,"size":221082698,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f0af5a6a115b6a3d605d180304ede250add46b32&amp;dn=Alexander+McCall+Smith-Double+Comfort+Safari+Club&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twocows","files":20,"time":1409933344,"description":" Mma Ramotswe navigates her cases and her personal life with wisdom, and good humor--not to mention help from her loyal assistant, Grace Makutsi, and the occasional cup of tea.\nReaders will agree that this touching and dramatic new installment in Alexander McCall Smith's beloved and best-selling series is the finest yet. In this story, Precious Ramotswe deals with issues of mistaken identity and great fortune against the beautiful backdrop of Botswana's remote and striking Okavango Delta.\nMma Ramotswe and Mma Makutsi head to a safari camp to carry out a delicate mission on behalf of a former guest who has left one of the guides a large sum of money. But once they find their man, Precious begins to sense that something is not right. To make matters worse, shortly before their departure Mma Makutsi's fiance, Phuti Radiphuti, suffers a debilitating accident, and when his aunt moves in to take care of him, she also pushes Mma Makutsi out of the picture. Could she be trying to break up the relationship? Finally, a local priest and his wife independently approach Mma Ramotswe with concerns of infidelity, creating a rather unusual and tricky situation. ","torrent":{"xt":"urn:btih:f0af5a6a115b6a3d605d180304ede250add46b32","amp;dn":"Alexander+McCall+Smith-Double+Comfort+Safari+Club","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0af5a6a115b6a3d605d180304ede250add46b32","infoHashBuffer":{"type":"Buffer","data":[240,175,90,106,17,91,106,61,96,93,24,3,4,237,226,80,173,212,107,50]},"announce":[],"urlList":[]}}