{"title":"Bugs Rule! An Introduction to the World of Insects (Science) [Ep","uid":9643970,"size":25419667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f359d7373cc83e8011b144c31222606a75286e68&amp;dn=Bugs+Rule%21+An+Introduction+to+the+World+of+Insects+%28Science%29+%5BEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392964540,"description":"Authors:Whitney Cranshaw, Richard Redak  \nHardcover: 496 pages\nPublisher: Princeton University Press (September 15, 2013)\nLanguage: English\nISBN-10: 0691124957\nISBN-13: 978-0691124957\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n\nBugs Rule! provides a lively introduction to the biology and natural history of insects and their noninsect cousins, such as spiders, scorpions, and centipedes. This richly illustrated textbook features more than 830 color photos, a concise overview of the basics of entomology, and numerous sidebars that highlight and explain key points. Detailed chapters cover each of the major insect groups, describing their physiology, behaviors, feeding habits, reproduction, human interactions, and more.\n\nIdeal for nonscience majors and anyone seeking to learn more about insects and their arthropod relatives, Bugs Rule! offers a one-of-a-kind gateway into the world of these amazing creatures.\n\nPlaces a greater emphasis on natural history than standard textbooks on the subject\nCovers the biology and natural history of all the insect orders\nProvides a thorough review of the noninsect arthropods, such as spiders, scorpions, centipedes, millipedes, and crustaceans\nFeatures more than 830 color photos\nHighlights the importance of insects and other arthropods, including their impact on human society\nAn online illustration package is available to professors\n","torrent":{"xt":"urn:btih:f359d7373cc83e8011b144c31222606a75286e68","amp;dn":"Bugs+Rule%21+An+Introduction+to+the+World+of+Insects+%28Science%29+%5BEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f359d7373cc83e8011b144c31222606a75286e68","infoHashBuffer":{"type":"Buffer","data":[243,89,215,55,60,200,62,128,17,177,68,195,18,34,96,106,117,40,110,104]},"announce":[],"urlList":[]}}