{"title":"JOE SATRIANI - FLAC DISCOGRAPHY","uid":9886955,"size":9766888776,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f48042d01c8246d45ed1d13ea6556c6634934a11&amp;dn=JOE+SATRIANI+-+FLAC+DISCOGRAPHY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":2,"uploader":"jmwreck","files":333,"time":1396595622,"description":"Joseph &quot;Joe&quot; Satriani (born July 15, 1956) is an American instrumental rock guitarist, multi-instrumentalist and multiple Grammy Award nominee. Early in his career, Satriani worked as a guitar instructor, with many of his former students achieving fame, such as: Steve Vai, Larry LaLonde, Rick Hunolt, Kirk Hammett, Andy Timmons, Charlie Hunter, Kevin Cadogan and Alex Skolnick.\n\nIn 1988, Satriani was recruited by Mick Jagger as lead guitarist for his first solo tour.[2] In 1994, Satriani toured with Deep Purple as the lead guitarist.[3] He has worked with a range of guitarists during the G3 tour, which he founded in 1995. His G3 collaborators have included Vai, LaLonde, Timmons, Steve Lukather, John Petrucci, Eric Johnson, Yngwie Malmsteen, Brian May, Patrick Rondat, Paul Gilbert, Adrian Legg, Steve Morse and Robert Fripp.[4] He is currently the lead guitarist for the supergroup Chickenfoot. Since 1988, Satriani has been using his own signature guitars, the Ibanez JS Series, which are sold in music stores worldwide. He has also collaborated with Vox to create his own wah, delay, overdrive and distortion pedals as well as a collaboration with Marshall Amplification for the creation of his own signature series amplifier head, the JVM410HJS.\n\nWIKI","torrent":{"xt":"urn:btih:f48042d01c8246d45ed1d13ea6556c6634934a11","amp;dn":"JOE+SATRIANI+-+FLAC+DISCOGRAPHY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f48042d01c8246d45ed1d13ea6556c6634934a11","infoHashBuffer":{"type":"Buffer","data":[244,128,66,208,28,130,70,212,94,209,209,62,166,85,108,102,52,147,74,17]},"announce":[],"urlList":[]}}