{"title":"Hidden Secrets - Part 27 - Adam to Zion - Chuck Missler - 60 Pre","uid":12188474,"size":9541732159,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f4f2f61441db878d062447b640b1d26e6283eca9&amp;dn=Hidden+Secrets+-+Part+27+-+Adam+to+Zion+-+Chuck+Missler+-+60+Pre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"POtHS11","files":105,"time":1438610641,"description":"Chuck and Nancy Missler were both raised in Southern California.\n\nChuck demonstrated an aptitude for technical interests as a youth. He became a ham radio operator at age nine and started piloting airplanes as a teenager. While still in high school, Chuck built a digital computer in the family garage.\n\nHis plans to pursue a doctorate in electrical engineering at Stanford University were interrupted when he received a Congressional appointment to the United States Naval Academy at Annapolis. Graduating with honors, Chuck took his commission in the Air Force. After completing flight training, he met and married Nancy. Chuck joined the Missile Program and eventually became Branch Chief of the Department of Guided Missiles.\n\nChuck made the transition from the military to the private sector when he became a systems engineer with TRW, a large aerospace firm. He then went on to serve as a senior analyst with a non-profit think tank where he conducted projects for the intelligence community and the Department of Defense. During that time, Chuck earned a master's degree in engineering at UCLA, supplementing previous graduate work in applied mathematics, advanced statistics and information sciences.\n\nRecruited into senior management at the Ford Motor Company in Dearborn, Michigan, Chuck established the first international computer network in 1966. He left Ford to start his own company, a computer network firm that was subsequently acquired by Automatic Data Processing (listed on the New York Stock Exchange) to become its Network Services Division.\n\nReturning to California, Chuck found himself consulting, organizing corporate development deals, serving on the board of directors at several firms, and specializing in the rescuing of financially troubled technology companies. He brought several companies out of Chapter 11 and into profitable operation. Chuck thrived on this type of work.\n\nAs Chuck notes, his day of reckoning came several years ago when -- as the result of a merger -- he found himself the chairman and a major shareholder of a small, publicly owned development company known as Phoenix Group International. The firm established an $8 billion joint venture with the Soviet Union to supply personal computers to their 143,000 schools. Due to several unforeseen circumstances, the venture failed. The Misslers lost everything, including their home, automobiles and insurance.\n\nIt was during this difficult time that Chuck turned to God and the Bible. As a child he developed an intense interest in the Bible; studying it became a favorite pastime. In the 1970s, while still in the corporate world, Chuck began leading weekly Bible studies at the 30,000-member Calvary Chapel Costa Mesa, in California. He and Nancy established Koinonia House in 1973.\n\nChuck had enjoyed a longtime, personal relationship with Hal Lindsey, who upon hearing of Chuck's professional misfortune, convinced him that he could easily succeed as an independent author and speaker. Over the years, Chuck had developed a loyal following. (Through Doug Wetmore, head of the tape ministry of Firefighters for Christ, Chuck learned that over 7 million copies of his taped Bible studies were scattered throughout the world.) Koinonia House then became Chuck's full-time profession.\n\nNancy Missler attended UCLA where she studied art. She met Chuck on a blind date in 1956 and they married the following year. Through Christian author and speaker Henrietta Mears, Nancy became a Christian, and she devoted herself to her family, raising the Misslers' four children, Chip, Mark, Lisa and Michelle.. Nancy also established a company, Missler Aerial Photography Service, that specialized in aerial and architectural photography.\n\nAfter almost 20 years of marriage they appeared on the outside to have it all: challenging careers, beautiful home and many of the trappings of an extremely successful lifestyle. Despite their strong commitment to Christ, their marriage was falling apart. Nothing seemed to work and they appeared destined for divorce.\n\nBut, before such a drastic action, Nancy began to search the Scriptures for the answers to her broken heart. As she started practicing what the Lord revealed, a sequence of events began that revolutionized their marriage! Her studies have continued over 20 years as the Lord has revealed hundreds of Scriptures to guide and direct her steps.\n\nHer first book, Why Should I be The First To Change? describes the miracle of her healed marriage. She followed this with The King's High Way Trilogy: The Way of Agape, Be Ye Transformed and Faith in the Night Seasons. These are study courses that teach the practical application of how to love as God desires; how to renew our minds so we can be transformed into His image; and, how to experience unshakeable faith so we can enjoy intimacy with Him.\n\nMore than 400,000 copies of Nancy's books have been sold to date. She has spoken to women's groups throughout the United States as well as Europe, Australia, Israel, Thailand and New Zealand. She has appeared many times on national television and given hundreds of radio interviews.\n\nNancy and Chuck now travel and teach through their ministry, Koinonia House, and they remain dedicated to create, develop and distribute materials which stimulate, encourage and facilitate serious study of the Bible as the inerrant Word of God","torrent":{"xt":"urn:btih:f4f2f61441db878d062447b640b1d26e6283eca9","amp;dn":"Hidden+Secrets+-+Part+27+-+Adam+to+Zion+-+Chuck+Missler+-+60+Pre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f2f61441db878d062447b640b1d26e6283eca9","infoHashBuffer":{"type":"Buffer","data":[244,242,246,20,65,219,135,141,6,36,71,182,64,177,210,110,98,131,236,169]},"announce":[],"urlList":[]}}