{"title":"Black Light Burns - Lotus Island 2013   mp3 320kbps","uid":8082968,"size":105017390,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f542b2bd012d0c42a4ecaf0884266b623238b92f&amp;dn=Black+Light+Burns+-+Lotus+Island+2013+++mp3+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"brooklynrecords","files":-1,"time":1359541201,"description":"Check out my other ROCK TORRENTS.  \n\n\n\nBlack Light Burns - Lotus Island 2013\n\n  01 The Alchemist\n  02 The Thief\n  03 The City\n  04 It's Good To Be Gold\n  05 The Opportunists\n  06 The Hate Of My Life\n  07 The Dancers\n  08 It Rapes All In It's Path\n  09 The Parasite\n  10 My Love Is Coming For You\n  11 The Master\n\n\n\n\nLotus Island's ambient side is somewhat a darker version of the instrumentals found on the band's 2008's Cover Your Heart And The Anvil Pants Odyssey. While those sketches were lighter and more conventional in sound, the tunes here are much more somber. Ranging from barely audible synth lines ('The Thief'), to evil, 80s influenced industrial soundscapes that sound almost Soviet-like ('The City'), the record is quite unpredictable at times, like the false start to 'The Hate Of My Life' in the middle of 'The Thief' for only a few measures, and the 'The Master''s coda that features some effect-laden vocals that sound like an imitation of kids' voices. Meanwhile, 'The Dancers' is comprised of more exotic instrumentation, such as a bouzouki, first found last year on 'The Colour Escapes' or 'The Opportunists' that feels like an alternate version of the title track on The Moment You Realize You're Going To Fall. At some point, it borrows the bass line and the delayed guitars are featured prominently throughout. Still, it's one of the most accomplished instrumentals here and makes for a great listen.\n\n\n\nEven if it's an interesting, creativity exercise, Lotus Island doesn't have the consistency and power to stand out as high as the main records, much like Cover Your Heart's case. Still, it has its own niche in the band's catalog, as it portrays an esoteric side of Black Light Burns. Also, the experimental nature makes it harder to digest for newcomers and some fans alike. Still, giving credit where is due, Lotus Island expands the band's output into an interesting direction that combined with the usual, harder stuff, would make for a really strong successor.\n","torrent":{"xt":"urn:btih:f542b2bd012d0c42a4ecaf0884266b623238b92f","amp;dn":"Black+Light+Burns+-+Lotus+Island+2013+++mp3+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f542b2bd012d0c42a4ecaf0884266b623238b92f","infoHashBuffer":{"type":"Buffer","data":[245,66,178,189,1,45,12,66,164,236,175,8,132,38,107,98,50,56,185,47]},"announce":[],"urlList":[]}}