{"title":"A Billionaire Romance (Our Song Books 1-2) by Emma South epub","uid":9696543,"size":443751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f56e61e30265944da239847253a91297c9c12d25&amp;dn=A+Billionaire+Romance+%28Our+Song+Books+1-2%29+by+Emma+South+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AtomTPB","files":2,"time":1393943000,"description":"Writing Our Song: A Billionaire Romance (Our Song #1) by Emma South \nFor aspiring singer, Beatrice Hampton, the future used to be a sweet thing to look forward to, filled with the kind of joy you could write a song about. However, after losing her parents while still in high school, she is left crushed, alone, and harboring a bitter resentment towards the wealthier members of society, whom she partially blames for the destruction of her hopes and dreams. After years of lonely struggle, she can hardly remember the last time she felt happy.\n\nThat's when she literally stumbles into billionaire Jeremy Holt and things take another turn for the unexpected. Seeking only a temporary escape from the cold and grey confines of her life, Beatrice agrees to go with Jeremy on a short trip to New Zealand. On the surface Jeremy is the exact kind of man she promised herself she would never fall for but, after spending some time with him, she realises that maybe there's a lot more to the successful young entrepreneur than his money. Maybe he's the one person that can make her feel alive again.\n\nBeatrice can't deny the spark, the chemistry, between the two of them but her past still haunts her. To be with Jeremy she must face the stresses of life in the public eye and the guilt of broken promises to herself and her parents. To be without him is almost too painful to bear. Will Beatrice and Jeremy get the chance to write the song of their love, or will they each be left with the memory of a beautiful but all too brief time when their lives intertwined?\n\nimage\n\nRemember Our Song: A Billionaire Romance (Our Song #2) by Emma South\nBeatrice Holt seems to have it all. She's got a passionate and loving marriage to the perfect man, billionaire Jeremy Holt, and all the opportunities and financial security that comes with it. However, life wasn't always so wonderful. When a tragic accident results in amnesia, she is effectively transported back to a time when all her emotional wounds are still causing her intense pain. She can't remember how those wounds were healed the first time around, she can't remember her marriage, she can't remember the man behind the money at all. All she sees in Jeremy is the very kind of man she swore she would never fall for.\n\nCan Jeremy find a way to make her fall in love with him all over again and make lightning strike twice? Can he help Beatrice remember their song or has their one chance for happiness slipped through their fingers?","torrent":{"xt":"urn:btih:f56e61e30265944da239847253a91297c9c12d25","amp;dn":"A+Billionaire+Romance+%28Our+Song+Books+1-2%29+by+Emma+South+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f56e61e30265944da239847253a91297c9c12d25","infoHashBuffer":{"type":"Buffer","data":[245,110,97,227,2,101,148,77,162,57,132,114,83,169,18,151,201,193,45,37]},"announce":[],"urlList":[]}}