{"title":"My Mobile - August 2016 (gnv64)","uid":15492667,"size":20241951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f576ba065db2e070c251abf2e6c944b8e40debd9&amp;dn=My+Mobile+-+August+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":4,"time":1470390016,"description":"My Mobile - August 2016\r\nEnglish | 148 pages | True PDF | 19.3 mb\r\n\r\n20 JUST IN\r\nWe take a closer look at all new Xperia X Performance, Samsung Galaxy On 5Pro and Galaxy On 7 Pro, and Gionee F103 Pro.\r\n26 CELL SPEAK\r\nWhat those who matter in the world of tech are saying.\r\n28 LEAD STORY \r\nWe take a look at the super phones - the best smartphones available in the market right now.\r\nSPOTLIGHT\r\n40 Single Brand Retail Boost: How 100 per cent FDI will help the businesses in India.\r\n54 Reliance Jio: A Revolution Cometh? We try to evaluate company’s future plans and strategies.\r\n62 Pokemon Go: A game which has once again sparked interest in augmented reality. We take a closer look\r\n92 Gadgets from abroad: We look at some amazing gadgets you can buy when travelling abroad\r\nINFOCUS\r\n42 We try to understand the darker side of the Internet, which only a handful of people know\r\n50 What is Project Tango? We try to explain Google's revolutionary concept in simple terms.\r\n66 Is the future for phones a modular one? We look at attempts to make phones modular, past and present.\r\n44 CHIEF SPEAK\r\nManu Jain, Xiaomi’s India head talks about the company’s second anniversary and future\r\nplans.\r\nFACE TO FACE\r\n48 Arvind Vohra, CEO &amp; Managing Director, Gionee India, talks about the brand’s future plans\r\n52 Rakesh Deshmukh, Co- Founder and CEO, Indus OS talks about the operating system that beat Apple iOS in terms of market share in India.\r\n58 syed tajuddin, CEO, Coolpad India on the company’s key achievements, expansion of 4g infrastructure and more\r\n64 Rohan shravan, Founder and CEO, Notion Ink, talks about the brand’s thrust areas, services offered and more\r\n96 sudhir Kumar, CEO, itel Mobile India, speaks on how the brand will make its presence felt in the country\r\n57 JARGON BUSTER\r\nEverything you need to know about CDLa audio technology\r\nSNAPSHOT\r\n60 HP spectre 13: a quick look at one of the sleekest laptops of recent times\r\n94 Oppo F1 Plus FC Barcelona Edition: a phone made for FCBand football - fans\r\n100 All-New Kindle: A quick look at Amazon’s new budget Kindle\r\n90 GAME ZONE\r\nDoom: the cult game returns, and unleashes hell. again. Our review.\r\n98 VERSUS\r\nthe great Photo Filter Battle features new underdog Prisma and the established Instagram\r\n102 BOREDOM BUSTERS\r\nKick some footballs in Ronaldo Kick’N’Run, wreak havoc on roads in Crazy Car Chase, enjoy the classic Pac-Man and more…\r\n107 SMART APPS\r\nEdit images using adobe Photoshop Mix, test your mobile internet speed through tRaI's Myspeed, get updated news smartly with smartNews and more…\r\n134 ETCETERA\r\nLogitech Wireless Mouse, Xiaomi Mi Band 2, Moto g turbo Virat FanBox, asus’s new gaming laptop, and much more…\r\n146 VANTAGE POINT\r\nashish gupta, Country Head India, sri Lanka &amp; Bangladesh, gameloft, speaks his mind about in-gaming advertising and its potential.\r\n\r\nBurn Tests\r\n69 INTEX AQUA VIEW\r\n70 HTC DESIRE 630\r\n72 PANASONIC ELUGA NOTE\r\n74 XIAOMI MI MAX\r\n76 LEECO LE 2\r\n78 HTC DESIRE 825\r\n80 SAMSUNG GALAXY J2 (2016)\r\n82 SONY XPERIA X\r\n84 HTC 10\r\n86 NOTION INK ABLE\r\n\r\nStyle Notes\r\n10 LETTERS\r\n12 NEWS\r\n16 MOBILE DOCTOR\r\n18 RUMOR MILL\r\n113 MY GUIDE\r\n \nhttps://s31.postimg.org/ym5gcx0wb/My_Mobile_August_2016.jpg","torrent":{"xt":"urn:btih:f576ba065db2e070c251abf2e6c944b8e40debd9","amp;dn":"My+Mobile+-+August+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f576ba065db2e070c251abf2e6c944b8e40debd9","infoHashBuffer":{"type":"Buffer","data":[245,118,186,6,93,178,224,112,194,81,171,242,230,201,68,184,228,13,235,217]},"announce":[],"urlList":[]}}