{"title":"Ragnar Benson Collection (OUT OF PRINT/RARE)","uid":8864056,"size":70785953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f646fa3fe86a697907599df60a105b821cabf919&amp;dn=Ragnar+Benson+Collection+%28OUT+OF+PRINT%2FRARE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Ritzbitts","files":12,"time":1377853043,"description":"Collection of rare, banned books. Download and seed before owning them becomes a crime!\n\n================================================================================\n\nBreath Of The Dragon - Homebuilt Flamethrowers\n\nDo you have a weapon in your arsenal that will hold off tanks or a small army of hostile people? What you need is a flamethrower. They're cheap; easy to build and maintain; and use common, inexpensive fuel. A recipe for napalm is included. One whiff of the dragon's breath will put attackers at your mercy.\n\n\n\nHome and Recreational Use Of High Explosives\n\nWho else but Uncle Ragnar could write this down-home guide? How to obtain commercial high explosives, safely storing and transporting them, detonation techniques, improvised explosives and more are woven in with tales of Ragnar's explosive adventures.\n\n\n\nHomebuilt Claymore Mines\n\nUntil recently, the technology for building claymores was inaccessible to the general public. But Uncle Ragnar has managed to put the pieces together, and here he presents a step-by-step guide to assembling them from basic over-the-counter supplies.\n\n\n\nHomemade C4 - A Recipe For Survival\n\nSurvivors know that the day may come when they need something more potent than dynamite. For blowing up bridges, shattering steel and derailing tanks, they need C-4. But it is not available in the U.S., so find out how to make your own by following Ragnar's step-by-step instructions.\n\n\n\nHomemade Detonators\n\nRagnar presents the missing piece of the improvised-explosives process - how to make homemade blasting caps! This simple 3-step method requires only 3 drugstore chemicals, a handful of scrap hardware and common tools. \n\n\n\nHomemade Grenade Launchers\n\nLet Uncle Ragnar walk you through these simple step-by-step plans for making an M79 or M203 in your own workshop! All it takes is ordinary tools and some pipe, washers, nuts and bolts. Reloading info for 40mm ammo and BATF guidelines are included.\n\n\n\nMantrapping\n\nThis is the first book ever published to explain how to capture that most dangerous animal: man. Based on Ragnar's own mantrapping experiences while on special assignments in Asia, Africa, North and South America and Cuba, this gut-wrenching book covers such mantraps as the Malaysian Hawk, the Andes Mountain Trail Trap, the Sheepeater's Rock Fall and the Cuban Water Trap. To know how to trap your enemy is to know how to avoid being trapped yourself.\n\n\n\nNew and Improved C-4\n\nThis book is for all those readers of the original Homemade C-4 who wrote to ask for alternatives that eliminated the need for costly, hard-to-find ingredients, especially nitromethane. These recipes are dirt-simple; feature widely found, inexpensive, unregulated chemicals and can be assembled in no time.\n\n\n\nRagnar's Ten Best Traps\n\nCatch even the craftiest critters with the trap lore perfected over generations. Ragnar has culled his all-time favorite traps that are easy to build, easy to maintain and guaranteed to work! Detailed illustrations show you how to build a floating duck snare, den trap, live-mouse set, campfire set and fish trap, to name just a few. And with Ragnar's expertise at hand, you can avoid the baits and sets that don't work and never have.\n\n\n\nThe Modern Survival Retreat - A New and Vital Approach to Retreat Theory and Practice\n\nModern retreaters have a new enemy to fear - our own government. In this companion to the classic book The Survival Retreat, Ragnar answers such vital questions as how to identify exactly who threatens your freedom, when to occupy your retreat and how to fight the government when it goes hard-core against you.\n","torrent":{"xt":"urn:btih:f646fa3fe86a697907599df60a105b821cabf919","amp;dn":"Ragnar+Benson+Collection+%28OUT+OF+PRINT%2FRARE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f646fa3fe86a697907599df60a105b821cabf919","infoHashBuffer":{"type":"Buffer","data":[246,70,250,63,232,106,105,121,7,89,157,246,10,16,91,130,28,171,249,25]},"announce":[],"urlList":[]}}