{"title":"The Guns of August.pdf","uid":7266820,"size":87999316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6a9da04c948eb597fc695bfe13c35cad4deb0bb&amp;dn=The+Guns+of+August.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"baboo456","files":1,"time":1336924338,"description":"Writing with a clarity, grace, and novelistic sweep rare among historians, Barbara W. Tuchman (1912-1989) distilled the complex interplay of personalities and events into gripping narratives that fuse rigorous scholarship with elegant literary art. Here are her best works, The Guns of August (1962) and The Proud Tower: The Portrait of the World Before the War, 1890-1914 (1966). Her Pulitzer Prize-winning best seller The Guns of August offers a majestic orchestration of the diplomatic and military history of the crucial first weeks of World War I. Together this two books have shaped our understanding of the outbreak of World War I and its complex origins in politics and culture. Her Pulitzer Prize-winning best seller The Guns of August offers a majestic orchestration of the diplomatic and military history of the crucial first weeks of World War I. Her following book, The Proud Tower: A Portrait of the World before the War, 1890-1914, brilliantly explores subjects ranging from international socialism and anarchism to the Dreyfus Affair in France and the birth of American imperialism that collectively set the stage for the cataclysm of 1914.","torrent":{"xt":"urn:btih:f6a9da04c948eb597fc695bfe13c35cad4deb0bb","amp;dn":"The+Guns+of+August.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a9da04c948eb597fc695bfe13c35cad4deb0bb","infoHashBuffer":{"type":"Buffer","data":[246,169,218,4,201,72,235,89,127,198,149,191,225,60,53,202,212,222,176,187]},"announce":[],"urlList":[]}}