{"title":"Louis Armstrong - Hot Fives and Sevens (Vol. 1-4)","uid":4638424,"size":265911914,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f703e01d2646282e9ab754f42f7dd4ef86ac292f&amp;dn=Louis+Armstrong+-+Hot+Fives+and+Sevens+%28Vol.+1-4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"SatchMo7","files":93,"time":1231630990,"description":"This is basically Louis Armstrong's best work from his best years. From the review below, &quot;It's almost impossible to overrate this material.&quot; I hope this gets spread far and wide, it is certain to bring joy to the heart of even the most jaded music fan. This stuff would be way more popular if people just had a chance to hear it. It's 80 years old but crazy as anything you have ever heard.\n\n*******\n\n\nBetween 1925 and 1929, Louis Armstrong created one of the first great bodies of work in jazz. While he worked regularly as a soloist with big bands, he began his career as a leader with the first all-star studio group in jazz, the Hot Five. The other four musicians were Armstrong's wife, Lil Hardin Armstrong, on piano; Johnny Dodds on clarinet; Kid Ory on trombone; and Johnny St. Cyr on banjo. The music's first great soloist, Armstrong was reshaping jazz by sheer improvisational magic, gradually diminishing the role of the traditional New Orleans ensemble with the clarion brilliance of his trumpet. Possessing an uncanny blend of exuberance and creativity, he combined virtuosic declarations with a talent for the subtlest shifts in phrasing and melodic variation, creating rich emotional statements that could hint at loss in the midst of joy or the promise of better things in the most sorrowful blues. The band expands here, to the Hot Seven and larger ensembles, and it gains soloists who applied Armstrong's lessons to their own instruments--musicians such as pianist Earl Hines and trombonist Jack Teagarden--but all come under the imprint of Armstrong's flowering genius, as both trumpeter and singer.\n\nIt's almost impossible to overrate this material. It may be the most influential music in jazz history, establishing standards for originality and sustained invention that have rarely been matched. The JSP set is a superb reissue of Armstrong's essential work. The remastering is by John R.T. Davies, widely acknowledged as the dean of engineers in the field of early jazz, and the resultant sound is simply the best this work has ever enjoyed. There are alternate takes of the later material on Columbia Legacy (including Louis in New York and St. Louis Blues), so collectors will want both. But this recording is superior listening, at a price that also makes it an ideal introduction to one of the few titans of jazz. --Stuart Broomer","torrent":{"xt":"urn:btih:f703e01d2646282e9ab754f42f7dd4ef86ac292f","amp;dn":"Louis+Armstrong+-+Hot+Fives+and+Sevens+%28Vol.+1-4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f703e01d2646282e9ab754f42f7dd4ef86ac292f","infoHashBuffer":{"type":"Buffer","data":[247,3,224,29,38,70,40,46,154,183,84,244,47,125,212,239,134,172,41,47]},"announce":[],"urlList":[]}}