{"title":"Esben and the Witch - Wash the Sins... (2013) [FLAC]","uid":8068864,"size":291979175,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f7c7c65e7543291156d4809d6de2fe3654c1cbf6&amp;dn=Esben+and+the+Witch+-+Wash+the+Sins...+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1359231158,"description":"\n  Esben and the Witch - Wash the Sins... (2013) [FLAC]\n\n\n  Album: Was the Sins, Not Only the Face\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Indie Rock, Alternative, Singer/Songwriter\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Iceland Spar\n  02 Slow Wave\n  03 When That Head Splits\n  04 Shimmering\n  05 Deathwaltz\n  06 Yellow Wood\n  07 Despair\n  08 Putting Down the Prey\n  09 The Fall of Glorieta Mountain\n  10 Smashed to Pieces in the Still of\n\n  On their debut album, Violet Cries, Esben and the Witch excelled at creating a mood that was equally bewitching and ominous. When this mood collided with a memorable melody or hook, it showed just how powerful the band could be; on Wash the Sins Not Only the Face, they deliver on that promise with more nuance and more confidence. The trio hasn't changed any one thing; instead, they've made everything better, bringing a precision to their music that hones its icy mystery and delivering more structured songs that paradoxically let Esben and the Witch soar even higher than before on &quot;When That Head Splits.&quot; \n\n  And while the band still balances more active tracks like that and the churning &quot;Despair&quot; with interludes such as &quot;Deathwaltz,&quot; on Wash the Sins they lose much less momentum switching gears between them. Indeed, Esben's dynamic control may be the biggest step forward between this album and their debut, allowing them to pull off hushed songs like &quot;Shimmering&quot; and the melting &quot;The Fall of Glorieta Mountain&quot; that rival the xx in their restraint and epics such as &quot;Smashed to Pieces in the Still of the Night&quot; that approach the majesty of post-rock masters like Mogwai and Godspeed You! Black Emperor. Yet as much as they've streamlined their sound on Wash the Sins, Esben and the Witch haven't lost the fairy-tale quality to their music that evokes castles surrounded by dark forests, and brave knights and maidens going on dangerous journeys. \n\n  Throughout the album, the lyrics suggest that the character(s) in these songs might be going on a perilous quest, albeit a possibly internal one. Rachael Davies' voice, like everything else on Wash the Sins, is more commanding and compelling than on Violet Cries, and her throaty vulnerability recalls Chelsea Wolfe as well as some of PJ Harvey's more ethereal work. Her twinned vocals on most of the songs suggest a struggle for identity and self-truth as she falls &quot;between two faces&quot; on &quot;Slow Wave&quot; and sings &quot;I am one with you now&quot; on the gory ballad &quot;Putting Down the Prey.&quot; The opposite of a sophomore slump, Wash the Sins Not Only the Face is sleek and spectral, and finds Esben and the Witch casting their spell even more successfully.","torrent":{"xt":"urn:btih:f7c7c65e7543291156d4809d6de2fe3654c1cbf6","amp;dn":"Esben+and+the+Witch+-+Wash+the+Sins...+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c7c65e7543291156d4809d6de2fe3654c1cbf6","infoHashBuffer":{"type":"Buffer","data":[247,199,198,94,117,67,41,17,86,212,128,157,109,226,254,54,84,193,203,246]},"announce":[],"urlList":[]}}