{"title":"Tom Clancy - Command Authority","uid":9610930,"size":772867072,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f8024948ebd971fce9f1c6322720323dc30aebd6&amp;dn=Tom+Clancy+-+Command+Authority&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"BosuxRedsux","files":-1,"time":1392317077,"description":"Command Authority is the 14th novel comprising the Jack Ryan Sr/Jack Ryan Jr franchise catalog, which began with The Hunt for Red October, published in 1984, and I have followed the series since that time. For me, Command Authority was a compelling read.\n\nThe story first takes us back 30 years, to a meeting between a GRU Special Forces Captain and a special member of the KGB. The purpose of this meeting is not fully revealed until much later as events unfold, piece by piece. Present day finds Jack Ryan Jr in London working on not military or political but financial intelligence - and a case involving Russian intelligence and criminal elements that will ultimately lead him into the upcoming fray. Meanwhile, Ryan Sr meets with a former foe and now friend (a retired SVR chief) at the White House, who warns the president that the new Russian chief-of-state seeks to return his country to the days of old - just prior to dying due to being poisoned with a radioactive isotope. In Moscow, a Croatian assassin takes the fall after pulling off a devastating bombing that takes out someone in addition to, and much more important than the &quot;targeted&quot; UK finance man (and former British agent) - the current head of the SVR. Thus, the stage is set for another action-packed, political/espionage thriller in this series.","torrent":{"xt":"urn:btih:f8024948ebd971fce9f1c6322720323dc30aebd6","amp;dn":"Tom+Clancy+-+Command+Authority","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8024948ebd971fce9f1c6322720323dc30aebd6","infoHashBuffer":{"type":"Buffer","data":[248,2,73,72,235,217,113,252,233,241,198,50,39,32,50,61,195,10,235,214]},"announce":[],"urlList":[]}}