{"title":"Meditation DVD 2010 - Meditactics - Science Health Sprituality","uid":5723364,"size":4692706198,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f84e450e60b5aaf712fc6b3196308a24cfcd32a6&amp;dn=Meditation+DVD+2010+-+Meditactics+-+Science+Health+Sprituality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"plaidfish","files":992,"time":1280365739,"description":":::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n:                                                                              :\n:  This torrent contains very long path names.                                 :\n:  Save the files to C: to avoid problems with too long paths.                :\n:  See http://bayimg.com/kAnCgAAcP about this issue.                           :\n:  For more info about HOW TO DOWNLOAD THE DVD go to the end of this text.     :\n:                                                                              :\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n \n \n \n /----------------------------------------------------------------------------\n/+-----------------------------The Meditactics--------------------------------+\n||                                                                            ||\n||                                                                            ||\n||                           M E D I T A T I O N                              ||\n||                           '''''''''''''''''''                              ||\n||                                                                            ||\n||                         from the perspective of                            ||\n||                                                                            ||\n||                     SCIENCE - HEALTH - SPIRITUALITY                        ||\n||                                                                            ||\n||                                                                            ||\n||                                                                            ||\n+----------------------------- 2010 VERSION ---------------------------------+/\n -------------------------------- *FINAL* -----------------------------------/\n \n \nThis is the NEW, UPDATED, and absolutely FINAL 2010 version of The Meditation\nDVD. The earlier 2008 version, now extremely outdated, is rubbish compared to\nthis version. The old one contained 397 files. The new one contains 991 files. \nThis 2010 new version is tagged &quot;Meditactics&quot; while the outdated lacks this tag.\n \n1000's of hours of work have gone into designing this DVD.\n \n--------------------------------------------------------------------------------\n           But first watch the groovy and very informative video trailer \n        about the DVD and the project. The trailer is all over the internet \n                         and also included on the DVD.\n--------------------------------------------------------------------------------\n \nWHAT IS THIS?\n  This is a complete guide to meditation in both theory and practice for \neveryone. From the complete beginner to the expert. It is also an extensive \nlibrary on meditation, containing material from some of the absolute best \nscientists and teachers in the world, all recognised experts on the complex \ntopic of meditation.\n \n \nIt contains:\n10 Hours Video (29 Video Clips)\n97 Hours Audio (28 Audio books on 91 CDs converted to mp3 files)\n10 000 pages of eBooks,\n \n... all this on ONE single DVD\n(or put the files on your hard drive, usb-stick etc).\n \n \n  Check out the very user friendly and well designed manual/booklet (60 pages!)\n  Online preview version:\n &lt;a href=&quot; https://ssl.vuzit.com/s/lpif?sid=CzulcMIpXmU04GdEe3rhJvrQGFBWGFMP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://ssl.vuzit.com/s/lpif?sid=CzulcMIpXmU04GdEe3rhJvrQGFBWGFMP&lt;/a&gt;\n  The manual is of course included on the DVD.\n \n \nHMM, BUT WHO CARES ABOUT MEDITATION ANYWAY?\n  If you enter the word &quot;meditation&quot; on an internet search engine you will get\nabout 30 million hits. Jon Kabat-Zinn's talk at Google Tech Talk about mind-\nfulness meditation has been watched by over 600,000 people onThere\nare now more than 200,000 research papers about meditation on the world's\nbiggest medical database PubMed. Anyone with a human brain and a nervous system\nseems to benefit from meditation according to modern science. And we are not \ntalking about some flaky pseudo-science here, but about ordinary clinical main-\nstream medicine. So, although the reason why people are interested in meditation\nmight differ a lot, the benefits are for everyone, and they are many.\n \nMind training has been studied and proved helpful in the many areas: \n\n     PERFORMANCE - Efficiency, productivity and creativity, attention, \n                   transforming habits\n   SOCIAL SKILLS - Communication, conflict management, kindness, \n                   social courage\n PHYSICAL HEALTH - Sleep quality, pain management, immune system, \n                   stress reduction, skin health\n   INNER BALANCE - Empathy, emotional stability, concentration, \n                   stress management, spiritual development, anger management, \n                   dealing with depression\n \nEvery single claim above is supported by academic references on the DVD.\n\n \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n------------                       F A Q                            ------------\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n \nWHY SO *MUCH* STUFF?\n  There are so many kinds of people. Material which suits one person may not be \nappreciated at all by another. We want to give you the whole range and depth of \nmeditation. If you give this DVD to someone they get the most complete\nintroduction imaginable. It is still equally beneficial for the expert.\n \nBUT WILL I NOT GET TOTALLY LOST IN ALL THAT MATERIAL?\n  No, you won't. The carefully designed and indexed colour booklet, complete\nwith screenshots, detailed info, tagging and much more will guide you along, \naccording to your liking and taste. Everything from really simple topics to the\ncomplicated and advanced material are indexed so you won't get lost in any way.\n \nSO WHAT ABOUT THE SCIENCE, HEALTH AND SPIRITUALITY PERSPECTIVES? DO YOU TRY TO\nCOMBINE ALL THREE OF THEM INTO A BIG UNIFIED WHOLENESS?\n  No, we don't. You can choose to do that, or NOT to do that. We just noticed\nthat people like meditation for different reasons, be it scientific, health-\noriented or spiritual. We wanted to make everybody happy by giving them all\nthree dishes, the best ones we could find. So, you pick the pieces you\nwant. We are agenda free. Use what you find helpful and discard the aspects\nwhich you do not find of value. Furthermore, it is not the intention of the\ndesigners to promote any particular religion, scientific organization,\nmovement, or belief system whatsoever.\n \nWHO ARE YOU PEOPLE?\n  We hardly know ourselves. From the viewpoint of both Western and Eastern\nphilosophy that really is not a easy question to answer at all.\n \nWHY DID YOU DO ALL THIS?\n  Because Meditation rocks! And we want to make you glad.\nAnd also to contribute towards making the world a bit more sane. Our way of\ndoing this is to provide powerful theoretical frameworks plus practical tools\nwhich can be used to train and develop a healthier, sharper and more caring\nmind. Our hope is that this DVD will be interesting, amusing and helpful.\n \nBUT REALLY, WHAT IS THE BIG FUSS ABOUT?\nWhether we are talking about individual or collective well-being one thing is\ncertain: just as our cultural environment affects our inner worlds the opposite\nis equally true; our interior structures, our states of mind, do affect behav-\niour and external structures and therefore society. It is a dialectic relation\nand not a one way lane, and meditation according to some theorists is the\nquickest and most certain means for internal growth. Plus it has neurological, \nbehavioural and psychotherapeutic data to support its effectiveness.\n  It goes without saying that meditation/mind training has a great capacity to\ndeal with an impressive variety of both individual and social problems in an\nextremely cost effective way. This is equally true to other kinds of education\nin general. Meditation should not be understood as some kind of egocentric\nanti-worldly navel-gazing, but as a practice that has effects on many social-\nrelational aspects of life.\n \nSO YOU MEAN MEDITATION CAN BE BENEFICIAL IN MANY DIFFERENT FIELDS?\n  Only if we were complete idiots would we believe that all problems in the\nworld would disappear because of mind training. But it would likewise be quite\nignorant not to use and benefit from, and further evaluate, its range of effec-\ntive potentials. There is a huge need in our society to generate healthier,\nmore compassionate and insightful ways of responding to our life conditions.\nAnyone who watches the evening news notices this. The quality of mind\ndetermines the quality of behavior. And the quality of how we act in turn\ndetermines the rules of social conduct which shape our culture, thus giving\nrise to the kind of society we will have to live in, as well as conform to.\nMany other important factors besides mind-training, are necessary to examine\nand apply on a practical level. If this will happen there is a slight chance to\nmake both individuals and societies in this world evolve in a little bit less\nmiserable way.\n \nWOW, THIS DVD REALLY ROCKS! CAN I HELP THE PROJECT SOMEHOW?\n  Oh, yeah! That is certain. Use your imagination. There are many ways. You \nmight like to help distribute the DVD. Or you might like to buy a few empty DVD \ndiscs, burn copies and share them around. Or you could share it on the net.\nSpreading the word is also extremely helpful! If you like you could write a\nreview of the DVD on your blog. Facebook about it! Tweet it!\n \nWHY SHARE THIS DVD?\n  There are numerous reasons why you might want to distribute or copy this DVD.\nPerhaps you want someone to enjoy some of the experiences you have had.\nPerhaps you have a friend or relative who would be helped by specific parts of\nthe DVD. Perhaps you know someone who is interested in personal development, or\nsomeone who is depressed or suffers from physical pain.\n \n \n \n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n \n                     The effect of this DVD on our culture\n                   equals the effort we put into sharing it.\n \n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n \n \n \nUNBIASED QUALITY GUARANTEE\n  Most of the people featured on this DVD are either M.D.s or professionals with\nPhDs in the subjects they teach. The few without academic qualification are\nacknowledged meditation masters, including nuns and monks, who have devoted\ntheir entire lives to intense and skilful practice. Both scientists and\npersons committed to different spiritual traditions are represented. What they\nhave in common is that they are all recognised experts on the complex topic of\nmeditation. Thus it can be clearly stated that this product in no way promotes\neither strange cults or suspicious swindlers, i.e. individuals or organizations\nwho try to make a quick profit on the basis of the recent popularization of\nmeditation in the public consciousness.\n \n \n     /-------------------------------------------------------------------\n     |   This DVD might be copied, downloaded, and distributed freely.   |\n     |                    It should never be sold.                       |\n     -------------------------------------------------------------------/\n \n \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n                            HOW TO DOWNLOAD THE DVD\n                      (In case you don't already know how)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThis is easy. 2 steps.\n \n1) Download and install a torrent client. For instance www.utorrent.com\n   For instance www.utorrent.com (Windows and Mac). It is completely free\n   of charge, just like the DVD itself. This will take you less than 5 minutes.\n \n \n2) Search for Meditactics on a torrent search page, like this one,\n   (or search for &quot;meditactics torrent&quot; on google) or in the utorrent program's\n   search area. Download and open the meditactics torrent file from the torrent\n   torrent search page. The download of the DVD begins when it is opened in\n   uTorrent.\n \nFor additional info or help about how to download using utorrent\n  go to http://www.utorrent.com/documentation/beginners-guide )","torrent":{"xt":"urn:btih:f84e450e60b5aaf712fc6b3196308a24cfcd32a6","amp;dn":"Meditation+DVD+2010+-+Meditactics+-+Science+Health+Sprituality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f84e450e60b5aaf712fc6b3196308a24cfcd32a6","infoHashBuffer":{"type":"Buffer","data":[248,78,69,14,96,181,170,247,18,252,107,49,150,48,138,36,207,205,50,166]},"announce":[],"urlList":[]}}