{"title":"Ethics in Public Administration: A Philosophical Approach","uid":6544110,"size":9095225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f88e571e11c1874511879cc6d207d4d15c80acf5&amp;dn=Ethics+in+Public+Administration%3A+A+Philosophical+Approach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"_F1_","files":-1,"time":1310796577,"description":"Ethics in Public Administration: A Philosophical Approach\n Praeger Publishers | April 30, 1993 | ISBN-10: 0275943119 | 184 pages | PDF | 8.6 MB\n\n Ethics in Public Administration provides public administrators with a theoretical knowledge of ethical principles and a practical framework for applying them. Sheeran reviews the place of ethics in philosophy, links it to political and administrative theory and practice, and analyzes the ethical theories and concepts from which ethical principles are derived. Before delving into ethics as part of philosophy, Sheeran provides the reader with a brief overview of philosophy and its principal subjects, including ontology, epistemology, and psychology. He offers several definitions of ethics, and discusses both the objectivist (absolutist) and interpretivist (&quot;situation ethics&quot;) perspectives. Sheeran focuses on the subject matter of ethics, human actions, and their morality, exploring Natural Law, man-made law, and conscience as sources for determining the morality of human action. In later chapters, he applies his discussion of ethics to such controversial policy issues as suicide, murder, abortion, sterilization, capital punishment, war, lying, and strikes. Recommended for graduate and upper division undergraduate courses in public administration, public policy, management, and administrative behavior.","torrent":{"xt":"urn:btih:f88e571e11c1874511879cc6d207d4d15c80acf5","amp;dn":"Ethics+in+Public+Administration%3A+A+Philosophical+Approach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f88e571e11c1874511879cc6d207d4d15c80acf5","infoHashBuffer":{"type":"Buffer","data":[248,142,87,30,17,193,135,69,17,135,156,198,210,7,212,209,92,128,172,245]},"announce":[],"urlList":[]}}