{"title":"Ian Watt - Literary History and Criticism (3 books)","uid":9131281,"size":8843892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8a1990bc686254ca49472189caacc33fbb652d0&amp;dn=Ian+Watt+-+Literary+History+and+Criticism+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"workerbee","files":-1,"time":1383324195,"description":"IAN WATT (1917 - 1999) was an internationally acclaimed literary critic, literary historian and professor of English at Stanford University.\n\nWatt's most famous work, THE RISE OF THE NOVEL (1957), is considered by many contemporary literary scholars as the seminal work on the genesis and development of the novel and an important study of literary realism.  It traces the interworkings of social conditions, changing attitudes, and literary practices during the period when the novel emerged as the dominant literary form of the individualist era.\n\nIn MYTHS OF MODERN INDIVIDUALISM (1996), Watt examines the myths of Faust, Don Quixote, Don Juan and Robinson Crusoe, as the distinctive products of modern society.  The four figures help to reveal the problems of individualism in the modern period: solitude, narcissism, and the claims of the self versus the claims of society.  They all pursue their own view of what they should be, raising strong questions about their heroes' character and the societies whose ideals they reflect.\n\nESSAYS ON CONRAD (2000) is a collection of Watt's most characteristic essays on the work of Joseph Conrad.  Watt's own philosophy, as well as his insight into Conrad's work, was shaped by his experiences as a prisoner of war on the River Kwai.  His moving account of these experiences completes this essential collection.\n\n\nThe books are a mix of PDF and EPUB/MOBI formats as follows:\n\n* ESSAYS ON CONRAD (Cambridge University Press, 2000) -- PDF\n\n* MYTHS OF MODERN INDIVIDUALISM: FAUST, DON QUIXOTE, DON JUAN, ROBINSON CRUSOE (Cambridge University Press, 1996) -- PDF\n\n* THE RISE OF THE NOVEL: STUDIES IN DEFOE, RICHARDSON AND FIELDING (Pimlico, 2000) -- EPUB &amp; MOBI\n","torrent":{"xt":"urn:btih:f8a1990bc686254ca49472189caacc33fbb652d0","amp;dn":"Ian+Watt+-+Literary+History+and+Criticism+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a1990bc686254ca49472189caacc33fbb652d0","infoHashBuffer":{"type":"Buffer","data":[248,161,153,11,198,134,37,76,164,148,114,24,156,170,204,51,251,182,82,208]},"announce":[],"urlList":[]}}