{"title":"Factorio v0.13.16 - MacOS","uid":15584006,"size":290686846,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:f90926ca88b1190e4c535d1ddd9bad5371781aad&amp;dn=Factorio+v0.13.16+-+MacOS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"BlueMane","files":3,"time":1471442455,"description":"Factorio v0.13.16\r\n\r\n\r\nFactorio is a game about mining resources, planning and building factories, automating production, and fighting enemies Native to the planet. You are a survivor from a space colonization effort gone awry, and you find yourself alone on the surface of a hostile alien planet. With nothing but the Raw Resources at your feet, the only hope for survival is to build your automated machines and factories from the ground up to produce the equipment and defenses needed for survival on this strange world. Apart from efficiently designing and maintaining your army of machines, you will need to protect your factory and yourself from the unfriendly alien hordes who seek to destroy your automatons and remove you from the planet. \r\n\r\n\r\nRemember to Buy the Software you Like to Support the Developers.\r\nRemember to Seed the Torrents you Like to Support the Swarm.\r\n\r\n\r\nChangelog:\r\nv0.13.16\r\n\r\nChanges\r\n    Changed the personal roboport so it reacts faster to jobs in range.\r\n    Added graphics option &quot;Enable tree sprite mipmaps&quot; that should reduce GPU load when drawing large forests.\r\n    Changed default value of &quot;Lights render resolution&quot; graphics option to 0.25. High values of this setting have negative performance impact on drawing lamps.\r\n    When the first LUA command is used, players are warned that it would disable achievements.\r\n    Changed default renderer for AMD GPUs back to DirectX.\r\n    Rewritten sandbox scenario to work in multiplayer.\r\n\r\nBugfixes\r\n    Fixed rail signals getting sometimes stuck as reserved. (30093)\r\n    Fixed that the game would crash when trying to load a save that contained unit groups with members in different surfaces. (30541)\r\n    Fixed combinators not drawing lights for the activity led.\r\n    Reverted the change from Version: 0.13.12 that would disable and hide vsync in some cases. (30246)\r\n    Fix that biters wouldn't become aggravated when damaged by the flamethrower. (30689)\r\n    Fixed game sometimes not being focused properly on OS X. (30436)\r\n    Fixed that the car could shoot itself. (30782)\r\n    Fixed desync related to fast-replacing filter inserters with other inserters. (30753)\r\n    Don't remove a wall's circuit connection when gate is destroyed and ghost is created. (30733)\r\n    Fixed opened machine sound sometimes being high-pitched. (30702)\r\n    Fixed that some keybindings wouldn't register properly after a game restart. (30690)\r\n    Fixed that it would be possible to manually craft items the player does not have enough ingredients for. (30794)\r\n    Fixed playtime in public game browser being 0 for the first minute the server is up.\r\n    Fixed train path finding penalty for circuit network disabled signals.\r\n    Fixed rail planner collision checks for rails in west and south direction. (28638)\r\n    Fixed requester chest was missing vehicle impact sound. (30925)\r\n    Fixed that dragging the research button would drag and move the technology tree. (31049)\r\n    Fixed that the selected slot wouldn't update properly when the quickbar was rotated. (31058)\r\n\r\n\r\nModding\r\n    Fixed crash when mods use tables as key values in prototype data. (30606)\r\n    Added example definition of an electric energy interface.\r\n    Fixed copy&amp;paste on modded constant combinator would copy also number of item slots. (30908)\r\n    Fixed possible desync caused by inserters putting items directly to loaders.\r\n    Fixed loader wouldn't stop loading to chest marked for deconstruction.\r\n\r\n\r\nScripting\r\n    Fixed LuaEntityPrototype::resource_category crash. (30626)\r\n    Fixed changing force of construction or logistic robot would cause game state corruption. (30912)\r\n    Added LuaEntity::get_fuel_inventory().\r\n    Added event on_player_changed_surface.\r\n    Added LuaInventory::find_item_stack(...).\r\n    Added LuaControlBehavior::disabled read.\r\n    Added LuaVirtualSignalPrototype and LuaGameScript::virtual_signal_prototypes read.\r\n    Changed LuaEntity::get_filter()/set_filter()/filter_slot_count to work on both inserters and loaders.\r\n    Added an optional boolean to LuaSurface::spill_item_stack to mark the created items with the to-be-looted flag.\r\n    Added LuaSurface::get_connected_tiles(...).\r\n    Added LuaSurface::get_hidden_tile(...).\r\n    Changed Product::type to string containing &quot;item&quot; or &quot;fluid&quot;","torrent":{"xt":"urn:btih:f90926ca88b1190e4c535d1ddd9bad5371781aad","amp;dn":"Factorio+v0.13.16+-+MacOS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f90926ca88b1190e4c535d1ddd9bad5371781aad","infoHashBuffer":{"type":"Buffer","data":[249,9,38,202,136,177,25,14,76,83,93,29,221,155,173,83,113,120,26,173]},"announce":[],"urlList":[]}}