{"title":"Abraham Lincoln - Abraham Lincoln. Quotes, Quips, and Speeches [","uid":10152961,"size":4227283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9f8b6196d3ffd2980130450af1e12c24545186a&amp;dn=Abraham+Lincoln+-+Abraham+Lincoln.+Quotes%2C+Quips%2C+and+Speeches+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1400121372,"description":"Description\nProduct Details\nBook Title: Abraham Lincoln: Quotes, Quips, and Speeches\t\nBook Author: Abraham Lincoln (Author), Gordon Leidner (Editor)\nHardcover: 160 pages\nPublisher: Cumberland House (February 1, 2009)\nLanguage: English\nISBN-10: 158182677X\nISBN-13: 978-1581826777\n\n===================================================================================\nBook Description\nMore than 140 years since his death, the enduring legacy of a great president, an American success story, and the celebrated leader of the Civil War continues. Abraham Lincoln: Quotes, Quips, and Speeches captures the essence of the sixteenth president. In addition to Lincoln's own words, Gordon Leidner includes insights into the man by those who knew him best, from his wife, Mary Todd Lincoln, to his greatest political opponent, Stephen A. Douglas. Every quote is sourced in the end notes. Numerous photographs add to the charm and usefulness of the book.\n\n===================================================================================\nFrom the Inside Flap\n&quot;An easy and enjoyable introduction to one of America's greatest presidents and heroes.&quot; -Tom Schwartz, Illinois State Historian\n\n&quot;Gordon Leidner provides readers with a toothsome smorgasboard of Abraham Lincoln's wit and wisdom. This volume is an excellent introduction to the Great Emancipator's humanity, philosophy, humor, and eloquence. To supplement Lincoln's own memorable words, Leidner adds judicious comments by such eminent figures as Frederick Douglass, Theodore Roosevelt, and Booker T. Washington.&quot; -Michael Burlingame, Chancellor Naomi B. Lynn Distinguished Chair in Lincoln Studies, University of Illinois, Springfield\n\n&quot;Abraham Lincoln had the God-given talent to express himself in words that the people felt and understood. [This] book enables readers to sample ad touch the greatness of Lincoln through his letters, public papers, and speeches.&quot; -Edwin C. Bearss, Historian Emeritus, National Park Service.\n\n===================================================================================\nAbout the Author\nGORDON LEIDNER has been a student of the Civil War and of Abraham Lincoln for more than twenty-five years. The author of numerous articles on Lincoln and the Civil War and a member of the board of the Abraham Lincoln Institute, he is a Webmaster of several Lincoln sites and maintains the website GreatAmericanHistory.net.\n===================================================================================","torrent":{"xt":"urn:btih:f9f8b6196d3ffd2980130450af1e12c24545186a","amp;dn":"Abraham+Lincoln+-+Abraham+Lincoln.+Quotes%2C+Quips%2C+and+Speeches+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f8b6196d3ffd2980130450af1e12c24545186a","infoHashBuffer":{"type":"Buffer","data":[249,248,182,25,109,63,253,41,128,19,4,80,175,30,18,194,69,69,24,106]},"announce":[],"urlList":[]}}