{"title":"EyeTV 3.3.3 6040 (Mac OSX) with Serial","uid":5468451,"size":118394531,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f9f8e45b8d5447fcac46d4937b0de2199d133e39&amp;dn=EyeTV+3.3.3+6040+%28Mac+OSX%29+with+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artpepper","files":-1,"time":1269746894,"description":"EyeTV 3.3.3 (6040) - Mac Os X \n\nEyeTV lets you watch, record, edit, timeshift and archive TV on your Mac. With solutions for analog and digital television, and video quality options to meet differing customer needs.\n\nSystem Requirements:\n\nEyeTV 3.3.3 is a Universal application. It requires a Macintosh computer with built-in USB 2.0 ports, and Mac OS X 10.4.11 (Tiger) or later. We recommend Mac OS X 10.6.2 or later with all software and security updates installed.\n\nEyeTV 3.3.3 is fully compatible with Snow Leopard.\n\nVersion 3.3.3:\n\n64-bit Components\n\nEyeTV 3.3.3 contains several additional components that are running in Intel 64-bit mode. In addition to the H.264 video decoder, MPEG-2 video is decoded in 64-bit mode for both playback and export.\n\nEyeTV Sharing and EyeConnect now run in 64-bit mode.\n\nLearn more about 64-bit computing: http://www.apple.com/macosx/technology\n\nHow to tell if your Intel-based Mac has a 32-bit or 64-bit processor: http://support.apple.com/kb/HT3696\n\nBug Fixes:\n\nEyeTV 3.3.3 contains many bug fixes, improving performance and stability.\n\nHardware:\n\nImproved quality of analog recordings with EyeTV Hybrid (North America 2010) on Macs with Intel Core Duo processors 2.26 GHz and faster.\nImproved stability for the EyeTV Netstream DTT, EyeTV Hybrid 2010 (North America), and EyeTV Sat.\nImproved CAM reliability and support for EyeTV Sat.\nEyeTV Sat no longer accepts remote commands from unsupported remote controls.\nFixed a problem where analog channel names were not displayed when tuning with EyeTV Hybrid.\nRecordings\nImproved performance when loading large libraries.\nFixed crashes related to memory usage.\nFix a problem where an incorrect audio track was exported to program or elementary streams.\nImproved sort speed in Programs window.\nProgram Guide\nFixed a problem where shows longer than 3 hours would not show a title or episode title in the EPG.\nImproved details view for EPG.\nFixed a crash when clearing the EPG.\nProgram Guide searches are no longer case sensitive.\nImproved resiliency during EPG server outages.\n\nMisc:\n\nEyeTV 3.3.3 fixes video playback problems with EyeTV 3.3.2 in certain countries.\nFixed a crash when displaying Picture-in-Picture.\nFixed a problem during analog input capture where certain VHS players would show &quot;No Signal&quot; after a few seconds of fast forward or reverse.\nImproved picture quality of DV exports.\nEyeConnect now recognizes when the local IP Address has changed, and resumes working.\nFixed a problem where large channels list were deleted.","torrent":{"xt":"urn:btih:f9f8e45b8d5447fcac46d4937b0de2199d133e39","amp;dn":"EyeTV+3.3.3+6040+%28Mac+OSX%29+with+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9f8e45b8d5447fcac46d4937b0de2199d133e39","infoHashBuffer":{"type":"Buffer","data":[249,248,228,91,141,84,71,252,172,70,212,147,123,13,226,25,157,19,62,57]},"announce":[],"urlList":[]}}