{"title":"Make: More Electronics","uid":10125102,"size":79774137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb152e02aa148e1479ee6be3024a0198540ff191&amp;dn=Make%3A+More+Electronics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"fire_lizard","files":-1,"time":1399752899,"description":"Want to learn even more about electronics in a fun, hands-on way? If you finished the projects in Make: Electronics, or if you're already familiar with the material in that book, you're ready for Make: More Electronics. Right away, you'll start working on real projects, and you'll explore all the key components and essential principles through the book's collection of experiments. You'll build the circuits first, then learn the theory behind them!\n\nThis book picks up where Make: Electronics left off: you'll work with components like comparators, light sensors, higher-level logic chips, multiplexers, shift registers, encoders, decoders, and magnetic sensors. You'll also learn about topics like audio amplification, randomicity, as well as positive and negative feedback. With step-by-step instructions, and hundreds of color photographs and illustrations, this book will help you use -- and understand -- intermediate to advanced electronics concepts and techniques.\n\n-------------------------------------------------------------------------------------\nPDF and original AZW are included in this torrent\n\nPDF looks good, but I hope that someone will convert AZW much better than me","torrent":{"xt":"urn:btih:fb152e02aa148e1479ee6be3024a0198540ff191","amp;dn":"Make%3A+More+Electronics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb152e02aa148e1479ee6be3024a0198540ff191","infoHashBuffer":{"type":"Buffer","data":[251,21,46,2,170,20,142,20,121,238,107,227,2,74,1,152,84,15,241,145]},"announce":[],"urlList":[]}}