{"title":"Grooming, Gossip and the Evolution of Language - [Non-Fiction] P","uid":8891877,"size":6691867,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb7b5685a4fe246fbc16e5e940459c6a225a506f&amp;dn=Grooming%2C+Gossip+and+the+Evolution+of+Language+-+%5BNon-Fiction%5D+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"K-Slender","files":3,"time":1378599836,"description":"\n\nWhat a big brain we have for all the small talk we make. It's an evolutionary riddle that at long last makes sense in this intriguing book about what gossip has done for our talkative species. Psychologist Robin Dunbar looks at gossip as an instrument of social order and cohesion--much like the endless grooming with which our primate cousins tend to their social relationships.\n\nApes and monkeys, humanity's closest kin, differ from other animals in the intensity of these relationships. All their grooming is not so much about hygiene as it is about cementing bonds, making friends, and influencing fellow primates. But for early humans, grooming as a way to social success posed a problem: given their large social groups of 150 or so, our earliest ancestors would have had to spend almost half their time grooming one another--an impossible burden. What Dunbar suggests--and his research, whether in the realm of primatology or in that of gossip, confirms--is that humans developed language to serve the same purpose, but far more efficiently. It seems there is nothing idle about chatter, which holds together a diverse, dynamic group--whether of hunter-gatherers, soldiers, or workmates.\n\nAnthropologists have long assumed that language developed in relationships among males during activities such as hunting. Dunbar's original and extremely interesting studies suggest otherwise: that language in fact evolved in response to our need to keep up to date with friends and family. We needed conversation to stay in touch, and we still need it in ways that will not be satisfied by teleconferencing, email, or any other communication technology. As Dunbar shows, the impersonal world of cyberspace will not fulfill our primordial need for face-to-face contact.\n\nFrom the nit-picking of chimpanzees to our chats at coffee break, from neuroscience to paleoanthropology, Grooming, Gossip, and the Evolution of Language offers a provocative view of what makes us human, what holds us together, and what sets us apart.\n","torrent":{"xt":"urn:btih:fb7b5685a4fe246fbc16e5e940459c6a225a506f","amp;dn":"Grooming%2C+Gossip+and+the+Evolution+of+Language+-+%5BNon-Fiction%5D+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb7b5685a4fe246fbc16e5e940459c6a225a506f","infoHashBuffer":{"type":"Buffer","data":[251,123,86,133,164,254,36,111,188,22,229,233,64,69,156,106,34,90,80,111]},"announce":[],"urlList":[]}}