{"title":"And Here's the Kicker: Conversations with 21 Top Humor Writers o","uid":8946879,"size":1296251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbb939a07394b406394206e5ea7a583b4462e342&amp;dn=And+Here%27s+the+Kicker%3A+Conversations+with+21+Top+Humor+Writers+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1379796776,"description":"And Here's the Kicker: Conversations with 21 Top Humor Writers on their Craft\nby Mike Sacks\n\nDID YOU HEAR THE ONE ABOUT ?\nEvery great joke has a punch line, and every great humor writer has an arsenal of experiences, anecdotes, and obsessions that were the inspiration for that humor. In fact, those who make a career out of entertaining strangers with words are a notoriously intelligent and quirky lot. And boy, do they have some stories.\n\nIn this entertaining and inspirational book, you'll hear from 21 top humor writers as they discuss the comedy-writing process, their influences, their likes and dislikes, and their experiences in the industry. You?ll also learn some less useful but equally amusing things, such as:\n\nHow screenwriter Buck Henry came up with the famous ?plastics? line for The Graduate.\nHow many times the cops were called on co-writers Sacha Baron Cohen and Dan Mazer during the shooting of Borat.\nWhat David Sedaris thinks of his critics.\nWhat creator Paul Feig thinks would have happened to the Freaks &amp; Geeks crew if the show had had another season.\nWhat Jack Handey considers his favorite ?Deep Thoughts.?\nHow Todd Hanson and the staff of The Onion managed to face the aftermath of 9/11 with the perfect dose of humor.\nHow Stephen Merchant and Ricky Gervais created the original version of The Office.\nWhat it?s really like in the writers? room at SNL.\nFunny and informative, And Here's the Kicker is a must-have resource - whether you?re an aspiring humor writer, a fan of the genre, or someone who just likes to laugh.","torrent":{"xt":"urn:btih:fbb939a07394b406394206e5ea7a583b4462e342","amp;dn":"And+Here%27s+the+Kicker%3A+Conversations+with+21+Top+Humor+Writers+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbb939a07394b406394206e5ea7a583b4462e342","infoHashBuffer":{"type":"Buffer","data":[251,185,57,160,115,148,180,6,57,66,6,229,234,122,88,59,68,98,227,66]},"announce":[],"urlList":[]}}