{"title":"Wheeler Dealers Season 09 - All Episodes (Wikipedia Order)","uid":10019250,"size":4992157831,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fbbe8c605fb17a73dae9d437f8b82968169f4a18&amp;dn=Wheeler+Dealers+Season+09+-+All+Episodes+%28Wikipedia+Order%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"hpl1950","files":15,"time":1398186721,"description":"Wheeler Dealers Season 09 - All Episodes (Wikipedia Order)\n\nI simply joined some torrents already available to create this one and put everything into order.\n\n\n1 \t&quot;Fiat Dino Coupe 2400&quot; \t20 March 2012\n\nWork Completed: Distributor rebuilt: distributor cap contacts cleaned, new rotor arm bearing and centrifugal bob weights installed, track control arm bushings replaced, dents and scratches in the bodywork repaired and painted, Cromodora alloy wheels and chrome center hubcaps refurbished, original orange interior carpets replaced with specially made black carpets, center dash board and center console retrimmed with black vinyl.\nNotes: Purchased in Northern Italy. Allegedly seized by the Italian Police in 1970 and stored in a police warehouse till 2004. Restoration price includes Â£530 travel expense and a Â£200 credit from selling the orange carpets. Restored car brought to Millbrook Proving Ground for its test drive. \n\n\n2 \t&quot;Morgan +4&quot; \t27 March 2012\n\nWork Completed: New chassis fitted, new plywood floor panels fitted, rear suspension uprated with new Panhard rod, 4 leaf springs instead of 6 to soften the ride, tramp bars or traction bars and new shock absorbers, front suspension uprated with new brakes, hubs, shock absorbers, springs, and kingpins.\nNotes: Purchased from a specialist dealer who was selling the car on behalf of an American who could not import the car back to the U.S. when he moved. Included a tour of Morgan Motor Company plant in Malvern. \n\n\n3 \t&quot;BMW M5 E39&quot; \t3 April 2012\n\nWork Completed: New front suspension strut mounts fitted, worn alternator bearings replaced instead of buying whole new part. &quot;Angel eyes&quot; headlights and taillights from 2001 model year fitted,[6] auto-dimming rearview mirror and nearside rear view mirror replaced, bonnet repaired and resprayed, missing sound damping under the bonnet refitted, new air filters fitted and alloy wheels refurbished and painted in gunmetal metallic paint.\nNotes: Engine had claimed extra 30 hp via undisclosed means. Tyres were originally mismatched and worn and were changed but not revealed on show. Restored car achieved a top speed of 170 mph. Sold at asking price. \n\n\n4 \t&quot;Renault Alpine A310&quot; \t10 April 2012\n\nWork Completed: New water pump installed to solve overheating problems, worn rear wheel bearings changed, new air filter installed, Holley 4-barrel carburetor and customized intake manifold upgrade installed to increase the engine's power, non-working high beams repaired, wheel center caps repainted.\nNotes: Purchased in France. Car overheated shortly after purchase and had to be towed back to the UK. Restored car brought to Brands Hatch for a Renault Alpine gathering. Sold to the only bidder of unknown identity as not willing to appear on TV. (First car to break even on sale.) \n\n\n5 \t&quot;Porsche 914&quot; \t17 April 2012\n\nWork Completed: Refurbished engine: Thermostatic bellows for engine cooling flaps replaced with thermostatic spring from VW Beetle, external oil cooler replaced, engine cooling tinware cleaned and repainted, new HT leads and distributor fitted, new fuel injector seals fitted, Fuchs alloy wheels cleaned and polished, targa top resprayed, vinyl panels on B-pillars replaced, body steam cleaned and machine polished, interior carpets cleaned with wet-vac and replacement seat covers fitted.\nNotes: Originally a non-working barn find. Restored car taken to Silverstone Circuit for its test drive. Sold back to original seller. \n\n\n6 \t&quot;Mercedes-Benz G-Wagen&quot; \t24 April 2012\n\nWork Completed: Speedo drive oil seals replaced, scratched center console sanded and re-lacquered, engine bay steam cleaned, battery tray treated with rust remedy and repainted, radiator top hose replaced, cam cover polished, front grille replaced with an aftermarket 2012 unit and painted in original colour, front bumper replaced and painted, headlight surrounds and original rear bumper repainted, original taillights replaced with upgraded LED taillights, second hand leather steering wheel from an E-class fitted, front seats refurbished.\nNotes: Restoration price includes a Â£90 credit from selling the old front bumper and grille. Restored car brought to Mercedes-Benz off-road testing facility. After sometime on the market, sold to an online buyer from Cyprus. \n\n\n7 \t&quot;Jaguar XK8&quot; \t1 May 2012\n\nWork Completed: Throttle body replaced to fix &quot;Limp Home Mode&quot; problem, engine and exhaust system decarbonized to reduce emissions, new lowered springs and shocks, new XKR brakes installed, both back exhaust mufflers replaced with aftermarket ones, chrome front grille replaced with a satin black unit.\nNotes: A contest was held for the programme to choose the next car to buy from a lucky viewer. The XK8 was chosen over a Triumph TR4 and a Lotus Excel SA among the finalists. Restored car tested at Rockingham Motor Speedway. Was used as a promotional prize with a Â£10,000 budget. (Sixth loss of the series.) \n\n\n8 \t&quot;Gardner Douglas Cobra&quot; \t18 September 2012\n\nWork Completed: Carburetor jets resized and custom exhaust fitted to reduce emissions for Individual Vehicle Approval (IVA) test, also, custom head rests fitted as a requirement for IVA, rear axle narrowed by fitting shorter lower control arms and shorter drive shafts, new deep-dished wheels fitted.\nNotes: Mike opted to find a kit car version rather than spend money for a genuine AC Cobra, which would have been over budget. Car was brought to a drag strip, where Edd did a top speed of 110 mph while Mike reached 108 mph. \n\n\n9 \t&quot;Jaguar Mark 2&quot; \t25 September 2012\n\nWork Completed: Crankcase ventilation system fixed by cleaning the oil screen and replacing the breather pipe that runs to the oil catch can to sort out blue exhaust smoke, clutch master and slave cylinders replaced to fix spongy clutch pedal and 1-2 gear crunch, interior woodwork on the dashboard top and doors replaced, leather seats replaced, hole in the exhaust down pipe welded up.\nNotes: Brought to Oxford to pay a small tribute to Inspector Morse. \n\n\n10 \t&quot;Willys MB&quot; \t2 October 2012\n\nWork Completed: Rusted floor replaced with a new panel and painted in original olive drab, missing jerrycan holder installed on the back, gearbox replaced with a refurbished part and painted in olive drab, all seat cushions replaced with new ones, missing manually operated period windscreen wipers reinstalled, missing WW2 first-aid kit box reinstalled under the dash.\nNotes: Purchased in Northern California. Restoration price includes Â£2,000 shipping. Built in 1945, it is the oldest car ever bought on the show. Brought to Upminster, Essex, for display at an annual military vehicle show. \n\n\n11 \t&quot;Nissan Skyline R33&quot; \t9 October 2012\n\nWork Completed: Custom Japanese wheels replaced as part of purchase deal. Rusty metal on the strut tower cut out and replaced with a patch from another Skyline, standard intercooler swapped for a larger one and front bumper modified to relocate the intercooler from the inner wing to the front of the car behind the front bumper, strut brace fitted, stock rear spoiler replaced with an adjustable aftermarket one, suspension set up for drifting: front camber adjusted to -2.6Â°, front caster adjusted -6.5Â° and rear camber adjusted to -0.9Â°. Also the tracking was readjusted. Suspension already had adjustable suspension parts and may have been previously used as a track-day car.\nNotes: Mike beat Edd in a drifting contest with a score of 6-3. \n\n\n12 \t&quot;Triumph TR6&quot; \t16 October 2012\n\nWork Completed: Cylinder head fitted with hardened exhaust valve seats so the engine can run on unleaded petrol, conventional water based coolant flushed and replaced with synthetic 'water free' coolant, a small hole in a petrol tank repaired using tinning &amp; patch method, old vinyl roof replaced with a new one, old Lucas fuel pump upgraded to a modern Bosch fuel pump, both seats re-padded as foam had crumbled.\nNotes: Restored car taken to Blackpool and Lancashire to pay tribute to the 4th RAC Rally won by John Wallwork and Harold Brooks in a Triumph TR2 in 1954. Sold at asking price. \n\n\n13 \t&quot;BMW Isetta 300&quot; \t23 October 2012\n\nWork Completed: Rear brake shoes replaced and rear brake drum skimmed, rubber gear linkage grommets replaced, flares on front wheel arches and rusty lower part of the near side wheel arch cut out and replaced with new panels, whole car sanded to bare metal and resprayed from yellow to factory Japan Red and Feather White colour combination, perished window rubber seals replaced, new front and rear chrome bumpers fitted, new narrower rim steel wheels fitted, headlight pods chromed instead of repainted, interior re-trimmed with custom vinyl panels, missing vinyl bench seat custom made to match body colour, steering wheel refurbished using original moulds.\nNotes: Rear brake locked up shortly after purchase and car had to be towed back to the garage. Sold at asking price to BMW Heritage UK for use as a Museum and Press Fleet car. \n\n\n14 \t&quot;Ford Mustang Fastback&quot; \t30 October 2012\n\nWork Completed: Replaced dented pattern front wings with original second-hand units. Resprayed whole body in Dark Highland Green. Replaced lower control arms on front suspension due to worn bushes and ball joints. Replaced rear drum brakes. Refurbished power steering system. Upgraded the dashboard panels to factory deluxe spec. New wheels &amp; tyres and various chrome trim items including bumpers. Purchased and sprayed but did not install rear trim panel; left in the boot for new owner to decide on fitting it.\nNotes: Purchased in Southern California. Car was desirable 'A Code' vehicle (289-4V engine). Originality reduced by re-spraying different colour, changing wheels and adding non-original parts. Brought to Salisbury Plain after restoration for Mike and Edd to re-enact a Hollywood police chase scene (with Edd driving a Ford Crown Victoria Police Interceptor). \n\n\n15 \t&quot;Mercedes-Benz SLK R170&quot; \t6 November 2012\n\nWork Completed: Replaced hydraulic pump and relay of retractable roof mechanism. Replaced supercharger (Kompressor), brake master cylinder, stability control sensor, nearside headlamp, all four wheels and tyres. Had several rust patches and scratches touched up. Installed original spec CD player.\nNotes: Mike recovered parts from a crashed car in a breakers. ","torrent":{"xt":"urn:btih:fbbe8c605fb17a73dae9d437f8b82968169f4a18","amp;dn":"Wheeler+Dealers+Season+09+-+All+Episodes+%28Wikipedia+Order%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbbe8c605fb17a73dae9d437f8b82968169f4a18","infoHashBuffer":{"type":"Buffer","data":[251,190,140,96,95,177,122,115,218,233,212,55,248,184,41,104,22,159,74,24]},"announce":[],"urlList":[]}}