{"title":"Cowardice: A Brief History (2014) epub","uid":11280099,"size":5218586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc2e0bcb5975ab6b964b2f4826e781948aed9e58&amp;dn=Cowardice%3A+A+Brief+History+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"bookzilla","files":1,"time":1414203443,"description":"Coward. It's a grave insult, likely to provoke anger, shame, even violence. But what exactly is cowardice? When terrorists are called cowards, does it mean the same as when the term is applied to soldiers? And what, if anything, does cowardice have to do with the rest of us? Bringing together sources from court-martial cases to literary and film classics such as Dante's Inferno, The Red Badge of Courage, and The Thin Red Line, Cowardice recounts the great harm that both cowards and the fear of seeming cowardly have done, and traces the idea of cowardice's power to its evolutionary roots. But Chris Walsh also shows that this power has faded, most dramatically on the battlefield. Misconduct that earlier might have been punished as cowardice has more recently often been treated medically, as an adverse reaction to trauma, and Walsh explores a parallel therapeutic shift that reaches beyond war, into the realms of politics, crime, philosophy, religion, and love.\n\n Yet, as Walsh indicates, the therapeutic has not altogether triumphed--contempt for cowardice endures, and he argues that such contempt can be a good thing. Courage attracts much more of our attention, but rigorously understanding cowardice may be more morally useful, for it requires us to think critically about our duties and our fears, and it helps us to act ethically when fear and duty conflict.\n\n Richly illustrated and filled with fascinating stories and insights, Cowardice is the first sustained analysis of a neglected but profound and pervasive feature of human experience","torrent":{"xt":"urn:btih:fc2e0bcb5975ab6b964b2f4826e781948aed9e58","amp;dn":"Cowardice%3A+A+Brief+History+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc2e0bcb5975ab6b964b2f4826e781948aed9e58","infoHashBuffer":{"type":"Buffer","data":[252,46,11,203,89,117,171,107,150,75,47,72,38,231,129,148,138,237,158,88]},"announce":[],"urlList":[]}}