{"title":"The Secret (DVD Rip)","uid":4520955,"size":944604738,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fc41b009782e84e0928cd8802f76c7c0eb0755e4&amp;dn=The+Secret+%28DVD+Rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"matreshka4u","files":-1,"time":1227158786,"description":"The Secret reveals the most powerful law in the universe. The knowledge of this law has run like a golden thread through the lives and the teachings of all the prophets, seers, sages and saviors in the world's history, and through the lives of all truly great men and women. All that they have ever accomplished or attained has been done in full accordance with this most powerful law.\n\nWithout exception, every human being has the ability to transform any weakness or suffering into strength, power, perfect peace, health, and abundance.\n\nRhonda Byrne's discovery of The Secret began with a glimpse of the truth through a 100 year old book. She went back through centuries, tracing and uncovering a common truth that lay at the core of the most powerful philosophies, teachings and religions in the world.\n\nWhat Rhonda discovered is now captured in The Secret, a film that has been viewed by millions around the world. The Secret has also been released as an audio-book and printed book with more than six million copies in print.\n\nThe Secret explains with simplicity the law that is governing all lives, and offers the knowledge of how to create - intentionally and effortlessly - a joyful life.  This is the secret to everything - the secret to unlimited happiness, love, health and prosperity.\n\nThis is the secret to life.","torrent":{"xt":"urn:btih:fc41b009782e84e0928cd8802f76c7c0eb0755e4","amp;dn":"The+Secret+%28DVD+Rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc41b009782e84e0928cd8802f76c7c0eb0755e4","infoHashBuffer":{"type":"Buffer","data":[252,65,176,9,120,46,132,224,146,140,216,128,47,118,199,192,235,7,85,228]},"announce":[],"urlList":[]}}