{"title":"Basia - Time and Tide 320cbr (Big Papi) 1987 Vocal Pop","uid":9460789,"size":101027513,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc8f43b6b22087f19163c45a8a6354f0aef2dbc6&amp;dn=Basia+-+Time+and+Tide+320cbr+%28Big+Papi%29+1987+Vocal+Pop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389349610,"description":"Source: 1987 CD\n\n\n\nBy Missing Person\nThe debut solo album from Basia (last name Trzetrzelewska) continues her collaboration with Danny White, the two of whom had previously worked together as members of the group Matt Bianco on the 1984 album &quot;Who's Side Are You On&quot;. That album includes the popular &quot;Half A Minute&quot;, which has Basia on lead vocals, and it clearly paved the way for this album. Basia has a somewhat muted presence on &quot;Whose Side Are You On&quot;, not contributing to any of the songwriting, and contributing far less vocally than one, in hindsight, would expect. On one hand, this &quot;Time And Tide&quot; album is cut from a similar cloth as &quot;Whose Side Are You On&quot;, but I find this disc to be a huge step forward. With better songwriting, a less gimmicky/ less 'dated' sound, and of course, Basia completely taking over the lead vocals, the pair struck gold here--this is a terrific album, simply put.\n\nBasia is out of this world as a vocalist. She's got a total command of her huge, riveting voice, alternating brilliantly between tender, seductive passages and powerful, thrilling climaxes, and she does so without shipping over into show-biz schmaltz. She's got a huge vocal range that she gets a ton of mileage out of. Although the liner notes don't explicitly say so, I believe Basia also handles ALL of the harmony vocals on the entire CD, to glorious effect.\n\nBasia and her &quot;silent partner&quot; Danny White produced the album, and they also handled all of the songwriting except for Peter Ross' lyrics on 5 of the 10 songs (including the US top 10 adult contemporary hits &quot;Promises&quot; and &quot;New Day For You&quot;).\n\nInspiration and class run rampant here. There are loads of great instrumental flavorings such as the sudden blasts of 'xylophone' (synthesizer?) on &quot;Run For Cover&quot;, moody 'clavinet' that comes in on the second verse of &quot;Freeze Thaw&quot;, vibraphone on &quot;New Day For You&quot;, funky electric guitar on &quot;Prime Time TV&quot;, and Fender Rhodes-style keyboards on many of the songs.\n\nOn the one hand, this is a dance-pop album, with a majority of the songs being uptempo and beat-oriented--the sassy &quot;Run For Cover&quot;, the raging &quot;Freeze Thaw&quot;, the upbeat yet contemplative &quot;New Day For You&quot;, and the slyly humorous &quot;Prime Time TV&quot; (partly reminiscent of &quot;Dance Hall Days&quot; by Wang Chung) are all mind-bogglingly catchy and infectious. At the same time, this is a mature adult contemporary pop album, with lots of fun and witty lyrics and barely anything that even remotely resembles sappiness. Songs such as &quot;Promises&quot; and &quot;New Day For You&quot;, as their respective chart placings indicate, fall easily into both categories.\n\nUnlike a lot of dance-pop records, this one DOESN'T come to a grinding halt with the ballads. Actually, the only time they really slow the tempo is on the hit title track, an excellently tuneful ballad. Other quasi-ballads like the breezy, stripped-down &quot;From Now On&quot; and the Astrud Gilberto tribute &quot;Astrud&quot; give you something of a breather from the more rousing tracks, and yet they're taken at brisk tempos and saturated with Latin rhythms, and like virtually everything, these songs are wonderfully melodic and catchy.\n\nAnything at all to complain about? Well, there are some quite minor gripes (few things in life are truly perfect, I suppose). Basia's warning cries of &quot;I'll get mad!&quot; on the swinging &quot;How Dare You&quot; are corny, but otherwise the song is in the same league as the aforementioned dance-pop gems contained herein. &quot;Promises&quot; has a slightly sugary, repeated chorus, but it's still a fine, fine way to start the album. And the gently-swinging &quot;Miles Away&quot;, although a fine song in its own right, does reek ever-so-slightly of being a forced attempt to end the album on an upbeat feel-good note. These are just minor gripes of an overall terrific CD.\n\nAnd I can't finish without making a special mention of &quot;New Day For You&quot;, one of the best pop songs of the '80s, a song so great it practically makes the whole CD worth owning on its own. With a looping three chord keyboard sequence seemingly nicked from Sister Sledge's &quot;Reach Your Peak&quot; (and later 'borrowed' again by George Michael for &quot;Too Funky&quot;), this is one of those songs with such a deathless groove that it just never gets old no matter how many times I hear it. Basia's vocals never come across any better, and of course, this is the one with that orgasmic extended high note which she belts out in full voice at the end of the first chorus, and the whole song works absolutely ravishingly.\n\nAs an interesting sidenote, Danny White is the younger brother of Peter White. Peter, who is probably best-known for his lengthy association with Al Stewart, even appears on this record--witness his unmistakable acoustic guitar solo on &quot;Promises&quot;.\n\nIf you're fanatical about 1980s pop-rock/ dance-pop, this is a unique and indispensable entry for your collection. &quot;Time And Tide&quot; definitely ranks as a must-have.","torrent":{"xt":"urn:btih:fc8f43b6b22087f19163c45a8a6354f0aef2dbc6","amp;dn":"Basia+-+Time+and+Tide+320cbr+%28Big+Papi%29+1987+Vocal+Pop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8f43b6b22087f19163c45a8a6354f0aef2dbc6","infoHashBuffer":{"type":"Buffer","data":[252,143,67,182,178,32,135,241,145,99,196,90,138,99,84,240,174,242,219,198]},"announce":[],"urlList":[]}}