{"title":"Burning the Reichstag -Benjamin Carter Hett","uid":9418505,"size":4870007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fcc590ce38adca54f7b7b4baf40a072af1c88830&amp;dn=Burning+the+Reichstag+-Benjamin+Carter+Hett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":-1,"time":1388506511,"description":"In February 1933, Adolf Hitler had only a tenuous grasp on power. Chancellor of Germany for merely four weeks, he led a fragile coalition government. The Nazis had lost seats in the Reichstag in the recent election, and claimed only three of thirteen cabinet posts. Then on February 27th, arson sent the Reichstag, the home and symbol of German democracy, up in flames. Immediately blaming the Communists, Hitler's new government approved a decree that tore the heart out of the democratic constitution of the Weimar Republic and cancelled the rule of law. Five thousand people were immediately arrested. The Reichstag fire marked the true beginning of the Third Reich, which ruled for 12 more years. The controversy surrounding the fire's origins has endured for 80. \nIn Burning the Reichstag, Benjamin Hett offers a gripping account of Hitler's rise to dictatorship-one that challenges orthodoxy and recovers the true significance of the part the fire played. At the scene the police arrested 23-year-old Marinus van der Lubbe, a Dutch Communist stonemason. Though he was initially dismissed abroad as a Nazi tool, post-war historians since the 1950s have largely judged him solely guilty--a lone arsonist exploited by Hitler. Hett's book reopens the case, providing vivid portraits of key figures, including Rudolf Diels, Hermann Goering, Joseph Goebbels, and the historian Fritz Tobias, whose account of the fire has, until now, been the standard. Making use of a number of new sources and archives, Hett sets the Reichstag fire in a wider context, revealing how and why it has remained one of the last mysteries of the Nazi period, and one of the most controversial and contested events in the 20th century.","torrent":{"xt":"urn:btih:fcc590ce38adca54f7b7b4baf40a072af1c88830","amp;dn":"Burning+the+Reichstag+-Benjamin+Carter+Hett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc590ce38adca54f7b7b4baf40a072af1c88830","infoHashBuffer":{"type":"Buffer","data":[252,197,144,206,56,173,202,84,247,183,180,186,244,10,7,42,241,200,136,48]},"announce":[],"urlList":[]}}