{"title":"Aerosmith's Greatest Hits [FLAC+MP3](Big Papi)","uid":9516730,"size":340756044,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fcd9337c419c980475d9d092640b42e33a5b75bd&amp;dn=Aerosmith%27s+Greatest+Hits+%5BFLAC%2BMP3%5D%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":3,"uploader":"Big-Papi","files":-1,"time":1390537043,"description":"Source:  CD\n\nFLAC:\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 63 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3:\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Insane, (avg. bitrate: 320kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n\nBy Michael G. King\nAEROSMITH'S GREATEST HITS is a 10 track collection of songs originally released in 1980, remastered in 1993, that included their biggest hits from 1973's AEROSMITH, 1974's GET YOUR WINGS, 1975's TOYS IN THE ATTIC, 1976's ROCKS, 1977's DRAW THE LINE, 1978's SEARGEANT PEPPER'S SOUNDTRACK, and 1979's NIGHT IN THE RUTS albums. PERMANENT VACATION, PUMP, etc. hadn't even been concieved yet. That having been said, let's focus on the material that is included here.\nTrack 1, DREAM ON, is really the only true worthy track from the AEROSMITH debut album. This is a classic that was re-released as a single in 1976 after the success of TOYS IN THE ATTIC. FM classic rock stations still play this one today.\n\nTrack 2, SAME OLD SONG AND DANCE, is the only track from the GET YOUR WINGS album. While this is a great song, TRAIN KEPT' A ROLLIN' would have been a better choice if they were only going to pick one for this album.\n\nTrack 3, SWEET EMOTION, from the TOYS IN THE ATTIC album has been butchered here. The track starts out already in progress. It's like switching the radio dial and finding an AEROSMITH song that had already started before you switched the dial. This track clocks in at 3:12, whereas the TOYS IN THE ATTIC version clocks in at 4:34.\n\nTrack 4, WALK THIS WAY, also from the TOYS IN THE ATTIC album, is essential on any AEROSMITH greatest hits collection. But just like SWEET EMOTION, it has been cut from it's original 3:40 to 3:12.\n\nTrack 5, LAST CHILD, from the ROCKS album is essential and is intact.\n\nTrack 6, BACK IN THE SADDLE, also from the ROCKS album is essential and is intact.\n\nTrack 7, DRAW THE LINE, from the DRAW THE LINE album, is one of two essential tracks from that album.\n\nTrack 8, KINGS AND QUEENS, also from the DRAW THE LINE album, is the other essential track.\nTrack 9, COME TOGETHER, is essential from the band's participation in the SEARGEANT PEPPER'S LONELY HEARTS CLUB BAND movie soundtrack. This was a very popular single that Aerosmith released in 1978.\n\nTrack 10, REMEMBER (WALKING IN THE SAND), from the NIGHT IN THE RUTS album was a popular single in 1979.\n\nAll in all, AEROSMITH'S GREATEST HITS is a very good representation of Aerosmith's work in the 70's. My biggest complaint is about the butchering of SWEET EMOTION, WALK THIS WAY, and KINGS AND QUEENS.\n\nStart with TOYS IN THE ATTIC and ROCKS, and then build your collection from there. It'll cost more than the AEROSMITH'S GREATEST HITS CD, but it'll be worth it","torrent":{"xt":"urn:btih:fcd9337c419c980475d9d092640b42e33a5b75bd","amp;dn":"Aerosmith%27s+Greatest+Hits+%5BFLAC%2BMP3%5D%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcd9337c419c980475d9d092640b42e33a5b75bd","infoHashBuffer":{"type":"Buffer","data":[252,217,51,124,65,156,152,4,117,217,208,146,100,11,66,227,58,91,117,189]},"announce":[],"urlList":[]}}