{"title":"Signature in the Cell - Dr. Stephen C. Meyer","uid":11773428,"size":4109969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd4e757c95211279a47a74d94031dfcb5617cd09&amp;dn=Signature+in+the+Cell+-+Dr.+Stephen+C.+Meyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"starxteel","files":1,"time":1427167671,"description":"Signature in the Cell is a defining work in the discussion of life?s origins and the question of whether life is a product of unthinking matter or of an intelligent mind. For those who disagree with ID, the powerful case Meyer presents cannot be ignored in any honest debate. For those who may be sympathetic to ID, on the fence, or merely curious, this book is an engaging, eye-opening, and often eye-popping read? ? American Spectator\n\nNamed one of the top books of 2009 by the Times Literary Supplement (London), this controversial and compelling book from Dr. Stephen C. Meyer presents a convincing new case for intelligent design (ID), based on revolutionary discoveries in science and DNA. Along the way, Meyer argues that Charles Darwin?s theory of evolution as expounded in The Origin of Species did not, in fact, refute ID. If you enjoyed Francis Collins?s The Language of God, you?ll find much to ponder?about evolution, DNA, and intelligent design?in Signature in the Cell.\n\n\nAbout the author:\nDr. Stephen C. Meyer received his Ph.D. from the University of Cambridge in the philosophy of science and is the director of the Center for Science and Culture at the Discovery Institute in Seattle.\n\nDr. Meyer is Director of the Discovery Institute?s Center for Science and Culture (CSC) and a founder both of the intelligent design (ID) movement and of the CSC, intelligent design?s primary intellectual and scientific headquarters. Dr. Meyer is a Cambridge University-trained philosopher of science and the author of peer-reviewed publications in technical, scientific, philosophical and other books and journals.\n\nGraduating from Whitworth College in Spokane, Washington, in 1981 with a degree in physics and earth science, he later became a geophysicist with Atlantic Richfield Company (ARCO) in Dallas, Texas. From 1981 to 1985, he worked for ARCO in digital signal processing and seismic survey interpretation. As a Rotary International Scholar, he received his training in the history and philosophy of science at Cambridge University, earning a PhD in 1991. His thesis offered a methodological interpretation of origin-of-life research.\n\nBecause the article was the first peer-review publication in a technical journal arguing for ID, the journal?s editor, evolutionary biologist Richard Sternberg, was punished by his Smithsonian supervisors for allowing Meyer?s pro-ID case into print. This led to an investigation of top Smithsonian personnel by the U.S. Office of Special Counsel, widely covered in the media, including the Wall Street Journal and Washington Post. The federal investigation concluded that Sternberg had been wrongly disciplined and intimidated. The case led to widespread public indignation at the pressures placed on Darwin-doubting scientists not only at the Smithsonian but at universities around the U.S. and elsewhere.\n\nMeyer has been featured on national television and radio programs, including The NewsHour with Jim Lehrer, CBS's Sunday Morning, NBC Nightly News, ABC's World News, Good Morning America, Nightline, FOX News Live, and Tavis Smiley, and has been featured in two New York Times front-page stories","torrent":{"xt":"urn:btih:fd4e757c95211279a47a74d94031dfcb5617cd09","amp;dn":"Signature+in+the+Cell+-+Dr.+Stephen+C.+Meyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd4e757c95211279a47a74d94031dfcb5617cd09","infoHashBuffer":{"type":"Buffer","data":[253,78,117,124,149,33,18,121,164,122,116,217,64,49,223,203,86,23,205,9]},"announce":[],"urlList":[]}}