{"title":"Cybersecurity  (Systems, Testing, Intrusions), 2013 Wiley [PDF]","uid":9289717,"size":8417852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd628e8bfba2afebfd5659c89a2e2f5ee23a0da1&amp;dn=Cybersecurity++%28Systems%2C+Testing%2C+Intrusions%29%2C+2013+Wiley+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":1,"uploader":"F1restorm","files":-1,"time":1386068150,"description":"Cybersecurity: Managing Systems, Conducting Testing and Investigating Intrusions\nAuthor: Thomas J Mowbray \nPublished: October 18, 2013 \nPublisher: Wiley \nISBN: 9781118697115 \nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nThere's some chapter tests and source codes available for download (link in book), no registration required. Tested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n___________________________________________________________________________________\n\nA must-have, hands-on guide for working in the cybersecurity profession\n\nCybersecurity involves preventative methods to protect information from attacks. It requires a thorough understanding of potential threats, such as viruses and other malicious code, as well as system vulnerability and security architecture. This essential book addresses cybersecurity strategies that include identity management, risk management, and incident management, and also serves as a detailed guide for anyone looking to enter the security profession. Doubling as the text for a cybersecurity course, it is also a useful reference for cybersecurity testing, IT test/development, and system/network administration.\n\n-Covers everything from basic network administration security skills through advanced command line scripting, tool customization, and log analysis skills\n-Dives deeper into such intense topics as wireshark/tcpdump filtering, Google hacks, Windows/Linux scripting, Metasploit command line, and tool customizations\n-Delves into network administration for Windows, Linux, and VMware\nExamines penetration testing, cyber investigations, firewall configuration, and security tool customization\n-Shares techniques for cybersecurity testing, planning, and reporting\n\nCybersecurity: Managing Systems, Conducting Testing, and Investigating Intrusions is a comprehensive and authoritative look at the critical topic of cybersecurity from start to finish.\n","torrent":{"xt":"urn:btih:fd628e8bfba2afebfd5659c89a2e2f5ee23a0da1","amp;dn":"Cybersecurity++%28Systems%2C+Testing%2C+Intrusions%29%2C+2013+Wiley+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd628e8bfba2afebfd5659c89a2e2f5ee23a0da1","infoHashBuffer":{"type":"Buffer","data":[253,98,142,139,251,162,175,235,253,86,89,200,154,46,47,94,226,58,13,161]},"announce":[],"urlList":[]}}