{"title":"Sergei Parajanov - Shadows Of Our Forgotten Ancestors","uid":3492118,"size":723518079,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdceb28d69fb91a0a74bb321e01ecd7021f87932&amp;dn=Sergei+Parajanov+-+Shadows+Of+Our+Forgotten+Ancestors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"kegir","files":2,"time":1149350609,"description":"Tini Zabutykh Predkiv (Shadows of Our Forgotten Ancestors, Sergei Parajanov (1964)\n\nEnglish srt subs\n\nEnjoy this masterpiece from Ukraina.\n\nDedicated to the folks behind TPB. Keep your spirit high.\n\nPlot synopsis from allmovie\n\nAlong with Tarkovsky and Dovzhenko, Sergei Paradjanov is one of the most important Soviet directors of last century. Paradjanov, who was periodically jailed and exiled because of his work, stunned world audiences in 1964 with his Shadows of Our Forgotten Ancestors, popularly known as the Romeo and Juliet of the Carpathians. The film is set among the Hutsul people of the Western Ukraine, an isolated ethnic group who live in the upper reaches of the mountain range. Their lives take place within a harsh environment and an ornate cultural system little changed since the 18th century. The film opens with the deaths of Ivanko's brother, Olexa, crushed by a tree, and father, Pyotr Pavlichuk, killed outside of church by his rich neighbor Guteniuk. During the funeral procession for his father, Ivanko meets Guteniuk's daughter, Marichka, and the stage is set for the star-crossed lovers. Structured episodically, the film checks in with Ivanko and Marichka as they fall in love and age towards adulthood. Finally of an age to marry, Ivanko finds himself unable, having been reduced to poverty by his father's death. Forced to work as a hired hand, he must leave his village and his beloved Marichka. Tragedy ensues and the remainder of the film concerns Ivanko's private and subtle dissolution as a result of this tragedy. -- Brian Whitener\n\nReview from allmovie\n\nThis romantic drama directed by Sergei Paradjanov is considered a stylistic masterpiece and a milestone in Ukrainian cinema. Bordering on the abstract, the feature contains a poetic style of dazzling innovation and fantasy images that resembles a violent fairy tale. Two Carpathian families have been involved in a long-standing feud caused by the death of a man during a fight. Ivan Paliychuk (Ivan Mikolaychuk) falls in love with the beautiful Marichka Gutenyuk (Larisa Kadochnikova), the daughter of his family's enemy. When Ivan's father dies from the fatal blow of an axe to the head, two red horse silhouettes appear on the screen as blood covers his eyes. The feature is noteworthy for steering away from the heavy-handed party control over filmmaking that accompanied most films from the Soviet Union. Such disregard for the official esthetic eventually brought trouble for the gifted director. Beginning in 1973, he was imprisoned for five years. -- Dan Pavlides\n\nNo time for tech specification. It is a dvd rip and it is standalone friendly\n\n\nMany thaks to Juan Delgado for the first up of this film here at Freakyflicks.\n\nSEED AT LEAST AS MUCH AS YOU HAVE DOWNLOADED...PLEASE!\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE' \n\n\n... simply search for 'freakyflicks' \n***************************************\n************** FREAKYFLICKS ***********\n***************************************","torrent":{"xt":"urn:btih:fdceb28d69fb91a0a74bb321e01ecd7021f87932","amp;dn":"Sergei+Parajanov+-+Shadows+Of+Our+Forgotten+Ancestors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdceb28d69fb91a0a74bb321e01ecd7021f87932","infoHashBuffer":{"type":"Buffer","data":[253,206,178,141,105,251,145,160,167,75,179,33,224,30,205,112,33,248,121,50]},"announce":[],"urlList":[]}}