{"title":"Lou Reed - Transformer [24 bit FLAC] vinyl","uid":8249598,"size":751080004,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe161c4d7dace2c8313dd38847208eb4ef8c7c68&amp;dn=Lou+Reed+-+Transformer+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"24.96","files":-1,"time":1363138885,"description":"  Lou Reed - Transformer (2004) [24 bit FLAC] vinyl\n\n  Released: 2004\n  Source: LSP-4807 / Germany\n  Genre: Pop/Rock\n  Style: Classic Rock, Glam Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Vicious 2:55 \n  A2. Andy's Chest 3:17 \n  A3. Perfect Day 3:43 \n  A4. Hangin' 'Round 3:39 \n  A5. Walk On The Wild Side 4:12 \n  B1. Make Up 2:58 \n  B2. Satellite Of Love 3:40 \n  B3. Wagon Wheel 3:19 \n  B4. New York Telephone Conversation 1:31 \n  B5. I'm So Free 3:07 \n  B6. Goodnight Ladies 4:19\n\n  David Bowie has never been shy about acknowledging his influences, and since the boho decadence and sexual ambiguity of the Velvet Underground's music had a major impact on Bowie's work, it was only fitting that as Ziggy Stardust mania was reaching its peak, Bowie would offer Lou Reed some much needed help with his career, which was stuck in neutral after his first solo album came and went. Musically, Reed's work didn't have too much in common with the sonic bombast of the glam scene, but at least it was a place where his eccentricities could find a comfortable home, and on Transformer Bowie and his right-hand man, Mick Ronson, crafted a new sound for Reed that was better fitting (and more commercially astute) than the ambivalent tone of his first solo album. Ronson adds some guitar raunch to &quot;Vicious&quot; and &quot;Hangin' Round&quot; that's a lot flashier than what Reed cranked out with the Velvets, but still honors Lou's strengths in guitar-driven hard rock, while the imaginative arrangements Ronson cooked up for &quot;Perfect Day,&quot; &quot;Walk on the Wild Side,&quot; and &quot;Goodnight Ladies&quot; blend pop polish with musical thinking just as distinctive as Reed's lyrical conceits. And while Reed occasionally overplays his hand in writing stuff he figured the glam kids wanted (&quot;Make Up&quot; and &quot;I'm So Free&quot; being the most obvious examples), &quot;Perfect Day,&quot; &quot;Walk on the Wild Side,&quot; and &quot;New York Telephone Conversation&quot; proved he could still write about the demimonde with both perception and respect. The sound and style of Transformer would in many ways define Reed's career in the 1970s, and while it led him into a style that proved to be a dead end, you can't deny that Bowie and Ronson gave their hero a new lease on life -- and a solid album in the bargain.","torrent":{"xt":"urn:btih:fe161c4d7dace2c8313dd38847208eb4ef8c7c68","amp;dn":"Lou+Reed+-+Transformer+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe161c4d7dace2c8313dd38847208eb4ef8c7c68","infoHashBuffer":{"type":"Buffer","data":[254,22,28,77,125,172,226,200,49,61,211,136,71,32,142,180,239,140,124,104]},"announce":[],"urlList":[]}}