{"title":"Handbook of High performance liquid chromatography","uid":8254501,"size":9094431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe3c780ecdc98e47cac07428b47eede2ecf721af&amp;dn=Handbook+of+High+performance+liquid+chromatography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1363231473,"description":"Danilo Corradini, &quot;Handbook of High performance liquid chromatography, Second Edition&quot;\n2010 | ISBN: 1574445545 | 715 pages | PDF | 8,7 MB\n\nHigh performance liquid chromatography (HPLC) is one of the most widespread analytical and preparative scale separation techniques used for both scientific investigations and industrial and biomedical analysis. Now in its second edition, this revised and updated version of the Handbook of HPLC examines the new advances made in this field since the publication of the benchmark first edition twelve years ago. It reports detailed information on fundamental and practical aspects of HPLC related to conventional format and sophisticated novel approaches which have been developed to address a variety of separation problems in different fields.\n\nThe latest concepts\n\nNew concepts presented in this edition include monolithic columns, bonded stationary phases, micro-HPLC, two-dimensional comprehensive liquid chromatography, gradient elution mode, and capillary electromigration techniques. The book also discusses LC-MS interfaces, nonlinear chromatography, displacement chromatography of peptides and proteins, field-flow fractionation, retention models for ions, and polymer HPLC.\n\nFundamentals and applications\n\nThe first section of the book explores emerging novel aspects of HPLC and related separation methods based on the differential velocity of analytes in a liquid medium under the action of either an electric field (capillary electromigration techniques) or a gravitational field (field-flow fractionation). The section focusing on applications highlights four significant areas in which HPLC is successfully employed: chiral pharmaceutical, environmental analysis, food analysis, and forensic science.","torrent":{"xt":"urn:btih:fe3c780ecdc98e47cac07428b47eede2ecf721af","amp;dn":"Handbook+of+High+performance+liquid+chromatography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe3c780ecdc98e47cac07428b47eede2ecf721af","infoHashBuffer":{"type":"Buffer","data":[254,60,120,14,205,201,142,71,202,192,116,40,180,126,237,226,236,247,33,175]},"announce":[],"urlList":[]}}