{"title":"Surfactants in Tribology - Girma Biresaw, K.L. Mittal","uid":16018935,"size":21129883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe4568b6f50eef219c27febfb0b3b178a2ed79da&amp;dn=Surfactants+in+Tribology+-+Girma+Biresaw%2C+K.L.+Mittal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"clouderone","files":1,"time":1476321579,"description":"Surfactants in Tribology - Girma Biresaw, K.L. Mittal (CRC, 2008).pdf\r\n\r\nSurfactants play a variety of critical roles in tribology. In addition to controlling friction and wear, they also allow for control of a wide range of properties of lubricants, such as emulsification/demulsification, bioresistance, oxidation resistance, and rust/corrosion prevention. This book explains recent advances in the role of surfactants within the purview of tribology, with an emphasis on product development.  \r\nIncludes Theoretical, Experimental, and Technological Advances\r\n\r\nProviding a unique exploration of the nexus between surfactants and tribology, this text represents the cumulative expertise of leading scientists and technologists engaged in the study of surfactants in variegated tribological phenomena. Organized thematically for easy reference, the volume covers—\r\n\r\n·         Fundamentals of surfactants\r\n\r\n·         Tribological aspects of micro- and nanodevices, including  micro-patterns of two-dimensional asperity arrays, MEMS, NEMS, and magnetic recording devices\r\n\r\n·         Self-assembled monolayers and ultra-thin films relevant to tribological phenomena, including aspects of organosilane monolayers, ultrathin self-assembled films, super-hydrophobic films, MoDTC/ZDDP tribofilms, and surfactant-coated copper nanoparticles\r\n\r\n·         Polymeric and biobased surfactants, covering various tribological aspects related to polymeric gels, elastomers sliding against hydrophilic and hydrophobic surfaces, agriculture-based amphiphiles, vegetable oils, and biobased greases\r\n\r\n·         Surfactant adsorption and aggregation relevant to tribological phenomena, such as the design of surfactants for lubrication, aqueous non-ionic surfactant-based lubricants, adsorption and aggregation kinetics, surfactant and polymer nanostructures, and engine oils\r\n\r\nThe first reference to comprehensively treat the relevance of surfactants in tribology, this book is an invaluable guide for individuals engaged in research, development, and manufacturing, especially those engaged in the study of MEMS, NEMS, SAMs, andbiodevices","torrent":{"xt":"urn:btih:fe4568b6f50eef219c27febfb0b3b178a2ed79da","amp;dn":"Surfactants+in+Tribology+-+Girma+Biresaw%2C+K.L.+Mittal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4568b6f50eef219c27febfb0b3b178a2ed79da","infoHashBuffer":{"type":"Buffer","data":[254,69,104,182,245,14,239,33,156,39,254,191,176,179,177,120,162,237,121,218]},"announce":[],"urlList":[]}}