{"title":"Treasure Island Media - CHRISTIAN 24 COCKS IN 24 HOURS - BB -GAY","uid":5201356,"size":1429284656,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:feee34b0db0038a79279c2bb0132f6da92084d84&amp;dn=Treasure+Island+Media+-+CHRISTIAN+24+COCKS+IN+24+HOURS+-+BB+-GAY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"jinorumo","files":-1,"time":1260184547,"description":"Treasure Island Media - CHRISTIAN 24 COCKS IN 24 HOURS - Bareback - (PAUL MORRIS)\n\nIt might surprise some to hear that T.I.M. exclusives CHRISTIAN and DAWSON are the best of friends, but they are. In fact, they've even told us stories about heading off together to bathhouses and sex clubs to collect loads!\n\nCall it sibling-pig-bottom rivalry, but when the discussion started of doing an all-CHRISTIAN video, the first thing he said was that if DAWSON could take 20 loads in a weekend (DAWSON'S 20-LOAD WEEKEND), he wanted to do it in 24 hours. The result is MAX SOHL's latest porn marathon, CHRISTIAN 24 COCKS IN 24 HOURS, which follows CHRISTIAN as he takes as much cock and cum as he can over the course of a SINGLE DAY.\n\nInfo:\nhttp://www.treasureislandmedia.com/TreasureIslandMedia_2007/cart/CHRISTIAN-24-COCKS-IN-24-HOURS.html\n\n------------------------\n\nNOTE:\n\nA lot of this stuff on eMule, using their client to connect to a server and search for those videos. Most of their videos are there. to get eMule client go here:\n\n------------------------\n\nNOTE:\nBy viewing this torrent page I agree that I am of legal age and not with any local, state, or federal law enforcement agencies whatsoever and that I am not a reporter, writer, or agent for any news or media organization. I am viewing this material at my sole discretion on my own behalf and will not report/disclose my findings and/or comments regarding this material. I subscribe to the principles of the First Amendment of the Constitution of the United States of America which holds that free adult Americans have the right to decide for themselves what they will read and view without governmental interference. ADULT XXX CONTENT FOR ADULT VIEWING ONLY.\t\n\n","torrent":{"xt":"urn:btih:feee34b0db0038a79279c2bb0132f6da92084d84","amp;dn":"Treasure+Island+Media+-+CHRISTIAN+24+COCKS+IN+24+HOURS+-+BB+-GAY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feee34b0db0038a79279c2bb0132f6da92084d84","infoHashBuffer":{"type":"Buffer","data":[254,238,52,176,219,0,56,167,146,121,194,187,1,50,246,218,146,8,77,132]},"announce":[],"urlList":[]}}