{"title":"Cantajuego - Que Lo Baile Todo El Mundo [2010]","uid":5869774,"size":91381656,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff40813b1855a04695df4d44ccc2bb21cbdbae52&amp;dn=Cantajuego+-+Que+Lo+Baile+Todo+El+Mundo+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"chusca","files":28,"time":1286411473,"description":"Que lo baile todo el mundo, grabado en directo el 19 de junio de 2010 en el Palacio Municipal de Congresos de Madrid con una magnÃƒÂ­fica selecciÃƒÂ³n de 27 canciones que reflejan lo bien que se lo pasan los niÃƒÂ±os (y sus familias) en los conciertos de CantaJuego, cÃƒÂ³mo interactÃƒÂºan con los actores cantando y bailando sin parar. Con una cuidada producciÃƒÂ³n muy divertida que incluye un grupo de mÃƒÂºsicos que interpretan todas las piezas en directo.  DespuÃƒÂ©s de haber conseguido batir todos los rÃƒÂ©cords de la historia de la mÃƒÂºsica espaÃƒÂ±ola con sus anteriores DVD, de los que ha vendido mÃƒÂ¡s de 500.000 ejemplares.\nCantaJuego es el fenÃƒÂ³meno musical y educativo destinado a los niÃƒÂ±os mÃƒÂ¡s importante de todos los tiempos en nuestro paÃƒÂ­s, el entretenimiento infantil de referencia, algo que se demuestra con hechos: esta misma semana, CantaJuego ocupa los nÃƒÂºmeros 1, 2, 3, 4, 6, 8 y 10 en la lista de los DVD mÃƒÂ¡s vendidos en EspaÃƒÂ±a con sus seis primeros volÃƒÂºmenes publicados (mÃƒÂ¡s dos ediciones especiales: CantaJuego Navidad y Superbailable) y un total de Ã‚Â¡20 Discos de Platino y 638 semanas conjuntas de permanencia en listas! Sobran comentarios. \nEn Que lo baile todo el mundo estÃƒÂ¡n canciones originales de CantaJuego como Soy AsÃƒÂ­, Buby la Ardilla, y Un CumpleaÃƒÂ±os Genial junto a clÃƒÂ¡sicos como Tengo una vaca lechera, AntÃƒÂ³n Pirulero, En un bosque de la china, el Arca de NoÃƒÂ© o La ManÃƒÂ©. Son las 27 canciones que han convertido a CantaJuego en un fenÃƒÂ³meno infantil de proporciones desconocidas en EspaÃƒÂ±a.\n\n\n\n","torrent":{"xt":"urn:btih:ff40813b1855a04695df4d44ccc2bb21cbdbae52","amp;dn":"Cantajuego+-+Que+Lo+Baile+Todo+El+Mundo+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff40813b1855a04695df4d44ccc2bb21cbdbae52","infoHashBuffer":{"type":"Buffer","data":[255,64,129,59,24,85,160,70,149,223,77,68,204,194,187,33,203,219,174,82]},"announce":[],"urlList":[]}}