{"title":"DAZ3D - Wound Makeup Artist Iray for Genesis 3 Female(s)","uid":15401224,"size":103161419,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ffac81989956f80336b47714afd98acfb6fb9b05&amp;dn=DAZ3D+-+Wound+Makeup+Artist+Iray+for+Genesis+3+Female%28s%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Kooroe","files":1,"time":1469457814,"description":"Wound Makeup Artist Iray for Genesis 3 Female is a collection of layered wounds in Geometry Shell format optimized for the Iray render engine in Daz Studio. Each shell has a different mesh offset so multiple wounds can be rendered in Daz Studio Iray without problems. Also the surface setup of each wound have been optimized to take advantage of Iray's renderer.\r\n\r\nGeometry Shells are second skins so it makes this product UV independent. Specially useful on Daz Genesis 3 figures that are characterized by a variety of different UVs. This means this product is compatible with every Genesis 3 Female character like Victoria 7, Gia 7, Eva 7, Olympia 7, etc. as well as any future Daz Genesis 3 female based released character or morph from Daz or any vendor. (Excluding geografts.)\r\n\r\nThe wound effects positions are controlled directly in the second skin (geometry shells) by surface parameters. This means you don't need to enter multiple times into the layered image editor to move the placement of a wound in a cumbersome 2D texture map, now you can interactively slide its position directly in the character skin by using the HORIZONTAL OFFSET and VERTICAL OFFSET sliders of the shell in the Surface Tab. This makes the correct positioning of wounds much faster and exact.\r\n\r\nGeometry Shell Wounds are stacked as children of your figure in the Scene Tab so you can toggle on and off visibility of effects and single wounds directly on the scene tab. It also means you don't risk flattening of complex wound compositions as it happened in the Layered Image Editor.\r\n\r\nGive your character a scar in the face for a tough look, put a bullet wound in his arm, an open wound in his leg where an enemy arrow has hit, a slash in his chest where a sword has grazed or burned skin where dragon fire hit. You control your wounded scene by having the ability to place your wounds in the exact spot where you need it. Bruised lips, whip marks, bloodied teeth, black eyes, scars, scratches,abrasions, several skin bruises, blood options and even full body wound cuts in several stages. Creativity without limits through a ready made library of wound geometry shells that you can re-position on the fly sliding them across your character skin using parameter sliders!\r\n\r\nWhat's Included and Features\r\n129 Wound Makeup Artist Geometry Shells for Iray (.DUF)\r\n5 Multiple surfaces Wound Effects:\r\nCuts Arms and Legs\r\nCuts Arms and Legs Blood\r\nCuts Full Body\r\nCuts Full Body Blood\r\nTeeth Bloody\r\n35 Arms Blood, Bruise, Scratches and Other Wounds\r\n32 Face Blood, Bruise, Scratches and Other Wounds\r\n21 Legs Blood, Bruise, Scratches and Other Wounds\r\n36 Torso Blood, Bruise, Scratches and Other Wounds\r\n1 Detailed User Guide (.PDF)\r\nTextures Include:\r\n453 Texture, and Bump Maps (4096 x 4096)\r\nDaz Studio Iray Material Presets (.DUF)\r\n\r\nImages: \nhttp://www.daz3d.com/wound-makeup-artist-iray-for-genesis-3-female-s","torrent":{"xt":"urn:btih:ffac81989956f80336b47714afd98acfb6fb9b05","amp;dn":"DAZ3D+-+Wound+Makeup+Artist+Iray+for+Genesis+3+Female%28s%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffac81989956f80336b47714afd98acfb6fb9b05","infoHashBuffer":{"type":"Buffer","data":[255,172,129,152,153,86,248,3,54,180,119,20,175,217,138,207,182,251,155,5]},"announce":[],"urlList":[]}}