{"title":"BBC The Mekong River with Sue Perkins 2of4 Cambodia PDTV x264 AA","uid":11621087,"size":724153309,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ffe92028ca7ef6f164939ad54815f4fdf23a11cb&amp;dn=BBC+The+Mekong+River+with+Sue+Perkins+2of4+Cambodia+PDTV+x264+AA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":5,"leechers":0,"uploader":"MVGroup","files":-1,"time":1417552144,"description":"The Mekong River (BBC)\n\nTravel Documentary hosted by Sue Perkins, published by BBC in 2014 - English narration\n\n\nInformation\n------------------------------\n\nThe Mekong is South East Asia's greatest river, the Mother of Water that brings life to millions of people from the paddy fields of Vietnam to the mountains of the Tibetan Plateau. In this series, Sue Perkins goes on an extraordinary journey, spanning nearly 3,000 miles, to explore lives and landscapes on the point of enormous change. Across four episodes, she travels upstream through Vietnam, Cambodia, Laos and China, towards the Mekong's source high in the Himalayan glacier.\n\n\n1)  Part 1 \nSue's epic journey begins in Vietnam, on the vast Mekong Delta, where she joins Si Hei, the queen of the noodle. Starting at dawn, Si Hei and her eager new apprentice head out to sell noodle soup at the Delta's largest floating market - Cai Rang, a centre of commerce on the river that's endured for centuries. But communist Vietnam has one of the fastest growing economies in South East Asia, and change is coming to millions of people who live along the river. Vietnam is the world's second largest exporter of rice, so Sue moves upstream to work with farmers Hung and Tuk in the paddy fields and finds out how their lives are changing with the prospect of capitalism. Travelling up river, Sue crosses into Cambodia and its capital Phnom Penh, which lies at the confluence of the Mekong and the Tonle Sap River. It's a place tainted by the horrific genocide carried out by Pol Pot and the Khmer Rouge. At the S21 detention centre, Sue meets one of only two of its prisoners still alive today, Chum Mey, before visiting the infamous genocide centre, known as the Killing Fields. To complete this first leg of her journey, Sue immerses herself in the lives of the people of Kuampang Pluk, an extraordinary village of stilted houses on the largest freshwater lake in Asia, Tonle Sap Lake.\n\n2)  Part 2 \nSue embarks on the most emotional leg of her journey along the Mekong. Having learnt how people are struggling to recover from the legacy of Pol Pot and the Khmer Rouge, animal lover Sue continues through Cambodia to witness how deforestation and wildlife crime are stripping the country of it last wild places. She goes on a raid with the Wildlife Rapid Response Rescue team, in search of trafficked wild animals and bush meat. It's a disturbing experience, and Sue is thrust into the complicated and conflicting world of animal welfare and conservation versus the poverty and greed that drives the trade. She also takes part in the more positive aspect of the team's work, as they release macaques and a slow loris back into the wild. And further upstream she sees the efforts to protect the Mekong's endangered river dolphins. But Cambodia also brings some of her happiest encounters, as Sue's ability to make friends is epitomised in her meetings with a mobile-touting hermit and the women of the Krung people. The Krung live in the remote highlands of Ratanakiri and are one of the tribes most affected by rapid deforestation. Having witnessed the devastation of the forest from the air, Sue makes a deep bond with these women, as she sees how they live from the bounty of the remaining forest and learns of their struggle to protect it.\n\n3)  Part 3 \nSue reaches Laos, one of the poorest and least developed of all the Mekong nations. It's a country shaped by both Buddhism and Communism and has hardly changed for centuries. Today, the beauty of its landscapes and people is bringing in foreign tourists - backpackers in search of unspoilt Asia. Sue spends time with Bounsom, a fisherman who's turned to tourism, setting up a restaurant on the beach. And she visits Luang Prabang, a beautiful town which was once the Royal City of Laos and is now a Unesco World Heritage site, famed as the centre of Buddhism. Thought to be the home of more monks than anywhere else in Asia, Sue spends a day with the novice monks and gives a surprising English lesson in the temple's school. Laos is on the verge of huge and irreversible change - massive dams are being built to harness the power of the river. After months of access negotiation, Sue films at the Xayaburi hydroelectric dam, south east Asia's biggest and most controversial engineering project. It's the first dam to be built across the Lower Mekong and will completely block the flow of the river, changing water levels, blocking fish migration and destroying fish stocks. Under strict supervision, Sue is told about the merits of the dam by the vice minister for energy and mines, Mr Viraphonh Varavong. When the waters rise, thousands of people will be forced to leave their traditional homes, so she is given a tour of their new village, complete with electricity. Having seen the effects of damming in Vietnam and Cambodia, Sue grapples with the complexities of projects such as this. While the Xayaburi Dam will bring economic benefits to Laos and beyond, the industrialisation of the Mekong will harm the livelihoods of tens of millions of people downstream. Foreign investment is coming to Laos on projects beyond the dams. The government has tempted Chinese developers with tax incentives to create tourist playgrounds in an area branded as the Golden Triangle Special Economic Zone. At the river's bank, Sue is met by a stretch limo to take her to a Las Vegas-style casino, built for Chinese VIPs who aren't allowed to gamble in their own country. It's a world away from the charm and serenity of the Laos she's fallen in love with.\n\n4)  Part 4 \nSue reaches her final destination - China, home to the source of the Mekong. Here, change is sweeping through faster than any other Mekong nation, as China's economic miracle transforms even the remotest regions. Arriving in Yunnan's tropical south western region of Xishuangbanna, Sue discovers how this once remote and sleepy region is now home to a booming tourist industry, with the indigenous Dai tribe at its heart. To the Dai, water is holy, the physical and spiritual source of life. Thousands of Han Chinese - who make up 92 per cent of China's population - flock to the Dai Minority Park, a Disneyfied version of an ancient Dai village, where they take part in a traditional water splashing ceremony. After decades of communism, the park represents China's renewed interest in the colourful melting pot of peoples that actually make up modern China, providing a must-see holiday destination for its burgeoning middle class. Leaving the Dai Park, Sue climbs higher into the foothills of Xishuangbanna to discover how the Aini tribe are adapting to a changing China. The Aini have farmed Pu'er tea for two thousand years - suddenly they can become rich from its harvest, as China's newly wealthy professionals buy up this now fashionable delicacy. But as China tries to work out what is significant from its past and what it should take into its future, some people feel this rush to modernity is threatening what little remains of ancient traditions and beliefs. Sue meets Li Jin Mei, who is desperately trying to preserve what is left of her Aini culture. Travelling further along the river's valleys and foothills, Sue reaches the town of Baisha under the shadow of the Himalayas. Home to the Naxi people, this region is famous for its botanists and herbalists, made popular by Victorian plant hunters such as Joseph Rock. Sue attends a consultation with the renowned Naxi Chinese herbalist Dr Ho and explores his magnificent herbal garden. Climbing higher and ever closer to the source, Sue encounters her first taste of Tibetan life in the village of Cizhong. French missionaries came here in 1850, bringing the Catholic gospel and converting, over time, 80 per cent of this village to Catholicism. Sue meets Mr Xiao Jie Yi, whose humbling story relates how his Catholic faith carried him through 30 years of hard labour during Mao's Cultural Revolution. In modern China, Cizhong is facing a new, even more dramatic change - a hydroelectric dam is being built close by, bringing with it construction along the river's banks, landslides and the prospect of flooding. Six mega dams are already in service on the Mekong in Yunnan, generating the equivalent of enough electricity to light up London for three years. But the human and ecological cost here and downstream is yet to be calculated - already more than 100,000 ethnic people were displaced to make way for the dams. Finally, after nearly 3,000 miles, Sue embarks on the last leg of her epic journey, arriving high up on the Tibetan Plateau in Qinghai province, close to the source of the Mekong. In a life-changing experience, she is immersed in the lives of a family of Tibetan yak herders, and joins a group of nuns as they make an offering to the water gods for their protection. Here, at the point where the Mekong's waters first filter into the lives of people, Sue reveals the eternal bond between humans, gods and this mighty river.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://image.bayimg.com/7ec6d9b6cd79ecfa6bd7679ef41b8690ba13363f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/7ec6d9b6cd79ecfa6bd7679ef41b8690ba13363f.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/1060a2de8418913d9e305fcb37b87496b517c042.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/1060a2de8418913d9e305fcb37b87496b517c042.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/361f979b137961f9dd061af6dad97f3bfb30ebc7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/361f979b137961f9dd061af6dad97f3bfb30ebc7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/6969f3198cc1ebb49b75aaab6b48cb731412ce98.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/6969f3198cc1ebb49b75aaab6b48cb731412ce98.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/1a8ccf2ab9daf25ebca7dd450c662d8029b73b8c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/1a8ccf2ab9daf25ebca7dd450c662d8029b73b8c.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/024bb35b1979fea8523962f91866c439de7b2a03.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/024bb35b1979fea8523962f91866c439de7b2a03.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/805e1b970b0c686ca76092b8e6612a35621d97c3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/805e1b970b0c686ca76092b8e6612a35621d97c3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/c614c897ce758fc8fadd0f011daa0118793a202d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/c614c897ce758fc8fadd0f011daa0118793a202d.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://image.bayimg.com/a59126d143fd020eee2b83cdbf14427b009fc3df.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/a59126d143fd020eee2b83cdbf14427b009fc3df.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;400d21292e000c736e71&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1511 Kbps\n * Video: Resolution: 832 x 468\n * Video: Aspect Ratio: 1.778 (16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 59mins\n * Framerate: 25fps\n * Number of Parts: 4\n * Part Size: average 691 MB\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b04plh4f&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b04plh4f&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Mysteries%20of%20the%20Mekong&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Mysteries%20of%20the%20Mekong&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Mekong%20Alive&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Mekong%20Alive&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Angkor%20Wat&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Angkor%20Wat&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Jungle%20Atlantis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Jungle%20Atlantis&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=World%27s%20Most%20Dangerous%20Roads%20Series2%20%28BBC%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=World%27s%20Most%20Dangerous%20Roads%20Series2%20%28BBC%29&lt;/a&gt;","torrent":{"xt":"urn:btih:ffe92028ca7ef6f164939ad54815f4fdf23a11cb","amp;dn":"BBC+The+Mekong+River+with+Sue+Perkins+2of4+Cambodia+PDTV+x264+AA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffe92028ca7ef6f164939ad54815f4fdf23a11cb","infoHashBuffer":{"type":"Buffer","data":[255,233,32,40,202,126,246,241,100,147,154,213,72,21,244,253,242,58,17,203]},"announce":[],"urlList":[]}}