{"title":"Valentina Lisitsa plays Philip Glass -24bit/96khz","uid":11779876,"size":3131771954,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fffad5dca6eaca46dfa43fdd1f2ba679b3703b31&amp;dn=Valentina+Lisitsa+plays+Philip+Glass+-24bit%2F96khz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sidmal","files":28,"time":1427531279,"description":"Valentina Lisitsa plays Philip Glass - The Hours, Metamorphosis, Mad Rush (2015)\n FLAC (tracks) 24-bit/96 kHz | Time - 164:04 minutes | 3,07 GB\nStudio Master, Official Digital Download | Artwork: Digital booklet\n\n Cutting-edge pianist meets trendsetting composer: Valentina Lisitsa, whose artistry has bewitched thousands of followers on YouTube, is releasing a double album selection of the most special pieces for solo piano by Philip Glass, whose brand of minimalism has made him one of the most influential composers of our time. Valentina Lisitsa plays Philip Glass brings together two artists with enormous followings, a truly winning combination. Minimalism has never been so big. Richly harmonic, this collection of definitive Glass is a deeply evocative listening experience, with revelatory performances from Lisitsa.\n\n\n The Ukraine-born pianist first came to prominence as an online sensation, now with more than 83 million YouTube views and some 165,000 subscribers to her channel, and she has converted her online success into a global concert career in the most prestigious venues of Europe, the USA, South America and Asia.\n\n Music on the album includes tracks from Stephen Daldry s BAFTA-winning and Academy Award-nominated film The Hours, using the building blocks of minimalism to achieve a huge, inventive soundscape of musical richness and contrasts. The most substantial piece in the collection is the mesmerising 30-minute How Now, one of the first compositions written for the Philip Glass Ensemble in 1968. Also featured is Metamorphosis, a five-movement work of music for a theatrical adaptation of Kafka s play of the same name. All five movements will be available as a free download for anyone pre-ordering the release digitally. Other tracks include the iconic Mad Rush, which Glass performed at the first public appearance of the 14th Dalai Lama in New York City in 1981 and Mishima/Closing, part of the soundtrack to the 1985 film Mishima: A Life in Four Chapters.  \n\n\nTracklist:\n\n 01 - Glassworks - Opening\n 02 - Truman Sleeps (&quot;The Truman Show&quot;)\n 03 - The Hours - Arr. Michael Riesman - The Poet Acts\n 04 - The Hours - Arr. Michael Riesman - Morning Passages\n 05 - How Now\n 06 - The Hours - Arr. Michael Riesman - Something She Has To Do\n 07 - The Hours - Arr. Michael Riesman - I'm Going To Make A Cake\n 08 - Olympian: Lighting Of The Torch\n 09 - Mad Rush\n 10 - The Hours - Arr. Michael Riesman - Dead Things\n 11 - The Hours - Arr. Michael Riesman - Tearing Herself Away\n 12 - Wichita Sutra Vortex\n 13 - The Hours - Arr. Michael Riesman - Escape!\n 14 - The Hours - Arr. Michael Riesman - Chosing Life\n 15 - The Hours - Arr. Michael Riesman - The Hours\n 16 - Metamorphosis One\n 17 - Metamorphosis Two\n 18 - Metamorphosis Three\n 19 - Metamorphosis Four\n 20 - Metamorphosis Five\n 21 - Closing (&quot;Mishima&quot;)\n 22 - The Hours - Arr. Michael Riesman - An Unwelcome Friend\n 23 - The Hours - Arr. Michael Riesman - Why Does Someone Have To Die?\n 24 - Truman Sleeps (&quot;The Truman Show&quot;)","torrent":{"xt":"urn:btih:fffad5dca6eaca46dfa43fdd1f2ba679b3703b31","amp;dn":"Valentina+Lisitsa+plays+Philip+Glass+-24bit%2F96khz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fffad5dca6eaca46dfa43fdd1f2ba679b3703b31","infoHashBuffer":{"type":"Buffer","data":[255,250,213,220,166,234,202,70,223,164,63,221,31,43,166,121,179,112,59,49]},"announce":[],"urlList":[]}}